{"title":"EL MUNDO SEGÃƒÅ¡N MONSANTO-The world according to Monsanto SPAsub","uid":4916289,"size":4107216896,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:00673dc355c5099f019d7e0f2a05490051905edf&amp;dn=EL+MUNDO+SEG%C3%83%C5%A1N+MONSANTO-The+world+according+to+Monsanto+SPAsub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"anarchasis","files":-1,"time":1243443932,"description":"He aÃƒÂ±adido a la estructura del DVD original los subtÃƒÂ­tulos en espaÃƒÂ±ol, ergo, es el DVD original con los subtÃƒÂ­tulos en espaÃƒÂ±ol, sÃƒÂ³lo hay que seleccionar los subtÃƒÂ­tulos con el mando del reproductor o desde la aplicaciÃƒÂ³n que utilices para ver la pelÃƒÂ­cula.\n\nDirector:Marie-Monique Robin\nWriter:Marie-Monique Robin (writer)\n2008\n\nCon una destacada presencia en mÃƒÂ¡s de 46 paÃƒÂ­ses y unos beneficios impresionantes, Monsanto se ha convertido en la empresa lÃƒÂ­der de los organismos genÃƒÂ©ticamente modificados (OGM), asÃƒÂ­ como en una de las compaÃƒÂ±ÃƒÂ­as mÃƒÂ¡s controvertidas de la industria mundial por la fabricaciÃƒÂ³n de PCB (piraleno), devastadores herbicidas (como el agente naranja durante la guerra de Vietnam) o la hormona de crecimiento bovino (prohibida en Europa).\nDesde 1901, fecha de su fundaciÃƒÂ³n, la empresa de Missouri ha ido acumulando infinidad de procesos penales debido a la toxicidad de sus productos, aunque hoy se presenta como una empresa de Ã‚Â«ciencias de la vidaÃ‚Â» reconvertida a las virtudes del desarrollo sostenible. Gracias a la comercializaciÃƒÂ³n de las semillas transgÃƒÂ©nicas (mÃƒÂ¡s del 90% del mercado mundial), Monsanto no sÃƒÂ³lo controla una parte importante de la alimentaciÃƒÂ³n mundial y la forma en que se produce, sino que pretende extender su poder sobre las formas de vida tradicionales de una parte importante del planeta.\nBasÃƒÂ¡ndose en documentos inÃƒÂ©ditos, testimonios de afectados y vÃƒÂ­ctimas, campesinos, reconocidos cientÃƒÂ­ficos y destacados polÃƒÂ­ticos, El mundo segÃƒÂºn Monsanto reconstruye la gÃƒÂ©nesis y desarrollo de este gigante industrial, la primera productora mundial de semillas, una empresa que segÃƒÂºn declaran sus responsables Ã‚Â«sÃƒÂ³lo quiere nuestro bienestarÃ‚Â».\n\nM\nDeclaraciÃƒÂ³n Universal de Derechos Humanos\nArtÃƒÂ­culo 19\nTodo individuo tiene derecho a la libertad de opiniÃƒÂ³n y de expresiÃƒÂ³n; este derecho incluye el de no ser molestado a causa de sus opiniones, el de investigar y recibir informaciones y opiniones, y el de difundirlas, sin limitaciÃƒÂ³n de fronteras, por cualquier medio de expresiÃƒÂ³n.\n\nMÃƒÂ¡s Torrents\nhttp://thepiratebay.se/user/anarchasis\nMÃƒÂ¡s aÃƒÂºn\nhttp://www.nidiosniamo.com\n\n\nUniversal Declaration of Human Rights\nArticle 19 \nEveryone has the right to freedom of opinion and expression; this right includes freedom to hold opinions without interference and to seek, receive and impart information and ideas through any media and regardless of frontiers.\n\nSeed\n\n","torrent":{"xt":"urn:btih:00673dc355c5099f019d7e0f2a05490051905edf","amp;dn":"EL+MUNDO+SEG%C3%83%C5%A1N+MONSANTO-The+world+according+to+Monsanto+SPAsub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00673dc355c5099f019d7e0f2a05490051905edf","infoHashBuffer":{"type":"Buffer","data":[0,103,61,195,85,197,9,159,1,157,126,15,42,5,73,0,81,144,94,223]},"announce":[],"urlList":[]}}