{"title":"[SoM]The Hurricane[DvdRip-Xvid- AC3 Ita-Mp3 Eng]","uid":4462938,"size":1467463680,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:00ce3f86c083661e9d129675f073f384447e704d&amp;dn=%5BSoM%5DThe+Hurricane%5BDvdRip-Xvid-+AC3+Ita-Mp3+Eng%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mitimex","files":2,"time":1224787676,"description":"Flusso audio :ITA/ENG\n\n\nRubin Carter detto &amp;#039;Hurricane&amp;#039; ÃƒÂ¨ un pugile di colore in grande ascesa. Si sta preparando a combattere per il titolo dei pesi medi, quando viene arrestato insieme ad un altro uomo per l&amp;#039;omicidio di tre persone in un bar del New Jersey. Il 27 maggio 1967 la giuria, composta da soli bianchi, giudica Carter e l&amp;#039;amico Artis colpevoli e li condanna all&amp;#039;ergastolo. In prigione Carter decide dopo qualche tempo di scrivere la storia dell&amp;#039;ingiustizia subita. Nel settembre 1974, mentre viene pubblicata l&amp;#039;autobiografia di Carter, due testimoni ritrattano le accuse formulate in tribunale. Anni dopo, Lesra Martin, un giovane disadattato che vive in Canada, trova per caso il libro, lo legge, ne rimane colpito, e inizia una corrispondenza con Carter. Convinto dell&amp;#039;innocenza del pugile, il ragazzo persuade i suoi assistenti sociali (Terry, Lisa e Sam) a impegnarsi in una battaglia civile per la scarcerazione di Carter. Riluttante all&amp;#039;inizio a collaborare con degli sconosciuti, Carter ÃƒÂ¨ a poco a poco conquistato dalla loro passione e li aiuta come puÃƒÂ². E&amp;#039; il novembre 1985, quando il giudice Sarokin invalida i verdetti di colpevolezza del secondo processo per &amp;#039;gravi violazioni costituzionali&amp;#039;. Passano altri tre anni di appelli, prima che, il 26 febbraio 1988, un altro giudice firmi l&amp;#039;ordine di proscioglimento. A ventidue anni di distanza dai fatti successi in quel bar.","torrent":{"xt":"urn:btih:00ce3f86c083661e9d129675f073f384447e704d","amp;dn":"%5BSoM%5DThe+Hurricane%5BDvdRip-Xvid-+AC3+Ita-Mp3+Eng%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00ce3f86c083661e9d129675f073f384447e704d","infoHashBuffer":{"type":"Buffer","data":[0,206,63,134,192,131,102,30,157,18,150,117,240,115,243,132,68,126,112,77]},"announce":[],"urlList":[]}}