{"title":"Santana feat. Michelle Branch - The Game of Love (2nafish)","uid":5518661,"size":154281988,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:011b7c0383c26d71d5e84e53747732d21d474e67&amp;dn=Santana+feat.+Michelle+Branch+-+The+Game+of+Love+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1272373660,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Game of Love&quot; is a song composed by Gregg Alexander and Rick Nowels, and is on the album Shaman by Santana. The vocal performance of the song is by Michelle Branch. The song was launched as single in 2002, and won a Grammy Award for &quot;Best Pop Collaboration with Vocals&quot;, as well as peaking at #5 in on the Billboard Hot 100 singles chart.\n\nThe music video depicts Santana and Branch in an alley with couples around them, each expressing their love for one another. The director was Paul Fedor.\n\nTina Turner originally recorded the track for Santana, however this version remained unreleased until October 16, 2007, where it featured on Ultimate Santana, with the Michelle Branch version also appearing on the effort.\n\nThe version with Michelle Branch is on the game Karaoke Revolution.\n\nIn the internet, there are different meanings about copies of this song. In Japan exists a similar song, called &quot;Kimi Ni Fuku Kaze&quot; performanced by Mikuni Shimokawa, which is the ending song for Full Metal Panic? Fumoffu.\n\nShaman is the follow-up album to Santana's 1999 studio release Supernatural. Shaman was released on October 22, 2002 and debuted at #1 on the Billboard Hot 200 with first weeks sales of 298,973. It was certified double platinum by the RIAA and sold over 5,000,000 copies worldwide.\n\nThe first single of the album was &quot;The Game of Love&quot;, featuring Michelle Branch. &quot;Why Don't You &amp; I&quot;, featuring Chad Kroeger of Nickelback, was also re-recorded as a single in 2003, which featured Alex Band of The Calling.\n\nAlthough the previous album featured various rock musicians such as Dave Matthews and Eric Clapton, this album included a mix of hip hop, Pop, and Rap artists.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:011b7c0383c26d71d5e84e53747732d21d474e67","amp;dn":"Santana+feat.+Michelle+Branch+-+The+Game+of+Love+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"011b7c0383c26d71d5e84e53747732d21d474e67","infoHashBuffer":{"type":"Buffer","data":[1,27,124,3,131,194,109,113,213,232,78,83,116,119,50,210,29,71,78,103]},"announce":[],"urlList":[]}}