{"title":"Jim White...Drill a Hole in That Substrate and Tell Me What You ","uid":6393672,"size":406544405,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:01935beb521d038f3cde99ea16a28103fec4a33d&amp;dn=Jim+White...Drill+a+Hole+in+That+Substrate+and+Tell+Me+What+You+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":17,"time":1305445311,"description":"\n\nDrill a Hole in That Substrate and Tell Me What You See [2004]V2 / VVR1026938\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1. Static on the Radio 6:31\n2. Bluebird 5:29\n3. Combing My Hair in a Brand New Style 6:24\n4. That Girl from Brownsville Texas 6:22\n5. Borrowed Wings 4:34\n6. If Jesus Drove a Motor Home 4:36\n7. Objects in Motion 5:58\n8. Buzzards of Love 7:00\n9. Alabama Crome 4:25\n10. Phone Booth in Heaven 7:09\n11. Land Called Home 4:11\n\nJim White writes like a Southern gentlemen. When he released his cryptic debut, Wrong-Eyed Jesus, in 1997, he was approaching 40, and with each record his civil invective and genuine yearning for redemption have become more focused, culminating in an eccentric -- yet fully realized -- body of work that requires no aging to prove itself worthy. Drill a Hole in That Substrate and Tell Me What You See preens like an alley cat with a bellyful of chicken scraps. The thick veil of gloss that co-producers Joe Henry and Tucker Martine use to coat each of the 11 hypnotic tracks is entirely transparent, resulting in a glass-bottom boat ride that's both cathartic and uncomfortably voyeuristic. White's characters are always teetering on the edge of a bridge, faces cast skyward, wondering if whatever it is that's left them might swoop down just seconds before the first shoe drops. He meets his subjects on level ground, allowing them to speak through him as well as serve as their master's mouthpiece. On the spooky Tom Waits-style dirge &quot;Borrowed Wings,&quot; the ghosts of doomed Bonnie and Clyde-cursed lovers weep &quot;For in the fallow field where what's reaped is what's sown/There lies a road to ruin and it's paved with our tombstones.&quot; It's not all hellfire and brimstone, though, as evidenced by the goofy Barenaked Ladies collaboration &quot;Alabama Chrome&quot; and the bright -- almost hopeful -- hidden track, &quot;Land Called Home.&quot; There's a deep Southern gothic vibe at work here that brings to mind the Spanish moss meanderings of Daniel Lanois' For the Beauty of Wynona, but it's the shadow of Waits that always gets the last word; &quot;If Jesus Drove a Motor Home&quot; sounds like a cross between something off of The Black Rider and the theme to The Sopranos, but it's interesting that despite all of the celebrity guests (Aimee Mann, Bill Frisell, M. Ward), it's White's self-produced tracks that mirror their creator's sewn up -- but still bleeding a little -- heart. \n\ncd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/10/25/jim-white/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/10/25/jim-white/&lt;/a&gt;","torrent":{"xt":"urn:btih:01935beb521d038f3cde99ea16a28103fec4a33d","amp;dn":"Jim+White...Drill+a+Hole+in+That+Substrate+and+Tell+Me+What+You+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01935beb521d038f3cde99ea16a28103fec4a33d","infoHashBuffer":{"type":"Buffer","data":[1,147,91,235,82,29,3,143,60,222,153,234,22,162,129,3,254,196,163,61]},"announce":[],"urlList":[]}}