{"title":"The Pat Conroy Cookbook","uid":10702942,"size":1210486,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:019ffe40f98e7a1e1c1450772ebf0fd9d9ff1cb3&amp;dn=The+Pat+Conroy+Cookbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ONLYMOBI","files":1,"time":1407245707,"description":"&quot;This book is the story of my life as it relates to the subject of food. It is my autobiography in food and meals and restaurants and countries far and near. Let me take you to a restaurant on the Left Bank of Paris that I found when writing &quot;The Lords of Discipline. &quot;There are meals I ate in Rome while writing &quot;The Prince of Tides&quot; that ache in my memory when I resurrect them. There is a shrimp dish I ate in an elegant English restaurant, where Cuban cigars were passed out to all the gentlemen in the room after dinner, that I can taste on my palate as I write this. There is barbecue and its variations in the South, and the subject is a holy one to me. I write of truffles in the Dordogne Valley in France, cilantro in Bangkok, catfish in Alabama, scuppernong in South Carolina, Chinese food from my years in San Francisco, and white asparagus from the first meal my agent took me to in New York City. Let me tell you about the fabulous things I have eaten in my life, the story of the food I have encountered along the way. . . &quot;\n\nAmerica's favorite storyteller, Pat Conroy, is back with a unique cookbook that only he could conceive. Delighting us with tales of his passion for cooking and good food and the people, places, and great meals he has experienced, Conroy mixes them together with mouthwatering recipes from the Deep South and the world beyond. \nIt all started thirty years ago with a chance purchase of &quot;The Escoffier Cookbook, &quot; an unlikely and daunting introduction for the beginner. But Conroy was more than up to the task. He set out with unwavering determination to learn the basics of French cooking--stocks and dough--and moved swiftly on to veal demi-glace and pate brisee. With the help of his culinary accomplice, Suzanne Williamson Pollak, Conroy mastered the dishes of his beloved South as well as the cuisine he has savored in places as far away from home as Paris, Rome, and San Francisco. \nEach chapter opens with a story told with the inimitable brio of the author. We see Conroy in New Orleans celebrating his triumphant novel &quot;The Prince of Tides&quot; at a new restaurant where there is a contretemps with its hardworking young owner/chef--years later he discovered the earnest young chef was none other than Emeril Lagasse; we accompany Pat and his wife on their honeymoon in Italy and wander with him, wonderstruck, through the markets of Umbria and Rome; we learn how a dinner with his fighter-pilot father was preceded by the Great Santini himself acting out a perilous night flight that would become the last chapters of one of his son's most beloved novels. These tales and more are followed by corresponding recipes--from Breakfast Shrimp and Grits and Sweet Potato Rolls to Pappardelle with Prosciutto and Chestnuts and Beefsteak Florentine to Peppered Peaches and Creme Brulee. A master storyteller and passionate cook, Conroy believes that &quot;A recipe is a story that ends with a good meal.&quot;","torrent":{"xt":"urn:btih:019ffe40f98e7a1e1c1450772ebf0fd9d9ff1cb3","amp;dn":"The+Pat+Conroy+Cookbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"019ffe40f98e7a1e1c1450772ebf0fd9d9ff1cb3","infoHashBuffer":{"type":"Buffer","data":[1,159,254,64,249,142,122,30,28,20,80,119,46,191,15,217,217,255,28,179]},"announce":[],"urlList":[]}}