{"title":"Ruby by Example: Concepts and Code","uid":6526787,"size":6681726,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02fef74b1d5a7601446b85eda1bcad085a1838c8&amp;dn=Ruby+by+Example%3A+Concepts+and+Code&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1310194558,"description":"&quot;Ruby by Example: Concepts and Code&quot; by Kevin C. Baird\n No S P | 326 pages | English | 2007 | ISBN: 1593271484 | PDF | 6.37 MB\n\n There may be no better way to learn how to program than by dissecting real, representative examples written in your language of choice. Ruby by Example analyzes a series of Ruby scripts, examining how the code works, explaining the concepts it illustrates, and showing how to modify it to suit your needs. Baird's examples demonstrate key features of the language (such as inheritance, encapsulation, higher-order functions, and recursion), while simultaneously solving difficult problems (such as validating XML, creating a bilingual program, and creating command-line interfaces). Each chapter builds upon the previous, and each key concept is highlighted in the margin to make it easier for you to navigate the book.\n\n You'll learn how to:\n\n Use the interactive Ruby shell (irb) to learn key features of the language\n Extend Ruby using RubyGems, the Ruby package manager\n Create numerical utilities, as well as utilities that process and analyze HTML/XML\n Implement purely functional and metaprogramming techniques to save time and effort\n Optimize, profile, and test your code to make sure that it not only does its job, but does it well\n Create web applications using Rails\n\n Ruby is the fastest growing programming language today, and for good reason: Its elegant syntax and readable code make for prolific and happy programmers. But it can be difficult to understand and implement without a little help. Ruby by Example shows you how to take advantage of Ruby as you explore Ruby's fundamental concepts in action.","torrent":{"xt":"urn:btih:02fef74b1d5a7601446b85eda1bcad085a1838c8","amp;dn":"Ruby+by+Example%3A+Concepts+and+Code","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02fef74b1d5a7601446b85eda1bcad085a1838c8","infoHashBuffer":{"type":"Buffer","data":[2,254,247,75,29,90,118,1,68,107,133,237,161,188,173,8,90,24,56,200]},"announce":[],"urlList":[]}}