{"title":"DeCamp-Franklin Cover-Up-Child Abuse,Satanism&amp;Murder in Nebraska","uid":4577360,"size":8830963,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:031c7a628b8dd7ee67b9968acd81b049d8cf9710&amp;dn=DeCamp-Franklin+Cover-Up-Child+Abuse%2CSatanism%26Murder+in+Nebraska&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1229284473,"description":"This is John W. DeCamp's shocking book The Franklin Cover-Up - Child Abuse, Satanism and Murder in Nebraska (1996) which exposes the pedophile ring in high circles of american power elite. The Franklin Coverup Scandal began on June 29, 1989, when the front page of the Washington Times bore the headline Homosexual Prostitution Inquiry ensnares VIPs with Reagan, Bush, and officially ended when a grand jury concluded that the charges were a &quot;carefully crafted hoax&quot;, although the scandal still feeds conspiracy theories to the present day. The article, by Washington Times journalists Paul M. Rodriguez and George Archibald, alleged that key officials of the Ronald Reagan and George H. W. Bush administrations were connected to an elaborate Washington, D.C male prostitution ring, and reported that two of these prostitutes even entered the White House late at night. The allegations included, among other things, &quot;abduction and use of minors for sexual perversion.&quot; Key persons named in the allegations were Craig J. Spence, a Washington D.C. based Republican lobbyist (who committed suicide in 1989), and Lawrence King, then manager of the Franklin Community Federal Credit Union in Nebraska. King was one of the Republican party's rising stars, performing the national anthem at the 1984 and 1988 Republican National Conventions. According to the December 15, 1989 New York Times, Nebraska State Senator Ernie Chambers came forward with reports of &quot;boys and girls, some of them from foster homes, who had been transported around the country by airplane to provide sexual favors, for which they were rewarded.&quot; In this amazing book former US Nebraska State senator exposes the elite web of crime, satanic cults, and child sexual abuse that reaches through the highest levels of power in our society. The organized cover-up and suppression of the events and victims' accounts is well documented, as is the author's role as attorney in the investigations and court cases. It's interesting that former CIA director Bill Colby ambiguously acknowledged to the author that the scenario described is real, and not long thereafter Colby turned up dead under suspicious circumstances. This is a good book to recommend for those in denial about the depravity and deviousness of those with power and influence in our society. The only significant weakness about the book is that it does not go into much discussion of the larger context of elite cults and organized conspiratorial activity, instead just focusing on a small portion of this activity. 450 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:031c7a628b8dd7ee67b9968acd81b049d8cf9710","amp;dn":"DeCamp-Franklin+Cover-Up-Child+Abuse%2CSatanism%26Murder+in+Nebraska","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"031c7a628b8dd7ee67b9968acd81b049d8cf9710","infoHashBuffer":{"type":"Buffer","data":[3,28,122,98,139,141,215,238,103,185,150,138,205,129,176,73,216,207,151,16]},"announce":[],"urlList":[]}}