{"title":"FSX IRIS PLATINUM SERIES - C-27J SPARTAN","uid":6683484,"size":209691186,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:03527cd0c54733450f5bd2f23dc2dff7bd0a52ae&amp;dn=FSX+IRIS+PLATINUM+SERIES+-+C-27J+SPARTAN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mickyfinny","files":1,"time":1316296769,"description":"C-27J SPARTAN\n\nThe Alenia C-27J Spartan is a medium-sized military transport aircraft.\nThe C-27J is an advanced derivative of Alenia Aeronautica's G.222 (C-27A Spartan in US service), with the engines and systems of the Lockheed Martin C-130J Super Hercules.\nThe aircraft was selected as the Joint Cargo Aircraft (JCA) for the United States military.\n\nBased on the Alenia G222 and the C-27A operated by the US Air Force in Central America, the C-27J Spartan represents a significant enhancement of an already capable tactical transport.\nOffered by the Lockheed Martin Alenia Tactical Transport Systems (LMATTS) joint venture, the C-27J follows the route set by the C-130J in taking a proven design and adding improved avionics and propulsion.\n\nFeatures:\n\n    * Custom soundpack by IRIS AudioworX\n    * Optimised Digital displays for silky smooth operation and improved system performance.\n    * Fully customisable visual model with options for inflight refuelling, advanced sensors and Head Up Displays.\n    * Superb flight model for the C-27J from Pam Brooker of JFTC suits the agile handling of this unique aircraft.\n    * A wide variety of paintschemes in various resolutions to suit your individual systems.\n    * Custom in cockpit audio for the copilot, tanker operator and loadmaster who all respond to your every decision.\n    * New design techniques including 'Lotus Style' landing light effects, in-game night vision capability and more.\n\nHave fun and go to there forum more info on easy start etc. :+)","torrent":{"xt":"urn:btih:03527cd0c54733450f5bd2f23dc2dff7bd0a52ae","amp;dn":"FSX+IRIS+PLATINUM+SERIES+-+C-27J+SPARTAN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03527cd0c54733450f5bd2f23dc2dff7bd0a52ae","infoHashBuffer":{"type":"Buffer","data":[3,82,124,208,197,71,51,69,15,91,210,242,61,194,223,247,189,10,82,174]},"announce":[],"urlList":[]}}