{"title":"Chalked Up: Inside Elite Gymnastics' Merciless Coaching, Overzea","uid":8849472,"size":3350459,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03a75509fb6560cbd3e6442499912c75f22c940c&amp;dn=Chalked+Up%3A+Inside+Elite+Gymnastics%27+Merciless+Coaching%2C+Overzea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1377485490,"description":"Chalked Up: Inside Elite Gymnastics' Merciless Coaching, Overzealous Parents, Eating Disorders, and Elusive Olympic Dreams\n\nPublished just as all eyes are on the young female gymnasts competing for a ticket to Beijing on the 2008 Olympic team, -Chalked Up- presents the story of the 1986 US National Gymnastics champion whose life long dream was to compete in the 1988 Olympics - until anorexia, injuries, coaching abuses, and parental hopes and neglect nearly destroyed her. Fanciful dreams of gold medals and Nadia Comaneci led Jennifer Sey to the sport of gymnastics at the age of six. Early success propelled her forward.Her family, seduced by the notion of their young daughter as a champion, complied with her every wish as she strove to become better. By the age of eleven, it all seemed to be coming together for her when she qualified for the nationally competitive elite level, the highest in U.S. gymnastics. -Chalked Up- is Sey's personal story in competitive gymnastics and also the story of the ways her needs were subsumed by the adults around her. It is about the meaninglessness of second place in a culture that places winning above all else. It is about the destruction waged by eating disorders. It is about a specific a culture in which underage and underweight girls are celebrated as cultural icons.\n\n","torrent":{"xt":"urn:btih:03a75509fb6560cbd3e6442499912c75f22c940c","amp;dn":"Chalked+Up%3A+Inside+Elite+Gymnastics%27+Merciless+Coaching%2C+Overzea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03a75509fb6560cbd3e6442499912c75f22c940c","infoHashBuffer":{"type":"Buffer","data":[3,167,85,9,251,101,96,203,211,230,68,36,153,145,44,117,242,44,148,12]},"announce":[],"urlList":[]}}