{"title":"Douwe Draaisma - De dromenwever (MP3, 2013)","uid":10495551,"size":604217664,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:03b72ae866a1f31de16d7a192f73e9b0e05622d9&amp;dn=Douwe+Draaisma+-+De+dromenwever+%28MP3%2C+2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":79,"time":1404613423,"description":"Sommige delen van ons brein moeten waken terwijl we slapen. Ze beginnen vreemde verhalen te spinnen. De meeste verhalen vervliegen bij het wakker worden. Wat blijft zijn de vragen. Waarom accepteer je in je droom bizarre situaties als volkomen vanzelfsprekend? Wat hebben psychologie en neurologie de afgelopen halve eeuw opgehelderd over ons nachtleven? En natuurlijk de moeilijkste vraag: betekenen dromen iets?\n\nMet De dromenwever betreedt Douwe Draaisma opnieuw de menselijke piste vol wilde verhalen, steigerende nachtmerries en ijzingwekkende mentale acrobatiek. Vastberaden doorkruist hij de droomlandschappen van zweefdromers, blinde en lucide dromers; feiten over erotische, profetische en examendromen scheidt hij moeiteloos van overspannen ficties. Ook het innerlijkst van het auto biografische droomleven onderzoekt en analyseert hij met wetenschappelijke acribie en pertinentie, maar nooit zonder open oog te houden voor de verhalende kracht van dromen en dromers. Wat we over dromen zeker willen weten is nu beschreven in De dromenwever.\n","torrent":{"xt":"urn:btih:03b72ae866a1f31de16d7a192f73e9b0e05622d9","amp;dn":"Douwe+Draaisma+-+De+dromenwever+%28MP3%2C+2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03b72ae866a1f31de16d7a192f73e9b0e05622d9","infoHashBuffer":{"type":"Buffer","data":[3,183,42,232,102,161,243,29,225,109,122,25,47,115,233,176,224,86,34,217]},"announce":[],"urlList":[]}}