{"title":"Sexually Broken--Former gymnast deep throat skull fuck Anikka Al","uid":7969087,"size":1150565067,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:0427b5e26acc57b7c4425fe185630022b812ce0e&amp;dn=Sexually+Broken--Former+gymnast+deep+throat+skull+fuck+Anikka+Al&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1356781103,"description":"Former track star, gymnast is deep throat skull fucked, and fisted by Isis Love, devastating orgams | Anikka Albrite | Matt Williams | Isis Love\n\nDecember 28, 2012 \n \n  \nMP4 only.\n   \n \nWelcome Anikka Albrite, this sexy former Track star and Gymnast still has a flexible hard body and is beautiful to boot. Also welcome Isis Love to the pages of Sexually Broken. Isis is by far the most beautiful and experienced Domme/Handler in the industry today. \n\nAnikka is bound with her head over the edge of a bed, at perfect cock height. Her muscular legs bound back to the headboard leave her pussy open and vulnerable. Isis slowly finger bangs and works her entire fist into Anikka's tight pussy. A hard cock fucks the back of Anikka's throat, slowly, deliberately deep, cutting off her ability to breathe. With her head over the edge of the bed, Anikka's face is getting fucked upside down, and you can see the cock bulge on her tight throat as the cock slides all the way down her throat.\n\nThe fist slips all the way in, filling her wet cunt. At the same time the hard cock is buried all the way down Anikka's throat. That was her first orgasm. Deep and brutal, totally stuffed from both ends, air tight. Isis attacks Anikka's little pussy with her entire fist wrist deep. Orgasm after orgasm are ripped from our former track star. There is nothing she can do but cum, and suck. Watching Anikka's face get destroyed by cock, while cumming like common whore over and over is brilliant to watch. Multi-tasking at Heroic level.\n\nAnikka is retied to the middle of the bed legs, still back in the perfect &quot;fuck me&quot; position, still bound and helpless. Isis has a strap on, and is about give our sexy little blonde a seriously deep and brutal lesbian fuck. Isis's perfect ass and massive tits are shown off to great benefit as Anikka can only look up and see this beautiful Goddess fucking the shit out of her pussy. Isis is one of the best in the world at fucking girls, and from Anikka's animistic grunts and moans you can tell Isis hips are magic. Anikka has been fucked deep into subspace, so many orgasms and she is still cumming. In the end Anikka suffers a intense Category 5 suspension, lifted in the &quot;fuck me&quot; position by just rope around her ankles. Anikka waits, swinging, and exposed until we return.... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/12_28aalbrite2/SexuallyBroken-Anikka-Albrite-Isis-Love-Matt-Williams-Former-track-star-gymnast-is-deep-throat-skull-fucked-and-fisted-by-Isis-Love-devastating%20orgams.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/12_28aalbrite2/SexuallyBroken-Anikka-Albrite-Isis-Love-Matt-Williams-Former-track-star-gymnast-is-deep-throat-skull-fucked-and-fisted-by-Isis-Love-devastating%20orgams.php&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:0427b5e26acc57b7c4425fe185630022b812ce0e","amp;dn":"Sexually+Broken--Former+gymnast+deep+throat+skull+fuck+Anikka+Al","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0427b5e26acc57b7c4425fe185630022b812ce0e","infoHashBuffer":{"type":"Buffer","data":[4,39,181,226,106,204,87,183,196,66,95,225,133,99,0,34,184,18,206,14]},"announce":[],"urlList":[]}}