{"title":"Pink Floyd - The Dark Side Of The Moon [UK Q8 Quad Mix] CD","uid":4136292,"size":456365616,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:046f7c5428ec4f06d37b889c4dc95c36b72f84e9&amp;dn=Pink+Floyd+-+The+Dark+Side+Of+The+Moon+%5BUK+Q8+Quad+Mix%5D+CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kiefspoon","files":1,"time":1208282889,"description":"Below is the info from the original torrent creator, which was a DTS encoded disc ONLY, so could not be listened on conventional CD players. I listened to the DTS disc of the original British Quad mix, and it sounded great - so I have created a copy via my audio CD burner in real time in uncompressed (no mp3 files here!) audio files.\n\nJust double click the stuffed file, and it&amp;#039;s formatted as Nero disc image. In fact, this disk image will also open in Toast (just change the extension manually to .Sd2f) but most people seem to use Nero.\n\nAnyway, I hope you all enjoy it - it sounds marvelous, and so much better than the &amp;#039;remasters&amp;#039; etc that have been released over the years.\n\n\n\n\n\nORIGINAL INFO FROM ORIGINAL TORRENT:\n\nThis is a DTS image of the highly rare Q8 British version of Dark Side Of The Moon by Pink Floyd.  The band originally intended for their audience to hear the album THIS way, but unfortunately QUAD playback didn&amp;#039;t take off like people thought it would.  So, this Q8 was definitely an obscure item; in the UK, 8-Track cartridge technology was not a sought-after mainstay of playback like it was in the US circa the 1970&amp;#039;s.\n\nThe 1970&amp;#039;s British Q8 was an 8-channel, 2 program cartridge. In the US we had 4 programs of stereo; the British cartridge had two programs of Quadrophonic.  Given the source, you can expect that the sound quality will be less than most versions of this album on CD or vinyl. Why post? Because it&amp;#039;s TRUE QUADROPHONIC and really must be experienced to be believed, and especially because it is the rare original mix of a landmark album.\n\nIt is very interesting to compare this to the 5.1 SACD or SACD=&gt;DTS image that is also available for download.  Both the Q8 and the SACD are true surround sound, but the mix is completely different; I think this original mix is much better.  Compare especially Clare Torry&amp;#039;s solo in The Great Gig in the Sky.  Since it came from much newer, fresher master tapes, the sound of the Q8 is much more dynamic, much less muddy than the SACD.  I hope you enjoy it as much as I do.","torrent":{"xt":"urn:btih:046f7c5428ec4f06d37b889c4dc95c36b72f84e9","amp;dn":"Pink+Floyd+-+The+Dark+Side+Of+The+Moon+%5BUK+Q8+Quad+Mix%5D+CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"046f7c5428ec4f06d37b889c4dc95c36b72f84e9","infoHashBuffer":{"type":"Buffer","data":[4,111,124,84,40,236,79,6,211,123,136,156,77,201,92,54,183,47,132,233]},"announce":[],"urlList":[]}}