{"title":"Stranded Deep 0.06 (x64) RePack MonoSoul","uid":12928072,"size":305042177,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0556d6e7918a775378f517563a8a25100239a910&amp;dn=Stranded+Deep+0.06+%28x64%29+RePack+MonoSoul&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"monosoul","files":2,"time":1449490745,"description":"Title: Stranded Deep x64\r\nGenre: Adventure, Indie, Early Access\r\nDeveloper: Beam Team Games \r\nPublisher: Beam Team Pty Ltd\t\r\nRelease Date: 23 Jan, 2015\r\nCrack: 3DM\r\n\r\n\r\nSTABLE BUILD 0.06 - NEW OCEAN, CRAFTING, BUILDING AND MORE!\r\n\r\nAbout This Game\r\nTake the role of a plane crash survivor stranded somewhere in the Pacific Ocean. Experience terrifying encounters both above and below an endless environment. Come face to face with some of the most life threatening scenarios that will result in a different experience each time you play. \r\n\r\nScavenge. Discover. Survive. \r\n--- \r\n \r\nInfinite Procedurally-generated World - Explore Pacific islands, reefs, and bottomless ocean trenches filled with detailed biomes. \r\nNo two worlds are the same, even share your world seed! \r\nDynamic Weather and Day-Night Cycle - Struggle to navigate stormy seas or enjoy basking with a coconut on a sunny afternoon. \r\nUnique Physically-based Crafting System - Harvest resources to create equipment by combining them together in the physical world - no crafting slots! \r\nUnique Physically-based Building System - Settle on an island and construct a shelter or venture the seas with your own built raft. \r\nDetailed Survival Aspects and Interaction - Manage your vitals of hunger, thirst, blood, and health against the harshness of mother nature. \r\nRandom Loot and Collectables - Search sunken shipwrecks and islands for interesting and rare equipment. \r\nHunting and fishing - Spear small animals in the shallows or risk the depths with a spear gun in search of larger meals. Starve an island of resources or maintain and manage its growth.\r\n \r\nThe things we want and things we know you want!\r\nDealing with bugs -A lot of effort has been put into making sure your Stranded Deep experience is as bug free as possible, however the game is in an Early Access stage of development, so there will be bugs. We will be doing our best to squish them. \r\nPerformance - Optimizing performance is an important ongoing process that will continue through the Early Access period. \r\nIsland and Terrain Variety - Creating more unique biomes and biome parameters for different procedural generations. \r\nMore Wildlife - Incorporating more fish and shark species and more interesting island wildlife like birds, snakes and lizards. \r\nAn End-game Scenario - Making it possible to complete a series of optional tasks and progress through the world in an attempt to be rescued. \r\nCo-operative Gameplay - Where you can band together as a team of misfits and ration your supplies or eliminate each other one by one. \r\nMultiplayer - Fun multiplayer game modes like raft wars, fishing challenges, rescue objectives, island vs island, etc. \r\nImproved User Interface - All of the in-game UI is temporary and will be replaced with a more fitting theme. \r\nOcculus Rift Support \r\nController Support \r\nMuch more! - See our website for more details, http://www.beamteamgames.com","torrent":{"xt":"urn:btih:0556d6e7918a775378f517563a8a25100239a910","amp;dn":"Stranded+Deep+0.06+%28x64%29+RePack+MonoSoul","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0556d6e7918a775378f517563a8a25100239a910","infoHashBuffer":{"type":"Buffer","data":[5,86,214,231,145,138,119,83,120,245,23,86,58,138,37,16,2,57,169,16]},"announce":[],"urlList":[]}}