{"title":"The Age of Stagnation by Satyajit Das (ePub)","uid":13681749,"size":1255546,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0662bca015ccbbb93897c069f15d5014ff0d6b83&amp;dn=The+Age+of+Stagnation+by+Satyajit+Das+%28ePub%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Bookz-BB","files":2,"time":1456480987,"description":"The Age of Stagnation: Why Perpetual Growth is Unattainable and the Global Economy is in Peril by Satyajit Das\r\n\r\n----------------\r\n\r\nThe global economy is entering an era of protracted stagnation, similar to what Japan has experienced for over a decade. That is the message of this brilliant and controversial summary of our current economic predicament from an internationally respected consultant and commentator on financial markets, who predicted the Global Financial Crisis of 2008. The author challenges the assumption that growth can be perpetual and questions the ability of political leaders to enact the tough structural changes needed. He is particularly critical of the &quot;easy money&quot; approach to dealing with the great recession of 2008, citing the dangers of excessive debt and deep-seated fundamental imbalances. The fallout of these poor policies, he argues, will affect not only the business sector, but also the lifestyles and prosperity of average citizens and future generations.\r\n\r\nThe author concludes with a thought experiment illustrating the large-scale changes that will be necessary to restore economic, financial, and social sustainability. This experiment has already been tried in Iceland, which went bankrupt in the wake of the 2008 crisis, and now, after a painful adjustment, is on the road to recovery.\r\n\r\nWritten for the lay reader and peppered with witty anecdotes, this immensely readable book clearly explains the missteps that created the current dilemma, why a recovery has proved elusive, and the difficult remedies that must eventually be applied to ensure a stable future","torrent":{"xt":"urn:btih:0662bca015ccbbb93897c069f15d5014ff0d6b83","amp;dn":"The+Age+of+Stagnation+by+Satyajit+Das+%28ePub%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0662bca015ccbbb93897c069f15d5014ff0d6b83","infoHashBuffer":{"type":"Buffer","data":[6,98,188,160,21,204,187,185,56,151,192,105,241,93,80,20,255,13,107,131]},"announce":[],"urlList":[]}}