{"title":"TV On The Radio - Dear Science (Deluxe Edition)","uid":5198942,"size":521581193,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:075ad4b77bc1ddd1b2e09e68a45bfd9ac81e2fcf&amp;dn=TV+On+The+Radio+-+Dear+Science+%28Deluxe+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ncdrawl","files":19,"time":1260057695,"description":"TV on the Radio (often abbreviated to TVotR) is an American experimental rock band formed in 2001 in New York City. The band's music spans genres as diverse as post-punk, free jazz, a cappella, doo-wop, soul, shoegaze and electro. The group has released several EPs including their debut Young Liars (2003), and three acclaimed albums: Desperate Youth, Blood Thirsty Babes (2004), Return to Cookie Mountain (2006), and Dear Science (2008). TV on the Radio is composed of Tunde Adebimpe (vocals/loops), David Andrew Sitek (guitars/keyboards/loops), Kyp Malone (vocals/guitars/loops) along with Jaleel Bunton (drums) and Gerard Smith (bass/keyboards). Other contributors include Katrina Ford of Celebration (vocals), Kazu Makino of Blonde Redhead (vocals), Martin Perna of Antibalas (saxophones, flute), David Bowie (vocals) and Nick Zinner of Yeah Yeah Yeahs (guitar).\n\n\nTrack Listing:\n\n01 - Halfway Home                                    05:32\n02 - Crying                                          04:11\n03 - Dancing Choose                                  02:56\n04 - Stork &amp; Owl                                     04:02\n05 - Golden Age                                      04:12\n06 - Family Tree                                     05:34\n07 - Red Dress                                       04:25\n08 - Love Dog                                        05:37\n09 - Shout Me Out                                    04:16\n10 - Dlz                                             03:49\n11 - Lover's Day                                     05:54\n12 - Untitled                                        04:01\n13 - Make Love All Night Long                        03:32\n14 - Heroic Dose                                     07:18\n15 - Dancing Choose (Prefuse 73 Remix)               03:49\n16 - Crying (Telepathe Remix)                        04:29\n\n                                                     \n                                                     73:37 min\nRelease Notes:\n &lt;a href=&quot;\nhttp://www.tvontheradio.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tvontheradio.com/&lt;/a&gt;\n\n&quot;A lot of bands have something to say,&quot; explains TV On The Radio\nproducer/multi-instrumentalist David Sitek. &quot;We have something to\nask.&quot;\n\nIndeed. Good luck finding easy answers in TVOTR's ever-evolving\nsoundscapes, though, whether we're talking about their new disc,\nDear Science (DGC/Interscope) or the band's early days. When\nguitarist/vocalist Kyp Malone joined, he didn't even get what\nSitek and vocalist Tunde Adebimpe were going for on their\nself-released 2002 debut, OK Calculator.\n\n&quot;Aspects of OK Calculator are genius,&quot; says Malone, &quot;but it isn't\nas laser-focused as Young Liars.&quot; Neither were Adebimpe and\nSitek's early live sets, boundless and brash bits of performance\nart that Malone remembers as &quot;an open mic/karaoke night gone awry.\nI could hear songs peeking through it all but it wasn't really my\nthing.&quot;\n\nBoy did that change in 2003, as Young Liars became Malone's\nfavorite CD-R (he'd often play it for the latte sippers at a local\ncoffee shop) and the group's first Touch &amp; Go release. An\nimmediate favorite among critics, the EP nailed Sitek's goal of\nsounding like a &quot;grand four-track thing,&quot; from the epic, evocative\nballadry of &quot;Blind&quot; to the spectral pop trails of &quot;Staring At the\nSun.&quot; To make things even more interesting, Malone dropped his\nskepticism and joined the group full-time before Young Liars'\nofficial release, with drummer Jaleel Bunton and bassist Gerard\nSmith rounding out the band's rhythm section soon after.\n\n&quot;We had a gig in Iceland where we needed a full band so we asked\nthe two best guitar players we knew, Gerard and Jaleel, to play\ndrums and bass,&quot; explains Sitek, laughing. &quot;It's absurd that Kyp\nand I are even holding a guitar when Jaleel and Gerard are fucking\nbananas at playing it.&quot;\n\nWhile that may be true, TV On The Radio's loose approach to\nsongwriting, recording and performing leaves an incredible amount\nof room for instrument-swapping and role reversals. Rather than\nrely on a stringent and stale guitars/bass/drums/vocals setup, the\nquintet often brings home-demoed sketches to the studio along with\nthe attitude that a track needs to go through everyone's filter\nbefore it becomes a fully formed song.\n\n&quot;Music is the most flexible medium in the world for me,&quot; explains\nSitek, the beat conductor responsible for distilling the band's\ntracks down to a living, breathing composition that's never\ncloying or cumbersome. &quot;There is no shortage of ideas; the hard\npart is not following each whim.&quot;\n\nAs much as he tries to keep a record sounding lean, Sitek is quick\nto admit, &quot;It takes most bands an album to get to a high track\ncount. I can go from 4 to 96 in a day, without question. I'm track\nhungry, really. A lot of stuff isn't even an instrument.&quot;\n\nThe densest a TVOTR disc ever got was their third LP, 2006's\nReturn to Cookie Mountain, a collection of songs you need to scale\nwith hi-def headphones to truly appreciate. Sitek went a little\nlighter on the multi-tracking with this Dear Science, but not by\nmuch. The album's opener, &quot;Halfway Home,&quot; is vintage TVOTR, for\ninstance--a rich, speaker-swallowing canvas of careening beats,\nbuzzing riffs (or are those synths?) and bloodletting vocals.\nThings get strange from that point on, however, as mirror balls\nspin (a dare-we-say-danceable &quot;Crying,&quot; the helicopter hook of\n&quot;Golden Age&quot;) and Adebimpe attacks &quot;Dancing Choose&quot; like a\nmic-wielding battle rapper.\n\nAnd then there are the glimmers of drum &amp; bass (&quot;Shout Me Out&quot;),\ndrunken horn sections (&quot;Red Dress,&quot; one of several songs to\nfeature members of Antibalas), and carefully-plucked film score\nstrings (&quot;Stork &amp; Owl&quot;) that spice up what's clearly TVOTR's most\nchallenging effort yet. Not challenging in the sense of being a\nrough listen--challenging in terms of rewriting the group's\nsupposed gloomy, stormy aesthetics.\n\n&quot;You know how people always say that comedians are some of the\nsaddest people in the world?&quot; asks Adebimpe. &quot;Well, the opposite\nis true, too. As heavy as some of the songs get, the joking around\nthat goes around between the five of us gets out of control\nsometimes.&quot;\n\n&quot;If people are listening to us because we're dark and brooding,\ngreat,&quot; adds Sitek, &quot;But I think there's a greater percentage\nlooking for us to do something different with every album. Some of\nthe darkest songs on Dear Science are the more upbeat ones. Like\n'Crying' is f**king heavy, dude.&quot;\n\nIf you' still toss on such beautifully-damaged tracks as &quot;Dreams&quot;\nand &quot;Ambulance&quot; when times get tough, don't worry--TV On The Radio\nstill goes for the jugular in the melancholic and moody\ndepartment. In fact, some of Dear Science sounds downright\nmenacing. Take &quot;DLZ&quot;: a fang-baring &quot;f**k you&quot; to the idea of\ndeath being &quot;your last chance to do anything&quot; according to\nAdebimpe, it's some of most frightening, and affecting, music in\nthe TVOTR canon. &quot;Stork &amp; Owl&quot; is much more muted in its mix of\nskittering beats, wilting strings and gorgeous, multi-tracked\nharmonies but good luck putting on a happy face after succumbing\nto its postmodern soul soundtrack.\n\n&quot;It's like Bukowski once said, 'I write all of this stuff to get\naway from it,'&quot; explains Adebimpe, who struggled with the deaths\nof a friend and family member during the making of Dear Science.\n&quot;Writing is a meditation, an exercise to put away all these\npainful things.'&quot;\n\nAnd that's ultimately what TV On The Radio still hopes to do with\nits music--they're still looking to connect, to make people feel\nsomething, anything no matter how up or down a song's arrangement\nis.\n\n&quot;I grew up listening to Joy Division, New Order, Echo &amp; the\nBunnymen, the Cure, the Smiths and the Swans,&quot; says Malone. &quot;Some\nof that qualifies as 'goth' but it didn't make me depressed to\nlisten to that music despite what my parents assumed. It didn't\nadd to my 'angst' as a teenager. I simply identitfied with\nsomething in the music.\n\n&quot;It made me feel less alone, you know?&quot; he continues. &quot;If I could\nbe that for someone else, that would make me happy. It'd be a real\nform of success for me.&quot;","torrent":{"xt":"urn:btih:075ad4b77bc1ddd1b2e09e68a45bfd9ac81e2fcf","amp;dn":"TV+On+The+Radio+-+Dear+Science+%28Deluxe+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"075ad4b77bc1ddd1b2e09e68a45bfd9ac81e2fcf","infoHashBuffer":{"type":"Buffer","data":[7,90,212,183,123,193,221,209,178,224,158,104,164,91,253,154,200,30,47,207]},"announce":[],"urlList":[]}}