{"title":"Alice Coltrane - Lord of Lords (1972) [EAC-FLAC]","uid":14714197,"size":296027791,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:077fa623d659ae50901d39e1778cacd37bdba65d&amp;dn=Alice+Coltrane+-+Lord+of+Lords+%281972%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pucholoco","files":17,"time":1464445550,"description":"Alice Coltrane - Lord of Lords (1972)\r\n             EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 179 Mb\r\n                     Full Artwork @ 300 dpi (jpg) -&gt; 13 Mb\r\n\r\n\r\nLord of Lords, released in 1972, was Alice Coltrane's final album for Impulse! It was the final part of a trilogy that began with Universal Consciousness and continued with the expansive World Galaxy.\r\n\r\nLike its immediate predecessors, the album features a 16-piece string orchestra that Coltrane arranged and conducted, fronted by a trio in which she plays piano, Wurlitzer organ, harp, and timpani with bassist Charlie Haden and drummer Ben Riley. Riley was familiar with the setting because he had been part of the sessions for World Galaxy. The first two pieces, &quot;Andromeda's Suffering&quot; and &quot;Sri Rama Ohnedaruth&quot; (titled after the spiritual name for her late husband, John Coltrane), are, in essence, classical works. \r\n\r\nThere is little improvisation except on the piano underneath the wall of strings. They are scored for large tone clusters and minor-key drone effects, but also engage in creating timbral overtones.&quot;Excerpts from The Firebird,&quot; which uses the organ to open the piece, features the strings playing almost (because with Alice Coltrane, she interpreted in her own way) directly from Igor Stravinsky's score. \r\n\r\nHer harp introduces Riley's brushes and the strings, which in turn offer a root chord for her to play the melody and improvise upon it on the organ. Here the blues make their presence known. It offers a kind of understanding for the listener that Coltrane, no matter where this musical direction was headed (even as it went further toward the Cosmic Music she and her late husband envisioned together), continued to understand perfectly where her musical root was. The interplay between the three principals is lively and engaging, based on droning blues chords, and her soloing – even amid flurries of notes – comes right back to the root, and she quotes quite directly from Delta blues riffs and other gospel songs. \r\n\r\nHaden's bass is a beautiful anchor here (although mixed a bit low), and the strings offer a lovely response to her organ and harp. Riley's cymbals are shimmering shards of light throughout, ending Lord of Lords on a very high note. While it's true that Alice Coltrane's later Impulse! music may not be for everyone, even those who followed her earlier, more jazz-oriented recordings on Impulse!, it was obvious from the beginning that she was seeking to incorporate Indian classical music's drone center into her work, and was literally obsessed with the timbral, chromatic, and harmonic possibilities of strings. She succeeds here, in ending her Impulse! period with elegance, grace, and soul.\r\n\r\nRecorded at The Village Recorder, Los Angeles, CA on July 5-13, 1972.\r\n\r\n\r\n---------------------------------------------------------------------------------\r\nTracklist:\r\n---------------------------------------------------------------------------------\r\n\r\n01. Andromeda's Suffering \r\n02. Sri Rama Ohnedaruth \r\n03. Excerpts from the Firebird \r\n04. Lord of Lords\r\n05. Going Home \r\n\r\n*2004 Impulse! | # UCCI-9110\r\n\r\n\r\nPersonnel:\r\nAlice Coltrane - piano, organ, harp, tympani, percussion\r\nCharlie Haden - bass\r\nBen Riley - drums, percussion\r\nString Orchestra:\r\nMurray Adler - concertmaster\r\nNathan Kaproff, Lou Klass, William Henderson, Ronald Folsom, Leonard Malarsky, Gordon Marron, Janice Gower, Gerald Vinci, Sidney Sharp, James Getzoff, Bernard Kundell - violins\r\nMyra Kestenbaum, Rollice Dale, Leonard Selic, David Schwartz, Samuel Boghosian, Marilyn Baker - violas\r\nJesse Ehrlich, Jerry Kessler, Jan Kelly, Anne Goodman, Edgar Lustgarten, Ray Kelley, Raphael Kramer - cellos\r\n\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks !","torrent":{"xt":"urn:btih:077fa623d659ae50901d39e1778cacd37bdba65d","amp;dn":"Alice+Coltrane+-+Lord+of+Lords+%281972%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"077fa623d659ae50901d39e1778cacd37bdba65d","infoHashBuffer":{"type":"Buffer","data":[7,127,166,35,214,89,174,80,144,29,57,225,119,140,172,211,123,219,166,93]},"announce":[],"urlList":[]}}