{"title":"[PSX-PSP] GRAND THEFT AUTO","uid":4394577,"size":497490604,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:083f2e9dbd4922ed7e38a4d63bc87b5f0868a7c6&amp;dn=%5BPSX-PSP%5D+GRAND+THEFT+AUTO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nuGFX","files":6,"time":1221358930,"description":"In 1997, a band of developers that would come to be known as Rockstar North and Rockstar Games released the original Grand Theft Auto on an unsuspecting public. The groundbreaking non-linear urban crime game shook up a complacent game industry with its irreverent gameplay, humor and style- and a phenomenon was born. \n\nGameplay \nGrand Theft Auto is made up of a series of levels each set in one of the three cities in the game (Liberty City, Vice City and San Andreas). In each level, the player has a target number of points to achieve, and five lives to attain the score. \n\nPossibilities \nThe player is free to do whatever he wants. The player can gain points by causing death and destruction amid the traffic in the city, or steal and sell cars for profit, although to get to the large target money amount to complete a level, players will usually opt to complete missions which will gain them multiplier for every success and losing one for every failed mission. The multiplier multiplies the amount of points scored for anything. Thus with a higher multiplier is is possible to reach the target score by only doing less worthwhile stuff \n\nFreedom \n]Even during missions there is still some freedom as most of the time the player is free to choose the route to take, but the destination is usually fixed. It is this level of freedom which set GTA apart from other action based computer games at the time. \n\nCharacters \nPlayers are able to choose to play as eight characters in the game: Travis, Kat, Nikki, Divine, Bubba, Troy, Kivlov and Ulrika. The Playstation version only lets players choose four characters. In actual gameplay, there is no real difference, since the characters all wear the exact same yellow sweater. You may also name your character, which, with the correct name, acts like a cheat code and enhances gameplay. However, these characters have never been seen in any other GTA game to date and are relatively unknown, as in the case of the characters from Grand Theft Auto but one of the characters Troy shares many similarities to Carl &quot;CJ&quot; Johnson from GTA San Andreas. \n\nLocations \nThe three cities in which the game is set are modelled after real cities, in terms of landscape and style. They are Liberty City (New York City), San Andreas (San Francisco) and Vice City (Miami). \n\nThese three cities would later become the settings of Grand Theft Auto III, Grand Theft Auto: Vice City, Grand Theft Auto: San Andreas, Grand Theft Auto: Advance, Grand Theft Auto: Liberty City Stories, Grand Theft Auto: Vice City Stories, and Grand Theft Auto IV. \n\n\n--------------------------------------------------------------------------------\n\nGrand Theft Auto \nRelease Date: 06/30/98 \nGenre: Action Adventure \nDeveloper: DMA Design \nESRB Rating: M \nNuumber of players: 1 \nISO Size: 699mb \n\n\n\nWill not run on firmware prior to 3.03 CE-C. Tested on 4.01 M33-2. \n","torrent":{"xt":"urn:btih:083f2e9dbd4922ed7e38a4d63bc87b5f0868a7c6","amp;dn":"%5BPSX-PSP%5D+GRAND+THEFT+AUTO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"083f2e9dbd4922ed7e38a4d63bc87b5f0868a7c6","infoHashBuffer":{"type":"Buffer","data":[8,63,46,157,189,73,34,237,126,56,164,214,59,200,123,95,8,104,167,198]},"announce":[],"urlList":[]}}