{"title":"Dispatches_Undercover_Mosque.divx","uid":3599963,"size":410346676,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:08dc0bae472c8eacc22c4abf7d0c8ff89c80a455&amp;dn=Dispatches_Undercover_Mosque.divx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Mrs_Hebron","files":1,"time":1169323081,"description":"Shocking documentary from &quot;moderate&quot; mosques.\n\nChannel4 &lt;a href=&quot;\nhttp://www.channel4.com/news/dispatches/article.jsp?id=1066&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.channel4.com/news/dispatches/article.jsp?id=1066&lt;/a&gt;\n\n42 min.\n\n\n- - -\n\n\n\n\n\n &lt;a href=&quot;\nhttp://www.ynetnews.com/articles/0,7340,L-3353122,00.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ynetnews.com/articles/0,7340,L-3353122,00.html&lt;/a&gt;\n\n\nUK TV uncovers &amp;#039;Islamic supremacism&amp;#039;\n\n\nDocumentary goes undercover in British mosques, finds &amp;#039;ideology of bigotry&amp;#039;\n\nYaakov Lappin Published:  01.16.07, 19:37\n\nA British television documentary, &amp;#039;Dispatches: Undercover Mosque,&amp;#039; \nbroadcast on Sunday evening on the UK&amp;#039;s Channel 4 has uncovered hate-filled \nspeeches and rhetoric delivered in a number of British mosques, and \ndirected against &amp;#039;unbelievers,&amp;#039; Jews, Christians, and gays, among others, \nas well as religious justifications of marriages between prepubescent girls \nand adult men.\n\n\nSome of the mosques targeted by the program were previously considered to \nbe centers of moderate Islam in Britain. One mosque featured in the video \nwas associated with a Muslim leader working with the British government to \nstrengthen ties between the Muslim and non-Muslim communities.\n\nThe program&amp;#039;s female narrator warned of &quot;an ideology of intolerance and \nbigotry spreading throughout Britain, with its roots in Saudi Arabia,&quot; as \nimages of the mosques and worshippers flashed across the screen.\n\nOne preacher was seen saying: &quot;We Muslims have been ordered to do \nbrainwashing.&quot;\n\nThe main English-language speaker of a Birmingham mosque, Abu Usama, who is \nan American convert to Islam, spread hatred of Christian and Jews in the \nfootage.\n\n&quot;It has come to pass that the Christians and the Jews, America , France, \nthe UK and Germany, they have come against the religion of al-Islam,&quot; Usama \nsaid, adding: &quot;Why give up your religion to please someone who is an enemy \nto you?&quot;\n\nIn the film, British Muslims at a mosque were told that that Islam will \neventually gain &quot;the uppermost strength&quot; and form an Islamic state. They \nwere instructed to &quot;form a state within a state, until we take over.&quot;\n\nIn the Islamic state, Abu Usama said if a Muslim tried to leave Islam, he \nwould be killed. &quot;If the imam wants to crucify him he should crucify him. \nThe person is put up on the wood and he&amp;#039;s left there to bleed to death for \nthree days,&quot; he said.\n\n\n&amp;#039;Marrying prepuescent girls Okay&amp;#039;\n\n&quot;The Islamic state he predicts will have a single, life-time ruler with no \nopposition party or elections,&quot; explains the narrator.\n\nA video purchased at a bookshop at the largest mosque in London, the \nRegents Park mosque, contained footage of a young, Saudi-trained Muslim \ncleric, Sheikh Faiz, who was seen saying: &quot;Kafir (infidel),&quot; as he drew an \nimaginary line on his forehead. &quot;The worst word that can ever be written. A \nsign of infidelity. Disbelief. Filth. The sign of dirt.&quot; The preacher calls \nJews &quot;pigs,&quot; and said they would be &quot;killed when the end of the world comes.&quot;\n\n&quot;This creature will say, oh Muslim, behind me is the Jew, come and kill \nhim,&quot; the preacher shouts, before carrying out an impersonation of a pig \nsound, saying, &quot;all of them,&quot; to the laughter of the audience.\n\nThe video showed a leading Muslim figure, who took part in a government \ntaskforce to tackle extremism, comfortably taking part in a religious \nconference at the Birmingham mosque, in which discrimination against \nhomosexuals was encouraged, as well as violence against girls who refused \nto wear the hijab.\n\n&quot;Allah has created the woman deficient,&quot; said the Birmingham mosque \nspeaker. &quot;Her intellect is incomplete, deficient. She may be suffering from \nhormones that will make her emotional. It takes two witnesses of a woman to \nequal the one witness of the man,&quot; he added.\n\nA Saudi video on sale at one of the mosques showed a preacher saying: &quot;Men \nare in charge of women. Wherever he goes, she should follow him. She \nshouldn&amp;#039;t be allowed to leave the house without his permission.&quot;\n\nAnother sheikh on video says 10-year-old girls should be hit if they do not \nput on the hijab covering.\n\n\n&amp;#039;The summit of Islam is jihad&amp;#039;\n\nOne speaker at a Birmingham mosque, Dr. Billal Phillips, said that the \nmarriage of Islam&amp;#039;s prophet, Muhammad to a nine year-old girl, Aisha, meant \nthat contrary to modern laws, such marriages were acceptable.\n\n&quot;The prophet Muhammad practically outlined the rules regarding marriage \nprior to puberty. With his practice, he clarified what is permissible, and \nthat is why we shouldn&amp;#039;t have any issues about an older man marrying a \nyounger woman,&quot; he said. &quot;It is looked down upon the society today, but we \nknow that the prophet Muhammad practiced it. It wasn&amp;#039;t abuse or \nexploitation, it was marriage,&quot; he added.\n\n&quot;Do you practice homosexuality with men? Take that homosexual man and throw \nhim off the mountain,&quot; declared Abu Usama. He later was heard calling for \nAllah &quot;to bring about the means and the ways&quot; to &quot;? go out and perform the \njihad.&quot;\n\n&quot;The peak, the pinnacle, the crest, the highest point, the pivot, the \nsummit of Islam is jihad,&quot; said Sheikh Faiz, on a DVD sold at the mosque in \nBirmingham.\n\n##########################################\n\n","torrent":{"xt":"urn:btih:08dc0bae472c8eacc22c4abf7d0c8ff89c80a455","amp;dn":"Dispatches_Undercover_Mosque.divx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08dc0bae472c8eacc22c4abf7d0c8ff89c80a455","infoHashBuffer":{"type":"Buffer","data":[8,220,11,174,71,44,142,172,194,44,74,191,125,12,143,248,156,128,164,85]},"announce":[],"urlList":[]}}