{"title":"Hogtied------HT-28191 Tia Ling","uid":8115016,"size":3119719503,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:09e1dfe6556d9ccebec1c255881146833e08a983&amp;dn=Hogtied------HT-28191+Tia+Ling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1360274485,"description":"Bitch Bound In Bag &amp; Extreme Spread Eagle Special!\n\nFeb 7, 2013 - Performers: Tia Ling \n\n\nMP4 and WMV + Pics.        \n\n\nWelcome back tenacious Tia Ling. This bitch is one of the toughest I've encountered. With delight she is subjected to some of the most intense predicaments her body can take. In scene one, Tia is bound in an extremely limited duration spread and neck play predicament. What makes this position so tough is with the feet elevated and the hands pulling back at an angle, she has no back support and only her ab and thigh strength keep her in place. A crotch rope is added and soon she starts suspending herself to avoid the torments being administered, which is super hot and sexy. So much that the barrel gets taken away entirely. The problem for her at this point is if she lowers her body too much, she will asphyxiate...\n\nSecond Tia is bound in a face up fold, kind of like an ebi but very open. Bitch however is wrapped in plastic like she was found in a dumpster and left to hang like a piece of meat. The plastic adds a new challenge. It dulls her senses and makes the cane on her ass feel very different. A hole is cut to expose only her pussy and the nice butt plug in her ass. All she gets is anal orgasms from a slick thick cock in her slut whole. The bitch loves it, lapping it up, and cumming more and more. Finally all of the plastic is removed and she is left to suffer in her bondage.\n\nFinally Tia is bound in a discipline position where she has to will herself to stay still. She is extremely ticklish and between tickling and the cane, really can't behave. She is switched onto her stomach into an open arm / reverse chicken wing hogtie. She looks far too comfortable and is switched into a very uncomfortable strappado and hoisted into the air in an intense 5 point hogtie suspension. Made to cum again and again she suffers and loves her bondage at the same time.\n\nScreens   &lt;a href=&quot;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=28191&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=28191&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:09e1dfe6556d9ccebec1c255881146833e08a983","amp;dn":"Hogtied------HT-28191+Tia+Ling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09e1dfe6556d9ccebec1c255881146833e08a983","infoHashBuffer":{"type":"Buffer","data":[9,225,223,230,85,109,156,206,190,193,194,85,136,17,70,131,62,8,169,131]},"announce":[],"urlList":[]}}