{"title":"Run of the Arrow 1957 DvdRip Avi Lee1001","uid":9826390,"size":819580975,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0ae8df89822020052a05fff8a41eed64150bf58f&amp;dn=Run+of+the+Arrow+1957+DvdRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"xultfoad","files":2,"time":1395786357,"description":"Run of the Arrow 1957 DvdRip Avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0050915/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0050915/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Run_of_the_Arrow&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Run_of_the_Arrow&lt;/a&gt;\nRun of the Arrow is an American western first released in 1957, directed by Samuel Fuller. The film stars Rod Steiger, Sara Montiel and Brian Keith. It has also been released under the title: Hot Lead.\n\nNo-nonsense writer-director Sam Fuller apparently didn't enjoy Rod Steiger's method approach to his character, O'Meara, a Southern soldier who fires the last shot in the Civil War, rejects his people and heads west to join the Sioux.\n\nGradually O'Meara is accepted, but when - in the movie's climax - a man captured by the Sioux does not survive the run of the arrow (a headstart given before a chase to the death) and is caught to be flayed alive, O'Meara shoots him with a bullet kept from the war. In crisis he is unable to accept the Sioux culture and returns home.\nA powerful, thought-provoking western featuring fine performance from Ralph Meeker as a General Custer clone and a young Charles Bronson as Blue Buffalo.\n\nSeveral film historians, notably the late William K. Everson, have noted the striking resemblances between Run of the Arrow and the 1990 Oscar-winner Dances with Wolves. Rod Steiger stars as O'Meara, an Irish-brogued Confederate soldier with an intense dislike for Yankees. Unable to accept the South's defeat, O'Meara heads westward after the Civil War, to start life anew amongst the Sioux Indians. Surving a ritual rite of passage called the Run of the Arrow, O'Meara is accepted into the tribe, and shortly afterward marries Sioux woman Yellow Moccasin (played by Spanish actress Sarita Montiel, whose voice was dubbed by Angie Dickinson). \n\nThe true test of O'Meara's fidelity to the Sioux comes when his adopted people come into conflict with a Cavalry troop, headed by Northerner Captain Clark (Brian Keith). The cast includes such western &quot;regulars&quot; as Charles Bronson, Olive Carey (the widow of Harry Carey) and Colonel Tom McCoy (a recognized Indian-lore expert). Produced by RKO Radio, Run of the Arrow was released by Universal-International.\n\nVIDEO\nSize.... 699mb\nDuration.... 01:27:46\nCodec.... divx\nFrame Width..... 640\nFrame Height.... 480\nData Rate.... 114kbps\nFrame Rate.... 25 F/S\nAUDIO\nBit Rate.... 129kbps\n2 Channel Stereo\nAudio Sample Rate.... 44KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:0ae8df89822020052a05fff8a41eed64150bf58f","amp;dn":"Run+of+the+Arrow+1957+DvdRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ae8df89822020052a05fff8a41eed64150bf58f","infoHashBuffer":{"type":"Buffer","data":[10,232,223,137,130,32,32,5,42,5,255,248,164,30,237,100,21,11,245,143]},"announce":[],"urlList":[]}}