{"title":"Katmar AioFlo Version 1.07 + Patch","uid":15323226,"size":5119242,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0bb7700f6c087290905bac2134d3c93f0f214cd8&amp;dn=Katmar+AioFlo+Version+1.07+%2B+Patch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JeffreyLato","files":1,"time":1468668486,"description":"Katmar AioFlo 1.07\r\n\r\nPipe Sizing and Flow Calculation Software\r\n\r\nPipe sizing, pressure drop and fluid flow rate calculations\r\n\r\nAioFlo (pronounced aye-oh-flow) is a Windows application for pipe sizing (diameter calculation), flow rate and pressure drop calculations for liquids and gases in single phase flow.\r\n\r\nThe AioFlo hydraulic calculator will determine any one of pipe diameter, fluid flow rate or pressure drop when the other two are known. It performs liquid and isothermal gas flow hydraulic calculations. Preliminary calculations based on velocity rather than pressure drop are also possible. Resistance coefficients for a wide range of pipe fittings are built in.\r\n\r\nDetailed Program Description\r\n\r\nAioFlo (pronounced aye-oh-flow) is a Windows software application that solves pipe sizing (diameter calculation), pressure drop and fluid flow rate hydraulic problems for single phase flow in single pipes. It is based on the Darcy-Weisbach pipe sizing formula for liquid flow, and the integrated version for isothermal gas flow.\r\n\r\n* It is extremely flexible in that it can calculate any one of pipe diameter, fluid flow rate or pressure drop when given the other two. AioFlo can be used for incompressible and compressible (isothermal) Newtonian single phase fluids.\r\n\r\n* Fluid flows can be given in mass or volumetric terms and viscosities in dynamic or kinematic units.\r\n\r\n* The accuracy of AioFlo has been validated by extensive in-house testing and by thousands of engineers applying it to real-world problems. The examples pages show the results from AioFlo compared with worked examples from well known and respected references.\r\n\r\n* Units handling is unparalleled, allowing the units for any individual property to be set independently, or in predefined sets (US Customary, SI and Metric) and user-defined sets of mixed units.\r\n\r\n* Use of the Churchill friction factor equation allows seamless coverage for fluid flow rate and pressure drop calculations in the laminar, critical, transition and fully turbulent flow regimes. Pipe friction factors can be reported as Fanning, Moody, Darcy-Weisbach or Stanton friction factors to suit any industry convention.\r\n\r\n* Pipe fitting resistance coefficients (K-values) based on the Darby 3-K Method are included for a wide variety of generic pipe fittings. This allows accurate pressure drops to be calculated for pipe fittings, taking into account the fitting size (pipe diameter) and the Reynolds Number. Cv values for control valves can be included. Dimensions of orifice plates can be specified to determine the permanent pressure drops.\r\n\r\n* Pressure drops for changes in pipe size can be calculated for sudden expansions and contractions, conical tapered reducers and standard pipe reducers using the Hooper Method for the resistance coefficients (K-values).\r\n\r\n* Pipe diameters are included for Schedules 10S, 40 and 80 for pipes from 1/2 inch (15 mm) to 24 inch (600 mm), but any other pipe inside diameter can be entered manually.\r\n\r\n* Differences between the pipe start and end elevations are taken into account in determining the overall pressure drop. Fluid flow rate or pipe diameter can be calculated for situations where gravity is the only driving force.\r\n\r\n* Pipe roughness data is included for a wide range of pipe materials and conditions to enable pipe friction factors to be calculated in the turbulent flow regime. Friction factors in the laminar flow regime are independent of pipe roughness.\r\n\r\n* Calculated results for liquids include the pump delivery pressure required in terms of the head of pumped liquid (and of course in pressure terms as well).\r\n\r\n* Preliminary pipe sizing (diameter calculation) can be done before sufficient data is available to perform detailed hydraulic calculations for pressure drop and fluid flow rate by basing calculations on the fluid velocity rather than the pressure drop.\r\n\r\n* The AioFlo interface has been designed to allow translation to languages other than English. In version 1.06 the interface translations to French, German, Portuguese and Spanish are almost complete. (Thanks very much to the users who did these translations!) We are now looking to complete the Italian translation.\r\n\r\n* Neat, single page hydraulic calculation reports can be printed.\r\n\r\n* Small download size - only 2.2 Mb. Totally self-contained software with no dependence on any frameworks, run-time libraries or DLLs.\r\n\r\n* Full install and uninstall utilities included.\r\n\r\n\r\nKatmar AioFlo Version 1.07 with pre-patched .exe by LAVteam (Thanks!)\r\n\r\n1. Disconnect from the Internet\r\n2. Run Setup\r\n3. After setup finishes, copy the patched AioFlo.exe to C:Program Files (x86)AioFlo (or other directory if you have installed it elsewhere)\r\n4. Make sure to run the program always by admin rights.\r\n5. Make sure AioFlo.exe is blocked at the Firewall from connecting to the Internet\r\n\r\nAt the Help&gt;About tab it says unregistered but program is patched and will work without any problem.\r\nIf you like the app, don't forget to seed or help with a seedbox!","torrent":{"xt":"urn:btih:0bb7700f6c087290905bac2134d3c93f0f214cd8","amp;dn":"Katmar+AioFlo+Version+1.07+%2B+Patch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bb7700f6c087290905bac2134d3c93f0f214cd8","infoHashBuffer":{"type":"Buffer","data":[11,183,112,15,108,8,114,144,144,91,172,33,52,211,201,63,15,33,76,216]},"announce":[],"urlList":[]}}