{"title":"The.Silk.Road--BBC-2016-w.subs-360p","uid":14630218,"size":1065224941,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0c5393ebd29bad6e00a5ffa1aa1d2d5608c4ffab&amp;dn=The.Silk.Road--BBC-2016-w.subs-360p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"uggauga","files":6,"time":1463358236,"description":"The Silk Road\r\n\r\nDr Sam Willis reveals how the Silk Road was the world's first global superhighway where people with new ideas, new cultures and new religions made exchanges that shaped humanity.\r\n\r\nBBC (2016) - 3 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/p03qb130\r\n_______________________________________\r\n\r\n640x360 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nEpisode 1\r\nIn the first episode of his series tracing the story of the most famous trade route in history, Dr Sam Willis starts in Venice and explores how its Renaissance architecture and art has been shaped by the east and by thousands of exchanges along the Silk Road.\r\nFrom Venice Sam travels to China's ancient capital, Xian. Here, Sam's story takes him back in time to reveal the tale of an emperor who was so desperate for horses to help protect his borders that he struck one of the most significant trade deals in human history - he wanted war horses, he gave the most precious material in the world, silk. From this single deal, a network of trading paths were carved out across thousands of miles by merchants, traders, envoys, pilgrims and travellers. It is known to us today as the Silk Road.\r\n\r\nEpisode 2\r\nIn the second episode of his series tracing the story of the most famous trade route in history, Dr Sam Willis travels west to central Asia, a part of the Silk Road often overlooked and yet the place of major innovations, big historical characters and a people - the Sogdians - whose role was pivotal to its success.\r\nIn the high mountain passes of Tajikistan, Sam meets the last survivors of that race, who once traded from the Mediterranean to the China Sea. In the Uzbek cities of Samarkand and Bukara, he discovers how they were built by armies of captive craftsmen for one of the greatest conquerors the world has ever seen - Timur.\r\nFrom here, Sam follows the flow of goods back towards the markets of the west, showing how their trading culture sparked cultural, technical and artistic revolutions all along the Silk Road, and goes back to school to learn where modern mathematics and astronomy were born.\r\n\r\nEpisode 3\r\nIn the final episode of his series tracing the story of the most famous trade route in history, Dr Sam Willis continues his journey west in Iran. The first BBC documentary team to be granted entry for nearly a decade, Sam begins in the legendary city of Persepolis - heart of the first Persian Empire.\r\nFollowing an ancient caravan route through Persia's deserts, he visits a Zoroastrian temple where a holy fire has burned for 1,500 years, and Esfahan, one of the Silk Road's architectural jewels and rival to Sam's next destination - Istanbul. In the ancient capital of Byzantium Sam discovers how the eastern Roman Empire was ruled through silk and how Venetian merchants cashed in on the wealth and trade it generated.\r\nSam's last stop takes him full circle to Venice. Visiting Marco Polo's house, Sam reminds us how the great traveller's book was one of the first to link East to West and how the ideas and products that trickled down the Silk Road not only helped to trigger the Renaissance, but set Europe on a path of unstoppable change","torrent":{"xt":"urn:btih:0c5393ebd29bad6e00a5ffa1aa1d2d5608c4ffab","amp;dn":"The.Silk.Road--BBC-2016-w.subs-360p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c5393ebd29bad6e00a5ffa1aa1d2d5608c4ffab","infoHashBuffer":{"type":"Buffer","data":[12,83,147,235,210,155,173,110,0,165,255,161,170,29,45,86,8,196,255,171]},"announce":[],"urlList":[]}}