{"title":"Diaper Girl Private Collection ( Volume 1 )","uid":5914211,"size":4580059864,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0df2959689fe60f0f1b1225bc43bd78ba934d071&amp;dn=Diaper+Girl+Private+Collection+%28+Volume+1+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Zolta0","files":1,"time":1288167321,"description":"Diaper Girls ( Volume 1)   (18's &amp; above only)\n\nThis a 4.5 Gigabyte collection when downloaded and decompressed.\n\nDiaper girls Film Collection (Approximately 125 films) from all over the net.\n\nIncluded is Winrar fully registered, Not my crack but thanks to the guy/girl that brought this ace program to us for free, There was no nfo file with the download to be able to say thanks, It is in a self extracting archive.\n\nAlso included in this download is the K Lite Codec Pack with Media Player Classic (&quot; probably one of the best media players ever&quot;) (easy install) it will play all the files of this download and is free on the net + free updates (there's very few media files that it won't play).\n\nAlso Include is VLC Media Player which again Plays more or less any media file you throw at it.\n\nQ. Why the inclusion of the above ?\n\nA. Simply to make the download instantly easy to watch and enjoy as everything you need for your viewing pleasure is here.\n\nThe files are in FLV, MPG, Mp4 ,Mp2, MPG ,AVI, X Vid, Div X,Wmv, Format, etc so will run on most players, But all will run on Media Player Classic (Included) &amp; VLC media Player  (Included) Actually i haven\\'t tested all on VLC as i used media Player Classic but im fairly  sure it will play all.\n\nAll the Diaper girls in these films are over 18 years of age.\n\nSo if you are a filthy fucking Paedophile don\\'t bother looking here i hope you die slowly and have a very very fucking painful Death.\n\nThis is a genuine archive there are absolutely no viruses or Spy ware ( 100% Clean ).\n\nI came across  some of this stuff by accident but found it quite fascinating and thought it would be good to see if i could fill a DVD with it, I didn't realise when i started  there would be so much of it out there or how easy to get especially when most of the sites this material is from are charging for it.\n\nSo here free  for your eyes viewing pleasure or whatever is my finds.\n\nEnjoy.\n\nPlease Seed for as long as possible as im only on a slow pay as you go dongle so won\\'t be able to seed for that long but will do my best with what i have.\n\nZolta0\n\nPlease leave comments &amp; thanks below.\n\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:0df2959689fe60f0f1b1225bc43bd78ba934d071","amp;dn":"Diaper+Girl+Private+Collection+%28+Volume+1+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0df2959689fe60f0f1b1225bc43bd78ba934d071","infoHashBuffer":{"type":"Buffer","data":[13,242,149,150,137,254,96,240,241,177,34,91,196,59,215,139,169,52,208,113]},"announce":[],"urlList":[]}}