{"title":"Eduardo Souto De Moura - The 2011 Pritzker Architecture Prize (A","uid":10863459,"size":120488852,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e3dc2fd7baaf1cd0eb45275bb195a46bbf15c55&amp;dn=Eduardo+Souto+De+Moura+-+The+2011+Pritzker+Architecture+Prize+%28A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1408900242,"description":"The 2011 Pritzker Architecture Prize Eduardo Souto De Moura by Joana de Mira Correa\nEnglish | 2012 | 272 pages | PDF | 114 MB\n\nDuring the past three decades, the Portuguese architect Eduardo Souta de Moura has produced a body of work that is of our time, but also carries echoes of architectural traditions. His oeuvre is convincing proof of modern idioms expressive potential and adaptability to distinct local situations. \n\nAlways mindful of context, understood in the broadest sense, and grounded in place, time, and function, Souto de Moura s architecture reinforces a sense of history while expanding the range of contemporary expression. Eduardo Souto de Moura s architecture is not obvious, frivolous, or picturesque. It is imbued with intelligence and seriousness. His work requires an intense encounter not a quick glance. And like poetry, it is able to communicate emotionally to those who take the time to listen. His buildings have a unique ability to convey seemingly conflicting characteristics - power and modesty, bravado and subtlety, bold public authority and sense of intimacy - at the same time. For architecture that appears effortless, serene, and simple, and for the care and poetry that permeates each project.","torrent":{"xt":"urn:btih:0e3dc2fd7baaf1cd0eb45275bb195a46bbf15c55","amp;dn":"Eduardo+Souto+De+Moura+-+The+2011+Pritzker+Architecture+Prize+%28A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e3dc2fd7baaf1cd0eb45275bb195a46bbf15c55","infoHashBuffer":{"type":"Buffer","data":[14,61,194,253,123,170,241,205,14,180,82,117,187,25,90,70,187,241,92,85]},"announce":[],"urlList":[]}}