{"title":"Economics of Good and Evil","uid":6651231,"size":4569336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e737c82e94750ba5b720d36b9280b709cf20389&amp;dn=Economics+of+Good+and+Evil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1315156292,"description":"Economics of Good and Evil: The Quest for Economic Meaning from Gilgamesh to Wall Street\n\nTomas Sedlacek has shaken the study of economics as few ever have. Named one of the \\&quot;Young Guns\\&quot; and one of the \\&quot;five hot minds in economics\\&quot; by the Yale Economic Review, he serves on the National Economic Council in Prague, where his provocative writing has achieved bestseller status. How has he done it? By arguing a simple, almost heretical proposition: economics is ultimately about good and evil. In The Economics of Good and Evil, Sedlacek radically rethinks his field, challenging our assumptions about the world. Economics is touted as a science, a value-free mathematical inquiry, he writes, but it's actually a cultural phenomenon, a product of our civilization. It began within philosophy--Adam Smith himself not only wrote The Wealth of Nations, but also The Theory of Moral Sentiments--and economics, as Sedlacek shows, is woven out of history, myth, religion, and ethics. \\&quot;Even the most sophisticated mathematical model,\\&quot; Sedlacek writes, \\&quot;is, de facto, a story, a parable, our effort to (rationally) grasp the world around us.\\&quot; Economics not only describes the world, but establishes normative standards, identifying ideal conditions. Science, he claims, is a system of beliefs to which we are committed. To grasp the beliefs underlying economics, he breaks out of the field's confines with a tour de force exploration of economic thinking, broadly defined, over the millennia. He ranges from the epic of Gilgamesh and the Old Testament to the emergence of Christianity, from Descartes and Adam Smith to the consumerism in Fight Club. Throughout, he asks searching meta-economic questions: What is the meaning and the point of economics? Can we do ethically all that we can do technically? Does it pay to be good? Placing the wisdom of philosophers and poets over strict mathematical models of human behavior, Sedlacek's groundbreaking work promises to change the way we calculate economic value\n\nOxford University Press, USA\n2011\n","torrent":{"xt":"urn:btih:0e737c82e94750ba5b720d36b9280b709cf20389","amp;dn":"Economics+of+Good+and+Evil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e737c82e94750ba5b720d36b9280b709cf20389","infoHashBuffer":{"type":"Buffer","data":[14,115,124,130,233,71,80,186,91,114,13,54,185,40,11,112,156,242,3,137]},"announce":[],"urlList":[]}}