{"title":"Tesla, Swartz - The Lost Journals of Nikola Tesla - HAARP - Chem","uid":9322082,"size":1666318,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ec50c8af8f508692382098f3cd3d6b27998f8f0&amp;dn=Tesla%2C+Swartz+-+The+Lost+Journals+of+Nikola+Tesla+-+HAARP+-+Chem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"conspiracyPDF","files":1,"time":1386570317,"description":"Tesla, Swartz - The Lost Journals of Nikola Tesla - HAARP - Chemtrails and Secret of Alternative 4 (2000)\n\nSENSATIONAL DATA OBTAINED FROM THE INVENTOR'S MOST PRIVATE PAPERS AND KEPT UNDER WRAPS BY THE MILITARY AND BIG BUSINESS CONCERNS This book is for all those who feel that the military industrial complex is attempting to control our lives, our financial affairs and our belief structure. The evidence is overwhelming!Discredited in his time, Nikola Tesla was made out by business competitors and the government to be nothing more than a kook. Nonetheless, the same conspirators later duplicated -- and possibly even stole -- many of Tesla's most fabulous inventions which could soon change the course of history as well as our lives! EXPOSED. . . * Reverse Gravity. * Free Energy. * Contact With Hidden Dimensions. * Mysterious Signals From Space. * Earth Changes. * Freak Weather. * Electric Death Rays. * UFOS. * Partical Beam Weapons. Put into Top-Secret use by agents of the New World Order and the global political monetary elite, many of Tesla most powerful and potentially dangerous scientific discoveries are being turned against ordinary citizens in programs of behavior and physical modification. This is being done to influence our critical thinking and belief patterns to make us more susceptible to the mental commands of the Secret Government.One of the most recognizable of these sinister programs is the seeding of clouds with mind and body altering chemicals. These mysterious chemtrails (as they are called) have been widely seen and photographed as they cris-cross the sky in bewildering patterns. Tesla fought all his life against the &quot;Evil Empire&quot; which is emerging as a fire breathing dragon as we get pushed head first into the new millennium.","torrent":{"xt":"urn:btih:0ec50c8af8f508692382098f3cd3d6b27998f8f0","amp;dn":"Tesla%2C+Swartz+-+The+Lost+Journals+of+Nikola+Tesla+-+HAARP+-+Chem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ec50c8af8f508692382098f3cd3d6b27998f8f0","infoHashBuffer":{"type":"Buffer","data":[14,197,12,138,248,245,8,105,35,130,9,143,60,211,214,178,121,152,248,240]},"announce":[],"urlList":[]}}