{"title":"Sexually Broken--20yr innocent girl next door Kristine Kahill Ma","uid":8496455,"size":1142063539,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:0ef5c77de9004a0c0ad20908990a3f662b0d28d8&amp;dn=Sexually+Broken--20yr+innocent+girl+next+door+Kristine+Kahill+Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1369159640,"description":"20yr innocent girl next door, finds out what bondage &amp; deep brutal throat fucking are all about! | Kristine Kahill | Matt Williams\n\nMay 20, 2013\n\n\nMP4 only.\n\n\nCute as a button Kristine Kahill is back for another serving of cock as only Sexuallybroken knows how to dish it out-extreme, no mercy, blast you into subspace blow jobs. She came to us to see if she can take what we dish out. Kristine may only be 20 years old, but she sucks cock like a champ.\n\nWe start out with our smooth shaved slut firmly bound to one of our custom made wooden devices and on her knees. She is helpless, a cock sheath for our pleasure. We are going to challenge her today, we want to see just how much her tiny throat can take. \n\nThe cock goes deep, owning the back of her throat. She struggles, but there is no escape. All she can do is submit and endure. Hoping that if she pleases us we might show her a scrap of mercy. We are not feeling very merciful. The cock slams, cutting off all air flow. Kristine drools and slobbers, trying to survive. It is down to animal instinct, hoping to stay on top of it. it doesn't matter, we always win in the end. \n\nKristine is dazed and dizzy, but we are just getting started. It isn't enough to overwhelm her with cock, we want to push her to her limits. She is hauled up by the wooden device she is bound to and finds her tiny feet placed on wooden blocks. Now she has to carefully maintain her balance, not that we are going to make that easy for her. The vibrator to end all vibrators, the Hitachi, is added into the mix. \n\nBound, cock dazed, gingerly perched on her toes and vibrated without mercy. Powerful orgasms rip through Kristine and there is nothing she can do to stop it-the very definition of a &quot;helpless orgasm&quot;. Nipple clamps and a flogger are added, just because we can. Kristine is undone, overwhelmed and leaking cum and drool from her holes. \n\nWe haul her up into a suspension and she limply dangles, a fucktoy waiting for the next time we want to take her down and play again...\n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/05_20kkahill2/SexuallyBroken-Kristine-Kahill-Matt-Williams-20yr-innocent-girl-next-door-finds-out-what-bondage-and-deep-brutal-throat-fucking-are-all-about.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/05_20kkahill2/SexuallyBroken-Kristine-Kahill-Matt-Williams-20yr-innocent-girl-next-door-finds-out-what-bondage-and-deep-brutal-throat-fucking-are-all-about.php&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:0ef5c77de9004a0c0ad20908990a3f662b0d28d8","amp;dn":"Sexually+Broken--20yr+innocent+girl+next+door+Kristine+Kahill+Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ef5c77de9004a0c0ad20908990a3f662b0d28d8","infoHashBuffer":{"type":"Buffer","data":[14,245,199,125,233,0,74,12,10,210,9,8,153,10,63,102,43,13,40,216]},"announce":[],"urlList":[]}}