{"title":"Self-Assembly of Nanostructures - The INFN Lectures, Vol. III","uid":15479389,"size":9794555,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fb9f7d559c1755361eb542d6f21b7ebc6cba602&amp;dn=Self-Assembly+of+Nanostructures+-+The+INFN+Lectures%2C+Vol.+III&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1470227906,"description":"Self-Assembly of Nanostructures - The INFN Lectures, Vol. III - Stefano Bellucci (Springer, 2012).pdf\r\n\r\nThis is the third volume in a series of books on selected topics in Nanoscale Science and Technology based on lectures given at the well-known Istituto Nazionale di Fisica Nucleare (INFN) schools of the same name. The present set of notes stems in particular from the participation and dedication of prestigious lecturers, such as Nunzio Motta, Fulvia Patella, Alexandr Toropov, and Anna Sgarlata. All lectures have been carefully edited and reworked, taking into account extensive follow-up discussions. \r\n\r\nA tutorial lecture by Motta et al. presents the analysis of the Poly(3-hexylthiophene) self assembly on carbon nanotubes and discusses how the interaction between the two materials forms a new hybrid nanostructure, with potential application to future solar cells technology. In their contribution, Patella et al. review quantum dots of III-V compounds, which offer appealing perspectives for more sophisticated applications in new generation devices such as single-photon emitters for nano-photonics and quantum computing. Focusing on self-assembled quantum dots, the chapter by Alexandr Toropov et al. provides a comprehensive review of some important aspects in the formation of quantum dots and presents the results of the authors’ extensive investigation of the features of droplet epitaxy. The fourth contribution, by Sgarlata et al., focuses on recent progress toward controlled growth of self-assembled nanostructures, dealing with the shaping, ordering and localization in Ge/Si heteroepitaxy and reviewing recent results on the self-organization of Ge nanostructures at Si surfaces","torrent":{"xt":"urn:btih:0fb9f7d559c1755361eb542d6f21b7ebc6cba602","amp;dn":"Self-Assembly+of+Nanostructures+-+The+INFN+Lectures%2C+Vol.+III","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fb9f7d559c1755361eb542d6f21b7ebc6cba602","infoHashBuffer":{"type":"Buffer","data":[15,185,247,213,89,193,117,83,97,235,84,45,111,33,183,235,198,203,166,2]},"announce":[],"urlList":[]}}