{"title":"Killer Girlfriend - The Jodi Arias Story - Brian Skoloff and Jos","uid":9296460,"size":3053789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fe510b1e8a50365a29ed2e473ee8fe0857f50db&amp;dn=Killer+Girlfriend+-+The+Jodi+Arias+Story+-+Brian+Skoloff+and+Jos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386166580,"description":"\n\nOn 2 January 2013, the murder trial of Jodi Arias began, setting off a national obsession with Jodi's story of sex, lies, and murder. Jodi Arias became a household name overnight when she was charged with the heinous murder of her ex-boyfriend Travis Alexander. Travis was found dead in his shower, with approximately thirty stab wounds, his throat slit, and a bullet hole in his forehead. From nightly news specials covering every moment of the trial to CNN Headline News featuring daily updates on the case, the media circus only fuelled the hunger of the public to learn more about this twisted tale. Associated Press reporters Brian Skoloff and Josh Hoffner were there covering every moment of the court case. This book provides the first comprehensive account of the case, from the moment Jodi and Travis met, through the killing, her arrest, the four-month trial, and ending, finally, with the verdict.\n \nThe book also delves deeply into the lives of both Jodi Arias and Travis Alexander as the authors take readers on a journey not only through their stormy relationship and the ensuing killing, but into their upbringings and the struggles and triumphs each experienced over the years leading up to the couple meeting in Las Vegas.\n\nIt provides a thorough account of both of their lives before and after they met, and introduces readers to the people behind this sensational murder case as identifiable characters who could be your own neighbor, family member or friend. As most of the news coverage has focused on daily happenings throughout the trial, this book compiles the entire account into one page-turning tale that allows the reader to better understand the lives and relationship of Travis and Jodi in much greater detail than anything previously reported.","torrent":{"xt":"urn:btih:0fe510b1e8a50365a29ed2e473ee8fe0857f50db","amp;dn":"Killer+Girlfriend+-+The+Jodi+Arias+Story+-+Brian+Skoloff+and+Jos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fe510b1e8a50365a29ed2e473ee8fe0857f50db","infoHashBuffer":{"type":"Buffer","data":[15,229,16,177,232,165,3,101,162,158,210,228,115,238,143,224,133,127,80,219]},"announce":[],"urlList":[]}}