{"title":"John Coltrane, Black Pearl, 1958 (2008 Van Gelder)","uid":6221662,"size":311645549,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1009c98ee2776504a325cab74c075c0a29dd0b7f&amp;dn=John+Coltrane%2C+Black+Pearl%2C+1958+%282008+Van+Gelder%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":14,"time":1299351049,"description":"eac secure cue log scans\n\nJohn Coltrane - Black Pearls [1958] \n2008 - Prestige / Rudy Van Gelder Remaster\n\nReview from allmusic.com [4 out of 5 stars]:\n- As is often the case with an artist as prolific as John Coltrane, not every release can be considered as essential. Black Pearls seems a bit ambiguous when placed in a more historical context. It was only three days later that Coltrane participated not as a leader, but rather a member, of the Miles Davis Sextet that recorded &quot;Stella By Starlight&quot; and &quot;On Green Dolphin Street.&quot; There is an obvious disparity between these three mostly improvised and lengthy jams and the Davis session. This is in no way to insinuate that Coltrane's performance is anything less than par. Black Pearls indeed captures Coltrane at the height of perfecting the intense volley that would garner the name &quot;sheets of sound.&quot; Featuring Donald Byrd (trumpet) and the Red Garland Trio -- Garland (piano), Paul Chambers (bass), and Art Taylor (drums) -- this is the same quintet that had mightily contributed to Lush Life and The Believers, as well as The Last Trane. This session would be their last together. The title track is a mid-tempo bop number that quite frankly fails to make a great melodic impact. It's not until Coltrane's indomitable solo that a direction is found and, for a short while, remains focused. Once the reins are passed to Byrd, Garland, Chambers, and to a lesser extent Taylor, the song meanders through some fairly vapid changes. Fortunately, the soloing from Byrd is more direct and is able to build and support Coltrane's equally impressive display. The difference is immeasurable as no holds are barred from Garland or Taylor -- who is arguably at his prime. All told, this performance is well worth the price of admission. At 18-plus minutes, &quot;Sweet Sapphire Blues&quot; (penned by Prestige Records owner Robert Weinstock) is the longest track on Black Pearls. It is in essence a 12-bar blues jam. Coltrane's double- and triple-time solo is primal within this setting. The overemphatic backbeat allows for more group interaction, yielding a full and well-rounded union among the musicians that was sadly absent from the opening track.\n\nTrack Listing:\n01 Black Pearls\n02 Lover Come Back To Me\n03 Sweet Sapphire Blues","torrent":{"xt":"urn:btih:1009c98ee2776504a325cab74c075c0a29dd0b7f","amp;dn":"John+Coltrane%2C+Black+Pearl%2C+1958+%282008+Van+Gelder%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1009c98ee2776504a325cab74c075c0a29dd0b7f","infoHashBuffer":{"type":"Buffer","data":[16,9,201,142,226,119,101,4,163,37,202,183,76,7,92,10,41,221,11,127]},"announce":[],"urlList":[]}}