{"title":"Why Genesis Matters - Jason Lisle","uid":11773260,"size":440702,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:102224449591ea23c9ebfd64c2e7ee746541f7be&amp;dn=Why+Genesis+Matters+-+Jason+Lisle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427160164,"description":"\nThe book of Genesis is not simply a collection of moral stories or fables about our origins. It's a book that sets the foundation for the whole of scripture and upon which all the other books of the Bible rest. Genesis is essential to understanding God our Creator, Judge, and Savior. Every vital Christian doctrine finds its roots in the Genesis record.\n\nIn Why Genesis Matters, Dr. Jason Lisle points us to the very first book of the Bible to understand the foundation of Christian doctrines. Which doctrines are first introduced in Genesis? How do we really know if we're interpreting Genesis correctly? What about the debate over the age of the earth? And how does Genesis help us when we share the gospel with others?\n\nThese and other questions are answered in this practical book about Genesis, Christian doctrine, and the gospel.\n\n\nAbout the author:\nAs Director of Research, Dr. Lisle leads ICR's gifted team of scientists who continue to investigate and demonstrate evidence for creation. He graduated summa cum laude from Ohio Wesleyan University where he double-majored in physics and astronomy and minored in mathematics. He earned a master's degree and a Ph.D. in astrophysics at the University of Colorado","torrent":{"xt":"urn:btih:102224449591ea23c9ebfd64c2e7ee746541f7be","amp;dn":"Why+Genesis+Matters+-+Jason+Lisle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"102224449591ea23c9ebfd64c2e7ee746541f7be","infoHashBuffer":{"type":"Buffer","data":[16,34,36,68,149,145,234,35,201,235,253,100,194,231,238,116,101,65,247,190]},"announce":[],"urlList":[]}}