{"title":"ALAN WAKE PORTABLE GLOBE","uid":7044182,"size":2869713975,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:11699b92e4839e27176dd9cd8d8110357b91fb76&amp;dn=ALAN+WAKE+PORTABLE+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"globeplus","files":-1,"time":1329667002,"description":"Hi gamers , Alan Wake PC file ...\n\n\n\n\nFILE INFO :\n\n\n\n\n- UPDATED TO LATEST VERSION\n\n- PORTABLE AND COMPLETE\n\n- OPTIONAL TESTED TRAINER INCLUDED\n\n\n\n\n\n\n* SYNOPSE :\n\n\nAlan Wake is a psychological thriller action game developed by Remedy Entertainment and published by Microsoft Game Studios. It was released for the Xbox 360 in May 18, 2010 and Microsoft Windows in February 16, 2012. The story follows bestselling thriller novelist Alan Wake, as he tries to uncover the mystery behind his wife's disappearance during a vacation in the small town of Bright Falls, Washington. All while experiencing events from the plot in his latest novel, which he cannot remember writing, coming to life.\n\nIn its pacing and structure, Alan Wake is similar to a thriller television series, with episodes that contain plot twists and cliffhangers. The game itself consists of six episodes, and the fiction is continued by two special episodes, titled &quot;The Signal&quot; and &quot;The Writer&quot;, that were made available as downloadable content (DLC) within the same year of the game's release, released for free with the PC's Collector's Edition. Together, they make the first season of a possibly longer story. Additionally, a six-episode live-action web series called Bright Falls acts as a prequel to the game, and a number of related books also expand upon the Alan Wake story.\n\nChiefly written by Sam Lake, Alan Wake took over five years to create; an unusually[citation needed] long development time in the game industry. The game received positive reviews from critics, and is often revered for its narrative, pacing, and atmosphere. Alan Wake has been awarded the first spot in Time magazine's list of the top 10 video games of 2010.\n\n\n\nnote : the freeware FREEARC is needed to extract the arc file\n\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012\n","torrent":{"xt":"urn:btih:11699b92e4839e27176dd9cd8d8110357b91fb76","amp;dn":"ALAN+WAKE+PORTABLE+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11699b92e4839e27176dd9cd8d8110357b91fb76","infoHashBuffer":{"type":"Buffer","data":[17,105,155,146,228,131,158,39,23,109,217,205,141,129,16,53,123,145,251,118]},"announce":[],"urlList":[]}}