{"title":"Fallen.Enchantress.Legendary.Heroes-RELOADED","uid":8499292,"size":3943384382,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1203094cec59e8eb07afdf7258c921cc16789d32&amp;dn=Fallen.Enchantress.Legendary.Heroes-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mr.Stifmeister","files":-1,"time":1369250843,"description":"\nnERv\n\nFallen Enchantress: Legendary Heroes (c) Stardock\n\n05/2013 :..... RELEASE.DATE .. PROTECTION .......: SteamStardock\n1 :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\nThe Fallen Enchantress seeks to destroy the civilizations that have risen\nfrom the ashes of the Cataclysm. Fortunately, your fame has spread and\ngreat heroes have been drawn to your banner. With your new champions,\nyou will confront new horrors like liches, brood hunters, banshees,\nand the dreaded hergon.\n\nFallen Enchantress: Legendary Heroes is the new standalone expansion to\nStardocks turn-based, fantasy strategy game. Players will forge a new\nempire in a world sundered by powerful magic, fight against terrible\ncreatures, complete quests and rediscover lost secrets in their bid to\nrule the world of Elemental.\n\nFallen Enchantress: Legendary Heroes is a standalone expansion. No prior\ngames are required to play.\n\nFeatures\nGain Champions Through Fame: Champions are no longer simply found,\ninstead, they seek you out based on the amount of Fame your kingdom\nhas generated. And not all of these legendary heroes were Men or Fallen\n\nNew Leveling System: Your sovereign and champions now evolve through a\nskill tree that visually allows you to plan what kind of hero you want\nhim or her to be. Make your mage into a powerful Necromancer, or train\nyour Assassin in special attacks that bleed the life from your enemies\n\nUpdated Tactical Battles: Battles are now more intense with additional\nspecial skills, combat mechanics, spells and new maps\n\nNew Monsters: The legendary heroes didnt reach our lands alone. The\nevents of the Fallen Enchantress have raised the dead and caused\nforgotten creatures to return to the surface of the world\n\nMore Magic: New spells like Lightning Form and Raise Skeletal Horde\nadd new options and dangers to battle\n\nLarger Maps: A new gigantic sized map delivers truly epic games\n\nUpdated Graphics Engine: An improved graphics engine delivers stunning\nnew visuals while improving performance on older machines\n\nAnd much, much more\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:1203094cec59e8eb07afdf7258c921cc16789d32","amp;dn":"Fallen.Enchantress.Legendary.Heroes-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1203094cec59e8eb07afdf7258c921cc16789d32","infoHashBuffer":{"type":"Buffer","data":[18,3,9,76,236,89,232,235,7,175,223,114,88,201,33,204,22,120,157,50]},"announce":[],"urlList":[]}}