{"title":"Milarepa movie","uid":3986780,"size":1258782525,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1207e0dd80dc225a764c7a43e63fc882b3ee9df8&amp;dn=Milarepa+movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cdgxo","files":2,"time":1200849506,"description":"Milarepa, one of the most widely known Tibetan saints, is also revered for the verses he composed throughout his life, known as the Hundred Thousand Songs of Milarepa. His faithful devotion to his teacher, Marpa, astonishing perseverance, and ultimate attainment made his life story into a legend, inspiring millions.\n\nMilarepa was born in 1052, the Year of the Water Dragon, in the shadow of Mount Tisi, in Tibet. His family name, Mila, came from a paternal ancestor, and he was given the surname Thopa Ga, Joy-to-Hear. His family was wealthy, but his father&amp;#039;s death, while he and his younger sister were still children, left Thopaga, his mother and sister at the mercy of a ruthless uncle and aunt, who robbed them of every possession, and forced them into servitude. At his mother?s urging, Thopaga sought the teaching of a sorcerer, in order to fulfill his mother?s desire for vengeance. Once he acquired the adequate powers, Thopaga returned to his village, murdered most of his aunt&amp;#039;s and uncle?s family and then fled. He soon regretted his actions and, realizing the need to purify his karma, sought instruction in Buddhism. After a period of fruitless practice, his first teacher told Thopaga that his karmic connection was stronger with another lama named Marpa Lotsawa, &quot;The Translator of Mar,&quot; and sent Thopaga to find him.\n\nMarpa was a married householder, a great teacher, and the translator of many Sanskrit Buddhist works that have become a standard part of the Tibetan canon. In India his principal guru was Naropa, whose principal guru was Tilopa, a direct successor of the Kagyu lineage. While basically warm and compassionate, Marpa could be quite stern, a method especially appropriate for purifying karmic obstructions. Marpa subjected Milarepa to several years of frustrating trials before he taught him directly. After much intense purification, Milarepa thoroughly devoted himself to practicing these teachings, and achieved his goal of personal liberation.\n\nAfter Milarepa left Marpa, he pursued his practice continually, living mostly in caves in the desolate mountains of Tibet and Nepal. His austere habit of wearing only a single cotton robe year round earned him the title &quot;repa,&quot; (cotton clad) which, added to his family name, became &quot;Milarepa.&quot; Occasionally he interrupted his solitude to beg for food, and in return would recite extemporaneous teaching songs. Although Milarepa endured great difficulties, he always exhibited great courage, and his reputation grew far and wide. Milarepa was known for a wry sense of humor and for his candid and direct style. Milarepa never welcomed fame, however, and it seemed as if he often rejected would-be disciples; but this is one of many paradoxes of his unique approach. Judging from the number of his accomplished disciples -- particularly for someone who made such an effort to avoid people ? he was extremely effective. ","torrent":{"xt":"urn:btih:1207e0dd80dc225a764c7a43e63fc882b3ee9df8","amp;dn":"Milarepa+movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1207e0dd80dc225a764c7a43e63fc882b3ee9df8","infoHashBuffer":{"type":"Buffer","data":[18,7,224,221,128,220,34,90,118,76,122,67,230,63,200,130,179,238,157,248]},"announce":[],"urlList":[]}}