{"title":"Hideous Progeny: Disability, Eugenics, and Classic Horror Cinema","uid":11684930,"size":16529094,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1217ec2780a72a95484890ae49a05fef89308e49&amp;dn=Hideous+Progeny%3A+Disability%2C+Eugenics%2C+and+Classic+Horror+Cinema&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1423279912,"description":"\n\n\nTwisted bodies, deformed faces, aberrant behavior, and abnormal desires characterized the hideous creatures of classic Hollywood horror, which thrilled audiences with their sheer grotesqueness. Most critics have interpreted these traits as symptoms of sexual repression or as metaphors for other kinds of marginalized identities, yet Angela M. Smith conducts a richer investigation into the period's social and cultural preoccupations. She finds instead a fascination with eugenics and physical and cognitive debility in the narrative and spectacle of classic 1930s horror, heightened by the viewer's desire for visions of vulnerability and transformation.\n\nReading such films as Dracula (1931), Frankenstein (1931), Dr. Jekyll and Mr. Hyde (1931), Freaks (1932), and Mad Love (1935) against early-twentieth-century disability discourse and propaganda on racial and biological purity, Smith showcases classic horror's dependence on the narratives of eugenics and physiognomics. She also notes the genre's conflicted and often contradictory visualizations. Smith ultimately locates an indictment of biological determinism in filmmakers' visceral treatments, which take the impossibility of racial improvement and bodily perfection to sensationalistic heights. Playing up the artifice and conventions of disabled monsters, filmmakers exploited the fears and yearnings of their audience, accentuating both the perversity of the medical and scientific gaze and the debilitating experience of watching horror. Classic horror films therefore encourage empathy with the disabled monster, offering captive viewers an unsettling encounter with their own impairment. Smith's work profoundly advances cinema and disability studies, in addition to general histories concerning the construction of social and political attitudes toward the Other","torrent":{"xt":"urn:btih:1217ec2780a72a95484890ae49a05fef89308e49","amp;dn":"Hideous+Progeny%3A+Disability%2C+Eugenics%2C+and+Classic+Horror+Cinema","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1217ec2780a72a95484890ae49a05fef89308e49","infoHashBuffer":{"type":"Buffer","data":[18,23,236,39,128,167,42,149,72,72,144,174,73,160,95,239,137,48,142,73]},"announce":[],"urlList":[]}}