{"title":"Zig Zag: The Surprising Path to Greater Creativity","uid":8350550,"size":2684295,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1242a6544cef912cba3bf7ba2ec4d2562d469b55&amp;dn=Zig+Zag%3A+The+Surprising+Path+to+Greater+Creativity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365331156,"description":"\nKeith Sawyer, &quot;Zig Zag: The Surprising Path to Greater Creativity&quot;\nEnglish | ISBN: 1118297709 | 2013 | EPUB | 288 pages | 2,5 MB\n\nA science-backed method to maximize creative potential in any sphere of life\nWith the prevalence of computer technology and outsourcing, new jobs and fulfilling lives will rely heavily on creativity and innovation. Keith Sawyer draws from his expansive research of the creative journey, exceptional creators, creative abilities, and world-changing innovations to create an accessible, eight-step program to increasing anyone's creative potential. Sawyer reveals the surprising secrets of highly creative people (such as learning to ask better questions when faced with a problem), demonstrates how to come up with better ideas, and explains how to carry those ideas to fruition most effectively.\nThis science-backed, step-by step method can maximize our creative potential in any sphere of life.* Offers a proven method for developing new ideas and creative problem-solving no matter what your profession\n* Includes an eight-step method, 30 practices, and more than 100 techniques that can be launched at any point in a creative journey\n* Psychologist, jazz pianist, and author Keith Sawyer studied with world-famous creativity expert Mihaly Csikszentmihalyi\n\nSawyer's book offers a wealth of easy to apply strategies and ideas for anyone who wants to tap into their creative power.","torrent":{"xt":"urn:btih:1242a6544cef912cba3bf7ba2ec4d2562d469b55","amp;dn":"Zig+Zag%3A+The+Surprising+Path+to+Greater+Creativity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1242a6544cef912cba3bf7ba2ec4d2562d469b55","infoHashBuffer":{"type":"Buffer","data":[18,66,166,84,76,239,145,44,186,59,247,186,46,196,210,86,45,70,155,85]},"announce":[],"urlList":[]}}