{"title":"Counter Strike 1.6 With Bots and Maps /-ZM-/","uid":4785219,"size":502981830,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:12773d8836f3f2647579b0c47f4c73904a67d7b1&amp;dn=Counter+Strike+1.6+With+Bots+and+Maps+%2F-ZM-%2F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZabuzaMox","files":4,"time":1237525525,"description":"Counter-Strike (commonly abbreviated to CS) is a tactical first-person shooter video game which originated from a Half-Life modification by Minh &quot;Gooseman&quot; Le and Jess &quot;Cliffe&quot; Cliffe. The game has been expanded into a series since its original release, which currently includes Counter-Strike: Condition Zero, Counter-Strike: Source, Counter-Strike: Anthology and Counter-Strike on Xbox. Counter-Strike pits a team of counter-terrorists against a team of terrorists in a series of rounds. Each round is won by either completing the mission objective or eliminating the opposing force. The latest incarnation of the game, Counter-Strike: Source, is based on the Source engine developed for Half-Life 2.\n\nThe game is almost entirely based on the dynamically streamlined multiplayer experience activated via Steam, and is currently the most played Half-Life modification in terms of players, according to GameSpy.\n\nCounter-Strike was developed first as a Half-Life modification. Therefore named &quot;Half-Life: Counter-Strike.&quot; The original version was a 3rd-party Half-Life modification, but since then it has grown into a commercial mod and later advertised as a separate game in itself. It still uses and runs on the Half-Life game engine and is based on its unchanged structure.\n\nHow to play Counter Strike 1.6:\n\n-Run .Exe\n\n-Let it Finish all Process\n\n-Run Maps (DON'T OVERWRITE THE MAPS)\n\n-Play The Game\n\n-Enjoy\n\nBefore anyone comes saying anything about &quot;Invalid Cd-Key&quot; I'm going to answer the question. It works on some server but not all of them. On the torrent comes a link where u can find working server, u can also play on LAN or play with bots, this version let u play with up to 32 bots, thats a lot and there are 3 different game types and a lot of maps (about 30).\n\nLeave a comment if u need help.","torrent":{"xt":"urn:btih:12773d8836f3f2647579b0c47f4c73904a67d7b1","amp;dn":"Counter+Strike+1.6+With+Bots+and+Maps+%2F-ZM-%2F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12773d8836f3f2647579b0c47f4c73904a67d7b1","infoHashBuffer":{"type":"Buffer","data":[18,119,61,136,54,243,242,100,117,121,176,196,127,76,115,144,74,103,215,177]},"announce":[],"urlList":[]}}