{"title":"Lois McMaster Bujold - The Sharing Knife - Vol 4 - Horizon - Unb","uid":5043030,"size":441881156,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:12bdbd1f6cff53527f3815b321b58441494c57bb&amp;dn=Lois+McMaster+Bujold+-+The+Sharing+Knife+-+Vol+4+-+Horizon+-+Unb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RamJamSam","files":21,"time":1249484288,"description":"Lois McMaster Bujold - The Sharing Knife - Vol 4 - Horizon - Unb\nRead by: Bernadette Dunne\nRuntime: 15 Hours and 25 Minutes\n\n\n\n\n\nIn a world where malices - remnants of ancient magic - can erupt with life-destroying power, only soldier-sorcerer Lakewalkers have mastered the ability to kill them. But Lakewalkers keep their uncanny secrets - and themselves - from the farmers they protect, so when patroller Dag Redwing Hickory rescued farmer girl Fawn Bluefield, neither expected to fall in love, join their lives in marriage, or defy both their kin to seek new solutions to the perilous split between their peoples. \n\nAs Dag's maker abilities have grown, so has his concern about who - or what - he is becoming. At the end of a great river journey, Dag is offered an apprenticeship to a master groundsetter in a southern Lakewalker camp. But as his understanding of his powers deepens, so does his frustration with the camp's rigid mores with respect to farmers. At last, he and Fawn decide to travel a very different road - and find that along it, their disparate but hopeful company increases. \n\nFawn and Dag see that their world is changing, and the traditional Lakewalker practices cannot hold every malice at bay forever. Yet for all the customs that the couple has challenged thus far, they will soon be confronted by a crisis exceeding their worst imaginings, one that threatens their Lakewalker and farmer followers alike. Now the pair must answer in earnest the question they've grappled with since they killed their first malice together: When the old traditions fail disastrously, can their untried new ways stand against their world's deadliest foe?\n\n\n\n\nGooD SeeDinG!\n","torrent":{"xt":"urn:btih:12bdbd1f6cff53527f3815b321b58441494c57bb","amp;dn":"Lois+McMaster+Bujold+-+The+Sharing+Knife+-+Vol+4+-+Horizon+-+Unb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12bdbd1f6cff53527f3815b321b58441494c57bb","infoHashBuffer":{"type":"Buffer","data":[18,189,189,31,108,255,83,82,127,56,21,179,33,181,132,65,73,76,87,187]},"announce":[],"urlList":[]}}