{"title":"Plastiland v1.0","uid":8222542,"size":41559328,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:1387d08868d9c33cd6a910baa5321a5df59910b0&amp;dn=Plastiland+v1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mobile-warez","files":2,"time":1362508853,"description":"Welcome to Plastilandiyu - a world full glare of plasticine. Spend a lovely plastilinchikov by level-maze, full of surprises and dangers.\n\nEach plastilinchik able to change shape and take on a role. Lay the safest way for them at every level and bring them to the exit! It is the most attractive of all the puzzle that you have seen!\n\nYou need to save plastilinchikov and carry them to the exit on each of the 48 levels. The levels are full of dangers! The heroes prevent the high cliffs, the sea of lava and acid, portals, dynamite and unexplained zero zone. To move forward and survive plastilinchiki able to transform into one of the eight roles, such as &quot;rodent&quot;, &quot;Roulette&quot;, &quot;ball&quot; ... show imagination, think about how you can apply a role, and if you really get stuck, you can always see the hint.\n\nThe unique music and funny sound effects create an immersive mysterious uncharted worlds. You will never forget this magical journey! So what are you waiting for?! Download the game - and forward to explore planets Plastitsiniya, Plastipoliya and Plastidoniya!\n\n* Addictive puzzle game inspired by the world famous game of Lemmings (Lemmings)\n* Funny plasticine characters\n* 48 challenging levels and colorful\n* 8 roles for the characters, dozens of mechanic\n* 3 fantasy world, molded from clay - Plastitsiniya, Plastipoliya and Plastidoniya\n* Music, dip into the wonderful world Plastiland and create a special magic atmosphere for each of the worlds","torrent":{"xt":"urn:btih:1387d08868d9c33cd6a910baa5321a5df59910b0","amp;dn":"Plastiland+v1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1387d08868d9c33cd6a910baa5321a5df59910b0","infoHashBuffer":{"type":"Buffer","data":[19,135,208,136,104,217,195,60,214,169,16,186,165,50,26,93,245,153,16,176]},"announce":[],"urlList":[]}}