{"title":"Lamb - Between Darkness and Wonder[FLAC - LOSSLESS]","uid":4226908,"size":332984679,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:13d78d1d4805a9a55cb4f4a0d7880171f674d853&amp;dn=Lamb+-+Between+Darkness+and+Wonder%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"99AM","files":15,"time":1212872653,"description":"FLAC image + CUE sheet + Covers\nRelease date: Feb 24, 2004.\n\n\n\nTrack listing:\n1. Darkness ? 4:59\n2. Stronger ? 3:14\n3. Sugar 5 ? 3:54\n4. Angelica ? 3:41\n5. Till the Clouds Clear ? 4:28\n6. Wonder ? 5:21\n7. Sun ? 3:00\n8. Learn ? 2:12\n9. Please ? 4:33\n10. Open Up ? 4:48\n11. Hearts and Flowers ? 5:22\n\n\n\nReview from BBC.co.uk:\nBuilt and barred around the shrill and sheer vocals of Lou Robinson and the classical clash and drum &amp;#039;n&amp;#039; peace backings of Andy Barlow, Between Darkness And Wonder possesses the ability to excite, shock, thrill and stun, all under the umbrella of some of the most stylish sounds you&amp;#039;ll hear at the moment.\n\nLamb&amp;#039;s real talent, though, is their ability to take this type of chill-out upbeat often soulless type of music and fill it with emotion, to hang pain and delight from the rigid beats so as to transform them into something warm and enticing.\n\nBetween Darkness And Wonder contains some divine tunes that leap out at you on every listen. The opening Darkness sets up a feel of Goldie&amp;#039;s Timeless and that album is a fitting comparison piece, given the light and shade, beauty and bedlam that exist in both.\n\nStronger shadowboxes through trauma, Clouds Clear hits out with a fuzzy tantrum chorus from a lulled verse (it&amp;#039;s what Lamb do best, think Gorecki), Learn dances around wonderful layers of strings, and top of the heap, the pairing of Wonder and Sun in the centre of the album show exactly why Lamb are so special. Wonder drips with the kind of grandeur that they excel at, while Sun demands to be turned up and danced around to.\n\nOne day, the wider world will wake up to Lamb and they will get the reverence they so richly deserve. Until then, though, they will exist in the hearts of those in the know as one of the best duos this country has. Whether on the dancefloor, spinning and sailing on the beats, or at home, watching the sunset or waiting for it to rise, Lamb are pretty close to perfection.\n\nEnjoy! ","torrent":{"xt":"urn:btih:13d78d1d4805a9a55cb4f4a0d7880171f674d853","amp;dn":"Lamb+-+Between+Darkness+and+Wonder%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13d78d1d4805a9a55cb4f4a0d7880171f674d853","infoHashBuffer":{"type":"Buffer","data":[19,215,141,29,72,5,169,165,92,180,244,160,215,136,1,113,246,116,216,83]},"announce":[],"urlList":[]}}