{"title":"DOCman 1.5.7 FULL + Upgrade: Joomla! Extension","uid":5523030,"size":921918,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:155f8a3670c8fa346a2f0949f9a8421d48f645ec&amp;dn=DOCman+1.5.7+FULL+%2B+Upgrade%3A+Joomla%21+Extension&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"krieg88","files":1,"time":1272690529,"description":"DOCman 1.5.7 FULL + Upgrade from 1.5.x to 1.5.7\n\nDOCman is a document management solution for Joomla. DOCman makes offering downloadable documents on your Joomla site a breeze.\n\nManage documents across multiple categories and subcategories, give users permission to upload, download or edit documents. Store documents either locally or remotely and prevent direct linking using our build-in anti-leech system. All from within an intuitive and simple to use administration interface.\n\n\nMain features:\n\n* Nested categories. Documents can be organized across infinite categories and subcategories.\n\n* Custom Groups. Documents can be owned by a specific registered user, a groups of registered users, all registered users or everybody.\n\n* Powerful Permission System. Easily set default guest, frontend and document and creator permissions and fine-tuned permission on a document level. DOCman's permissions system gives you full control over who can access, edit, manage and download documents.\n\n* Remote or Local Storage. Files can either be hosted locally or you can easily link to files stored on a remote server.\n\n* Statistics. You can display a download counter per document. All downloads are also being logged (by user, IP, browser, date and hour) to give you full overview of what is happening with your documents.\n\n* Integrated Search System. Documents can be searched by name and/or description. The search system integrates with Joomla! using an optional Plugin.\n\n* Security. The built-in anti-leech system avoids direct linking to documents. Real paths to documents are never displayed to users.\n\n* Flexible Themes. Change the look and feel of your documents repository using our flexible themeing system. Easily create your own themes to match the look and feel of you site.\n\n\n------- Changelog -------\nRelease 1.5.7 | 30 april 2010\n\n* Fixed &quot;Call to undefined function apache_setenv&quot; on IIS\n\n\nRelease 1.5.6 | 30 april 2010\n\n* Fixed #194 Background gradient on dark templates can be set in theme config\n* Fixed #170 Document table headers not sorting\n* Fixed #189 Local Name setting while transfer file is now required in backend\n* Fixed #169 Re-added, cleaned up, fixed email group feature\n* Fixed #209 Smarter filtering for files in backend\n* Fixed #107 Installation with FTP layer\n* Fixed #192 Batch upload relative path\n* Fixed #182 Couldn't delete filenames with quotes\n* Fixed #167 DOCman license not using JRoute class\n* Fixed #183 Downloading with IE7/8\n* Fixed: Wrong div class in latest down module\n\n\n------- System Requirements -------\n\n1. Joomla 1.5.x (recommended 1.5.15 or later). \n2. PHP 5.2.x or higher\n3. Database: MySQL 4.1 or higher","torrent":{"xt":"urn:btih:155f8a3670c8fa346a2f0949f9a8421d48f645ec","amp;dn":"DOCman+1.5.7+FULL+%2B+Upgrade%3A+Joomla%21+Extension","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"155f8a3670c8fa346a2f0949f9a8421d48f645ec","infoHashBuffer":{"type":"Buffer","data":[21,95,138,54,112,200,250,52,106,47,9,73,249,168,66,29,72,246,69,236]},"announce":[],"urlList":[]}}