{"title":"Deus.Ex.Human.Revolution.Directors.Cut.XBOX360-COMPLEX","uid":9060952,"size":15677394901,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:1581c27809ce72f3ecafb011c0bf9d020b108d57&amp;dn=Deus.Ex.Human.Revolution.Directors.Cut.XBOX360-COMPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":8,"uploader":"Mr.Stifmeister","files":5,"time":1382040164,"description":"\n- C O M P L E X\n\nP R E S E N T S   :\n\nDeus Ex Human Revolution Directors Cut\n\nRegion      : Region Free           Languages: English\nSize        : 2 DVDs                Genre    : Action\nPlatform    : XBOX 360              Date     : 10/2013\n\nRelease Info:\n\nDeus Ex: Human Revolution - Director's Cut is the enhanced return to one\nof the most critically-acclaimed video game franchises of all time.\nThe game tells the story of Adam Jensen, a man cybernetically augmented\nagainst his own will who soon finds himself in the middle of a global\nconspiracy to which he holds the key. By offering players the chance\nto advance through the game in multiple and vastly different ways,\nDeus Ex: Human Revolution Director's Cut challenges the foundations\nof gaming and provides an immersive experience where every choice\nhas a lasting consequence\n\n- Ultimate Deus Ex: Human Revolution experience: Take advantage of a\nmultitude of improvements, features and additional content that bring t\nhis already critically-acclaimed adventure to whole new levels\nTap into Microsofts SmartGlass technology using your tablet: Adam\nJensen's newest augmentation, the Neural Hub, offers an immersive\nand empowering experience, right at the tips of your fingers\n- Absolute fusion of action and role-play: A unique combination of\naction-packed close-quarter takedowns and intense shooting, offering\na vast array of augmentations and upgrades for the many weapons at\nyour disposal\n- Multi-solution structure: Choose how to accomplish each mission using\ncombat, hacking, stealth or social mode to create a customized experience\nto suit any gaming style\n- Diverse customization: Engage in combat and challenges utilizing deep,\nspecialized character augmentations and weapon upgrades\n- Augmented visuals: Never has the Cyber Renaissance setting that masterfully\nblends near future and Renaissance era styles been so visually stunning\n- Explore the world: Traverse numerous locales across the globe - each\nwith its own distinct art direction -- in Adam's search to uncover a\nworldwide conspiracy.\n\nNotes\n\nEnjoy\n\nEnjoy This Fine COMPLEX Release\n\nbmx\n\n","torrent":{"xt":"urn:btih:1581c27809ce72f3ecafb011c0bf9d020b108d57","amp;dn":"Deus.Ex.Human.Revolution.Directors.Cut.XBOX360-COMPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1581c27809ce72f3ecafb011c0bf9d020b108d57","infoHashBuffer":{"type":"Buffer","data":[21,129,194,120,9,206,114,243,236,175,176,17,192,191,157,2,11,16,141,87]},"announce":[],"urlList":[]}}