{"title":"HomeNet 3.2 WiFi Media Center - plex-xbmc-lite - Linux Webserver","uid":10869837,"size":1168595,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:159f47e2399b4a000755cb7dc22cedc217114c2f&amp;dn=HomeNet+3.2+WiFi+Media+Center+-+plex-xbmc-lite+-+Linux+Webserver&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kromekast","files":-1,"time":1408964740,"description":"  &lt;a href=&quot;\nhttp://www.homenetvideo.com/demo/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.homenetvideo.com/demo/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.homenetvideo.com/readme.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.homenetvideo.com/readme.html&lt;/a&gt;\n\nHomeNet LMS (Local Media Server) was developed as a simplified media center alternative to replace or supplement complex and resource-hungry UPnP / DLNA media servers like Plex or XBMC. It is especially useful on Chromebooks because ChromeOS does not enable direct UPnP access. Homenet LMS does not use UPnP or DLNA. Instead it uses a locally installed Windows, Linux or Mac Web Server. \n\nAs a minimalist lightweight media center focused on speed and simplicity, some features are absent in HomeNet LMS. There are no thumbnails, categories, indexing or other distractions. Try the online demo to view efficient nested text-based directories and files. Unlike often-bloated UPnP/DLNA servers, there is no database to be maintained or updated so disk thrashing and performance concerns are mostly absent.\n\n---\n\nThis torrent includes all HomeNet web files needed for setting up your Linux HomeNet Wifi Media Center.\n\nSetup on Linux is even easier than on Windows. See included and updated printable PDF documentation file.\n\n---\n\nBy default, HomeNet can play your MP4, MKV, WebM, MOV, M4V, and OGV video files and MP3, M4A, M4B, OGG, and WAV audio files in Google Chrome and Firefox browser tabs on any computer or device using your wi-fi network.\n\nGoogle Chrome is required for Chromecast compatibility. Note, however, that unlike in Windows, Google Chrome does not have a Linux VLC web plugin while the Linux version of Firefox does ( in Synaptic: browser-plugin-vlc ).\n\nHomeNet has also developed a VLC plugin player that enables those with Firefoxe with VLC web plugin installed to play most other media formats via VLC's on-the-fly transcoding. This includes [b]AVI, WMV, FLV, MPG, VOB, and 3GP[/b] video files, WMA, FLAC, ALAC, and AU audio files, plus streaming radio and video playlist files ASX, ASF, PLS, and XSPF.\n\n\nChromecast owners can play any of the 6 video and 5 audio default media formats via the HomeNet Chromecast URL player.\n\nChromecast does not yet support the additional transcoded VLC-plugin media formats. ( However, VideoLan is working on a Chromecast solution. )\n\n\nBy default, your own HomeNet web files use the same background images as the demo site. However, this can easily be changed to &quot;barebones&quot; (no background images) or use your own images.\n","torrent":{"xt":"urn:btih:159f47e2399b4a000755cb7dc22cedc217114c2f","amp;dn":"HomeNet+3.2+WiFi+Media+Center+-+plex-xbmc-lite+-+Linux+Webserver","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"159f47e2399b4a000755cb7dc22cedc217114c2f","infoHashBuffer":{"type":"Buffer","data":[21,159,71,226,57,155,74,0,7,85,203,125,194,44,237,194,23,17,76,47]},"announce":[],"urlList":[]}}