{"title":"The Smiths 24 Bit Vinyl Pack","uid":9119586,"size":3403746564,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:15f8acfa10053756f50dab71a7f954dac88ca567&amp;dn=The+Smiths+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1383100825,"description":"\n  The Smiths 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1984 The Smiths\n  1985 Meat is Murder\n  1986 The Queen is Dead\n  1987 Strangeways, Here We Come\n\n  The Smiths were the definitive British indie rock band of the '80s, marking the end of synth-driven new wave and the beginning of the guitar rock that dominated English rock into the '90s. Sonically, the group was indebted to the British Invasion, crafting ringing, melodic three-minute pop singles, even for their album tracks. But their scope was far broader than that of a revivalist band. The group's core members, vocalist Morrissey and guitarist Johnny Marr, were obsessive rock fans inspired by the D.I.Y. ethics of punk, but they also had a fondness for girl groups, pop, and rockabilly. Morrissey and Marr also represented one of the strangest teams of collaborators in rock history. Marr was the rock traditionalist, looking like an elegant version of Keith Richards during The Smiths' heyday and meticulously layering his guitar tracks in the studio. Morrissey, on the other hand, broke from rock tradition by singing in a keening, self-absorbed croon, embracing the forlorn, romantic poetry of Oscar Wilde, publicly declaring his celibacy, and making no secret of his disgust for most of his peers. While it eventually led to The Smiths' early demise, the friction between Morrissey and Marr resulted in a flurry of singles and albums over the course of three years that provided the blueprint for British guitar rock in the following decade.\n\n  Before forming The Smiths in 1982, Johnny Marr (born John Maher, October 31, 1963; guitar) had played in a variety of Manchester-based rock &amp; roll bands, including Sister Ray, Freaky Part, White Dice, and Paris Valentinos. On occasion, Marr had come close to a record contract -- one of his bands won a competition Stiff Records held to have Nick Lowe &quot;produce your band&quot; -- but he never quite made the leap. Though Morrissey (born Steven Patrick Morrissey, May 22, 1959; vocals) had sung for a few weeks with the Nosebleeds and auditioned for Slaughter &amp; the Dogs, he had primarily contented himself to being a passionate, vocal fan of both music and film. During his teens, he wrote the Melody Maker frequently, often getting his letters published. He had written the biography/tribute James Dean Isn't Dead, which was published by the local Manchester publishing house Babylon Books in the late '70s, as well as another book on the New York Dolls; he was also the president of the English New York Dolls fan club. Morrissey met Marr, who was then looking for a lyricist, through mutual friends in the spring of 1982. The pair began writing songs, eventually recording some demos with the Fall's drummer, Simon Wolstencroft. By the fall, the duo had settled on the name The Smiths and recruited Marr's schoolmate Andy Rourke as their bassist and Mike Joyce as their drummer.\n\n  The Smiths made their live debut late in 1982, and by the spring of 1983, the group had earned a small but loyal following in their hometown of Manchester and had begun to make inroads in London. Rejecting a record deal with the Mancunian Factory Records, the band signed with Rough Trade for a one-off single, &quot;Hand in Glove.&quot; With its veiled references to homosexuality and its ringing riffs, &quot;Hand in Glove&quot; became an underground sensation in the U.K., topping the independent charts and earning the praise of the U.K. music weeklies. Soon, Morrissey's performances became notorious as he appeared on-stage wearing a hearing aid and with gladioli stuffed in his back pockets. His interviews were becoming famous for his forthright, often contrary opinions, which helped the band become a media sensation. By the time of the group's second single, &quot;This Charming Man,&quot; in late 1983, The Smiths had already been the subject of controversy over &quot;Reel Around the Fountain,&quot; a song that had been aired on a BBC radio session and was alleged to condone child abuse. It was the first time that Morrissey's detached, literary, and ironic lyrics were misinterpreted and it wouldn't be the last.\n\n  &quot;This Charming Man&quot; reached number 25 on the British charts in December of 1983, setting the stage for &quot;What Difference Does It Make&quot;'s peak of number 12 in February. The Smiths' rise to the upper reaches of the British charts was swift, and the passion of their fans, as well as the U.K. music press, indicated that the group had put an end to the synth-powered new wave that dominated Britain in the early '80s. After rejecting their initial stab at a first album, they released their debut, The Smiths, in the spring of 1984 to strong reviews and sales -- it peaked at number two. A few months later, the group backed '60s pop vocalist Sandie Shaw -- who Morrissey had publicly praised in an article -- on a version of &quot;Hand in Glove&quot; that was released and reached the Top 40. &quot;Heaven Knows I'm Miserable Now&quot; reached number ten, becoming their highest-charting single amid a storm of controversy about its B-side, &quot;Suffer Little Children,&quot; which was about the notorious Moors Murders. More controversy appeared when Morrissey denounced the hunger-relief efforts of Band Aid, but the group's popularity was not affected. Though The Smiths had become the most popular new rock &amp; roll group in Britain, the group failed to make it outside of underground and college radio in the U.S., partially because they never launched a full-scale tour. At the end of the year, &quot;William It Was Really Nothing&quot; became a Top 20 hit and Hatful of Hollow, a collection of B-sides, BBC sessions, and non-LP singles, went to the Top Ten, followed shortly by &quot;How Soon Is Now,&quot; which peaked at number 24.","torrent":{"xt":"urn:btih:15f8acfa10053756f50dab71a7f954dac88ca567","amp;dn":"The+Smiths+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15f8acfa10053756f50dab71a7f954dac88ca567","infoHashBuffer":{"type":"Buffer","data":[21,248,172,250,16,5,55,86,245,13,171,113,167,249,84,218,200,140,165,103]},"announce":[],"urlList":[]}}