{"title":"Fakebook - A True Story Based On Actual Lies (2013) By Dave Cici","uid":9551693,"size":18740400,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:168672dd30f373e1cf7c11bac6605c673772c8b0&amp;dn=Fakebook+-+A+True+Story+Based+On+Actual+Lies+%282013%29+By+Dave+Cici&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1391278835,"description":"Format: mobi/epub/azw3\nLength: 320 pages\nGenre: Non-Fiction/Biography/Social Media\nDate: 17 September 2013\n\nThis hilarious, irreverent, and profoundly honest memoir explores our cultural obsession with social media and dares to ask: Who is the real &quot;you&quot; and what is the story you tell others? \n\nAt age 26, Dave Cicirelli found himself at a crossroads. While his friends on Facebook appeared to have lives of nonstop accomplishments, his early adulthood felt disappointingly routine. So one October morning, Dave announced on Facebook that he was dropping everything and heading west. Many thought him brave--or crazy.\n\nNo one guessed he was lying.\n\n&quot;Fake Dave&quot; set off on a wild adventure, toilet-papering an Amish horse and buggy, freight-hopping with a farmer's daughter, and being kidnapped by a religious cult. But the online prank quickly became a social experiment. People began connecting over his journey, and some were inspired to change their own lives. But as Fake Dave's popularity grew, the real Dave became increasingly isolated, struggling with the implications of his secret.\n\nClever, funny, and surprisingly candid, FAKEBOOK is a true memoir of our digital age. It explores what the old ideas of reputation and relationships mean in our new world of constant connection and ultimately asks: How do you draw the line between your virtual self and who you really are? And can you discover yourself on a journey that never took place?\n\nAuthor:\n\nDave Cicirelli is a New York York-based writer and art director with extensive experience serving iconic consumer and entertainment brands across all print, digital, and experiential mediumsmedia. His work has won a number of awards, including a Silver Anvil and honors from HOW Magazine, GDUSA, and Creativity 38. In the eight years he's been in the marketing industry, he's witnessed the impact social media has had on how brands talk to consumers. In the sixteen years since he got an AOL screen name, he's witnessed the impact social media has had on how people talk to one another.","torrent":{"xt":"urn:btih:168672dd30f373e1cf7c11bac6605c673772c8b0","amp;dn":"Fakebook+-+A+True+Story+Based+On+Actual+Lies+%282013%29+By+Dave+Cici","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"168672dd30f373e1cf7c11bac6605c673772c8b0","infoHashBuffer":{"type":"Buffer","data":[22,134,114,221,48,243,115,225,207,124,17,186,198,96,92,103,55,114,200,176]},"announce":[],"urlList":[]}}