{"title":"Hue And Cry (1947 Alastair Sim)","uid":5488713,"size":733847552,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:16ae89bec0406c791a99c9d34f705c2e21912d0f&amp;dn=Hue+And+Cry+%281947+Alastair+Sim%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"renman","files":-1,"time":1270867670,"description":"Though by no means the first comedy to emerge from Ealing studios, Hue and Cry \n\n(d. Charles Crichton, 1947) was among the first British comedies after the \n\nwar, and is generally considered the first of what are now remembered as the \n\n'Ealing comedies' - although the cycle really got underway two years later \n\nwith the release of Passport to Pimlico (d. Henry Cornelius), Whisky Galore! \n\n(d. Alexander Mackendrick) Kind Hearts and Coronets (d. Robert Hamer).\n\nThe story of a group of East End kids who foil a gang of robbers who are using \n\na children's comic to communicate their plans, Hue and Cry borrows something \n\nof its premise from the popular children's story Emil and the Detectives \n\n(first filmed in Germany in 1931).\n\nWhile the story has an appealing Boy's Own quality, perhaps the film's most \n\ndistinctive feature is its use of bombed-out locations in London's East End \n\nand Docklands. These rubble-strewn sites become the background for one grand \n\nboy's adventure (the children include only one girl - who is just about \n\ntolerated by the others), culminating in the film's best known image, in which \n\nhundreds of boys from all over London converge on a handful of unfortunate \n\npetty criminals.\n\nIn keeping with Ealing's tendency in the last years of the war to foster \n\ninclusive images of British society, the children are mostly working-class, \n\nand include a young Scottish boy, Alec (Douglas Barr).\n\nJack Warner, who within a few years would be well-known to TV audiences as the \n\nhonest and steadfast PC George Dixon in Ealing's The Blue Lamp (d. Basil \n\nDearden, 1950) and the TV series Dixon of Dock Green (BBC, 1955-76), took the \n\nmost substantial adult role as the villain, Nightingale. Apart from a \n\nmemorable cameo from Alastair Sim as The Trump's eccentric author, the rest of \n\nthe major parts are taken by the children, led by Harry Fowler as Joe, the \n\nfantasist whose daydreams become real.\n\nHue and Cry was the first of seven comedies for the studio by T.E.B. Clarke, \n\nthe writer whose work, including Passport to Pimlico and The Lavender Hill Mob \n\n(d. Crichton, 1951), did most to shape the way the Ealing comedies are usually \n\nremembered today - as cheery celebrations of English (even though two of the \n\nfilms are set in Scotland) community spirit and mild eccentricity.\n\nPlease help to Seed this thank you\n","torrent":{"xt":"urn:btih:16ae89bec0406c791a99c9d34f705c2e21912d0f","amp;dn":"Hue+And+Cry+%281947+Alastair+Sim%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16ae89bec0406c791a99c9d34f705c2e21912d0f","infoHashBuffer":{"type":"Buffer","data":[22,174,137,190,192,64,108,121,26,153,201,211,79,112,92,46,33,145,45,15]},"announce":[],"urlList":[]}}