{"title":"Promoting Sustainable Electricity in Europe - (Malestrom)","uid":4699977,"size":1656686,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16b196922ca10736082250388646a6108a8cc27d&amp;dn=Promoting+Sustainable+Electricity+in+Europe+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1233686407,"description":" &lt;a href=&quot;http://www.image-upload.net/images/3hfi8zrn539m1x5d2zj1.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/3hfi8zrn539m1x5d2zj1.jpeg&lt;/a&gt;\n\nWilliam M. Lafferty, Audun Ruud, &quot;Promoting Sustainable Electricity in Europe: Challenging the Path Dependence of Dominant Energy Systems&quot;\nEdward Elgar Publishing | 2008-11-30 | ISBN: 184720807X | 344 pages | PDF\n\nThis is a timely and comparative assessment of initiatives to promote renewable electricity sources (RES) in eight European countries. Carried out by the ProSus research programme at the University of Oslo in cooperation with leading research institutions in each country, the study focuses on the promotional schemes used to foster RES in Austria, Denmark, Finland, Ireland, the Netherlands, Norway, Spain and Sweden. The study is unique in that it monitors progress on implementing the EU RES Directive in relation to the impact of the `dominant energy systems' in each country. Employing the notions of `path dependency/path creation', the analysis demonstrates that crucial lessons for achieving RES targets are to be found in the contextual conditions of national and regional settings; conditions that qualify the effects of more general, market-oriented schemes. The conclusions reached are of direct relevance for the ongoing debate as to the most effective policy instruments for achieving sustainable energy and climate policies in Europe.\n\nPromoting Sustainable Electricity in Europe will be of interest to academics and researchers involved in environmental management, energy studies, technology and sustainable development. Furthermore it will be of interest to policymakers and bureaucrats both at the EU level and among EU/EEA member states concerned with climate change, renewable energy and sustainable development at large. The book should also be of relevance for business organizations and NGOs concerned with the promotion of sustainable electricity.","torrent":{"xt":"urn:btih:16b196922ca10736082250388646a6108a8cc27d","amp;dn":"Promoting+Sustainable+Electricity+in+Europe+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16b196922ca10736082250388646a6108a8cc27d","infoHashBuffer":{"type":"Buffer","data":[22,177,150,146,44,161,7,54,8,34,80,56,134,70,166,16,138,140,194,125]},"announce":[],"urlList":[]}}