{"title":"aTube Catcher 1.0.236","uid":4198220,"size":5808057,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:171257ece16a37acd6de1cb63d3081c5e4340f7d&amp;dn=aTube+Catcher+1.0.236&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"atube","files":1,"time":1211348157,"description":"Download videos from web sites like YouTube, Stage6, MySpace, Dailymotion, Megavideo (the first software in add support for Megavideo!!!), Google, Yahoo!, Metacafe, iFilm, Yahoo ! Video etc; now has support for more than 60+ video sharing sites; you can download and export the multimedia content to your computer or your mobile device, IPOD, PSP, Cell Phone, DVD, VCD, MP3 (Yes, you can extract only audio tracks from your favorite videos), includes templates so you don&amp;#039;t have to worry about the encoding options, but if you want, you can customize the options and get higher quality video/audio. The default format is MPEG4 AVI, the file types supported are 3GP, 3G2, AVI, XVID, MP4, MP3,  MP2, WMA, WMV, GIF, FLAC, WAV, PSP, MPG, VOB, OGG, MOV, AVI. aTube Catcher also is available in 4 languages, English, Spanish, Portuguese and Italian (you can help to translate it to your language), all in a easy to use GUI, just Copy &amp; Paste the url of your video. Sites containing embedded youtube videos are supported only if they use the standard code provided by the portal.\n\naTube Catcher can authenticate with Dailymotion, YouTube, CrunchyRoll, Orange and Kewego, this makes possible to download private or adult rated videos; other new feature is the support for YouTube Playlists, put the url of a playlist and you will be prompted to select the the videos that you wanna get, you can check all items and automatically aTube Catcher will add all them to the queue manager to download and process each one while you are away from your Desktop or doing other tasks.\n \nHas support for YouTube playlists, you can put the url of a playlist and aTC will show you a screen, then select the desidered videos or simply all; due to a request from the users now you can copy the url of a search and aTube Catcher will fetch the links; for example, you are a lawyer and want to search videos about other attorneys, and you search with that key word on youtube, after copy the url of the results to aTube Catcher and it will read the links and prompt you to choose those that want. Try it and you will love these 2 great features. \n\nThe release 1.0.236 include full support for MegaVideo and Megarotic, download unlimited videos from megaortic with no ip restrictions.\n\n\nLiscence: 100% FREEWARE and completely CLEAN. ","torrent":{"xt":"urn:btih:171257ece16a37acd6de1cb63d3081c5e4340f7d","amp;dn":"aTube+Catcher+1.0.236","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"171257ece16a37acd6de1cb63d3081c5e4340f7d","infoHashBuffer":{"type":"Buffer","data":[23,18,87,236,225,106,55,172,214,222,28,182,61,48,129,197,228,52,15,125]},"announce":[],"urlList":[]}}