{"title":"Historia del Camello que Llora FULL DVD5 ISO","uid":7417427,"size":4676769792,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:17138eea3382093407e2e3692e53f0fdb671617d&amp;dn=Historia+del+Camello+que+Llora+FULL+DVD5+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chucao","files":1,"time":1341565197,"description":"ORIGINAL TITLE\tIngen Numsil - Die Geschichte vom weinenden Kamel (The Story of the Weeping Camel)\nYEAR\t\n2003\t \nRUNNING TIME\t\n93 min.\t  Watch Trailers/Videos\nCOUNTRY\t\n\t  (New) Visual section\nDIRECTOR\tByambasuren Davaa, Luigi Falorni\nSCREENWRITER\tByambasuren Davaa, Luigi Falorni\nCOMPOSER\tMarcel Leniz, Marc Riedinger, Choigiw Sangidorj\nCINEMATOGRAPHER\tLuigi Falorni, Juliane Gregor\nCAST\tDocumentary\nSTUDIO/PRODUCER\tCo-production Mongolia-Germany\nAWARDS\t2004: Nominated for Oscar: Best Documentary\n2004: Gijon Film Festival: Official Selection\nGENRE\tDocumentary | Small Town Life (Non-North American). Family Relationships. Animals\nSYNOPSIS/PLOT\tDuring Spring, a family of nomadic shepherds assists the births of their camel herd. The last camel to calve this season has a protracted labor that persists for two days. With the assistance and intervention of the family, a rare white calf is born. This is her first calving. Despite the efforts of the shepherds, the mother rejects the newborn, refusing it her milk and fails to establish a care-bond with it.\n\nTo restore harmony between the mother and calf, the nomadic family call upon the services of group of lamas who perform a ritual with bread or dough 'effigies' (Tibetan: torma) of the mother, the calf and the individual members of the family. The rite opens with the sound of a sacred conchshell horn followed by bells in the hands of lamas, some of whom wield 'vajra' (Sanskrit). The rite takes place with members of the extended nomadic community and a number of lama at a sacred place that consists of one end of a log, or wooden pole, set in the earth, with the other end raised to the sky: a stylized 'victory banner' (Sanskrit: Dhvaja) with a piece of blue fabric entwined around it, functioning as a prayer flag (darchor-style). The log is supported by a cairn of rocks at its base as foundation. The ritual does not re-establish harmony between the mother and calf.\n\nThe family then resolve to secure the services of an indigenous 'violinist' to play the music for a Mongolian 'Hoos' ritual. They send their two young boys on a journey through the desert to the community marketplace to locate a musician. The 'violinist' --who plays more precisely, a Morin Khuur-- is summoned to the camp and a ritual of folk music and chanting is enacted. The musician first drapes the morin khuur on the first hump of the camel to establish a sympathetic magical linkage between the mother and the state of harmony represented by the instrument. Then once this is done removes the instrument and commences to play. As the musician sounds the Mongolian 'violin', the female family member who lulled her child to sleep with a lullaby earlier in the documentary, repeatedly entones the calming sounds and beautiful melody of the 'hoos'. Immediately after the rite the mother and calf are reconciled and the calf draws milk from her teat.\n ","torrent":{"xt":"urn:btih:17138eea3382093407e2e3692e53f0fdb671617d","amp;dn":"Historia+del+Camello+que+Llora+FULL+DVD5+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17138eea3382093407e2e3692e53f0fdb671617d","infoHashBuffer":{"type":"Buffer","data":[23,19,142,234,51,130,9,52,7,226,227,105,46,83,240,253,182,113,97,125]},"announce":[],"urlList":[]}}