{"title":"Sex - The Garbage Generation by Doctor Daniel Amneus.pdf","uid":4388692,"size":627854,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1740d6ef0cd7abdb927f8806de4fbff424db555d&amp;dn=Sex+-+The+Garbage+Generation+by+Doctor+Daniel+Amneus.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"leraconteur","files":1,"time":1221054926,"description":"The Garbage Generation by Doctor Daniel Amneus.pdf\n\n\nAmneus deftly describes in this book how the feminist/liberal/leftist attack on the notorious and now officially discredited &quot;Patriarchy&quot; is in fact an attack on civilization itself, since the former was the prerequisite for the latter. He documents how the feminist wish for the rights of the more primitive matriarchy along with the benefits of civilization, which only patriarchy can produce and provide, is wanting to &quot;have your cake and eat it too&quot;, of wanting to have it both ways, that the two are incompatible. That, and that the effects on men are uniformly negative, which is why men should oppose these trends. And while many claim we're still under a patriarchal system, Amneus shows that we're actually a long way towards going back to the matriarchal stone age. Not only that, but many applaud this as if it were something progressive. Even the &quot;family values&quot; and &quot;Compassionate Conservativism&quot; crowds don't get it.\n\nAmneus shows how deluded these folk are, pointing to the ghetto, Haiti, and the Indian reservation for what actually ensues when women are in control. On the one hand, the material in this book is something we already kind of know; on the other hand, reading the book reminds one of how much we've forgotten in the last generation or two as other assumptions and beliefs have become the unexamined norm and certain ideas have become verbotten. That's what makes the book so refreshing and eye-opening, since it's definitely not a re-tread of standard 50's traditionalism. It urges men to view their work as their bodies in &quot;Our Paychecks, Ourselves&quot;, where he implores men to refuse to pay child support for the male-only &quot;privilege&quot; of having their families destroyed and their children taken from them.\n\nFurther radical ideas include a thorough debunking of conservative favorite George Gilder's sentimental views about the civilizing effects of women, and the reasons why single men should avoid educated, independent, &quot;career&quot; women like the plague. Some would no doubt consider this book to be a misogynistic diatribe, such is the strength of its point of view, except that in promoting civilization over primitivism Amneus is hoping to show how patriarchal systems benefit everyone, not just the evil, brutish, straw-men erected by feminism or the incompetent bozos of the TV sitcom (which are actually more common under matriarchy). Much of the material in the book is, in fact, taken from feminist writings, only it's turned around to show what its real implications are once men and children are included in the consideration.\n\nFile Under:\nMGTOW, Men's Rights,mens rights, MRA, FRA, anti-feminism, feminism, mra, fra, Father's Rights, fathers rights, misandry, anti-misandry\n\nThe Essential Men's Rights Library - Torrent #9","torrent":{"xt":"urn:btih:1740d6ef0cd7abdb927f8806de4fbff424db555d","amp;dn":"Sex+-+The+Garbage+Generation+by+Doctor+Daniel+Amneus.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1740d6ef0cd7abdb927f8806de4fbff424db555d","infoHashBuffer":{"type":"Buffer","data":[23,64,214,239,12,215,171,219,146,127,136,6,222,79,191,244,36,219,85,93]},"announce":[],"urlList":[]}}