{"title":"Oxford Epidemiology A Very Short Introduction 2010 AUDIOBOOK PHC","uid":6157388,"size":152033806,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1770d81a4cfc003dac385389234b509a86943b91&amp;dn=Oxford+Epidemiology+A+Very+Short+Introduction+2010+AUDIOBOOK+PHC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":38,"time":1297086466,"description":"\nOxford_-_Epidemiology-A_Very_Short_Introduction-2010-AUDIOBOOK-PHC\n\nProduct Description\n\nEpidemiology plays an all-important role in many areas of medicine, from discovering the relationship between tobacco smoking and lung cancer, to documenting the impact of diet, the environment, and exercise on general health, to tracking the origin and spread of new epidemics such as Swine Flu. It is truly a vital field, central to the health of society, but it is often poorly understood, largely due to misrepresentations in the media. In this Very Short Introduction, an internationally recognized authority on epidemiology, Dr. Rodolfo Saracci, provides a wealth of information on this key field, dispelling some of the myths surrounding the study of epidemiology, and explaining what epidemiology is and how vital it is to the discovery, control, and prevention of disease in world populations. Dr. Saracci provides a general explanation of the principles behind clinical trials, and explains the nature of basic statistics concerning disease. He also looks at the ethical and political issues related to obtaining and using information concerning patients, and trials involving placebos.\n\n\nAbout the Author\n\nRodolfo Saracci, MD is Honorary Director of Research in Epidemiology at the Italian National Research Council at Pisa.\n\n\nOxford_-_Epidemiology-A_Very_Short_Introduction-2010-AUDIOBOOK-PHC","torrent":{"xt":"urn:btih:1770d81a4cfc003dac385389234b509a86943b91","amp;dn":"Oxford+Epidemiology+A+Very+Short+Introduction+2010+AUDIOBOOK+PHC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1770d81a4cfc003dac385389234b509a86943b91","infoHashBuffer":{"type":"Buffer","data":[23,112,216,26,76,252,0,61,172,56,83,137,35,75,80,154,134,148,59,145]},"announce":[],"urlList":[]}}