{"title":"Mental Discipline - Fallen Stars CDM (2011)","uid":6317135,"size":50080296,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:177abc3ff6fb0ca8c62df47969e34da7a82144e3&amp;dn=Mental+Discipline+-+Fallen+Stars+CDM+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1302746017,"description":"Synthematik presents a brand new maxi-single &quot;Fallen Stars&quot; from the talented Russian futurepop artist Mental Discipline featuring guest appearances by Felix Marc (Diorama / Frozen Plasma) and Peter Rainman (People Theatre)!\nMental Discipline is a one-man project formed by Alexandr Krivoruko in 2008. After releasing a couple of demos packed with catchy and danceable tracks, it has become widely recognized as one of Russia's most promising futurepop projects.\n'Fallen Stars' was originally an instrumental track released on the project's first demo in 2008. Now it has been given a second life thanks to the renowned guests who contributed to the track with their creativity and talent. As a result, one can enjoy two versions of 'Fallen Stars', each with a completely different lyrics and vocal melody combined with the catchiness of the original music.\nBoth versions got proper remix treatment from such artists as Foretaste, !distain, Alpha Point, Mechanical Apfelsine and Systemshock. In addition, the single also includes a remixed version of one of the project's recognized hit songs 'Battlefield Of Love' delivered by Per Aspera.\nTo make a long story short: this release is a real must listen for any fan of synthpop and futurepop music! \n\nTracklist:\n\n01. Fallen Stars (feat. Felix Marc) 04:42\n02. Fallen Stars (feat. Peter Rainman) 04:54\n03. Battlefield Of Love (Per Aspera Gentle Vision) 04:23\n04. Fallen Stars (feat. Peter Rainman) (Remix by !distain) 05:07\n05. Fallen Stars (feat. Felix Marc) (Survivor Remix by Systemshock) 04:54\n06. Fallen Stars (feat. Felix Marc) (Broken Stars Mix by Mechanical Apfelsine) 05:34\n07. Fallen Stars (feat. Peter Rainman) (Remix by Foretaste)* 04:58\n08. Fallen Stars (feat. Felix Marc) (Progressive Fall Mix by Alpha Point)* 05:34\n\n* Paid version exclusive\n &lt;a href=&quot;\nhttp://synthematik.bandcamp.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://synthematik.bandcamp.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:177abc3ff6fb0ca8c62df47969e34da7a82144e3","amp;dn":"Mental+Discipline+-+Fallen+Stars+CDM+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"177abc3ff6fb0ca8c62df47969e34da7a82144e3","infoHashBuffer":{"type":"Buffer","data":[23,122,188,63,246,251,12,168,198,45,244,121,105,227,77,167,168,33,68,227]},"announce":[],"urlList":[]}}