{"title":"Victor J. Katz  - Taming the Unknown. A History of Algebra from ","uid":10395976,"size":13601783,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18c005fa4c66e27df96fdcf4eaa1e3acc46b07aa&amp;dn=Victor+J.+Katz++-+Taming+the+Unknown.+A+History+of+Algebra+from+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403224107,"description":"Description\nProduct Details\nBook Title: Taming the Unknown: A History of Algebra from Antiquity to the Early Twentieth Century\t\nBook Author: Victor J. Katz , Karen Hunger Parshall\nHardcover: 504 pages\nPublisher: Princeton University Press (July 21, 2014)\nLanguage: English\nISBN-10: 0691149054\nISBN-13: 978-0691149059\n\n===================================================================================\nBook Description\nPublication Date: July 21, 2014 | ISBN-10: 0691149054 | ISBN-13: 978-0691149059\nWhat is algebra? For some, it is an abstract language of x's and y's. For mathematics majors and professional mathematicians, it is a world of axiomatically defined constructs like groups, rings, and fields. Taming the Unknown considers how these two seemingly different types of algebra evolved and how they relate. Victor Katz and Karen Parshall explore the history of algebra, from its roots in the ancient civilizations of Egypt, Mesopotamia, Greece, China, and India, through its development in the medieval Islamic world and medieval and early modern Europe, to its modern form in the early twentieth century.\nDefining algebra originally as a collection of techniques for determining unknowns, the authors trace the development of these techniques from geometric beginnings in ancient Egypt and Mesopotamia and classical Greece. They show how similar problems were tackled in Alexandrian Greece, in China, and in India, then look at how medieval Islamic scholars shifted to an algorithmic stage, which was further developed by medieval and early modern European mathematicians. With the introduction of a flexible and operative symbolism in the sixteenth and seventeenth centuries, algebra entered into a dynamic period characterized by the analytic geometry that could evaluate curves represented by equations in two variables, thereby solving problems in the physics of motion. This new symbolism freed mathematicians to study equations of degrees higher than two and three, ultimately leading to the present abstract era.\nTaming the Unknown follows algebra's remarkable growth through different epochs around the globe.\n\n===================================================================================\nFrom the Inside Flap\n&quot;Taming the Unknown is well written and informative, and will satisfy any reader with an interest in the history of algebra. Striking just the right balance between general overview and technical detail, this book is a pleasure to read.&quot;--Joseph W. Dauben, City University of New York, Graduate Center\n\n&quot;This original and high-quality book is a significant contribution to the history of mathematics. It will be useful to scholars doing research in the history of mathematics, as well as to a broader readership that includes mathematics teachers, advanced undergraduate or graduate students, and mathematicians.&quot;--Leo Corry, Tel Aviv University\n\n&quot;This fine survey of the history of algebra is clearly and engagingly written. It will become the standard reference on this topic by virtue of its scholarship, coverage, and readability.&quot;--Tom Archibald, Simon Fraser University\n\n===================================================================================\nAbout the Author\nVictor J. Katz is professor of mathematics emeritus at the University of the District of Columbia. Karen Hunger Parshall is professor of history and mathematics at the University of Virginia.\n===================================================================================","torrent":{"xt":"urn:btih:18c005fa4c66e27df96fdcf4eaa1e3acc46b07aa","amp;dn":"Victor+J.+Katz++-+Taming+the+Unknown.+A+History+of+Algebra+from+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18c005fa4c66e27df96fdcf4eaa1e3acc46b07aa","infoHashBuffer":{"type":"Buffer","data":[24,192,5,250,76,102,226,125,249,111,220,244,234,161,227,172,196,107,7,170]},"announce":[],"urlList":[]}}