{"title":"Feed Your Genes Right : Eat To Turn Off Disease-Causing Genes An","uid":3501380,"size":1649022,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:195e102b3c07f7db8fe5b9476aa2f309e783738b&amp;dn=Feed+Your+Genes+Right+%3A+Eat+To+Turn+Off+Disease-Causing+Genes+An&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"richiesw15","files":2,"time":1152244639,"description":"Feed Your Genes Right : Eat To Turn Off Disease-Causing Genes And Slow Down Aging \n\n\\&quot;If you?re like me, you want to maintain and perhaps improve your \nhealth, reduce your chances of developing disease, stay mentally sharp, \nstay at a normal weight, and remain physically active as you get older. \nBut as I?m sure you?ve already discovered, there is no shortage of howto \nhealth books or programs, frequently offering odd, counterintuitive, \nor contradictory advice. \nHow do you make sense of everything you hear? \nToday, in the early years of the twenty-first century, medical \nresearch is dramatically shifting its focus. Instead of looking only at \nthe physical or biochemical factors that lead to health problems, \nresearchers are gaining a better understanding of the far-reaching roles \ngenes play in determining the risk of disease. Now and in the years \nto come, the role of genes in health will strongly influence, and perhaps \neven dominate, recommendations for maintaining health and avoiding \ndisease. \nThe truth is that your genes do play a fundamental role in health \nand disease.These tiny molecules, found in each one of your body?s 70 \ntrillion cells, contain biological instructions that orchestrate the functions \nof those cells and of your body as a whole.Your genes govern the \nactivities of your heart, lungs, brain, and every other organ.The collective \nefforts of your genes determine how well your body functions?or \nmalfunctions, as the case may be. Quite simply, when your genes do \ntheir job properly, you?re in good health.When they don?t, or can?t, you \nare more likely to develop heart disease, cancer, and other diseases. \nYou have probably heard people say that ?you?ve got the genes you \nwere born with,? suggesting that your health and risk of disease were \nsealed at birth. But contrary to popular opinion, genes are not rigid and \ninflexible determinants of your health, and your life is not merely an \nexecution of some biological program beyond your control. \nInstead, your genes possess extraordinary flexibility, which you can \nuse to live a longer and healthier life. How is this possible? The reason \nis that genes do not function by themselves. Rather, gene activity \ndepends on a variety of nutrients as cofactors. Nutrients provide the \nbuilding blocks of genes, and they turn many genes on and off. Because \nyou control what you put into your mouth, you can literally feed your \ngenes right and gain tremendous health benefits. Or you can feed your \ngenes all the wrong foods and suffer the unfortunate consequences.Vitamins \nand minerals (and many other nutrients as well) have always \nbeen essential cofactors for the normal functioning of your genes. \nIf these ideas seem strange or unfamiliar, rest assured. Research on \nthe interactions between nutrition and genes is in step with many of the \npublic-health recommendations you have heard over the years. For \nexample, doctors have long urged the adoption of various dietary and \nlifestyle habits to reduce the risk of heart disease and cancer, such as \neating more vegetables and fruit and exercising regularly. Nutrients \nwork on multiple levels in the body, and ultimately they enable genes to \nfunction more efficiently, the way nature intended them to. \nI first became interested in the health benefits of nutrition in 1969, \nwhen DeWitt Garrett, a college biology professor, made an intriguing \noff-the-cuff comment about vitamin supplements. The timing was \nserendipitous. I had recently been diagnosed with a cyst that my physician \nsaid would bother me for the rest of my life. About a week after I?d \nstarted to take vitamin supplements, my cyst drained and disappeared. \nI was impressed by the immediate and dramatic effect of the vitamins, \nand I have been taking them ever since. Looking back, I now realize \nthat nutrient deficiencies likely interfered with the genes involved in \nhealing the cyst, a situation that the vitamin supplements corrected. \nIt was not until the mid-1990s, however, that I started to see a clear \nconnection between nutrition and genes. Bernard Rimland, an autism \nresearcher, happened to tell me about a physician who had used \nlarge dosages of vitamins and other supplements to treat children with \nDown syndrome, a disorder caused by an irreversible genetic defect \nthat leads to physical abnormalities and mental retardation. Rimland \ntold me that the earlier children began taking the supplements, the \nmore likely they would grow up with near-normal intelligence and \nappearance. Somehow, massive amounts of vitamins and other supplements \nmanaged to offset much of the genetic chaos of Down syndrome. \nHearing about the nutritional treatment of Down syndrome, I \nbegan to mull over whether we are ?what we inherit.? I had reason to \nbe curious. My older brother had died from cancer at a relatively young \nage, and my parents had died after many years of failing health. I did \nnot want to follow in their footsteps, at least if I didn?t have to. \nI mulled over a simple question: if vitamin supplements could undo \na significant amount of the genetic damage done by Down syndrome, \nwhy couldn?t vitamins and dietary changes improve other types of \ngenetic defects or damage? It turned out that other people were thinking \nalong the same lines. Researchers around the world were discovering \nthat vitamins, such as vitamin E and the B vitamin folic acid, could \nreduce much of the cumulative genetic damage that occurs during the \naging process and in many diseases. \nShortly afterward, I had an opportunity to experiment on myself. In \n1997, at age forty-seven, I grappled with the fact that I was twenty \npounds overweight and my blood sugar was creeping up toward prediabetic \nlevels. I was slowly but steadily heading toward type 2 diabetes. \nFor a health writer, this situation was, at the very least, embarrassing. \nBut I was at a loss as to how to change it. \nThe solution came with advice from people who were more savvy \nthan I was when it came to nutritional supplements and diet. A nutritionally \noriented physician conducted a battery of blood tests and \nfound that I was low in key minerals involved in managing blood sugar \nand insulin. So I started taking supplements of these minerals, including \nchromium, magnesium, and zinc. I also increased my intake of alphalipoic \nacid, a vitamin-like nutrient involved in regulating blood sugar \nand insulin levels. But supplements were not the entire solution. Two \nyears later a nutritionist coached me on eating more wholesome foods \nas a way to lose weight and control my blood sugar. \nBy eating more nutritious foods, cutting out the all-too-convenient \njunk foods, and continuing to take certain nutritional supplements? \nwhat I now call feeding my genes right?I effortlessly lost twenty \npounds and four inches from my waist in three months. I also found, a \nlittle later, that my blood sugar and insulin levels fell to well within \nnormal ranges. Knowing what I do now, I understand that these \nchanges helped turn off genes involved in overweight, inflammation, \nand diabetes. \nAll of these events were stepping-stones to a more serious examination \nof how nutrition influences the activity of genes and, in turn, \noverall health.With all the news reports about gene research and (so \nfar exaggerated) promises of future gene therapies, most physicians \nand researchers have ignored a simple yet profound fact: our genes \nrequire many nutrients to do their jobs correctly, just as you and I need \na good meal to feel up to doing our jobs. \nFeed Your Genes Right is the result of both a personal and a professional \nquest, one that I am pleased to share with you. This book \nexplains, in simple and nontechnical terms, how nutrition affects your \ngenes and your risk of disease, regardless of whether you have inherited \n?good? or ?bad? genes. \nIn Part I, I provide an overview of nutrition-gene interactions, \nexplaining how genes become damaged and how they are capable of \nrepairing themselves, so long as they receive proper nutrition. In Part \nII, I provide the Feed Your Genes Right Supplement Plan, which \ndescribes specific vitamins and vitamin-like nutrients needed for \nhealthy genes. Part III covers dietary recommendations for maintaining \nhealthy genes, explaining what you should and should not eat. Finally, \nPart IV describes how stress affects genes, suggests antistress nutrients \nyou can take, and makes specific recommendations for reducing \ngenetic damage that occurs in aging, heart disease, cancer, some inherited \ndiseases, and many other conditions. \nThe bottom line of Feed Your Genes Right is that you do not have \nto wait years to apply the new and exciting discoveries of nutrigenomics, \nthe science of nutrition and genetics.You can utilize existing \nknowledge to improve your health today and to set the stage for an \nactive, healthy, and long life. I have incorporated these concepts in my \nown life, and you can, too. \nBe healthy, and enjoy life!\\&quot;","torrent":{"xt":"urn:btih:195e102b3c07f7db8fe5b9476aa2f309e783738b","amp;dn":"Feed+Your+Genes+Right+%3A+Eat+To+Turn+Off+Disease-Causing+Genes+An","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"195e102b3c07f7db8fe5b9476aa2f309e783738b","infoHashBuffer":{"type":"Buffer","data":[25,94,16,43,60,7,247,219,143,229,185,71,106,162,243,9,231,131,115,139]},"announce":[],"urlList":[]}}