{"title":"[BlacksOnMoms] - Brooke Tyler - Horny MILF takes on 2 basketball","uid":15819073,"size":275057546,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:1a1cb272f8023a90398a2f2cd09496e2f43cd7a6&amp;dn=%5BBlacksOnMoms%5D+-+Brooke+Tyler+-+Horny+MILF+takes+on+2+basketball&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LucasCar","files":1,"time":1473736097,"description":"[BlacksOnMoms] - Brooke Tyler - Horny MILF takes on 2 basketball studs [NEW September 12, 2016]\r\nThis week we found us a good old mom who likes herself some good black dick. Ok check this out, we were playing at the park a few weeks back when this mark shows up and asked us if wanted to play basketball right. We let him watch us from the sideline. Well then he thought he was down and asked us if wanted to come and watch the game right, we’re like he looks like a rich white guy probably has a like a big ass tv and a small dick right. So we took him up on his offer to go watch the finals. When we got there this marks had a small 17 inch LCD and some cheap beer and shit. So we’re like ok let’s just watch the game and get the fuck out of here, right, but not all was what it seemed to appear. The guys wife was behind us making all sorts of eye contact with us. She had like the come fuck me eyes. So I asked my boy to cause a distraction and I excused myself, went over there. We started making out and she was grabbing my dick and shit. I had my hand in her pussy, it was all wet. Then I went back to the couch and let my homeboy smell my hand. Then he got up and she sucked his dick in the kitchen. All the while this mark was too busy watching the game. So then we told him to go on a beer run and get us some of the good shit from far up town. After he left,She told us she been wanting some black dick since we got here. We took turn on his wife, fucking her on the couch. She was sucking my dick and taking dick in her pussy. We ran a train on her and she loved it. The team may have lost the game but we won that day. Her husband showed up and caught us right after we nutted, but it was too late we bounced and took the good beer too.\r\n \nhttp://teenimage.net/img-57d751843a365.html\r\n \nhttp://teenimage.net/img-57d7518cb206f.html\r\n \nhttp://teenimage.net/img-57d7519383f32.html\r\n\r\n\r\n\r\n♥ ♥ ♥  For more Exclusive Porn please visit ♥ ♥ ♥ \r\n   \nhttps://thepiratebay.org/user/LucasCar","torrent":{"xt":"urn:btih:1a1cb272f8023a90398a2f2cd09496e2f43cd7a6","amp;dn":"%5BBlacksOnMoms%5D+-+Brooke+Tyler+-+Horny+MILF+takes+on+2+basketball","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a1cb272f8023a90398a2f2cd09496e2f43cd7a6","infoHashBuffer":{"type":"Buffer","data":[26,28,178,114,248,2,58,144,57,138,47,44,208,148,150,226,244,60,215,166]},"announce":[],"urlList":[]}}