{"title":"Handknit Holidays Knitting Year Round for Christmas Hanukkah and","uid":9384006,"size":31985652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a7636a94bca4ece90c64b150d83c357ed3fd286&amp;dn=Handknit+Holidays+Knitting+Year+Round+for+Christmas+Hanukkah+and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1387769536,"description":"For many people, the best part of the winter holidays is the anticipation: planning the perfect gifts, decorating the house, looking forward to seeing family and friends. Holidays can be particularly special for knitters, whose preparations often start months in advance and involve their own creations. In Handknit Holidays best-selling knitting author Melanie Falick presents an eclectic collection of more than 50 original gifts, decorations, and clothing pieces for Christmas, Hanukkah, and the winter solstice, providing year-round inspiration for knitters of all levels.Created by top knitwear designers, the projects include colorful ornaments; funky and classic Christmas stockings; a wire-and-bead menorah; sparkly ribbon scarves; a poncho and matching dog sweater; and a range of super-quick projects for that last-minute holiday rush, from a Santa hat, to elf caps, to flower pins. Rounding out the volume are a few grand projects-an Aran tree skirt, a patchwork afghan, a lace shawl-destined to become family heirlooms, plus features on such topics as the origin of the Christmas stocking, the meaning of the winter solstice, knitting for charities, strategies for finishing holiday knitting (on schedule!), and even a delicious recipe for festive crescent cookies.Beautifully photographed by Susan Pittard, Handknit Holidays is a creative celebration of the holiday season and a treasure for all knitters who seek to bring more of their own handwork-and artistry-into their daily lives and their holiday festivities.","torrent":{"xt":"urn:btih:1a7636a94bca4ece90c64b150d83c357ed3fd286","amp;dn":"Handknit+Holidays+Knitting+Year+Round+for+Christmas+Hanukkah+and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a7636a94bca4ece90c64b150d83c357ed3fd286","infoHashBuffer":{"type":"Buffer","data":[26,118,54,169,75,202,78,206,144,198,75,21,13,131,195,87,237,63,210,134]},"announce":[],"urlList":[]}}