{"title":"Remotekeys","uid":11020611,"size":2833282,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1ac7099c907d0a394826e6460fd3d88ffc59bdbd&amp;dn=Remotekeys+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":3,"time":1410560243,"description":" &lt;a href=&quot; http://bayimg.com/GaOmJAafp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/GaOmJAafp&lt;/a&gt;  &lt;a href=&quot;\nhttp://bayimg.com/GAOMNAAFp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/GAOMNAAFp&lt;/a&gt;  &lt;a href=&quot;\nhttp://bayimg.com/GaOmoAafP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/GaOmoAafP&lt;/a&gt;\n\nRelease 8.7.3 \n\n\nI couldn't run the program until I installed Msvbvm50.exe from here http://support.microsoft.com/kb/180071 \n\nOut of the box, this is one of the best freeware macro managers you'll find, though novice users might be overwhelmed. RemoteKeys' interface is as fluid as the program is flexible. You'll do well to spend time with the extensive manual application. From preferences to profiles, you'll find it very easy to configure this application to fit your needs. Most functions have multiple configuration methods; most either pull-down or hot-key based. This program doesn't discriminate against button pushers or hot-key users as either method is easily assigned to any macro.\n\nRemoteKeys makes a simple process out of automatically sending keystrokes to most applications. You can easily create 2,500 editable buttons over 10 profiles. The program includes dozens of buttons that cover the gamut of functions available. You'll find it easy to edit them to perform new functions or follow their structure to build entirely new macros. An included recorder makes it simple create macros out of everyday tasks. Intermediate users and above will like this flexible and free utility.\n\nRemoteKeys is a powerful tool, but expects users to be careful. There are no guards in place to check macros for potential damage to your files and operating system. Advanced users with a penchant for macros will have a field day with this utility. Other users will find it daunting to learn, but powerful to use.\n\nSome tasks are repetitive when you work on your computer, as to insert the date, names of contacts, calculations, etc.\nRemote Keys is a program allowing to automate complex controls or simple jobs. For it you only have to choose among 2500 buttons which can be freely allocated.It is macros who will be able to insert the current date in a text or launch programs and the refreshed in a definite order in the screen. There is about 350 available orders and within reach hand in the bar system.It works in network and asks for no installation.\n\nA review.\n\n&quot;Definitely works for Win 7 64bit Professional SP1 !&quot;\n\nOctober 02, 2013 \n\nPros\n\n100% reliable, always works as expected. When installed correctly, RemoteKeys works perfectly and it's a real time saver! Makes logging in various email accounts and filling in repetitive forms a snap! Tiny memory &amp; resources footprint, never hogs background processes.\n\nCons\n\nNone. Always works, 100% reliable, never crashes. (I am NOT the developer, just another happy camper.)\n\nSummary\n\nI've been using this on all versions of windows from [if I remember correctly] Win 3.1 through Win XP, Vista &amp; Win 7. With Win 7, I've disabled User Account Control settings for other reasons, so you might want to those settings for your needs.\n\n100% reliable, always works as expected. Just install in the Programs (86) folder and follow the developers instructions:\n\nEach freewarehits program needs (710k):\nDownload MSVBVM50.dll\n( -&gt; System folder)\n(YOU WILL DEFINITELY NEED THIS FOR MOST USES, THE PROGRAM REQUIRES AN OLDER VISUAL BASIC 5 RUNTIME; THE NEXT FEW ARE OPTIONAL0\n\nChangeColor.exe needs (65 k):\nDownload COMDLG32.OCX\n( -&gt; System folder)\n\nFor database access of RK (3.2 mb):\nDownload MS Jet Engine 3.5 &amp; vb5db.dll\n(Installer)\n\nNetwork use for RK (55k):\nDownload MSWINSCK.OCX\n( -&gt; System folder)\n\nThe Rich version of ClipMonMini (no 5.9k limitation in hex/dec mode) needs (90 k):\nDownload RICHTX32.OCX\n( -&gt; System folder)\n\nUpdated on Oct 2, 2013\n\nI've used AVG antivirus for about 10 years and with each re-install or computer build, it has never reported a virus, keystroke logger, etc. No need to add an exception to AVG. I suppose it's possible to download an infected install file from certain websites, but there's nothing wrong with RemoteKeys itself.\n","torrent":{"xt":"urn:btih:1ac7099c907d0a394826e6460fd3d88ffc59bdbd","amp;dn":"Remotekeys+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ac7099c907d0a394826e6460fd3d88ffc59bdbd","infoHashBuffer":{"type":"Buffer","data":[26,199,9,156,144,125,10,57,72,38,230,70,15,211,216,143,252,89,189,189]},"announce":[],"urlList":[]}}