{"title":"Pascal Languirand - Minos &amp; De Harmonia Universalia (Cosmic Newa","uid":3779682,"size":83239494,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1b2962495c7091f2e7c8309652acd6e380cea49e&amp;dn=Pascal+Languirand+-+Minos+%26+De+Harmonia+Universalia+%28Cosmic+Newa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tryandthenbuy","files":12,"time":1187658381,"description":"Artist     : Pascal Languirand\nAlbum      : Minos-De Harmonia Universalis (&amp;#039;78-&amp;#039;80)\nSource     : CD\nYear       : 1993\nGenre      : Cosmic New Age\nLabel      : Neuroumium Records\n\nCodec      : FhG \nQuality    : CBR, 192kbps, joint stereo\n\nID3-Tag    : Yes, Version 1 &amp; 2.3\n\n\nIncluded   : This Info-File (NFO)\n             Frontcover\n             Backcover\n             CD-cover\n\nTracklisting\n------------\n01 05:59)\n02 06:24)\n03 06:49)\n04 09:44)\n05 06:30)\n06 06:12)\n07 11:51)\n\nPlaying Time : 53:29\nTotal Size   : 73.5 MB\n\n\nPascal Languirand (Canada) \n\nMike McLatchey  4-October-2002  Overview (1979-81)  \n\nPascal Languirand may roughly represent, by himself, the Canadian New Age  music scene in the 70s/80s. Sure, there is Mychael Danna, who released his Elements in 1979, although his prominence would come much later with his connection to both Hearts of Space and the Mirage label and would relate far more to ambient and melodic styles. Languirand&amp;#039;s style was sort of a cosmic, symphonic take on the influential German styles, a step forward from the music of Klaus Schulze and Tangerine Dream done in a truly idiosyncratic way. \nLanguirand&amp;#039;s debut was entitled Minos, and it inaugurated his style from the get-go. Long electronic drones, atmospheres and effects fade slowly up from silence with guitar accompaniment. The ambiance is definitely of the Schulzian ilk, with its long drawn out, desolate moods, an effect close to Timewind&amp;#039;s &quot;Wahnfried 1883&quot; or Picture Music&amp;#039;s &quot;Mental Door,&quot; except any overt sequencing does not come until later on in the album. Minor keys prevail as always in this style of music, although there are occasional forays into eastern modal territories which bring into the picture some pleasant female vocal accompaniment. However, while Languirand works dominantly with electronic motifs, there are also more conventional moments, including a ballad with acoustic guitars and male vocals as well as a piece with drum accompaniment. Unfortunately, not only are these moments diversions, they also aren&amp;#039;t very impressive, forgetting the trance-like elements of his influences that tended to make those works so mesmerizing. As a debut, Minos is a bit patchy, surely trying to take a step away from his dominant influences, but not quite making it out of the looming shadow. \n\nHowever, De Harmonia Universalia was far more successful in its attempts to blend influences into something newer. While Minos was more like a list of the various things Languirand was bringing to electronic music - the acoustic guitars, eastern tinges and vocal accompaniment - there was actually an attempt to fully blend all of them for his second effort. There was also a move here to a less morose and more uplifting sound, a move in keeping with the new age-like title. Here, Languirand was finding his voice among the waves of crystalline electronic patches, floating delicately through twinklings, shimmerings, vocoders and the like. There is still a dominant sense of the ethereal and transcendent, however this cosmic prevalence always avoids the melancholy teutonic overtones, even at its most intensely meditative. Nowhere are there any startling transitions into different stylistic territories, and the entirely does well with its flow among quiet drones and symphonic climaxes. By now, Languirand had far more in common with artists like Michael Stearns than Germans like Klaus Schulze. \n\nSo it&amp;#039;s sort of strange to find the guitar back so prominently at the beginning of Vivre Ici Maintenant, droning on modally like an outtake from Minos. However, Languirand was not exactly taking a step back, as one can tell from the crystalline bell sounds that follow the guitar ramble, yet like on Minos, there is a breakdown into stylistic elements that give an effect far different from the homogeneity of its successor. It&amp;#039;s clear that the eastern sounds and titles (like &quot;Danse de Shiva,&quot; &quot;Sitar,&quot; and &quot;Mandala&quot;) are yet more aspects of the sort of holistic/new age spiritualies that fuel the concepts to his albums. As the advent of the 80s brought to the fore labels like Windham Hill and Narada, it might be said that Languirand was one of the earliest creating a new age music of a sort, at least in a day where it did not quite yet mean brightened up fuzak and bland world music. Vivre Ici Maintenant&amp;#039;s methods are probably closest to those of the early Aeoliah albums in that there is an analog sound to the electronics and a sense of experimentation and exploration that likened it more to a strain of progressive and symphonic rock music far removed from its influences. It&amp;#039;s probably not quite as successful as its shimmering, cosmic predecessor, however its placement in country and era is intriguingly anachronistic. \n\nIt would be a long time before Languirand would create his next album, and even to this day one will see a release every now and then that fleetingly becomes part of an electronic catalog only to fall back into obscurity quickly. There was even a compilation of music from his earlier years at one point, whose lack of availability points to its lack of solid distribution. Based on his early albums, one would hope that this will eventually improve so that reissues of these three original works will find their way to permanent and available digital format and that his modern work will also fall on more ears. \n\n","torrent":{"xt":"urn:btih:1b2962495c7091f2e7c8309652acd6e380cea49e","amp;dn":"Pascal+Languirand+-+Minos+%26+De+Harmonia+Universalia+%28Cosmic+Newa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b2962495c7091f2e7c8309652acd6e380cea49e","infoHashBuffer":{"type":"Buffer","data":[27,41,98,73,92,112,145,242,231,200,48,150,82,172,214,227,128,206,164,158]},"announce":[],"urlList":[]}}