{"title":"The Untold History of the Enslavement of Whites in Early America","uid":4328002,"size":2912412,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b3a922ea1476ad5b31a31193a6069b83a622da3&amp;dn=The+Untold+History+of+the+Enslavement+of+Whites+in+Early+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CuriousGeorge","files":1,"time":1217881482,"description":"They Were White and They Were Slaves: The Untold History of the Enslavement of Whites in Early America\n- Michael Hoffman II\n\nMr. Hoffman presents a rough outline of the history of the enslavement of whites in Europe, the Middle East, North Africa, the Carribean and finally in America from Roman times to the begining of the 20th century. Documented are such details as:\n\n-Slavery in ancient Greece and attitudes towards slaves there\n-Arab traffic in white slave to the Middle East\n-The Vikings&amp;#039; massive involvement in the slave trade during the middle ages\n-White slavery and ethnic-cleansing in Ireland and Barbados under Oliver Cromwell\n-Kidnapping of whites in Britain to bring to the Americas\n-Child labor and gross working conditions in the mines and factories in America and Britain during the industrial revoloution.\n-One of the most disturbing events documented here: the use of &quot;human brooms&quot; as chimney sweeps in England during the 1800&amp;#039;s. These might be able to claim the worst status. The orphans who had to climb up chimneys filled with toxic dirt and soot weren&amp;#039;t even paid to do so, they were forced to do that work and then BEG for a living.\n-White slavery and white slave trade in colonial America. These whites were treated as more expendable then the African slaves because the slave ships had to go out of their way to pick up Africans.\n-&quot;Redneck,&quot; because whites had to work out in the fields in the sun so their skin would get tanned and burned.\n-&quot;Hillbilly,&quot; because when they were freed or escaped, the slaves had nowhere to live except in remote places in the backwoods and especially APPALACIA.\n-The race politics presented here explain and elucidate the animostiy between blacks, lower class whites and the white slave-and-plantation owning aristocracy in the South.\n-This one&amp;#039;s the kicker: the word SLAVE actually comes from SLAV, the white peoples of Eastern Europe who were often raided and held in bondage by invaders.\n\nThis book is well worth getting a hand on and reading, because it proves that slavery is a universal condition that has been practiced against all races and nations of people, even against those traditionally portrayed (i.e. Anglo Saxons/whites) as being the slavemasters and oppressors. ","torrent":{"xt":"urn:btih:1b3a922ea1476ad5b31a31193a6069b83a622da3","amp;dn":"The+Untold+History+of+the+Enslavement+of+Whites+in+Early+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b3a922ea1476ad5b31a31193a6069b83a622da3","infoHashBuffer":{"type":"Buffer","data":[27,58,146,46,161,71,106,213,179,26,49,25,58,96,105,184,58,98,45,163]},"announce":[],"urlList":[]}}