{"title":"Linton Kwesi Johnson Forces Of Victory &amp; Dread Beat And Blood","uid":6460753,"size":402624727,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1be608c208d00884c3ec37661a846e50bad7ad9b&amp;dn=Linton+Kwesi+Johnson+Forces+Of+Victory+%26+Dread+Beat+And+Blood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ocnrf","files":19,"time":1307753812,"description":"Forces Of Victory\n\nHaving exploded onto the UK scene in 1978 with the dark, angry masterpiece, Dread Beat &amp; Blood, Brixton Dub Poet Linton Kwesi Johnson returned the following year with second album, Forces Of Victory. Calling, again, on the talents of the Dennis Bovell Band, this was a calmer, more measured work, packed with both wry observation and political conviction.\n\nJohnson's poetry, with its emphasis on rhythm, was ideally suited to the sparse, jazz-tinged backings of UK dub. Opener &quot;Want Fi Go Rave&quot; is as cool and confident as anything by Gregory Isaacs or Prince Buster, while &quot;It Noh Funny&quot;, a homage to the realities of youth, gives Bovell plenty of room for the interaction of drum and delay.\n\n&quot;Sonny's Lettah - a deeply affecting tale of injustice - is a favourite among veteran activists, but &quot;Independent Intavenshan&quot;'s bouncing bassline and scornful lyrics (bemoaning the abundance of right-minded organisations attempting to speak for the black community) make the more resonant statement. &quot;Fight Dem Back&quot; rallies against the racists behind a mocking sing-song refrain, while &quot;Reality Poem&quot;, with its haunting chorus-drenched guitar motif, advocates sober atheism at a time when such viewpoints were far from welcome.\n\nSome have criticised Johnson for making Caribbean culture palatable to a predominantly white left-wing audience, but such criticism is to be expected by any artist who transcends their genre. And while the clean understated Bovell production is more suitable for the coffee bar than the sound system, it marks one of many high points in a distinguished career. A homegrown reggae classic. \n\n\nBBC\n\nDread Beat And Blood\n\nThe title pretty much says it all. This is a stunning debut and an indication of the great things that were to come. Johnson's debut is longer on spoken-word pieces than it is on poetry and music, but Dennis Bovell's influence can be felt in these eight tracks. Songs such as &quot;It Dread Inna Inglan,&quot; which describes the death of George Lindo at the hands of racists, or &quot;Five Nights of Bleeding,&quot; which recounts tales of British police's capricious use of violence against London's West Indian population, are moving and confrontational mini-masterpieces of anger and a man searching for justice in a country that seems all to willing too deny it to him and other Afro-Brits. A powerful and compelling record. \n\n\n*****\n\nAMG\n\n\nNeedledrop from UK 1st editions\n\n\nusing\n\nLinn LP12, Lingo, Ekos and Dynavector XX2 moving coil cartridge, via a  Naim 62 pre-amp into Pioneer PDR-609 CDR, using TDK audio CDR.\n\n\nArt work included","torrent":{"xt":"urn:btih:1be608c208d00884c3ec37661a846e50bad7ad9b","amp;dn":"Linton+Kwesi+Johnson+Forces+Of+Victory+%26+Dread+Beat+And+Blood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1be608c208d00884c3ec37661a846e50bad7ad9b","infoHashBuffer":{"type":"Buffer","data":[27,230,8,194,8,208,8,132,195,236,55,102,26,132,110,80,186,215,173,155]},"announce":[],"urlList":[]}}