{"title":"Emperor of the World: Charlemagne and the Construction of Imperi","uid":10172247,"size":2677826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d1fe458664d1e4cadee5adbb10a8e354ff7a64e&amp;dn=Emperor+of+the+World%3A+Charlemagne+and+the+Construction+of+Imperi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"K-Slender","files":3,"time":1400420143,"description":" &lt;a href=&quot;http://i.imgur.com/xLLZOOi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i.imgur.com/xLLZOOi.jpg&lt;/a&gt;\n\nPublisher: Cornell University Press; 1 edition (February 26, 2013)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B00B5Q5NCS\n\n\nCharlemagne never traveled farther east than Italy, but by the mid-tenth century a story had begun to circulate about the friendly alliances that the emperor had forged while visiting Jerusalem and Constantinople. This story gained wide currency throughout the Middle Ages, appearing frequently in chronicles, histories, imperial decrees, and hagiographies-even in stained-glass windows and vernacular verse and prose. In Emperor of the World, Anne A. Latowsky traces the curious history of this myth, revealing how the memory of the Frankish Emperor was manipulated to shape the institutions of kingship and empire in the High Middle Ages.\n\nThe legend incorporates apocalyptic themes such as the succession of world monarchies at the End of Days and the prophecy of the Last Roman Emperor. Charlemagne's apocryphal journey to the East increasingly resembled the eschatological final journey of the Last Emperor, who was expected to end his reign in Jerusalem after reuniting the Roman Empire prior to the Last Judgment. Instead of relinquishing his imperial dignity and handing the rule of a united Christendom over to God as predicted, this Charlemagne returns to the West to commence his reign. Latowsky finds that the writers who incorporated this legend did so to support, or in certain cases to criticize, the imperial pretentions of the regimes under which they wrote. New versions of the myth would resurface at times of transition and during periods marked by strong assertions of Roman-style imperial authority and conflict with the papacy, most notably during the reigns of Henry IV and Frederick Barbarossa. Latowsky removes Charlemagne's encounters with the East from their long-presumed Crusading context and shows how a story that began as a rhetorical commonplace of imperial praise evolved over the centuries as an expression of Christian Roman universalism.","torrent":{"xt":"urn:btih:1d1fe458664d1e4cadee5adbb10a8e354ff7a64e","amp;dn":"Emperor+of+the+World%3A+Charlemagne+and+the+Construction+of+Imperi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d1fe458664d1e4cadee5adbb10a8e354ff7a64e","infoHashBuffer":{"type":"Buffer","data":[29,31,228,88,102,77,30,76,173,238,90,219,177,10,142,53,79,247,166,78]},"announce":[],"urlList":[]}}