{"title":"Paul Schwartz - Aria 3 Metamorphosis [FLAC] + covers","uid":4479564,"size":421444335,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1d4dee1b2352ddb9cb76e84aa1a419c61c0dd15d&amp;dn=Paul+Schwartz+-+Aria+3+Metamorphosis+%5BFLAC%5D+%2B+covers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Willy_B","files":-1,"time":1225499655,"description":"&quot;One of the world's leaders in creating eloquently-spiritual, modern-classical music that fully integrates elements of both pop and new age -- reaffirms his preeminent position with State of Grace III, the latest volume in his series of original-music hymns and anthems.\n\nAlthough serving as composer, arranger, conductor, pianist and producer on his recordings, Paul puts his music to the forefront and does not put his name on the covers of the State of Grace recordings. In addition, although a few of the pieces on his albums are instrumentals, most feature solo or chorus vocals by singers such as Lisbeth Scott and Rebecca Luker, both of whom Schwartz has worked with for many years. &quot;I'm listed in the credits similarly to a film director,&quot; he explains. &quot;I create the overall sound production, but I don't feel the need to be in the spotlight by myself.&quot;&quot;\n\n\nI think this disk is one of the successful mixes of classic opera &amp; electronic music. I can't name another one disk like that. This CD will be interestig even people, who don't like any electronic mixes of classic things (like I am). \n\n\nAll pictures in booklet is 300 pixels/inch. All tracks are separate &amp; with tags. Ripped by EAC.\nIf you want to burn this CD, you can download cole2K nero audio plugin (google helps you), or use alcohol, EAC  etc. \nI can't seed all the time, but I'll seed every night, till someone downloads. Just wait. I'll be hapy if you seed few days after download.\nIf you think you want somethig else, just tell me here.\n\nP.S. Sorry for my bad english. I'm russian.","torrent":{"xt":"urn:btih:1d4dee1b2352ddb9cb76e84aa1a419c61c0dd15d","amp;dn":"Paul+Schwartz+-+Aria+3+Metamorphosis+%5BFLAC%5D+%2B+covers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d4dee1b2352ddb9cb76e84aa1a419c61c0dd15d","infoHashBuffer":{"type":"Buffer","data":[29,77,238,27,35,82,221,185,203,118,232,74,161,164,25,198,28,13,209,93]},"announce":[],"urlList":[]}}