{"title":"The Beatles - Acetate Collection (Remastered Edition)","uid":6512722,"size":410119113,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1d98885b7fb207e51fe8d664ac54e60de212918c&amp;dn=The+Beatles+-+Acetate+Collection+%28Remastered+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":21,"time":1309699832,"description":"THE BEATLES\nACETATE COLLECTION\nRemastered Edition\nRMW 703\n\nFurther declicked, dethumped, pitch, phase and levels corrected from the CD on Unicorn UC 087 (2001) at Remasters Workshop June 28 &amp; 29, 2011.\n\nNotes reprinted from the booklet (for which I have no scans), edited and/or reworded to sound like they were written by an English-speaking person. My notes are in [brackets].\n\nThis CD brings together a collection of acetates from 1961-69. Some you may have seen before on previous releases, but some discs make their CD debut here.\nFirst, an MGM/Verve acetate of The Beatles' June 24, 1961 recording of &quot;Ain't She Sweet&quot;.\nThis is followed by two 7&quot;, 1-sided Emidisc mono acetates of &quot;She's A Woman,&quot; the first being the released take 6, but the second features a false start and take 7. These acetates were probably cut the same day as the mono mixing for &quot;She's A Woman,&quot; October 12, 1964.\nThese are followed by an 8&quot; stereo Capitol acetate of &quot;Paperback Writer&quot; -- take 2, the same as the released take.\nThe third of three mono remixes for &quot;Strawberry Fields Forever&quot; take 7 was chosen for acetate cutting on November 29, 1966. Only sixty seconds of this mix would be used in the final product. [NOTE: This acetate was so damaged, nothing could be done to improve it but pitch correction and summing of the channels.]\n[FAKERY ALERT!]\nWe have also included a white label Emidisc with hand written notes, of &quot;Blue Jay Way.&quot; This is quite a bizarre stereo mix, which is totally different from the mix that appeared on Yellow Dog's 'Acetates' CD in 1991.\n[NOTE: BOTH OF THESE &quot;BJW&quot; MIXES ARE FORGERIES. Verified by Doug Sulpy 6-29-11.]\nWhat follows is the infamous &quot;Una Sensationale Intervista&quot; acetate, a Kenny Everett interview with John, and then Paul, George and Ringo at Abbey Road on June 6, 1968, for inclusion on his radio show which aired June 9th. This is a 1-sided 10&quot; Emidisc that clocks in at over 14 minutes. It ends with a piece recorded by Kenny Everett's tape operator, Tony Olivestone. An edit of this recording was issued in Italy on Apple promo single DPR 108.\nContinuing with the Everett madness, we have included a rare 2-sided 8&quot; Apple acetate, &quot;Kenny Everett Musical Workshop,&quot; which contains various jingles and ads from his radio program, all done for The Tea Council. These serve as an advertisement for Kenny's commercial and jingle creation business, for which he gave out records to prospective clients.\n&quot;Across The Universe&quot; was originally recorded as early as February 1968 for inclusion as a single release (&quot;Lady Madonna&quot; was chosen instead). This was later used on the charity compilation album &quot;No One's Gonna Change Our World&quot; in December 1969. The basic recording was then remixed, overdubbed, slowed down and released on the &quot;Let It Be&quot; album. Presented here is an Emidisc acetate of the original 1968 recording, take 8 with no overdubs or speed variants. This disc was cut on February 8, 1968.\n&quot;Revolution 9&quot; was mixed for stereo on June 21 &amp; 25, 1968. Track 10 is an Apple mono 2-sided acetate. This unique mono mix also appeared on Vigotone's 'Revolution' CD in 1994, but it sounds a bit cleaner here.\nThe following two Apple acetates, &quot;Let It Be&quot; and &quot;The Long And Winding Road&quot; are the released takes, but sound like uncompressed mixes, with high dynamics as opposed to the official versions. [NOTE: These two recordings were brickwall limited and had no dynamics whatsoever!]\nThe last three tracks have been taken from a 'Cutting Room Inc.' 1-sided stereo acetate. The first two recordings have appeared on previous bootlegs over the years, most notably on &quot;What A Shame Mary Jane Had A Pain At The Party&quot;, a 12&quot; EP released in 1979 on a fake EMI label. For some unknown reason the third track was not included. Here, for the first time on CD, we have included that 'edit version' of &quot;What's The New Mary Jane&quot; [sourced from an mp3].\n[A bonus track of the stereo single edit of &quot;WTNMJ&quot; has been added to this version of the CD.]\n\nAll of the acetates were subjected to declicking by the folks at Unicorn, but thousands of thumps were left behind, and there are gaps in the waveforms where very large clicks used to be on some of the discs. Almost all of the thumps have been removed for this remastered edition, particularly those in the quiet parts. Some of them proved impossible to remove, as you could hear them but not see them. All the tracks sound as good as I could make them. No noise reduction was used. I think you will be pleased with the results.\n\nffp file and artwork are included.\n\nPlease preserve the lossless quality of this material.\n\nEnjoy!\n\nRemasters Workshop\nRMW 703","torrent":{"xt":"urn:btih:1d98885b7fb207e51fe8d664ac54e60de212918c","amp;dn":"The+Beatles+-+Acetate+Collection+%28Remastered+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d98885b7fb207e51fe8d664ac54e60de212918c","infoHashBuffer":{"type":"Buffer","data":[29,152,136,91,127,178,7,229,31,232,214,100,172,84,230,13,226,18,145,140]},"announce":[],"urlList":[]}}