{"title":"A Stranger to Myself: The Inhumanity of War: 1941-1944 -epub","uid":10310726,"size":1282356,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1da073566caf00c359c0068430157e9a1dbc8814&amp;dn=A+Stranger+to+Myself%3A+The+Inhumanity+of+War%3A+1941-1944+-epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1402176766,"description":"A Stranger to Myself: The Inhumanity of War: Russia, 1941-1944\n\n\n A Stranger to Myself: The Inhumanity of War, Russia 1941-44 is the haunting memoir of a young German soldier on the Russian front during World War II. Willy Peter Reese was only twenty years old when he found himself marching through Russia with orders to take no prisoners. \n\n Three years later he was dead. Bearing witness to--and participating in--the atrocities of war, Reese recorded his reflections in his diary, leaving behind an intelligent, touching, and illuminating perspective on life on the eastern front. He documented the carnage perpetrated by both sides, the destruction which was exacerbated by the young soldiers' hunger, frostbite, exhaustion, and their daily struggle to survive. And he wrestled with his own sins, with the realization that what he and his fellow soldiers had done to civilians and enemies alike was unforgivable, with his growing awareness of the Nazi policies toward Jews, and with his deep disillusionment with himself and his fellow men.\n\n An international sensation, A Stranger to Myself is an unforgettable account of men at war. \n\n","torrent":{"xt":"urn:btih:1da073566caf00c359c0068430157e9a1dbc8814","amp;dn":"A+Stranger+to+Myself%3A+The+Inhumanity+of+War%3A+1941-1944+-epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1da073566caf00c359c0068430157e9a1dbc8814","infoHashBuffer":{"type":"Buffer","data":[29,160,115,86,108,175,0,195,89,192,6,132,48,21,126,154,29,188,136,20]},"announce":[],"urlList":[]}}