{"title":"Doctor Who - Season 14 - (1976-77) - 26 Episodes","uid":9119332,"size":4828948659,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1df80891e80302ddb878dc4c31553ea2597630e4&amp;dn=Doctor+Who+-+Season+14+-+%281976-77%29+-+26+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":5,"uploader":"bnaron","files":26,"time":1383094897,"description":"The fourteenth season of British science fiction television series Doctor Who began on 4 September 1976 with The Masque of Mandragora, and ended with The Talons of Weng-Chiang.\n\nTom Baker continues his roles as The Fourth Doctor. Sarah Jane Smith (Elisabeth Sladen) departs partway through the season in The Hand of Fear. As Sarah Jane was effectively the only tie the Doctor had to UNIT at this point, he no longer had a reason to return to his former job following her departure. In between the two serials, the Doctor has a solo adventure in The Deadly Assassin. The Doctor is then joined by Leela played by Louise Jameson in The Face of Evil.\n\nThe Master reappears in The Deadly Assassin, his first appearance since Frontier in Space (1973), this time played by Peter Pratt. The character would not make a further appearance until five years later in 1981.\n\nThe Masque of Mandragora saw the debut of the new wood paneled &quot;Secondary Console Room&quot; set, which was to be used as the main TARDIS console room throughout the season. The season took a five-week transmission break between the broadcasts of The Deadly Assassin and The Face of Evil in order to extend the season further into 1977, allowing Robert Holmes time to work on the final serial The Talons of Weng-Chiang.[1]\n\n1.  The Masque of Mandragora - Four Episodes\n\n    Synopsis: An encounter with the living energy structure known as the\n    Mandragora Helix leads the TARDIS to 15th century Italy. \n\n2.  The Hand of Fear - Four Episodes\n\n    Synopsis: The Doctor and Sarah are caught in a mining explosion. Sarah is\n    found clutching what appears to be a fossilized hand, buried in a\n    150-million-year-old stratum. \n\n3.  The Deadly Assassin - Four Episodes\n\n    Synopsis: The Doctor returns to his home world, Gallifrey. When the\n    President of the High Council is assassinated, however, he becomes the\n    prime suspect. \n\n4.  The Face of Evil - Four Episodes\n\n    Synopsis: The Doctor arrives on a planet where two tribes are at war and\n    discovers that their god of evil is himself. \n\n5.  The Robots of Death - Four Episodes\n    NOTE: There is a Special Edition of this serial which was released as part\n    of the Revisitations 3 box set., but I do not think the one included here\n    is that version.\n\n    Synopsis: A vessel is commanded by a crew of indolent or avaricious human\n    staff. It is a happy partnership until the human crew start being murdered\n    one by one. \n\n6.  The Talons of Weng-Chiang - Six Episodes\n\n    Synopsis: The Doctor and Leela arrive in London so that Leela can learn\n    about the customs of her ancestors, specifically the musical theater of\n    Victorian England.\n\n","torrent":{"xt":"urn:btih:1df80891e80302ddb878dc4c31553ea2597630e4","amp;dn":"Doctor+Who+-+Season+14+-+%281976-77%29+-+26+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1df80891e80302ddb878dc4c31553ea2597630e4","infoHashBuffer":{"type":"Buffer","data":[29,248,8,145,232,3,2,221,184,120,220,76,49,85,62,162,89,118,48,228]},"announce":[],"urlList":[]}}