{"title":"Unveiling the Kings of Israel - David Down","uid":11773257,"size":30913462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e1208af9566aac506a4b0b554a328f9c719a97b&amp;dn=Unveiling+the+Kings+of+Israel+-+David+Down&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427160132,"description":"\nCorrectly interpreted, the historical records of Egypt and Israel show a remarkable consistency with the Bible records which we can accept as not only inspiring but entirely reliable. - From the Introduction\n\nUnearth the history of the small nation of Israel the troubled and devastating periods of loss and exile once lost to time. Far from being a book of myths, the Bible is an amazing historical record, and each year, more archaeological discoveries continue to prove its validity and significance. Follow the intriguing clues found buried in ancient cities, on the walls of early monuments, and in the written records of our world s oldest civilizations. Walk the ancient streets, explore the distant temples, and unearth the compelling history that continues to resonate with the world today.\n\n-Cultural references proven through artifacts and archives displayed in full color\n-Fascinating accounts that fill in some of history s unwritten record\n-Follow the Biblical timeline through detailed photos and examples\n\n\nAbout the author:\nBorn in 1919 in Australia, David Down's first encounter with archeology was in Melbourne during WWII. The lecturer at a public meeting spoke of Daniel and the nations of Babylon and Medo-Persia in the Bible. David at first thought the Bible to be unlikely to be historically accurate and was surprised to find secular references to the same nations. He attended other lectures and was converted to faith in Christ.\n\nHe moved into the study of Archeology when he was a missionary to India and had a chance to take his family to visit Israel by car. He camped in Babylon and visited other Biblical sites during a seven month trip. Later as he was teaching Archeology he found several areas where the standard chronology (especially the Egyptian chronology) did not fit with Biblical data. Examples given were that Solomon's era was thought to be a time of poverty and the Pharaoh of the Exodus (Amenhotep II) was a mummy in the Cairo Museum rather than at the bottom of the Red Sea. Then, when he read The Exodus Problem and Its Ramifications by Dr. Donovan Courville, he realized that the possible revised Egyptian chronology would solve most of the chronological problems.\n\nDown feels that his familiarity with the Bible and awareness of the revised chronology gives him advantages in understanding the sites he is excavating and in interpreting artifacts","torrent":{"xt":"urn:btih:1e1208af9566aac506a4b0b554a328f9c719a97b","amp;dn":"Unveiling+the+Kings+of+Israel+-+David+Down","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e1208af9566aac506a4b0b554a328f9c719a97b","infoHashBuffer":{"type":"Buffer","data":[30,18,8,175,149,102,170,197,6,164,176,181,84,163,40,249,199,25,169,123]},"announce":[],"urlList":[]}}