{"title":"Fable 3 Unlocking DLC files","uid":8775518,"size":32709,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1e14f3df1bac7e1d9fad9c329eb6af7431d140be&amp;dn=Fable+3+Unlocking+DLC+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kamianbu","files":1,"time":1375547338,"description":"Since these files are very rare and the slightly 'hint' of them are either on russian sites or websites that you wouldn't even consider downloading from, let alone actually going to them.\n\nBefore I get onto the list of the items within this. This does not include the xlive.dll, fakexlive.ini or any of the dlc files that are needed for this all to work. Search thepiratebay for all the DLC (it isn't hard) or another torrent site if the ones on thepiratebay aren't seeded any longer.\n\nNote: This 'version' does not have the (traitor's keep) dlc in the package_collection_info.xmb. So if you have it, you'll have to merge the two together...\n\nSo first and foremost, what is in this:\n\nPackage_collection_info.xmb\n\n(This has all the free dlc + the unlockdlc.bnk files written in it for the game to read) This is all ready to be placed in your content folder or mod0 folder. Whichever way you have it set up.\n\n\n2 Versions of the UnlockDLC.bnk files.\n\n1 Version of the UnlockDLC.bnk files are to immediately unlock all the free dlc goodies... or almost all of them.\n\n(Unlocks may vary from using the 'content' folder or the Mod0 folder) I haven't tried the mod0 way yet, so I don't know.\n\n1 Version is to 'support' the DLC unlocks.\n\nWhy? Because if you keep the 'unlock immediately version' in the content or mod0 area, it will continuously give it to you... which does get annoying and Fable 3 won't let you load your save game if you remove the UnlockDLC.bnk.\n\nSo, the Support version is kind of an 'image' It makes Fable 3 happy and let's you load your save game un-bothered, but doesn't nothing otherwise.\n\nAdditional Notes: This 'has' the possibility to unlock the paid dlc's (Traitor's keep and Understone) but I haven't arranged my game to try and unlock them. I'll probably do that later\n\nIt 'might' unlock both of the above DLC's or it might not, I simply don't know at the moment. It's up to you to decide if you want to try to unlock them or not.","torrent":{"xt":"urn:btih:1e14f3df1bac7e1d9fad9c329eb6af7431d140be","amp;dn":"Fable+3+Unlocking+DLC+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e14f3df1bac7e1d9fad9c329eb6af7431d140be","infoHashBuffer":{"type":"Buffer","data":[30,20,243,223,27,172,126,29,159,173,156,50,158,182,175,116,49,209,64,190]},"announce":[],"urlList":[]}}