{"title":"Mourning Becomes Electra [1947] Eugene ONeill","uid":6684759,"size":735308010,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1e1b5b4145a7ea7dc96fdfea62efb6398573b6fa&amp;dn=Mourning+Becomes+Electra+%5B1947%5D+Eugene+ONeill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1316358617,"description":" &lt;a href=&quot;http://bayimg.com/GakGaaAdb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/GakGaaAdb&lt;/a&gt;\n\nMourning Becomes Electra (1947) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0039636/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0039636/&lt;/a&gt;\n\nDOWNLOADED FROM CINEMAGEDDON.NET\n\nMourning Becomes Electra is a play cycle written by American playwright Eugene O'Neill. The play premiered on Broadway at the Guild Theatre on 26 October 1931 where it ran for 150 performances before closing in March 1932. In May 1932, it was revived at the Alvin Theatre (now the Neil Simon Theatre), and in 1972 at the Circle in the Square Theatre.\n\nThe story is an update of the Greek myth of Orestes to the family of a Northern general in the American Civil War. Agamemnon is now General Ezra Mannon, Clytemnestra is his second wife Christine, Orestes is his son Orin, and Electra is his daughter Lavinia. As an updated Greek tragedy, the play features murder, adultery, incestuous love and revenge, and even a group of townspeople who function as a kind of Greek chorus. Though fate alone guides characters' actions in Greek tragedies, O'Neill's characters have motivations grounded in 1930s-era psychological theory as well. The play can easily be read from a Freudian perspective, paying attention to various characters' Oedipus complexes and Electra complexes.\n\nMourning Becomes Electra is divided into three plays with themes corresponding to The Oresteia trilogy by Aeschylus. In order, the three plays are titled Homecoming, The Hunted, and The Haunted. However, these plays are normally not produced individually, but only as part of the larger trilogy. Each of these plays contain four to five acts, and so Mourning Becomes Electra is extraordinarily lengthy for a drama. In production, it is often cut down. Also, because of the large cast size, it is not performed as often as some of O'Neill's other major plays.\n\nIn 1947 the play was adapted for film by Dudley Nichols, starring Rosalind Russell, Michael Redgrave, Raymond Massey, Katina Paxinou, Leo Genn and Kirk Douglas. It was nominated for Academy Awards for Best Actor in a Leading Role (Michael Redgrave) and Best Actress in a Leading Role (Rosalind Russell). There was also a 1978 television miniseries production that aired on PBS and that starred Joan Hackett and Roberta Maxwell.\n\nMourning Becomes Electra (1947) marked Rosalind Russell's second major dramatic role - and second Best Actress Oscar nomination - in a row after Sister Kenny (1946). Writer-director Dudley Nichols, who had agreed to make Sister Kenny at Russell's urging, asked her to return the favor with his three-hour version of the Eugene O'Neill drama, which had run six hours onstage. Nichols knew O'Neill personally and idolized him.\n\nInspired by the &quot;Oresteia&quot; trilogy by Aeschylus, Mourning Becomes Electra sets the tragic action in 1865 Massachusetts, with Russell cast as Lavinia, a Civil War-era Electra. Raymond Massey plays the patriarch of the murderous family, with Greek actress Katina Paxinou as his wife and British actor Michael Redgrave as Lavinia's brother. Leo Genn costars as a sea captain who has an affair with Paxinou, setting off a spiral of bloody violence. Kirk Douglas, in his second film, appears in a supporting role. Redgrave, in his Hollywood debut, also was nominated for an Oscar, as Best Actor.\n\nRussell wrote in her autobiography that she would have preferred playing Paxinou's part, with Olivia de Havilland as Lavinia. Nichols insisted, however, that Russell take on the younger role. From all reports, the international cast was ill at ease during filming. Russell wrote that Redgrave was &quot;a hell of a good actor, but nervous, taking pills to calm himself.&quot; In his autobiography, Redgrave sniped in turn that Russell was &quot;an excellent comedienne,&quot; but &quot;Mourning did not become her.&quot; Redgrave added that, &quot;On the first day of shooting, she greeted me with 'Hi, Michael!' I hear you dig deep into your part. Not me, I'm afraid. I like to have a laugh with the boys in the gantry, know what I mean?&quot; Redgrave, with typical British reserve, wrote that he &quot;thought it wiser not to pursue this too far.&quot; Redgrave unintentionally offended neophyte Kirk Douglas by giving him a gag gift - an old theatrical pamphlet offering advice to aspiring actors about how to treat their more experienced colleagues. Meantime, according to Russell, the volatile Paxinou was &quot;screaming and yelling all over the set.&quot; Russell summed up the filming experience: &quot;It was murder.&quot;\n\nDespite some excellent reviews and awards (the National Board of Review Best Actor award for Redgrave, a Golden Globe for Russell), Mourning Becomes Electra was a major disappointment at the box office, losing almost $3 million after all receipts were counted. The most expensive project RKO had ever attempted, this &quot;prestige&quot; black-and-white film was first released as a road-show attraction with an intermission, then trimmed by 25 minutes for the rest of its initial release. Still, it remained a personal victory for Russell, who wrote that she &quot;received a rare, handwritten note from Eugene O'Neill telling me how he loved my performance as Lavinia.&quot; By the time Oscar season rolled around, it seemed that Russell's chances were excellent.\n\nThe campaign to win Russell the Oscar that had eluded her the year before was masterminded by publicist Henry Rogers, who had mounted successful Best Actress campaigns for two years running, for Joan Crawford (Mildred Pierce, 1945) and Olivia de Havilland (To Each His Own, 1946). Among Rogers' tactics was having a casino in Las Vegas post odds on the Oscar race, with Russell favored at 6-5. A few days before the awards, a Daily Variety poll also predicted an easy win for Russell.\n\nOn the night of the Oscars, even presenter Fredric March seemed prepared to speak Russell's name as Best Actress. He saw with a shock that the winner was instead Russell's close friend Loretta Young, for the comedy The Farmer's Daughter - a lightweight role Russell had turned down, according to The Hollywood Reporter. Louella Parsons recalled that she was &quot;seated directly behind Rosalind. . . Never as long as I live will I forget that almost involuntary motion she made of leaning forward, almost rising from her seat.&quot; Although obviously disappointed, Russell proved to be a good sport and showed up at the post-awards party, where she embraced Young for photographers. \n\nProducers: Dudley Nichols, Edward Donahue (associate)\nDirector: Dudley Nichols\nScreenplay: Dudley Nichols, from play by Eugene O'Neill\nCinematography: George Barnes\nProduction Design: William Flannery\nCostume Design: Travis Banton, Gile Steele\nOriginal music: Richard Hageman \nEditing: Roland Gross, Chandler House\nPrincipal Cast: Rosalind Russell (Lavinia Mannon), Michael Redgrave (Orin Mannon), Raymond Massey (Brig. Gen. Ezra Mannon), Katina Paxinou (Christine Mannon), Leo Genn (Adam Brant), Kirk Douglas (Peter Niles), Nancy Coleman (Hazel Niles), Henry Hull (Seth Beckwith), Sara Allgood (Landlady).\n","torrent":{"xt":"urn:btih:1e1b5b4145a7ea7dc96fdfea62efb6398573b6fa","amp;dn":"Mourning+Becomes+Electra+%5B1947%5D+Eugene+ONeill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e1b5b4145a7ea7dc96fdfea62efb6398573b6fa","infoHashBuffer":{"type":"Buffer","data":[30,27,91,65,69,167,234,125,201,111,223,234,98,239,182,57,133,115,182,250]},"announce":[],"urlList":[]}}