{"title":"Transformers Fall of Cybertron Language Selector incl Crackfix-S","uid":9480800,"size":28765267,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1e23889521e87e44e87221b5a931056807e5a89f&amp;dn=Transformers+Fall+of+Cybertron+Language+Selector+incl+Crackfix-S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sonywo","files":6,"time":1389794041,"description":"[img]http://dyncdn.me/posters2/4/462716fae785219fe82c7d59777511345050439e.jpg[/img]\n\nTransformers: Fall of Cybertron Language Selector incl Crackfix \n\n26-08-2012....Release Date                 Protection.............Steam + CEG\nAction...........Game Type                      Disk(s).............CRACKFIX + DOX \n\nCRACKFIX NOTES \n\nNot so much to say, rather than we're so sorry for the last days of rampage and troubles our latest cracks have caused. This should fix it! \n\nLanguage Selector Notes: Run TFOC.Language.Selector.exe and install the language of your choice. Enjoy! \n\nCrackfix Notes: Replace all files with the content from SKIDROW folder! \n\nRELEASE NOTES \n\nTransformers: Fall of Cybertron transports you to the final days of the planet Cybertron where you will experience the darkest hours of the apocalyptic war between the AUTOBOTS and DECEPTICONS. Embark on an adrenaline-fueled journey through a wide range of missions and massive environments designed around each characterÂ’s unique abilities. With the stakes higher than ever before, you play as a variety of Transformers characters, including Grimlock's nearly indestructible T-Rex form and the legendary Combaticons forming into the colossal Bruticus. Fight through both sides of the TransformersÂ’ most epic battles leading to their legendary exodus from their homeworld. TransformersÃ‚â„¢: Fall of CybertronÃ‚â„¢ allows you to go head-to-head as AUTOBOTS and DECEPTICONS with its multi-player online mode. Create your own personalized character and weaponry with the most advanced and in-depth customization ever before seen in a Transformers video game. \n\nINSTALL NOTES\n\n1. Mount or burn image (Game Not Included) \n2. Install \n3. Copy everything from the SKIDROW folder into the game installation \n4. Play the game \n5. Support the companies, which software you actually enjoy!","torrent":{"xt":"urn:btih:1e23889521e87e44e87221b5a931056807e5a89f","amp;dn":"Transformers+Fall+of+Cybertron+Language+Selector+incl+Crackfix-S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e23889521e87e44e87221b5a931056807e5a89f","infoHashBuffer":{"type":"Buffer","data":[30,35,136,149,33,232,126,68,232,114,33,181,169,49,5,104,7,229,168,159]},"announce":[],"urlList":[]}}