{"title":"A Date With Judy (1948) Xvid 1cd -  Subs-Eng-Francais-Jane Powel","uid":11335245,"size":926298499,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1eae6d1d0de9ccd26ec38e87e11c3f8d062383b4&amp;dn=A+Date+With+Judy+%281948%29+Xvid+1cd+-++Subs-Eng-Francais-Jane+Powel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"SaM","files":-1,"time":1414721786,"description":"A Date With Judy (1948) Xvid 1cd -  Subs-Eng-Francais-Jane Powell, Elizabeth Taylor [DDR]\n\nA Date with Judy is a 1948 MGM musical film starring Wallace Beery, Jane Powell, and Elizabeth Taylor. Directed by Richard Thorpe, the movie was based on the radio series of the same name.\nThe film was photographed in Technicolor and largely served to showcase the former child star Elizabeth Taylor, age 16 at the time. Taylor was given the full MGM glamor treatment, including specially designed gowns.\nRobert Stack appears in a prominent supporting part. Many others in the MGM stock company appear in their customary roles, including Leon Ames as a dignified father figure, the same role he played in the Judy Garland film Meet Me in St. Louis (1944) and Wallace Beery in his penultimate role as a contrasting &quot;rough and ready&quot; father figure.\nThe film features the soprano singing voice of young Jane Powell, and is also a showcase for the musical performances of the Latin American singer Carmen Miranda and bandleader Xavier Cugat. In this film, she is given to humorous malapropisms such as &quot;His bite is worse than his bark&quot; and &quot;Now I'm cooking with grass&quot;. The songs &quot;Judaline&quot; and &quot;It's a Most Unusual Day&quot; also debuted in this film.\n\n    CAST:-\n    Wallace Beery as Melvin R. Foster\n    Jane Powell as Judy Foster\n    Elizabeth Taylor as Carol Pringle\n    Carmen Miranda as Rosita Cochellas\n    Xavier Cugat as Himself\n    Robert Stack as Stephen Andrews\n    Scotty Beckett as Ogden &quot;Oogie&quot; Pringle\n    Selena Royle as Mrs. Foster\n    Leon Ames as Lucien T. Pringle\n    Clinton Sundberg as Jameson\n    George Cleveland as Gramps\n    Lloyd Corrigan as &quot;Pop&quot; Sam Scully\n    Jerry Hunter as Randolph Foster\n    Jean McLaren as Mitzi Hoffman\n\nDirected by Richard Thorpe\nProduced by Joe Pasternak\nWritten by Dorothy Cooper\nMusic by Ernesto Lecuona\nRunning time 113 minutes\n\nMOVIE PLOT:- A Date With Judy (1948)\nThe big high school dance in Santa Barbara is coming up. Judy Foster (Jane Powell) expects boyfriend &quot;Oogie&quot; Pringle to be her escort, but he declines. Meanwhile, Oogie's sister, sophisticated senior Carol Pringle (Elizabeth Taylor), has booked famous bandleader Xavier Cugat and his orchestra for the dance.\n\nCugat's lady friend, Rosita Cochellas (Carmen Miranda), is a dance instructor. She is secretly giving rumba lessons to Judy's dad, Melvin Foster (Wallace Beery), who wants to surprise his wife with a dance for their upcoming wedding anniversary.\n\nSoda shop owner Pop Scully (Lloyd Corrigan) introduces a disappointed Judy to his handsome nephew Stephen I. Andrews (Robert Stack), who volunteers to take Judy to the dance, even though he's considerably older. Judy finds him dreamy, and having Stephen as her date definitely makes Oogie jealous.\n\nStephen, however, falls for the beautiful Carol instead. This is annoying to Judy, as is her discovery that her dad is seeing Rosita behind her mother's back, presumably carrying on a romantic affair. Misunderstandings abound, including Rosita trying to explain the situation to her boyfriend, Cugat.\n\nDuring the dance scene in which Mrs. Foster dances with Xavier Cugat, the song is the instrumental version of &quot;The Walter Winchell Rumba&quot;, which Cugat and his band played during their normal gigs. The words, can be heard during a PBS Lawrence Welk show called, &quot;The New York Show&quot; by Gail, Sandy, and Marylou.\n\nPROUCTION NOTES:-\nAlthough Xavier Cugat is credited in the opening credits as &quot;Xavier Cugat and His Orchestra,&quot; the end credits simply bill Cugat as &quot;Himself.&quot; The A Date with Judy radio show ran from 1941 to 1949 on the NBC network, and from 1949 to 1950 on the ABC network. The character of &quot;Judy Foster&quot; was portrayed on the radio by Dellie Ellis, Louise Erickson and Ann Gillis. Pre-production news items in HR indicate that actor Thomas E. Breen was originally set to co-star in the film with Jane Powell, and that Leslie Kardos was set to direct. A Dec 1947 HR news item notes that Selena Royle replaced Mary Astor, who withdrew from the film due to illness. A contemporary HR news item lists Marcia Van Dyke in the cast, but her appearance in the released film has not been confirmed. A biography of director Vincente Minnelli notes that a musical number entitled Mulligatawny, which was created by Stanley Donen, was cut from the film before its release. Actress Patricia Crowley portrayed &quot;Judy Foster&quot; in the ABC television series A Date with Judy , which ran from 1951 to 1953.\n\nMOVIE RECEPTION:-\nThe film was a hit, earning $3,431,000 in the US and Canada and $1,155,000 elsewhere resulting in a profit of $1,495,000.\n&quot;Jane Powell was used to playing good-girl types, but for Elizabeth Taylor A Date With Judy represented a chance to build a whole new image. The role of sultry bad-girl Carol in the film gave her the opportunity to show the world that she was no longer a child, but a beautiful young woman. A direct contrast to Powell's girlish wholesomeness, Taylor's character was more mature, and costumes and makeup strategically played up her sensuality (...) Musical number highlights in A Date With Judy include the popular &quot;It's a Most Unusual Day&quot; and &quot;Judaline.&quot; However, it's the &quot;Brazilian Bombshell&quot; Carmen Miranda who nearly steals the show in a supporting role as rhumba teacher Rosita. Her energetic rendition of &quot;Cuanto Le Gusta&quot; alone makes watching A Date With Judy worthwhile.&quot; said Andrea Passafiume of the Turner Classic Movies \n\n    SOUNDTRACKS:-\n    Judaline ... Performed by Jane Powell, Scotty Beckett &amp; Quartet\n    Its a Most Unusual Day ... Performed by Jane Powell\n    I'm Strictly on the Corny Side ... Performed by Jane Powell &amp; Scotty Beckett\n    Love Is Where You Find It ... Performed by Jane Powell\n    Its a Most Unusual Day ... Performed by Elizabeth Taylor (Dubbed by Jean McLaren)\n    Swing Low, Sweet Chariot ... Performed by Lillian Yarbo\n    Smiling Through The Years ... Performed by Jane Powell &amp; George Cleveland\n    Love Is Where You Find It (Reprise) ... Performed by Jane Powell\n    Home Sweet Home ... Performed by Jane Powell, Jerry Hunter &amp; Selena Royle\n    Cooking With Gas ... Performed by Carmen Miranda with Xavier Cugat and His Orchestra\n    Marguerita ... Performed by Xavier Cugat and His Orchestra\n    Cuanto La Gusta ... Performed by Carmen Miranda with Xavier Cugat and His Orchestra\n \nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 598 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  1\nAudio Languages: English\nRunTime 113 mins\nSubtitles: English, Francais\nRipped by: Trinidad [DDR","torrent":{"xt":"urn:btih:1eae6d1d0de9ccd26ec38e87e11c3f8d062383b4","amp;dn":"A+Date+With+Judy+%281948%29+Xvid+1cd+-++Subs-Eng-Francais-Jane+Powel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eae6d1d0de9ccd26ec38e87e11c3f8d062383b4","infoHashBuffer":{"type":"Buffer","data":[30,174,109,29,13,233,204,210,110,195,142,135,225,28,63,141,6,35,131,180]},"announce":[],"urlList":[]}}