{"title":"Gramophone magazine - September 2014 [classical music]","uid":10864978,"size":28415542,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f26523892f6afe3e3e5ac03506f78dfb8e4e31d&amp;dn=Gramophone+magazine+-+September+2014+%5Bclassical+music%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"workerbee","files":-1,"time":1408911116,"description":"\nGramophone magazine (September 2014)\n\nISSN: 0017-310X | 148 pages | PDF\n\n\nGRAMOPHONE is a magazine published monthly in London and devoted to classical music, particularly recordings. Packed with features across all classical music genres, its globally acclaimed writers inform and entertain you with independent and intelligent editorial and more than 150 reviews in every issue. Gramophone's reputation is founded on its acclaimed critical analyses of the latest CD releases, in-depth features and interviews with classical stars, and its comprehensive coverage of recorded and live music.\n\nIN THE SEPTEMBER ISSUE:\n\n* Lindsay Kemp attends recording sessions of conductor Niklous Harnoncourt and pianist Lang Lang in Vienna, two of the most distinctive and influential musicians in the world today;\n\n* Gramophone Awards Shortlist -- we reveal the top three discs in each of the 12 recording categories;\n\n* Harriet Smith interviews Gramophone Award-winning pianist Jean-Efflam Bavouzet as he records Haydn's piano concertos;\n\n* Conductor Harry Christophers takes Lindsay Kemp on a guided tour of the score of Handel's oratorio &quot;Jephtha&quot;;\n\n* Philip Clark surveys the recordings and career of that most graceful of maestros, Seiji Ozawa;\n\n* Richard Whitehouse admires the single-minded musical style of composer Augusta Read Thomas;\n\n* Karajan's 1962 recording of Beethoven's Ninth Symphony is the subject of a fascinating discussion between Philip Clark and Peter Quantrill;\n\n* and Gramophone's Season Preview, the essential guide to the best live music-making around the world in 2014-15.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                            &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:1f26523892f6afe3e3e5ac03506f78dfb8e4e31d","amp;dn":"Gramophone+magazine+-+September+2014+%5Bclassical+music%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f26523892f6afe3e3e5ac03506f78dfb8e4e31d","infoHashBuffer":{"type":"Buffer","data":[31,38,82,56,146,246,175,227,227,229,172,3,80,111,120,223,184,228,227,29]},"announce":[],"urlList":[]}}