{"title":"gaytanamo dark alley media gay porn fetish","uid":4080223,"size":1194639830,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1f8ef827015a626038062957528015ea2e4b7682&amp;dn=gaytanamo+dark+alley+media+gay+porn+fetish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"wandal-kr","files":1,"time":1205526372,"description":" &lt;a href=&quot;http://www.gayemart.com/-/gay_adult_dvd_product_info/filmid=GDVD03082.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.gayemart.com/-/gay_adult_dvd_product_info/filmid=GDVD03082.html&lt;/a&gt;\ngpqec\n\nAdult Video Product Details\nWhen unsuspecting German tourist Danny Fox is mistaken for a terrorist, he finds himself abducted and taken to the sexiest secret military detention center ever. Under the rule of the despotic Violator, Gaytanamo proves to be full of torture techniques not approved by the Geneva Convention.\n\nCritically-acclaimed director Matthias von Fistenberg brilliantly blends rough, hardcore fucking with Dark Alley&amp;#039;s trademark sense of humor and surprise to create a fantasy space both intensely arousing and entertaining. With five scenes and a cast of ten, it&amp;#039;s vintage Dark Alley, reminiscent of the award-winning Mutiny!\n\nDirector: Matthias Von Fistenberg\n\nFeaturing: Danny Fox, Demetrius, Dominik Rider, Jason Tyler, Matthias Von Fistenberg, Owen Hawk, Sebastian Cruz, Tim Rusty, Tony Diamond, Violator\n\nRating: Content: \nFeatures &amp; Extras\n\n    * No Regional Coding - Playable Worldwide\n    * Digitally Remastered for DVD\n\n    * 16:9 Wide Screen Format\n    * Shot In High Definition (HD) For The Purest Quality Imaginable\n\n \n \nReviews\nDVD: In this humor-laced indictment on the military, Danny Fox plays a German tourist who gets mistaken for a terrorist and kidnapped by masked men. He wakes up at the mercy of Violator, who concocts torture schemes with Owen Hawk, who is always hard and ready ? his pounding of Dominik Rider and Jason Tyler are highlights. Also strong is the closer, where Fox is shoved into a cell and the horny Sebastian Cruz makes him his bitch. The scene starts with some great, hard oral action. There?s a fun, nasty attitude here that has become the studio?s trademark. The bonus disc has interviews and three extras scenes: Matthias Von Fistenberg fisting Demetrius, Tony Diamond fucking Demetrius, and Violator administering some electro-torture to Fox.\nWritten by: Brady Jansen for AVN Magazine","torrent":{"xt":"urn:btih:1f8ef827015a626038062957528015ea2e4b7682","amp;dn":"gaytanamo+dark+alley+media+gay+porn+fetish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f8ef827015a626038062957528015ea2e4b7682","infoHashBuffer":{"type":"Buffer","data":[31,142,248,39,1,90,98,96,56,6,41,87,82,128,21,234,46,75,118,130]},"announce":[],"urlList":[]}}