{"title":"Steve Earle - Townes 2009 [FLAC] - Kitlope","uid":4917076,"size":315202404,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1fafc66b30e027c3df4531fae8dddace13b197ed&amp;dn=Steve+Earle+-+Townes+2009+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Kitlope","files":19,"time":1243474626,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 1FAFC66B30E027C3DF4531FAE8DDDACE13B197ED\nFile Size: 300.60 Mb\nYear: 2009\nLabel: New West\nCatalog #: NW6164\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\n\nStephen 'Steve' Fain Earle (pronounced /Ã‹Ë†Ã‰Å“rl/) is an American singer-songwriter known for his rock and country music as well as his political views. He is also a published writer, a political activist and has written and directed a play. When he first came to prominence in 1986, he was viewed as a savior of country music (along with the likes of Randy Travis and Dwight Yoakam) and hailed by some as the &quot;new Bruce Springsteen.&quot; In the later part of his career, after troubles with the law, drug addiction and his uncompromising viewpoints, he has become known as &quot;the hardcore troubadour&quot;.\n\nStephen Fain Earle was born on January 17, 1955, at Fort Monroe in Hampton, Virginia.\nHe is the eldest son of Jack Earle, an air traffic controller, and Barbara Earle. Although his parents moved around the U.S. often during his childhood, he spent several of his formative years in Schertz, Texas. He dropped out of school in the 9th grade to move to Houston and learn more about the music business. Earle released his first album, Guitar Town, in 1986. His sister, Stacey Earle, is a musician herself, having toured with Steve in the 1990s and sung on the song &quot;When I Fall&quot; on Steve's 2000 album Transcendental Blues.\nEarle has been married seven times, including twice to the same woman. His wives were Sandra (Sandy) Henderson, Cynthia Dunn, Carol Hunter (with whom he had his first child, Justin), Lou-Anne Gill (with whom he had a second son, Ian), Maria Teresa Ensenat, Lou-Anne Gill a second time, and finally, in 2005, singer-songwriter Allison Moorer. His first son, Justin Townes Earle, is also a musician, and is named for Townes Van Zandt.\n\n\n\n\n\nTownes 2009\n\n\n\nTownes is a 2009 Steve Earle album on which he pays tribute to his friend and mentor, the late singer-songwriter Townes Van Zandt by covering his songs.[1] According to a New West Records press release, &quot;The songs selected for Townes were the ones that meant the most to Earle and the ones he personally connected to (not including selections featured on previous Earle albums). Some of the selections chosen were songs that Earle has played his entire career ('Pancho &amp; Lefty', 'Lungs', 'White Freightliner Blues') and others he had to learn specifically for recording.[2]\n\nNotable guest appearances on the album are to include Tom Morello (of Rage Against the Machine/The Nightwatchman/Street Sweeper) playing electric guitar on &quot;Lungs&quot;, and Earle's wife Allison Moorer singing backing vocals on &quot;Loretta&quot; and &quot;To Live is to Fly&quot;. Earle and his son, Justin Townes Earle trade verses on &quot;Mr. Mudd &amp; Mr. Gold&quot;.[2]\n\n\nTracks: \n\n\n1.\t&quot;Pancho &amp; Lefty&quot;\n2.\t&quot;White Freightliner Blues&quot;\n3.\t&quot;Colorado Girl&quot;\n4.\t&quot;Where I Lead Me&quot;\n5.\t&quot;Lungs&quot;\n6.\t&quot;No Place To Fall&quot;\n7.\t&quot;Loretta&quot;\n8.\t&quot;Brand New Companion&quot;\n9.\t&quot;Rake&quot;\n10.\t&quot;Delta Momma Blues&quot;\n11.\t&quot;Marie&quot;\n12.\t&quot;Don't Take It Too Bad&quot;\n13.\t&quot;Mr. Mudd &amp; Mr. Gold&quot;\n14.\t&quot;(Quicksilver Daydreams Of) Maria&quot;\n15.\t&quot;To Live Is To Fly&quot;\n\n\n\nEnjoy this new release :)\n","torrent":{"xt":"urn:btih:1fafc66b30e027c3df4531fae8dddace13b197ed","amp;dn":"Steve+Earle+-+Townes+2009+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fafc66b30e027c3df4531fae8dddace13b197ed","infoHashBuffer":{"type":"Buffer","data":[31,175,198,107,48,224,39,195,223,69,49,250,232,221,218,206,19,177,151,237]},"announce":[],"urlList":[]}}