{"title":"Pope Francis - The Joy of the Gospel (epub, mobi)","uid":9254721,"size":1277322,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:207fa312d5d032ae0b99602b6204f0c01a171418&amp;dn=Pope+Francis+-+The+Joy+of+the+Gospel+%28epub%2C+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1385529803,"description":"Pope Francis - Apostolic Exhortation Evangelii Gaudium: The Joy of the Gospel (Vatican, 2013).\n\n\nEpub and mobi files converted from Vatican webpage. Quick and dirty conversion: most formatting retained, external table of contents added, but footnote links vanished in the conversion.\n\n\ndescription from news sources:\n\nEight months into his headline-grabbing papacy, Pope Francis issued a wide-ranging manifesto Tuesday in which he sharply criticizes the excesses of capitalism and says he wants a decentralized Roman Catholic Church that is &quot;bruised, hurting and dirty because it has been out on the streets.&quot;\n\nFrancis' 84-page Apostolic Exhortation, titled &quot;The Joy of the Gospel,&quot; gathers together a number of the causes he has championed in speeches and homilies since being elected in March, including the need for &quot;a conversion of the papacy,&quot; to reverse the &quot;excessive centralization.&quot;\n\nWhile not offering new doctrine, the exhortation offers the best summation yet of the pope's priorities and passions. He writes that there are &quot;two great issues which strike me as fundamental at this time in history.... These issues are first, the inclusion of the poor in society, and second, peace and social dialogue.&quot;\nCharacterized by Francis' trademark conversational tone, the document is his first real written work as pope.","torrent":{"xt":"urn:btih:207fa312d5d032ae0b99602b6204f0c01a171418","amp;dn":"Pope+Francis+-+The+Joy+of+the+Gospel+%28epub%2C+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"207fa312d5d032ae0b99602b6204f0c01a171418","infoHashBuffer":{"type":"Buffer","data":[32,127,163,18,213,208,50,174,11,153,96,43,98,4,240,192,26,23,20,24]},"announce":[],"urlList":[]}}