{"title":"The BIBLE CODE","uid":6210126,"size":11236893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:208b8ea9b7ccaaaf5bff58a0d43062013d787f31&amp;dn=The+BIBLE+CODE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MANTESH","files":2,"time":1298955177,"description":" &lt;a href=&quot;http://i1130.photobucket.com/albums/m521/cikachuno/0684810794.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i1130.photobucket.com/albums/m521/cikachuno/0684810794.jpg&lt;/a&gt;\n\n\n\n\nThe BIBLE CODE\n\n\n\nSimon &amp; Schuster\nmichael Drossnin\nEnglish \n1997-05-29 \nISBN: 0684810794\n272 pages \nPDF \n11 MB\n\n\nFor three thousand years a code in the Bible has remained hidden. Now it has been unlocked by computer -- and it may reveal our future.\nThe code was broken by an Israeli mathematician, who presented the proof in a major science journal, and it has been confirmed by famous mathematicians around the world.\nThis book is the first full account of a scientific discovery that may change the world, told by a skeptical secular reporter who became part of the story.\nThe three-thousand-year-old Bible code foretells events that happened thousands of years after the Bible was written.\nIt foresaw both Kennedy assassinations, the Oklahoma City bombing, the election of Bill Clinton -- everything from World War II to Watergate, from the Holocaust to Hiroshima, from the Moon landing to the collision of a comet with Jupiter.\nThe author of this book, investigative reporter Michael Drosnin, himself found the assassination of Yitzhak Rabin predicted in the Bible more than a year before the murder -- and personally warned the Prime Minister.\nThe book is based on Drosnin's five-year investigation. The author interviewed all the experts, here and abroad. He spent many weeks with the world-class mathematician who discovered the code, Dr. Eliyahu Rips, and he met with famous mathematicians at Harvard, Yale, and Hebrew University. He talked to a senior code breaker at the top secret U.S. National Security Agency, who confirmed that there is a code in the Bible that does reveal the future.\nNo one yet knows if the Bible code accurately foretells what is yet to come. But the code may be a warning to this world of unprecedented danger, perhaps the real Apocalypse, a nuclear World War.\nIn any event, the Bible code forces us to accept what the Bible itself can only ask us to believe -- that we are not alone.\nAnd it raises a question for us all -- does the code describe an inevitable future, or a series of possible futures whose ultimate outcome we can still decide?\n\n","torrent":{"xt":"urn:btih:208b8ea9b7ccaaaf5bff58a0d43062013d787f31","amp;dn":"The+BIBLE+CODE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"208b8ea9b7ccaaaf5bff58a0d43062013d787f31","infoHashBuffer":{"type":"Buffer","data":[32,139,142,169,183,204,170,175,91,255,88,160,212,48,98,1,61,120,127,49]},"announce":[],"urlList":[]}}