{"title":"The Dream with Roy and H.G","uid":10337375,"size":4472241344,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:209bc4eebba6114a353cdc34e4a5bfec16a797c7&amp;dn=The+Dream+with+Roy+and+H.G&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"uwf3892","files":7,"time":1402494141,"description":"The Dream with Roy and H.G.\nThe Sydney 2000 Olympic Games\n\nWeek 1 - Straight from the high priestesses, The Dream brings home the spirit of the greatest Olympic Games ever. Relive that first fabulous week of the Games of the XXVII Olympiad as seen from the gold medal desk in the House of Zzzzs.\nWhen the sun went down, the moon came up and the stars came out on The Dream. And here's what kept millions on the fiddle under the doona at the end of every Olympic day.\nWatch Roy Slaven and H.G. Nelson say a big &quot;Hello, boys&quot; to the world's gymnasts, and to the Battler's Prince, Fatso the Fat-Arsed Wombat.\nRediscover week one of Sydney 2000 - eight days that were far superior to week two.\n\nWeek 2 - Over two hours of two blokes talking rings.\nThis lets you relive that sensational second week of the Games of the XXVII Olympiad in Sydney, as seen on The Dream.\nAs a nation did the dog and embraced Greco-Roman wrestling, medal-winners sacrificed their greater ambitions to pack down with Rampaging Roy Slaven and H.G. Nelson.\nFrom boxing, to the story of the building of the Sydney Harbour Bridge, as told by Australia's synchronised swimmers, here's proof that week two of the Games, featuring the famous gold-medal dive-off between Millie, Olly, Dickhead and Fatso the Fat-Arsed Wombat, was far superior to the joke that was week one.","torrent":{"xt":"urn:btih:209bc4eebba6114a353cdc34e4a5bfec16a797c7","amp;dn":"The+Dream+with+Roy+and+H.G","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"209bc4eebba6114a353cdc34e4a5bfec16a797c7","infoHashBuffer":{"type":"Buffer","data":[32,155,196,238,187,166,17,74,53,60,220,52,228,165,191,236,22,167,151,199]},"announce":[],"urlList":[]}}