{"title":"NubileFilms - Aisha (Absolute Beauty)","uid":15930463,"size":122114783,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:20b6b17e32eba957bb03200f3c71736f47d4d3f0&amp;dn=NubileFilms+-+Aisha+%28Absolute+Beauty%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"SudoSu","files":1,"time":1475356228,"description":"http://youpornbook.com\r\n\r\n――――――――――――――――\r\n Screen source:\r\n―――――――――――――――― \nhttp://imgreborn.com/?v=778881 \nhttp://imgreborn.com/?v=752169 \nhttp://imgreborn.com/?v=328197 \nhttp://imgreborn.com/?v=765385\r\n\r\nA pair of crotchless fishnet pantyhose are all the accoutrements that gorgeous Aisha needs to show off her lithe figure for Nick Ross. He walks in as she's in the midst of rubbing her medium tits and pinching her rock hard nipples, a pretty picture who's absolutely ripe for the taking. When she beckons him closer, Nick knows that he would be a fool to decline this invitation.\r\n\r\nPressing Aisha back onto the bed, Nick gradually works his way down her tight figure. He takes a pit stop at her magnificent breasts, and then goes further to enjoy the opening in her tights. Soon he is happily lapping away at the soft bare slit between Aisha's legs that glistens with the evidence of her desire.\r\n\r\nAfter springing Nick's stiffie free from his briefs, Aisha gets down on her hands and knees and takes his cock in her soft hands. Her mouth is warm and wet as she engulfs the head of his dick between her sweet lips and starts sucking. Although she's an expert at using her mouth, Nick wants something more from this encounter before he gives in to the urge to cum.\r\n\r\nAisha is happy to bend over on her hands and knees so that Nick can get things started taking her from behind. His long sure strokes are a true delight, and she lets him know with her loud moans of excitement. Her first climax leaves her boneless on the bed and practically purring with the need for another!\r\n\r\nNow it's Aisha's turn to set the pace as Nick lays down on the bed and lets his blonde lover straddle him. She takes him in slowly, enjoying the slide of his dick deep inside in this new position. Before long, though, she's bouncing away happily with enough force to make her titties jiggle like crazy.\r\n\r\nNick loves the show, a fact that he proves as he flips Aisha over onto her back and goes to town jackhammering her greedy twat. Rough sex does the trick for this feisty blonde, who explodes in passion with a moan of completion. Moments later, Nick pulls out to finish by sending his cum shot flying all over Aisha's boobs all the way down to the soft bare snatch that has given him so much pleasure this afternoon.\r\n\r\nLatest DVD porn at:  https://thepiratebay.org/search/WebGift/0/3/0\r\n\r\nFind more exclusive content at:  https://thepiratebay.org/user/SudoSu/","torrent":{"xt":"urn:btih:20b6b17e32eba957bb03200f3c71736f47d4d3f0","amp;dn":"NubileFilms+-+Aisha+%28Absolute+Beauty%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20b6b17e32eba957bb03200f3c71736f47d4d3f0","infoHashBuffer":{"type":"Buffer","data":[32,182,177,126,50,235,169,87,187,3,32,15,60,113,115,111,71,212,211,240]},"announce":[],"urlList":[]}}