{"title":"180 Creative Ideas for Getting Students Involved, Engaged, and E","uid":5906276,"size":13659377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21a8092150d644937b8efbc5a5ae7488e551cf17&amp;dn=180+Creative+Ideas+for+Getting+Students+Involved%2C+Engaged%2C+and+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MANTESH","files":3,"time":1287879696,"description":"[img]http://img695.imageshack.us/img695/1817/0071412298.jpg[/img]\n\n\n\n\n\n\n180 Creative Ideas for Getting Students Involved, Engaged, and Excited\n\n\nMGH \n\nLuisa Gerasimo and Sally Walker\n\n2003 \n\nISBN: 0071412298 \n\n320 pages \n\nPDF | \n\nENGLISH\n\n13 MB\n\n\nEverything you need to keep your class engaged and involved!\nTapped out on teaching ideas? Drained from dreaming up creative lesson supplements? Burned out from battling the bored student glaze-over? These days, with so many distractions clamoring for students' attention, it's often a struggle to get students to &quot;tune in&quot; to the lesson at hand. If you're desperate for a resource packed with imaginative additions to your daily lessons, the experts behind Chase's Teacher's Calendar come to the rescue with 180 indispensable, classroom-enrichment suggestions for K-8 teachers.\n\nThis gotta-have, go-to resource of 180 educational gems--one for each day of the school year--covers a broad range of subject areas, from etiquette to mathematics and from language arts to science and nature. Hook your kids with an assortment of age-appropriate activities, including poetry sessions, crystal creations, and fascinating investigations into local historical lore. Ideas are presented chronologically by month and keyed with subject-area icons for maximum ease of use. Each entry includes additional resources, such as books, websites, and audiovisual aids.\n\nWith these hands-on lessons, your students will learn to:\nConvert Fahrenheit temperatures to Celsius on National Weather Observer's Day (May 4)\nMake homemade butter for National Dairy Month (June)\nCreate &quot;flying verse&quot; with poetry wind socks for National Poetry Month (April)\nTrace family trees to commemorate the opening of Ellis Island (January)\nFish for fact-filled flashcards to celebrate National American Indian Heritage Month (November)\n\nYear after year, you'll turn to 180 Creative Ideas for Getting Students Involved, Engaged, and Excited to discover fun, educational topics and doable ideas to enrich your students' learning experience.................\n\n\n\n\n","torrent":{"xt":"urn:btih:21a8092150d644937b8efbc5a5ae7488e551cf17","amp;dn":"180+Creative+Ideas+for+Getting+Students+Involved%2C+Engaged%2C+and+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21a8092150d644937b8efbc5a5ae7488e551cf17","infoHashBuffer":{"type":"Buffer","data":[33,168,9,33,80,214,68,147,123,142,251,197,165,174,116,136,229,81,207,23]},"announce":[],"urlList":[]}}