{"title":"The Drifters-album","uid":6848083,"size":858792858,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:21ef0213aa7f000a04058cbe27706d5c440f4fb2&amp;dn=The+Drifters-album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"flitigalisa","files":213,"time":1322419702,"description":"The Drifters are a long-lived American doo-wop and R&amp;B/soul vocal group with a peak in popularity from 1953 to 1963, though several splinter Drifters continue to perform today. They were originally formed to serve as Clyde McPhatter's (of Billy Ward &amp; the Dominoes) backing group in 1953. Rolling Stone magazine states that the Drifters were the least stable of the vocal groups due to being low-paid hired musicians of their management.[1] The Treadwell Drifters website states that there have been 60 vocalists in the history of the Treadwell Drifters line.[2] Several splinter groups by former Drifters members add to the count. Only one splinter Drifters group features a classic Drifters member, Charlie Thomas' Drifters. Nevertheless, there are two versions of the Drifters that are notable. The first classic Drifters formed by Clyde McPhatter was inducted into the Vocal Group Hall of Fame as &quot;The Drifters&quot; or &quot;The Original Drifters&quot;.[3] The second Drifters formed by Treadwell featuring Ben E. King was separately inducted into the Vocal Group Hall of Fame as Ben E. King and the Drifters.[4] In their induction, the Rock and Roll Hall of Fame eclectically selected four members from the classic Drifters, two from the second Drifters, and one from the post-King Treadwell Drifters.[5] According to the Vocal Group Hall of Fame, &quot;Through turmoil and changes the (original) Drifters managed to set musical trends and give the public 13 chart hits, most of which are legendary recordings today.&quot;[3] Matching that feat more or less, the non-original Drifters managed to give the public 13 Hot 100 top 30 chart hits.\n\n","torrent":{"xt":"urn:btih:21ef0213aa7f000a04058cbe27706d5c440f4fb2","amp;dn":"The+Drifters-album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21ef0213aa7f000a04058cbe27706d5c440f4fb2","infoHashBuffer":{"type":"Buffer","data":[33,239,2,19,170,127,0,10,4,5,140,190,39,112,109,92,68,15,79,178]},"announce":[],"urlList":[]}}