{"title":"Party Popcorn: 75 Creative Recipes For Everyone&amp;rsquo;s Favorite","uid":11634506,"size":19741003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22248e24c1aec0aef2522aec514a1564305f78ab&amp;dn=Party+Popcorn%3A+75+Creative+Recipes+For+Everyone%26rsquo%3Bs+Favorite&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"MentalZero","files":-1,"time":1417715115,"description":"Seventy-five sweet and savoury popcorn recipes to satisfy every craving The days of buying popcorn in those expensive tins are over thanks to Party Popcorn, a book full of popcorn recipes that are incredibly fun and affordable to make at home. With 75 tasty recipes, Ashton Swank offers much more than just the familiar caramel and cheddar flavours. In the savoury chapter, Swank includes creations like Pepperoni Pizza, Bacon Teriyaki, and Taco Lime. The sweet options range from Turtle Brownie to Gooey S'mores to Firecracker (which has candy Pop Rocks!). There's also a chapter devoted to popcorn fun for kids and another just for the holidays. Such a wide variety of flavoured popcorn means that there's a batch perfect for any occasion. Even better, popcorn is naturally vegan, vegetarian, and gluten-free, a great alternative to unhealthy processed snacks. This vibrant little volume is the definitive popcorn guide. \n \nAUTHOR: Ashton Epps Swank is the author of the popular dessert recipes blog Something Swanky. A stay-at-home mom and online entrepreneur, Ashton is passionate about food styling, food photography, and recipe development","torrent":{"xt":"urn:btih:22248e24c1aec0aef2522aec514a1564305f78ab","amp;dn":"Party+Popcorn%3A+75+Creative+Recipes+For+Everyone%26rsquo%3Bs+Favorite","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22248e24c1aec0aef2522aec514a1564305f78ab","infoHashBuffer":{"type":"Buffer","data":[34,36,142,36,193,174,192,174,242,82,42,236,81,74,21,100,48,95,120,171]},"announce":[],"urlList":[]}}