{"title":"Dan Simmons - Ilium and Olympos","uid":12495686,"size":1023323581,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:22526c48849adbddb168d4da2bf940449ea52173&amp;dn=Dan+Simmons+-+Ilium+and+Olympos&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Cybotage","files":2,"time":1443263329,"description":"Ilium (Ilium #1)\r\n\r\nThe Trojan War rages at the foot of Olympos Mons on Mars—observed and influenced from on high by Zeus and his immortal family—and twenty-first-century professor Thomas Hockenberry is there to play a role in the insidious private wars of vengeful gods and goddesses. On Earth, a small band of the few remaining humans pursues a lost past and devastating truth—as four sentient machines depart from Jovian space to investigate, perhaps terminate, the potentially catastrophic emissions emanating from a mountaintop miles above the terraformed surface of the Red Planet.\r\n\r\n---\r\n\r\nOlympos (Ilium #2)\r\n\r\n\r\nTHE EXTRAORDINARY AND MAGNIFICENT EPIC CONCLUSION TO THE HUGO AWARD-NOMINATED ILIUM\r\n\r\nBeneath the gaze of the gods, the mighty armies of Greece and Troy met in fierce and glorious combat, scrupulously following the text set forth in Homer's timeless narrative, but that was before twenty-first century scholar Thomas Hockenberry stirred the bloody brew, causing an enraged Achilles to join forces with his archenemy Hector and turn his murderous wrath on Zeus and the entire pantheon of divine manipulators; before the swift and terrible mechanical creatures that catered for centuries to the pitiful idle remnants of Earth's human race began massing in the millions, to exterminate rather than serve.\r\n\r\nAnd now all bets are off.\r\n\r\n\r\n---\r\n\r\nBitrate: 32kbps","torrent":{"xt":"urn:btih:22526c48849adbddb168d4da2bf940449ea52173","amp;dn":"Dan+Simmons+-+Ilium+and+Olympos","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22526c48849adbddb168d4da2bf940449ea52173","infoHashBuffer":{"type":"Buffer","data":[34,82,108,72,132,154,219,221,177,104,212,218,43,249,64,68,158,165,33,115]},"announce":[],"urlList":[]}}