{"title":"No Rest for the Dead (2011) by various authors","uid":7444049,"size":2385634,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:226e1ad08dd297f8cda4902added11b39940a407&amp;dn=No+Rest+for+the+Dead+%282011%29+by+various+authors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"FatFreddy879","files":4,"time":1342305929,"description":"No Rest for the Dead (2011)\nA novel by Jeff Abbott, Lori Armstrong, David Baldacci, Sandra Brown, Thomas H Cook, Jeffery Deaver, Diana Gabaldon, Tess Gerritsen, Andrew F Gulli, Lamia Gulli, Peter James, J A Jance, Faye Kellerman, Raymond Khoury, John Lescroart, Jeff Lindsay, Gayle Lynds, Alexander McCall Smith, Phillip Margolin, Michael Palmer, T Jefferson Parker, Matthew Pearl, Kathy Reichs, Marcus Sakey, Jonathan Santlofer, Lisa Scottoline, R L Stine and Marcia Talley.\n\nsypnosis - When Christopher Thomas, a curator at San Francisco's Museum of Fine Arts, is murdered and his decaying body is found in an iron maiden in Berlin, his wife Rosemary Thomas is the prime suspect.\n\nLong suffering under Christopher's unfaithful ways, Rosemary is tried, convicted and executed. Ten years later, Jon Nunn, the detective who cracked the case, becomes convinced that the wrong person was put to death. Along with financier Tony Olsen, he plans to gather everyone who was there the night Christopher died and finally uncover the truth about what happened that fateful evening. Could it have been the ne'er do well brother Peter Hausen, interested in his sister's trust fund having got through his own; the curatorial assistant Justine Olengard, used and betrayed by Christopher; the artist Belle who turned down his advances only to see her career suffer a setback; or someone else all together?","torrent":{"xt":"urn:btih:226e1ad08dd297f8cda4902added11b39940a407","amp;dn":"No+Rest+for+the+Dead+%282011%29+by+various+authors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"226e1ad08dd297f8cda4902added11b39940a407","infoHashBuffer":{"type":"Buffer","data":[34,110,26,208,141,210,151,248,205,164,144,42,221,237,17,179,153,64,164,7]},"announce":[],"urlList":[]}}