{"title":"Victoria An Empire Under The Sun VIP Edition with Revolutions","uid":4450878,"size":1045199562,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:22bc778110a281ab239ddd9b91e24a9fad926d93&amp;dn=Victoria+An+Empire+Under+The+Sun+VIP+Edition+with+Revolutions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SaorEire","files":16,"time":1224259368,"description":"Uploaded by SaorEire; we serve neither king, nor kaiser, but Ireland!\n\nThis is the definitive and complete torrent of Victoria An Empire Under The Sun. It comes with the expansion pack, Victoria Revolutions which ironed out all the bugs of the base game, and Victoria Improvement Project (http://www.paradoxian.org/vickywiki/index.php/Victoria_Improvement_Project) which is a user community created mod from the members of the Paradox Interactive forum. It shores up the game's historical accuracy, making for a much more realistic experience. Its installation is not necessary, if you wish to just have the game and the expansion, but it is very much recommended. Everything has been tested thoroughly, and works fine. Problems may crop up, as is inevitable with an on going mod, but nothing game damaging. The steps listed must be taken in order, and any deviation from it will cause fuck ups. \n\nPlease note, unlike Deviance's base copy release, this edition has no files missing, hence the 777MB size. It will however inform you of a missing intro .avi file, regarding this publisher. It is of no importance.\n\nInstructions;\n\n*Mount the Victoria disk using Daemon Tools as per usual\n*Install the game\n*Use the victoria_104 patch to get Victoria up to the latest release\n*Mount the Revolutions expansion disk\n*Install the expansion\n*Use the vr_patch... to patch up to the latest release\n*Drag the files within the Hotfix 6 .rar file into the Victoria directory (the following steps aren't required if \n you don't wish to install VIP)\n*Install VIPR01Classic, followed by VIPR0.2, and VIPR02Hotfix2.\n*Install the VIPRO1InterfaceMod, for a vastly improved interface.\n*Drag the db and gfx folders within Prinz_Wilhelm_and_Semper_Victor_s_Leaderpack_v._1.05 to the main directory\n for extra leaders.\n*Drag the contents of the Colourscales archive to the map directory, making sure to name the tiles... file as follows; tiles.bmp.bak\n*Finally, add the contents of the New_Victora_Frames to the gfx then interface folder, replacing the existing files.\n\nCredits go to TNTVillage for the base game, Deviance for the expansion, OHGamer for VIP, Prinz Wilhelm and Semper Victor for the leaders, Tyrel68 for the interface, aswell as anyone I've missed out. \n\nPlease be aware, I didn't create anything here, bar the compiling of the torrent.","torrent":{"xt":"urn:btih:22bc778110a281ab239ddd9b91e24a9fad926d93","amp;dn":"Victoria+An+Empire+Under+The+Sun+VIP+Edition+with+Revolutions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22bc778110a281ab239ddd9b91e24a9fad926d93","infoHashBuffer":{"type":"Buffer","data":[34,188,119,129,16,162,129,171,35,157,221,155,145,226,74,159,173,146,109,147]},"announce":[],"urlList":[]}}