{"title":"Rhoda Scott - 10 Albums - Jazz Organ","uid":5317963,"size":1115754486,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:22f9b450796dff1c9c84bbdb7e3b9edbeadc8ed6&amp;dn=Rhoda+Scott+-+10+Albums+-+Jazz+Organ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1264777443,"description":"Rhoda Scott - 10 Albums - Jazz Organ\n\nRhoda Scott (born July 3, 1938, Dorothy, New Jersey) spent much of her childhood in New Jersey, where she learned to play organ in the churches where her father served. Soon she was serving frequently as organist for youth and gospel choirs at her father's and other churches. Scott later studied classical piano, but she concentrated on the organ, eventually earning a Masters' degree in music theory from the Manhattan School of Music.\n\nChoosing as her instrument the Hammond organ, she became an eminent jazz musician and is considered to be among the top jazz organists.\n\nIn 1967 Scott moved to France, where she has since spent most of her career.\n\nIn this collection you will find Rhoda Scott in both studio and live small band settings (duo or trio), except for 'In New York' where she performs with Thad Jones &amp; Mel Lewis Orchestra.\n\nList of included albums in cronological recorded order:\n\n1970 Come Bach To Me\n1971 Live At The Olympia\n1971 Special Comedies Musicales\n1973 Summertime\n1974 Live At The Club Saint-Germain\n1976 In New York\n1977 Jazz In Paris\n1980 Take Five / In The Mood / Summertime...\n2002 Encore, Encore, Encore...\n2008 Live At The Club Duc Des Lombards\n\nA small video clip from 1972 where Scott performs Moanin' is also included. During her excellent performance we can also see why she has earned her nickname 'The Barefoot Lady'.\n\n----------\n\nMP3 format. All songs are tagged by the book.\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n----------","torrent":{"xt":"urn:btih:22f9b450796dff1c9c84bbdb7e3b9edbeadc8ed6","amp;dn":"Rhoda+Scott+-+10+Albums+-+Jazz+Organ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22f9b450796dff1c9c84bbdb7e3b9edbeadc8ed6","infoHashBuffer":{"type":"Buffer","data":[34,249,180,80,121,109,255,28,156,132,187,219,126,59,158,219,234,220,142,214]},"announce":[],"urlList":[]}}