{"title":"Jim ex Zionist-Christian. (dvd islam 911 bbc)","uid":3741529,"size":317798400,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:23038e30ac90e91e31ac7f68cc61ab09406d01f6&amp;dn=Jim+ex+Zionist-Christian.+%28dvd+islam+911+bbc%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Sayanim","files":1,"time":1184405807,"description":"The main file of this ISO image CD (size : 302 MB), is an interesting interview with Jim who was brought up as a zionist-christian by his parents. (duration : 1 hr 15 mns) \n\nAs an independant thinking adult, he had to re-adjust his positions in the light of what he perceives it to be the correct  understanding of the christian faith and in the light of the actions of the so-called &quot;state of israel&quot;.\n\nThe following passages of the bible seem to have helped him see through the deception :   \n\n--&gt; New American Bible : Matthew, Ch. 23 :\n\n29_ &quot;Woe to you, scribes and Pharisees, you hypocrites. You build the tombs of the prophets and adorn the memorials of the  righteous,\n30_  and you say, If we had lived in the days of our ancestors, we would not have joined them in shedding the prophets&amp;#039;  blood.\n31_ Thus you bear witness against yourselves that you are the children of those who murdered the prophets;\n32_ now fill up what your ancestors measured out !.\n33_ You serpents, you brood of vipers, how can you flee from the judgment of Gehenna ?.\n\n--&gt; Bible : Revelation, Ch. 2, v9 :\n\n&quot;I know your works, tribulations and poverty (but you are rich). And I know the BLASPHEMY of those which say they are ISRAEL but they are not, but they are the SYNAGOGUE OF SATAN&quot;.\n\n==============================================\n\nWhile we are on the subject, let it be noted that one of the latest &quot;prodigy&quot; of the so-called &quot;truth movement&quot;, *Gary Franchi* - who also goes by the nickname of &quot;Lone Lantern&quot; (a self-proclaimed &quot;truth seeker&quot; - , has stated his position and has defended it in the forums as follow (quoting him) :\n\n&quot;We also believe Israel has the full right to exist on the land given to them by God, and should use any force necessary to defend themselves. Let&amp;#039;s put it in perspective: five hundred million Arabs; five million Jews. Think of all the Arab  countries as a football field, and Israel as a pack of matches sitting in the middle of it. Case dismissed...As a Christian I know and understand the importance of Israel as a prophetic barometer. I also understand and believe that Israel has a God ordained right to their land... even to the Biblical borders.&quot;\n\n===============================================\n\nKeywords : dvd islam 911 9-11 alex jones nwo malcolm x noam chomsky cat stevens yusuf islam empire of faith lone gunmen  zionism ted pike bbc pbs iraq documentary jesus bible quran new world order psychology wtc world trade center cia anti-christ the illuminati vietnam september 11 ","torrent":{"xt":"urn:btih:23038e30ac90e91e31ac7f68cc61ab09406d01f6","amp;dn":"Jim+ex+Zionist-Christian.+%28dvd+islam+911+bbc%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23038e30ac90e91e31ac7f68cc61ab09406d01f6","infoHashBuffer":{"type":"Buffer","data":[35,3,142,48,172,144,233,30,49,172,127,104,204,97,171,9,64,109,1,246]},"announce":[],"urlList":[]}}