{"title":"Legend of the fist (2010)(nl subs)(Eng subs)(DD5.1)DTS TBS","uid":5981778,"size":4629494123,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:237f3ac268fcbf4231d9a61f2e313a8b57779045&amp;dn=Legend+of+the+fist+%282010%29%28nl+subs%29%28Eng+subs%29%28DD5.1%29DTS+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BlackSam.","files":-1,"time":1290612784,"description":"Legend of the fist (nl/Eng subs)(DD5.1)DTS TBS\nthe return of Chen Zhen\n\nDe nieuwste film van Donnie Yen bekend van o.a. de IP Man films.\n\nAls het Chinese leger dezelfde vaardigheden had als die Donnie Yen laat zien als munitiedrager voor de Engelsen in de Tweede Wereldoorlog, dan hadden ze \n\nnu de wereld geregeerd.\nGelukkig lijkt het erop dat ze niet over de supermenselijke eigenschappen beschikken, die hij heeft in deze film.\nDe film speelt zich af na, en gebaseerd op, de gebeurtenissen die plaats vonden in o.a. &quot;Fist of fury&quot;en&quot;Fist of legend&quot;en de tv serie.\nWe volgen het karakter Chen Zhen na zijn terugkeer van het slagveld in Europa, in een stad die is opgedeeld in secties en bestuurd wordt door geallieerde \n\nen de Japanners.\nZich voordoende als een playboy richt hij een rebellengroep op die het Japanse leger willen tegenhouden en het bestuur van de stad weer in Chinese handen \n\nwillen krijgen.\nMaar dat is niet zo simpel, want lokale gangsters zien er niet het nut van in om de buitenlanders opteruimen, omdat ze goed aan hun verdienen.\nOok valt Chen Zhen voor de charmes van een mooie zangeres, die niet blijkt te zijn waar ze zich voor uitgeeft.\nOpdagend in een Kato-achtig kostuum vecht Yen tegen het Japanse leger, maar tegelijkertijd riskeert hij het leven van zijn kameraden die in het vezet \n\nzitten.\n\nstoryline\n\nThe latest film by Donnie Yen known for the IP Man movies. \n\nWhen the Chinese army had the same skills as Donnie Yen shows as ammunition carrier for thein World War II, they would have ruled the world. \nFortunately it seems that they do not have the super human qualities, he has in this film. \nThe film takes place after, and based on the events that took place in ao &quot;Fists of Fury&quot; and &quot;Fist of Legend&quot; and the TV series. \nWe follow the character Chen Zhen, after his return from the battlefield in Europe, in a city that is divided into sections and managed by Allied and \n\nJapanese. \nPosing as a playboy, he founded a rebel group that would keep the Japanese army and the administration of the city want to get back into Chinese hands. \nBut that's not so simple, because local gangsters do not look into the usefulness of the opteruimen foreigners because they are good with their money. \nChen Zhen also falls for the charms of a beautiful singer, who turns out to be where they are to spend. \nShow up in a Kato-type costume fighting against the Japanese Yen army, yet he risks the lives of his comrades in the Vezet down\n\nSource: Retail DVD9.\nFormat: DVD5, 7 pass CCE.\nAudio: Cantonese DD5.1 + Cantonese DTS.\nSubtitles: Retail English + Custom Dutch/Nederlands, vertaald en gecontroleerd aan de hand van de Engelse retail subs door The Bold One.\nMenu: Motion Menu, volledig aangepast door The Bold One.\nExtra`s: Alles verwijdert.\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nOndertitels : Nederlands (instelbaar) Engels (instelbaar)\n \n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/66571&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/66571&lt;/a&gt;\nhttp://www.imdb.com/title/tt1456661 \n\n  \nBlack-Sam  TBS","torrent":{"xt":"urn:btih:237f3ac268fcbf4231d9a61f2e313a8b57779045","amp;dn":"Legend+of+the+fist+%282010%29%28nl+subs%29%28Eng+subs%29%28DD5.1%29DTS+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"237f3ac268fcbf4231d9a61f2e313a8b57779045","infoHashBuffer":{"type":"Buffer","data":[35,127,58,194,104,252,191,66,49,217,166,31,46,49,58,139,87,119,144,69]},"announce":[],"urlList":[]}}