{"title":"Hogtied------HT-30072 Ana Foxxx","uid":8596580,"size":2809436145,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:238e3804bf4251a6e1156d3d3d944c8a2bb5f7a5&amp;dn=Hogtied------HT-30072+Ana+Foxxx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"merzedes","files":-1,"time":1371772159,"description":"Former Runway Model Tamed - Ana Foxxx\n\nJun 20, 2013 - Performers: Ana Foxxx \n \n\nMP4 and WMV + Pics.\n\n\nStunning beauty Ana Foxxx decides HogTied is something she would like to try. Oh, and she likes pain. Oh, and she likes bondage. Lets go, bitch. We start out with her bound in a ball tie. Helpless to do anything but squirm, she is beaten with her shoes and has her socks tied to her knees so she cannot escape bastinado torment. Her bondage changes into an open ball tie strappado on a box. A cruel nose hook is added so she cannot comfortably move her head and she is then teased, tormented, and pleasured with the vibrator.\n\nSecond, her long legs had to be bound on display. Bent over the beam and arms strict and in strappado, her cunt meat is ripe for the taking. Clothespins are added and then secured open displaying her hot juicy pussy. A cunt hook is added. She is uncomfortably challenged with the cane and nipple weights. After satisfying our whims of being in enough discomfort, She is made to cum.\n\nFinally, we need to see all of her on display. Her gorgeous body is drawn and quartered so to speak in an intense inverted spread eagle suspension. A tough crotch rope is added with a heavy bowling ball weight for discomfort. Another is added to a neck rope, discouraging any movement she may have had. She is oiled to show off her defined physique and chopstick nipple clamps are added to complete her circuit of distress. She has been tormented all day long and now all we want to see is this bitch cum. Squeezing every orgasm we can out of her she is milked until there is nothing and then left to suffer.\n\nScreens &lt;a href=&quot;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=30072&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=30072&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:238e3804bf4251a6e1156d3d3d944c8a2bb5f7a5","amp;dn":"Hogtied------HT-30072+Ana+Foxxx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"238e3804bf4251a6e1156d3d3d944c8a2bb5f7a5","infoHashBuffer":{"type":"Buffer","data":[35,142,56,4,191,66,81,166,225,21,109,61,61,148,76,138,43,181,247,165]},"announce":[],"urlList":[]}}