{"title":"Design-It-Yourself Clothes by Cal Patch","uid":9621579,"size":18406557,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23dc4b975307f5c42d96f5be1f42583061e86b15&amp;dn=Design-It-Yourself+Clothes+by+Cal+Patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"PirateBook","files":1,"time":1392506978,"description":"\nIf youve ever watched Project Runway and wished you were a contestant, or youre simply ready to take your sewing to a new level, Design-It-Yourself Clothes teaches you the fundamentals of modern patternmaking so that you, too, can create your own inspired clothing.\n\nUntil now, the aspiring DIY fashionista has been hard-pressed to find self-teaching tools other than dry textbooks or books with outdated looks. Finally, in Design-It-Yourself Clothes, former Urban Outfitters designer Cal Patch brings her youthful aesthetic to a how-to book. If you want to wear something you cant find on store racks and make clothes that express your individual style, or if youve reached a sewing plateau and want to add pattern drafting to your repertoire, Design-It-Yourself Clothes is the book you have been waiting for.\n\nIn five key projects (each with four variations)a perfect-fitting dress, T-shirt, button-down shirt, A-line skirt, and pantsPatch shares the art of patternmaking. At its core, its much simpler than you think. Patch covers everything an intermediate sewer needs to know in order to become a fabulous fashion designer, from designing the patterns, taking your own measurements, and choosing fabrics to actually sewing the clothing. You will also learn how to stylize patterns by using darts, waistbands, patch pockets, and ruffles. Patch offers tips, explanations, options, and exercises throughout that will make the design process that much easier.\n\nBut besides showing you how to create clothing from scratch, she also teaches you how to rub off patterns from existing clothingso if you have a pair of pants that you love but are worn out, or you have your eye on a piece in the store with a prohibitive price tag, you can figure out how to get the looks you want by using your own two hands.\n\nGenre: Non Fiction , Sewing","torrent":{"xt":"urn:btih:23dc4b975307f5c42d96f5be1f42583061e86b15","amp;dn":"Design-It-Yourself+Clothes+by+Cal+Patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23dc4b975307f5c42d96f5be1f42583061e86b15","infoHashBuffer":{"type":"Buffer","data":[35,220,75,151,83,7,245,196,45,150,245,190,31,66,88,48,97,232,107,21]},"announce":[],"urlList":[]}}