{"title":"The Art Of Noise - (Who's Afraid Of) The Art Of Noise@flac","uid":4908129,"size":257579573,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:250bc89fe3cf4794ecdc52459070eabac42a509c&amp;dn=The+Art+Of+Noise+-+%28Who%5C%27s+Afraid+Of%29+The+Art+Of+Noise%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alekow1","files":-1,"time":1243013401,"description":"\nArt of Noise's first full album, (Who's Afraid Of?) The Art of Noise!, consolidated the future shock of the earlier EPs and singles in one entertaining and often frightening and screwed-up package. \nRarely has something aiming for modern pop status also sought to destroy and disturb so effectively. \nThe most legendary song is still &quot;Close (To the Edit),&quot; benefiting not merely from the innovative video but from its strong funk groove and nutty sense of humor in the mostly lyric-less vocals, not to mention the &quot;hey!&quot; vocal hook the Prodigy would sample for &quot;Firestarter.&quot; Its close cousin, the title track, brilliantly blends a nagging bass synth, echoed drum, and percussion fills and constantly shifting vocal cut-ups, random noises, and strange melodies. They're just two highlights on this prescient release, though. Part of the thrill of Who's Afraid is the sense of juxtaposition and playing around, something still not very common in music and even less so in the pop music genre. The blunt political protest of &quot;A Time for Fear (Who's Afraid)&quot; and the more abstract &quot;How to Kill,&quot; achieved via appropriate sampling, slams right up against the rough beat sonics and serene orchestration. If such material had appeared on Rephlex or even DHR in the mid- to late '90s, few would have been surprised. Things aren't all dour and gloomy, though; &quot;Beat Box&quot; captures heavy grooves from said source with quirky vocal bits and soft vibes. Patented Trevor Horn orchestral stabs surface throughout, while Anne Dudley's knack for gentler shadings and dramatic arrangements also comes through clearly, something that would surface ever more strongly in her freelance production career. \nThe full ten-minute version of &quot;Moments in Love&quot; is perhaps her triumph here, a seemingly pretty instrumental turned increasingly strange. (AMG)\n\n\n\n\n01. A Time To Fear (Who's Afraid)\n02. Beat Box (Diversion One)\n03. Snapshot\n04. Close (To The Edit)\n05. Who's Afraid (Of The Art Of Noise)\n06. Moments In Love\n07. Momento\n08. How To Kill\n09. Realization\n\n\n\nLabel: ZTT\nReleased: 1984\n\n\nCodec: Flac\nCompression Level: 3\nQuality: High\n\n\nMy cd-rip (EAC and Flac)\nCovers Included\n\n\n\n\n\nEnjoy, Seed and Share\n","torrent":{"xt":"urn:btih:250bc89fe3cf4794ecdc52459070eabac42a509c","amp;dn":"The+Art+Of+Noise+-+%28Who%5C%27s+Afraid+Of%29+The+Art+Of+Noise%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"250bc89fe3cf4794ecdc52459070eabac42a509c","infoHashBuffer":{"type":"Buffer","data":[37,11,200,159,227,207,71,148,236,220,82,69,144,112,234,186,196,42,80,156]},"announce":[],"urlList":[]}}