{"title":"DR. GENE SCOTT - 15 RARE TEACHING ALBUMS - 170 TOTAL TALKS","uid":3907152,"size":1368027127,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2542dc1f911c4f0ad5395fa83ce0ad2e990eb950&amp;dn=DR.+GENE+SCOTT+-+15+RARE+TEACHING+ALBUMS+-+170+TOTAL+TALKS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mesohony","files":393,"time":1195910729,"description":"------------------------------------------------------------------------------\nDR. GENE SCOTT - 15 RARE TEACHING ALBUMS - 170 TOTAL TALKS\n------------------------------------------------------------------------------\nThis unique collection is a follow-up to an earlier archive of lectures removed from Dr. Scott's website, which is available separately and consists of mostly\ndifferent material, though there may be some overlap here and there.\n------------------------------------------------------------------------------\n\n\nHere are the complete contents of 15 teaching albums by the late Dr. Gene Scott.   The original albums consisted of twelve cassette tapes each, and this present collection contains digitized MP3 versions of those original recordings, plus the original artwork from each album. These albums originally sold for $100.00 each, but are no longer available at all.   The albums included here are:\n\n1)  Atlantis\n2)  Demonology Vol 1\n3)  Demonology Vol 2\n4)  Great Pyramid Vol 1\n5)  Mysteries of the Universe Vol 1\n6)  Mysteries of the Universe Vol 2\n7)  Mysteries of the Universe Vol 3\n8)  Mysteries of the Universe Vol 4\n9)  Mysteries of the Universe Vol 5\n10  Mysteries of the Universe Vol 6\n11) Mysteries of the Universe Vol 7\n12) Revelation Vol 1\n13) Revelation Vol 2\n14) Stars\n15) Spiritual Warfare Against the Kosmokratoras (2 tapes)\n\nTOTAL: 170 recordings\n\nDr. Gene Scott warned that once he died, those who took over the church\nwould destroy his entire life work.  This was because his teachings frequently went\ninto territory far beyond what one would normally expect from a Christian preacher.  Indeed, he spent much time educating his listeners on subjects which were highly politically sensitive even to this day, and he knew that only he himself could guarantee the continued availability of his teachings.\n\nHis prophecy has unfortunately been fulfilled.  Dr. Scott's widow Melissa Scott has removed all of Dr. Scott's important material from public availability, and has correctly stated on public television that &quot;there are forces which do not want to see Dr. Scott's memory embedded in time.&quot; \n\nNow if you go to his church, all you will see will be Melissa prancing around on stage, if you can get in the door at all.   The church is guarded by a virtual army of private security goons masquerading as &quot;ushers,&quot; wearing three-piece suits and ear-phone communication systems.   This has all the earmarkings of a government-sponsored cult operation, working as expected to mind-control its followers and destroy the truth.  \n  \nMelissa Scott is ABUSING her ownership of the copyright to this material as a means to DESTROY AND ERASE the life work of Dr. Gene Scott from the face of the Earth.  We feel that Dr. Scott did not produce his lifetime of work simply so that his former porn-producer wife Melissa aka &quot;Barbie Bridges&quot; could shut it all down the moment he passed on, in order to appease her handlers.  Dr. Scott's work rightfully belongs to the world now, and so we are making it available to everyone free of charge.","torrent":{"xt":"urn:btih:2542dc1f911c4f0ad5395fa83ce0ad2e990eb950","amp;dn":"DR.+GENE+SCOTT+-+15+RARE+TEACHING+ALBUMS+-+170+TOTAL+TALKS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2542dc1f911c4f0ad5395fa83ce0ad2e990eb950","infoHashBuffer":{"type":"Buffer","data":[37,66,220,31,145,28,79,10,213,57,95,168,60,224,173,46,153,14,185,80]},"announce":[],"urlList":[]}}