{"title":"Family.Guy-Season.7[2008-2009]-COMPLETE [-MomradN-]","uid":4905299,"size":2934787499,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:25daf6763beca70e0175c884837dd4413004ac1a&amp;dn=Family.Guy-Season.7%5B2008-2009%5D-COMPLETE+%5B-MomradN-%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Momradn","files":-1,"time":1242856611,"description":"&gt;/-=-=-=-=-=-=-=-\n&gt;/-..:MomradN:..-\n&gt;/Family Guy S07-\n&gt;/-=-=-=-=-=-=-=-\n&gt;\n&gt; - Use DAMN NFO Viewer for vewing .nfo files: http://www.softpedia.com/get/Office-tools/Text-editors/DAMN-NFO-Viewer.shtml -\n&gt;\n&gt;Episode #1:\n&gt;&quot;Love Blactually&quot;\n&gt;Brian sets his sights on a girl named Carolyn and follows Stewie's advice to\n&gt;take things slow with the relationship, only to drive her crazy and straight\n&gt;into Cleveland's arms. Brian does whatever it takes to win her back, even if\n&gt;it means getting Cleveland's ex-wife Loretta involved.\n&gt;\n&gt;Episode #2:\n&gt;&quot;I Dream of Jesus&quot;\n&gt;Peter re-discovers his passion for the song &quot;Surfin' Bird&quot;, but Brian and\n&gt;Stewie find it so annoying that they try to prevent it from being heard again.\n&gt;Distraught, Peter searches every record store in town for a copy of the song\n&gt;until he runs into Jesus himself, and the two start hanging out.\n&gt;\n&gt;Episode #3:\n&gt;&quot;Road to Germany&quot;\n&gt;Mort Goldman accidentally steps into Stewie's time machine, so Brian and\n&gt;Stewie go back in time to retrieve him. Things look bad when they discover \n&gt;that they've arrived in World War II-era Poland, so they must travel to Nazi\n&gt;Germany to save Mort and find a way to safely return to the present.\n&gt;\n&gt;Episode #4:\n&gt;&quot;Baby not on Board&quot;\n&gt;Peter gets a lasting supply of gasoline for the year, so the family decides to\n&gt;use it to take a road trip to the Grand Canyon. They pack up and hit the\n&gt;road, but it takes them a while to realize that they had forgotten to bring\n&gt;Stewie with them; when they do, they must make an explosive trip back home.\n&gt;\n&gt;Episode #5:\n&gt;&quot;The Man with Two Brians&quot;\n&gt;When Brian gets injured during a take of Peter's version of Jackass, the \n&gt;Griffins realize that Brian may be getting too old, so Peter brings home a\n&gt;new dog, prompting Brian to leave. Everyone else, however, loves &quot;New \n&gt;Brian&quot;; all except for Stewie, who doesn't like his constant happy attitude.\n&gt;\n&gt;Episode #6:\n&gt;&quot;Tales of a Third Grade Nothing&quot;\n&gt;Peter's up for a promotion at work, but he is forced by his boss Angela to be\n&gt;sent back to repeat the third grade in order to qualify. Meanwhile, Frank \n&gt;Sinatra, Jr. returns to Quahog to open a new nightspot with Brian, and they\n&gt;enlist Stewie to make it the hottest new spot in town.\n&gt;\n&gt;Episode #7:\n&gt;&quot;Ocean's Three and a Half&quot;\n&gt;Bonnie finally gives birth to her baby, a beautiful girl named Susie, with\n&gt;whom Stewie falls in love and will do anything to win her heart. Meanwhile,\n&gt;Joe borrows $20,000 from a loan shark to pay for Bonnie's medical bills, and\n&gt;plans to steal the money from Mr. Pewterschmidt to pay off his debt.\n&gt;\n&gt;Episode #8:\n&gt;&quot;Family Gay&quot;\n&gt;Peter participates in some medical experiments to pay off his debt, including\n&gt;one that sees him getting injected with the &quot;gay gene&quot;. Peter winds up in a\n&gt;gay relationship and leaves Lois and the rest of the family heartbroken,\n&gt;though they realize the most important thing is that Peter is happy.\n&gt;\n&gt;Episode #9:\n&gt;&quot;The Juice Is Loose&quot;\n&gt;Peter cashes in a raffle ticket from 1989 and wins a golf outing with O. J. \n&gt;Simpson. When he befriends Simpson and brings him home to meet the \n&gt;family, the residents of Quahog aren't so welcoming of the infamous running \n&gt;back and try to force him out of town.\n&gt;\n&gt;Episode #10:\n&gt;&quot;FOX-y Lady&quot;\n&gt;Lois lands a job at FOX News and has to shoot an investigative exposÃƒÂ© on a \n&gt;liberal filmmaker, but loses her job when her story implicates a conservative\n&gt;radio host.\n&gt;\n&gt;Episode #11\n&gt;&quot;Not All Dogs Go to Heaven&quot;\n&gt;Meg becomes a born-again Christian and tries to convert Brian from atheism.\n&gt;Meanwhile, Stewie is furious he doesn't get to ask the cast of Star Trek: \n&gt;The Next Generation any questions at a convention, so he kidnaps the cast\n&gt;and forces them to hang out with him.\n&gt;\n&gt;Episode #12\n&gt;&quot;420&quot;\n&gt;After Brian is arrested for drug possession, he launches a campaign to legalize\n&gt;marijuana. Mayor West passes the law, and the whole town goes to pot.\n&gt;\n&gt;Episode #13\n&gt;&quot;Stew-Roids&quot;\n&gt;After Stewie gets his butt kicked by Joe's infant daughter, he starts hitting the\n&gt;gym with Peter. It seems like all of Stewie's hard work is paying off until Peter\n&gt;drops a boombshell when he reveals just how Stewie got those six-pack abs. Meanwhile  \n&gt;Chris starts to date a popular girl at school and quickly realizes that popularity\n&gt;is like physics as in &quot;What goes up, must come down&quot;.\n&gt;\n&gt;Episode #14\n&gt;&quot;We love you, Conrad&quot;\n&gt;Brian is devastated to learn that his ex-girlfriend Jillian is getting married \n&gt;until he meets The Hills star Lauren Conrad. Though Brian begins to think\n&gt;he and Conrad are the perfect match, he finds his heart may still belong to Jillian.\n&gt;\n&gt;Episode #15\n&gt;&quot;Three Kings&quot;\n&gt;Peter imagines his friends and family in three of Stephen King's most famous works.\n&gt;Stand by Me parody - Twelve-year old Peter, Quagmire, Cleveland and Joe travel\n&gt;along a railroad track on a journey of self-discovery.\n&gt;Misery parody - Brian is injured in a bad car crash only to be &quot;rescued&quot; by his\n&gt;&quot;number one fan,&quot; Stewie. The Shawshank Redemption parody - Cleveland and Peter\n&gt;become fast friends in prison.\n&gt;\n&gt;Episode #16\n&gt;&quot;Peter's Progress&quot;\n&gt;Peter learns from a psychic through a palm reading that he had a fascinating past \n&gt;life as Griffin Peterson, a dignified gentleman who vied for the love of Lady Redbush\n&gt;from 17th century England, ruled by the fierce King Stewart, to the newly founded\n&gt;American colony of Quahog.\n&gt;\n&gt;SOURCE....................................[ EZTV (http://www.eztv.it) (RSS Feed)\n&gt;TYPE......................................[ PDTV, XviD, LOL/2HD, DOT\n&gt;\n&gt;UPLOADED ON...............................[ http://www.thepiratebay.se/ \n&gt;TORRENT FiLE iS CREATED AND UPLOADED BY...[ MomradN\n&gt;\n&gt;MORE FROM ME..............................[ http://www.thepiratebay.se/user/Momradn\n&gt;MAiL......................................[ &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d6bbb9bba4b7b2b896b1bbb7bfbaf8b5b9bb&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n&gt;\n&gt;This is not an official EZTV release. I've just downloaded and collected their\n&gt;episodes and uploaded the whole season in one torrent. - The latest repacks from EZTV as of 05/18.09\n&gt;A new torrent WiLL be released IF there is new repacks available.\n&gt; - Enjoy!\n&gt;\n&gt; [-MomradN-]","torrent":{"xt":"urn:btih:25daf6763beca70e0175c884837dd4413004ac1a","amp;dn":"Family.Guy-Season.7%5B2008-2009%5D-COMPLETE+%5B-MomradN-%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25daf6763beca70e0175c884837dd4413004ac1a","infoHashBuffer":{"type":"Buffer","data":[37,218,246,118,59,236,167,14,1,117,200,132,131,125,212,65,48,4,172,26]},"announce":[],"urlList":[]}}