{"title":"Love - Forever Changes [FLAC] TNT Village","uid":8823893,"size":367326883,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:26203eb5e358eeb3e26763fb718eec118bb16c4d&amp;dn=Love+-+Forever+Changes+%5BFLAC%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"l.diliberto","files":26,"time":1376778627,"description":"Love - Forever Changes [FLAC] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=355955&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=355955&lt;/a&gt;\n\nAnno: 1967\nGenere: pop\n\nLove's Forever Changes made only a minor dent on the charts when it was first released in 1967, but years later it became recognized as one of the finest and most haunting albums to come out of the Summer of Love, which doubtless has as much to do with the disc's themes and tone as the music, beautiful as it is. Sharp electric guitars dominated most of Love's first two albums, and they make occasional appearances here on tunes like &quot;A House Is Not a Motel&quot; and &quot;Live and Let Live,&quot; but most of Forever Changes is built around interwoven acoustic guitar textures and subtle orchestrations, with strings and horns both reinforcing and punctuating the melodies. The punky edge of Love's early work gave way to a more gentle, contemplative, and organic sound on Forever Changes, but while Arthur Lee and Bryan MacLean wrote some of their most enduring songs for the album, the lovely melodies and inspired arrangements can't disguise an air of malaise that permeates the sessions. A certain amount of this reflects the angst of a group undergoing some severe internal strife, but Forever Changes is also an album that heralds the last days of a golden age and anticipates the growing ugliness that would dominate the counterculture in 1968 and 1969; images of violence and war haunt &quot;A House Is Not a Motel,&quot; the street scenes of &quot;Maybe the People Would Be the Times or Between Clark and Hillsdale&quot; reflects a jaded mindset that flower power could not ease, the twin specters of race and international strife rise to the surface of &quot;The Red Telephone,&quot; romance becomes cynicism in &quot;Bummer in the Summer,&quot; the promise of the psychedelic experience decays into hard drug abuse in &quot;Live and Let Live,&quot; and even gentle numbers like &quot;Andmoreagain&quot; and &quot;Old Man&quot; sound elegiac, as if the ghosts of Chicago and Altamont were visible over the horizon as Love looked back to brief moments of warmth. Forever Changes is inarguably Love's masterpiece and an album of enduring beauty, but it's also one of the few major works of its era that saw the dark clouds looming on the cultural horizon, and the result was music that was as prescient as it was compelling.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img526.imageshack.us/img526/4933/loveforeverchanges.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img526.imageshack.us/img526/4933/loveforeverchanges.jpg&lt;/a&gt;\n\n.: Tracklist :.\n\n    Alone Again Or - 3:16\n    A House Is Not a Motel - 3:31\n    Andmoreagain - 3:18\n    The Daily Planet - 3:30\n    Old Man - 3:02\n    The Red Telephone - 4:46\n    Maybe the People Would Be the Times or Between Clark and Hilldale - 3:34\n    Live and Let Live - 5:26\n    The Good Humor Man He Sees Everything Like This - 3:08\n    Bummer in the Summer - 2:24\n    You Set the Scene - 6:56","torrent":{"xt":"urn:btih:26203eb5e358eeb3e26763fb718eec118bb16c4d","amp;dn":"Love+-+Forever+Changes+%5BFLAC%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26203eb5e358eeb3e26763fb718eec118bb16c4d","infoHashBuffer":{"type":"Buffer","data":[38,32,62,181,227,88,238,179,226,103,99,251,113,142,236,17,139,177,108,77]},"announce":[],"urlList":[]}}