{"title":"Iron.Front.Liberation.1944.D-Day-RELOADED","uid":7956054,"size":1171232192,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:262ecb4892697f91020409ce1bcbb6c79158789f&amp;dn=Iron.Front.Liberation.1944.D-Day-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1356433146,"description":"\n                                      nERv\n\n\n                Iron Front: Liberation 1944 (c) Deep Silver\n\n      05/2012 :..... RELEASE.DATE .. PROTECTION .......: PCD\n            1 :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\n\n&quot;D-Day&quot; adds the famous landing on the coast of Normandy by the Allied\nForces to the tactical World War II shooter &quot;Iron Front   Liberation 1944&quot;.\nMerciless gun battles for each centimeter of the beaches await brave\nsoldiers on the side of the Allies and the Wehrmacht alike in this\nextensive expansion. Brutal combat unfolds on the storm-lashed shores of\nFrance, as the future of the world is about to be decided at the Atlantic\nWall...\nand you are in the thick of it! Fight with the Allied Forces against the\ndogged Wehrmacht defenders, or join the battle on the side of Germany and\nuse any means to stop the Allies' advance.\n\n&quot;D-Day&quot; introduces a whole new scenario with new weapons, military equipment\nand missions in both single-player and multiplayer modes (incl. co-op), as\nwell as the Allies as a new faction. In the expansion, players can take on\nthe roles of American soldiers, pilots and tank crews to fight for the\nfreedom of France. The famous landing craft which carried the US soldiers\nto the bloody battle of liberation at Omaha Beach are of course also\nincluded in D-Day. Air support is provided by the P-47 Thunderbolt, while\nSherman tanks support the advance of the ground forces.\n\nFollowing the successful landing of the Allied Forces, the battles in\nNormandy continue with new missions featuring authentic re-creations of\nthe military equipment of the age, including the Garand M1 rifle and the\nBrowning automatic rifle. Players can also, for the first time, enter the\nwar on the American side and use the new troops in multiplayer mode as\nwell. However, the German troops are also well-prepared for\nD-Day: In response to frequent requests from the community, the Tiger I\npanzer is ready to deploy in the expansion.\n\n\n1. Unrar.\n2. Burn or mount the image.\n3. Upgrade the game to version 1.05 using the patches in Crack/Patches\n4. Install the addon, when asked for a serial enter one of the following:\n\n   F9G3-66VRF-69KG9-HZ90H-M6C4S\n   553M-90RRE-LJ3MM-6X9Z2-K1GXC\n   RHCP-30SGW-H46RD-57P1Z-FH59D\n\n5. Copy over the contents of the /Crack dir on the disc to your installation\n   directory.\n6. Play the game. We recommend not going online with it, as usual.\n7. Support the software developers. If you like this game, BUY IT!\n\n\n                            &quot;Merry Christmas&quot;\n","torrent":{"xt":"urn:btih:262ecb4892697f91020409ce1bcbb6c79158789f","amp;dn":"Iron.Front.Liberation.1944.D-Day-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"262ecb4892697f91020409ce1bcbb6c79158789f","infoHashBuffer":{"type":"Buffer","data":[38,46,203,72,146,105,127,145,2,4,9,206,27,203,182,199,145,88,120,159]},"announce":[],"urlList":[]}}