{"title":"DoubleKiller Pronnak8","uid":4660820,"size":1149962,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:26761c7332b5b9abf0c9111b1d16ce6a38aee987&amp;dn=DoubleKiller+Pronnak8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Hieraco","files":2,"time":1232386697,"description":"This is my first attempt to give back to the community that has given me so much. Please be gentle with me, it's my first time. :-D\n\nDoubleKiller Pro is a very fast and flexible application for finding and removing duplicate or similar files.\n\n    *  - Free up hard disk space by removing unnecessary duplicate files\n    * - Tidy up your picture or music collection\n    * - Speed up backups, file searches and overall performance\n\nFeatures\n\n    * - Scans directories, complete drives or computers in your Network Neighborhood for duplicate files\n    * - Freely configurable comparison criteria (file name, size, date and content)\n    * - You can exclude files based on their name, file type, attributes or size\n    * - Presents a list of all identical files so you can decide which ones to remove\n    * - Offers an automatical selection of unneeded files based on various criteria\n    * - Deletes, moves or replaces duplicate files by shortcuts\n    * - Allows to export and reload the result list at any time\n    * - Command line support allows to automate repetitive tasks\n\nin detail\nDescription\n\nDoubleKiller Pro finds duplicate or similar files by comparing any combination of name, size, date and content; optionally just a certain part or with a given tolerance. Files can be filtered by masks like *.jpg, attributes or file size. When the scan is finished a list containing all duplicates found is displayed and you can select the files to be deleted, moved to the Recycle Bin or a backup folder or replaced by shortcuts. Automatic selection allows to mark the oldest or biggest files of each set or all files in a certain directory for removal, for example. You can save scan sessions and load them any time later to review or continue your work. The complete process of choosing directories, scanning for duplicates and removing files can be automated via command line switches. The user interface is multilingual and can be translated to your language using freely downloadable language files. An optional help file provides first-step information, a complete reference and usage examples.","torrent":{"xt":"urn:btih:26761c7332b5b9abf0c9111b1d16ce6a38aee987","amp;dn":"DoubleKiller+Pronnak8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26761c7332b5b9abf0c9111b1d16ce6a38aee987","infoHashBuffer":{"type":"Buffer","data":[38,118,28,115,50,181,185,171,240,201,17,27,29,22,206,106,56,174,233,135]},"announce":[],"urlList":[]}}