{"title":"Windows 7 Loader v1.7.7 (REPACK) (x86 - x64) by Daz [Un-Zipped] ","uid":5396065,"size":2363584,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:26dd867077179f707a780310c8d53fba318e1462&amp;dn=Windows+7+Loader+v1.7.7+%28REPACK%29+%28x86+-+x64%29+by+Daz+%5BUn-Zipped%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Askeen.","files":-1,"time":1267233289,"description":"Windows 7 Loader v1.7.7 (REPACK) (x86 &amp; x64) by Daz [Un-Zipped]\n\n----------------------------------\nLatest - 1.7.7 REPACK\nFixed loader modes to stop system hangs\nChanged the way the loader is wrote to the partition (no more mounting)\n----------------------------------\n\nFeatures\nCan be run as a standalone, just move the executable to wherever you like\nMaintain your own list of serials, future or current (comes with allot of preset keys)\nAdd your own certificates and SLIC's\nAutomatically finds an available drive letter (if required)\nInstaller and uninstaller built in as standard\nChecks your Windows version and build before install\nAutomatically finds your active boot partition\nWorks on all languages\nWorks alongside hidden partitions\nWorks on Windows 7, Vista and Server 2008 editions\nSupport for bios modded users\nArgument support for silent installs\nYou can use this tool to activate your Windows 7/Vista ISO by editing setupcomplete.cmd\nImproves Windows 7 boot time on a Mac\nEncrypted SLIC support\n\nAdvantages\nAdvantages\nEncryption and randomization for your security\nByte differences - Everyones GRLDR won't be byte for byte the same\nProfile matchups - SLIC, certificate and serial that best suits your system\nArguments - Can be used to pre-activate your OS\nUses custom error checking on near every function making the application much more reliable instead of spitting out files and failing\nFrankenbuild checking\nIntegrity checking with useful info on screen so the user can verify it\nExternal Keys.ini support for all OS versions\nExternal file support for both SLIC's and certificates\nNewer GRLDR versions before other applications, thus a greater chance of a successful activation\n\nIn short this is now the only application based loader or loader period that has encryption and some randomization going on to help protect you from MS. And on top of that it's using a much newer GRLDR with some bug's fixed\n\nWhat makes this different from every other loader out at the moment?\nIt's not a batch file and all commands are made within the application, it has great error handling and doesn't try to find the active partition based on size (which every other loader is doing at the moment).\n\nWhats the differences between each loader option?\nHover your mouse over each option to see\n\nOk so how do I run it?\nSelect the brand that best suits your system, if the brand isn't there don't worry as you can pick any and it should still work. All you have to do next is click the blue &quot;Install&quot; button and wait for the completed message.\n\nI activated Windows 7 and now I want to activate Windows Vista, why isn't it working?\nUse the uninstall option while on Windows 7 and reboot into Windows Vista. Next install your selected cert/slic in Windows Vista and then reboot back to Windows 7 and click install.\n\nActivation failed, now what?\nTry again with the beta or the older loader option enabled, one of them might just work for you.\n\n** I have tested this on a virtual machine with a 100% success rate **\n\n\nChanges since 1.6.4\n1.6.5 -- Improved profile matchups (for matching a SLIC, certificate and serial)\n1.6.5 -- Added activation checking for Windows 7, Vista and Server 2008\n1.6.5 -- Added tokens checking for Windows 7 (alerts the user, repair is manual so that later on down the line this loader will never frankenbuild your system itself!)\n1.6.5 -- Added error handling should UAC fail to elevate the application\n1.6.5 -- Added Asus SLIC, certificate and Home Premium serial\n1.6.5 -- Added new GRLDR beta 0.93 from zsmin\n1.6.6 -- Fixed activation checking for non-english systems (This release is just to address confusion as to if a system is activated or not)\n1.6.7 -- Fixed Windows Vista activation status\n1.6.7 -- Added Windows 7 Enterprise editions as a supported OS, although you will need to wait for OEM SLP keys to leak\n1.6.8 -- Added application integrity checking. This is a new feature which will display you with information about how the application was launched when the mouse is hovered over the green or red icon.\nIt's goal is to inform you if you are running an untouched version of the application or one that could have been modified in some way by a script kiddie. Of course green is the best result, if it's red then be cautious as someone's likely binded a trojan!\n1.6.9 -- Added amber as a color to the application integrity checking as well as a few tweaks to the existing code (you should still always check the displayed application path even when green)\n1.6.9 -- Cleaned up some code for better performance\n1.6.9 -- Added new GRLDR 0.94 from zsmin\n\nChanges since 1.6.9\n1.7.0 -- Removed the older loader\n1.7.0 -- Added loader mode options\n1.7.0 -- Changed the UI so that it's now slightly transparent as well as resized to suit the new options\n1.7.0 -- Added Samsung support for Windows 7 Ultimate, Professional &amp; Home Premium editions\n1.7.0 -- Improved internal resources security\n1.7.1 -- Removed window transparency to fix a Windows 7 artifacts bug and improve responsiveness on older systems using onboard graphics\n1.7.1 -- Improved the &quot;Custom menu.lst&quot; loader option. It will now show all people using this setting the GRUB menu at system startup\n1.7.1 -- Upgraded some certificates to version 2.1\n1.7.1 -- Added a new GRLDR version (0.96) from zsmin (custom edition for my program)\n1.7.1 -- Added external SLIC support (read &quot;How to add support.txt&quot; for more info)\n1.7.1 -- Added support for BenQ and Sony machines\n1.7.1 -- Added support for Windows 7 Starter Edition\n1.7.1 -- Added various new OEM SLP serials\n1.7.2 -- Added encrypted SLIC support\n1.7.2 -- Added random loader names\n1.7.2 -- Added byte differences (everyones GRLDR loader won't be byte for byte the same)\n1.7.2 -- Added a new GRLDR version (0.97) from zsmin (custom edition for my program)\n1.7.2 -- Added /norestart argument\n1.7.2 -- Added support for Windows 7 Home Basic (4 new keys)\n1.7.3 -- Improved free drive letter assignment\n1.7.3 -- Corrected some grammar\n1.7.3 -- Added random SLIC encryption support, this means everyones SLIC will have a unique encryption\n1.7.3 -- Added GRLDR file size randomization\n1.7.3 -- Added GRLDR v0.97-DAZ+SEC-R2. This is just a minor version to support the random encryption\n1.7.3 -- Added SLIC table detection (BIOS mod and software, it can tell the difference) -- this feature is in BETA\n1.7.3 -- Added support for Advent, Medion and Nokia\n1.7.3 -- Added various new OEM SLP serials\n1.7.4 -- Improved SLIC detection (still not tied to anything, it's simply a BETA feature until I get more feedback)\n1.7.4 -- Fixed file write errors caused by version 1.7.3\n1.7.4 -- Added support for Server Standard R2\n1.7.4 -- Added support for FSC, Quanmax and Trigem\n1.7.4 -- Added various new OEM SLP serials\n1.7.5 -- Removed the beta SLIC detection (caused crashes on 1.7.4)\n1.7.5 -- Added support for LG\n1.7.5 -- Added various new OEM SLP serials\n1.7.6 -- Improved the encryption support\n1.7.6 -- Added Toshiba Professional serial\n1.7.6 -- Added support for Gigabyte\n\nLatest - 1.7.7 REPACK\nFixed loader modes to stop system hangs\nChanged the way the loader is wrote to the partition (no more mounting)\n\nMD5: fb11ad4bfdf3b063ce1116294c8db769\nSHA1: 58cbaff2c5473290ceee8c895455df5af140d1c5\n\nSupport Page: http://forums.mydigitallife.info/showthread.php?t=8632\n\n\nExtra information\n--------------------------------------------------------------------------------\nDo I need to update?\nIf you have installed a version and you're activated then you shouldn't need to update. If however you are like me and you like to use the latest and the best versions of software then updating shouldn't be a problem.\n\nCan I install a newer version over an older version?\nYes, you don't need to perform an uninstall to upgrade to a newer version.\n\n\n---------------------------\nInstructions for Use\n\nIf you have NO SLIC 2.1 in BIOS (which unless you flashed with a modded BIOS, you Probably do not have)\n---------------------------\n1. Install windows 7 (DON'T Enter a Serial During Installation).\n2. Run this as Administrator.\n3. Click on Advanced Options. (Optional, Loader will automatically choose best options for your PC)\n4. Choose Matching SLIC and Certificate (Dell, MSI, etc) (Optional)\n5. Choose Serial (Serial Must match Your version of Win 7) (Optional)\n6. Choose an option under loader versions (Optional)\n7. Click on the install button. (under software mod)\n7. Wait for Loader to Work and Reboot.\nEnjoy !!!!\n\nNote:\nIf Windows does NOT Activate:\nRe-run the loader under Win 7 and choose a different Mode from the Drop-Down List.\n\n\nTo Determine if you have Slic 2.0 or Slic 2.1,\nRead this: &lt;a href=&quot;\nhttp://forums.mydigitallife.info/showthread.php?t=8267&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.mydigitallife.info/showthread.php?t=8267&lt;/a&gt;","torrent":{"xt":"urn:btih:26dd867077179f707a780310c8d53fba318e1462","amp;dn":"Windows+7+Loader+v1.7.7+%28REPACK%29+%28x86+-+x64%29+by+Daz+%5BUn-Zipped%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26dd867077179f707a780310c8d53fba318e1462","infoHashBuffer":{"type":"Buffer","data":[38,221,134,112,119,23,159,112,122,120,3,16,200,213,63,186,49,142,20,98]},"announce":[],"urlList":[]}}