{"title":"The.Hairy.Bikers-Northern.Exposure-S01-Complete","uid":12528214,"size":6387540857,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:270b2086e92afddc693b6612ff86d3986fcc538a&amp;dn=The.Hairy.Bikers-Northern.Exposure-S01-Complete&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"uggauga","files":12,"time":1444174590,"description":"The Hairy Bikers' Northern Exposure\r\n\r\nThe Hairy Bikers head north on a big Baltic adventure in search of new cuisines to explore, travelling from Germany to Sweden via Poland, Russia, Finland, Estonia, Latvia and Lithuania.\r\n\r\n**************************************\r\n\r\nAll 6 episodes of The Hairy Bikers' Northern Exposure\r\n\r\nWith subtitles. Resolution 1280x720\r\n\r\nBroadcast in September/October 2015 on BBC TWO\r\n \nhttp://www.bbc.co.uk/programmes/b069hr3q\r\n\r\n\r\n**************************************\r\n\r\n\r\n\r\nI will not upload episode 6 separately, just deselect the older episodes\r\n\r\nin your torrent client if you don't want/need to download them.\r\n\r\nHere's the description for episode 6, the final episode:\r\n--------------------------------------------------------\r\n\r\nSouth Sweden\r\nThe Hairy Bikers' Northern Exposure Episode 6 of 6\r\n\r\nA trip around the Baltic wouldn't be complete without the Bikers tasting the ultimate smorgasbord - it's the very best of Sweden on a plate. They then meet Eva, a local fisherwoman (and fisher-feminist!) who had to fight for a place in the fishing community and is now a leading light. They try Eva's delicacies and inherit one of her grandmother's old pickling recipes before getting back on the road. The Bikers have always wanted to cook with wild boar and decide to tackle that Swedish classic - meatballs! The Bikers revel in their new-found Viking spirit! There is a surprise in store for the boys - a DNA test to see if they have any Viking blood flowing through their veins. One of our bikers is a direct descendent of the Viking hordes, but which one is it? After the big reveal, the Bikers head for Stockholm where Dave meets city gardener Johan for a preserving masterclass, and Si gets a pastry crash course with one of Sweden's youngest and most talented bakers. To end their epic road trip, the Bikers jump a ferry for the medieval island of Gotland, a real foodies' paradise. The Bikers enjoy the islands specialities of lamb and crayfish before a sensational final cook with one of Sweden's top chefs - Filip Fasten. What a finale!\r\n\r\n_______________________________________________________\r\n\r\nPlease seed !!!","torrent":{"xt":"urn:btih:270b2086e92afddc693b6612ff86d3986fcc538a","amp;dn":"The.Hairy.Bikers-Northern.Exposure-S01-Complete","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"270b2086e92afddc693b6612ff86d3986fcc538a","infoHashBuffer":{"type":"Buffer","data":[39,11,32,134,233,42,253,220,105,59,102,18,255,134,211,152,111,204,83,138]},"announce":[],"urlList":[]}}