{"title":"City.Of.Ember.2008.720p.BluRay.x264-RETEIL","uid":6182986,"size":4676579356,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:272088a46f4e63451aad2a13c68fd988428ef1ec&amp;dn=City.Of.Ember.2008.720p.BluRay.x264-RETEIL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"reteil","files":2,"time":1298020341,"description":"Original Title: ........... City of Ember\n\nYear: ..................... 2008\n\nGenre: .................... Children\\'s/Family\n\nCategory: ................. Race Against Time, Trapped or Confined, Future                 Dystopias, Post-Apocalypse, Unlikely Heroes\n\nDirector: ................. Gil Kenan\n\nCountry: .................. USA\n\nActors: ................... David Ryall, Saoirse Ronan, Harry Treadaway, Ian\nMcElhinney, Bill Murray, Harry Treadaway, Tim Robbins, Martin Landau, Bill Murray, Mary Kay Place, B.J. Hogg, Toby Jones, Marianne Jean-Baptiste, Lucinda Dryzek, Mackenzie Crook, Matt Jessup, Tim Robbins, Amy Quinn, Lara McIvor, Catherine Quinn, Myles Thompson, David Ryall, Eoin McAndrew, Ian McElhinney, Rachel Morton, B.J. Hogg, Conor MacNeill, Lorraine Hilton, Lucinda Dryzek, Saoirse Ronan, Matt Jessup, Lara McIvor, Liam Burke, Mary Kay Place, Miles Thompson, Eoin McAndrew, Liz Smith, Amy Quinn, Rachel Morton, Catherine Quinn, Conor MacNeill, Lorraine Hilton, Simon Kunz, Liam Burke, Martin Landau, Frankie McCafferty, Liz Smith, Marianne Jean-Baptiste, Simon Kunz, Frankie McCafferty, Heathcote Williams, Mackenzie Crook, Maureen Dow, Maureen Dow, Becky Stark, Becky Stark, Brid Ni Chionaola, Brid Ni Chionaola, Mark Mulholland, Mark Mulholland, Valerie O\\'Connor, Valerie O\\'Connor, Ann Queensberry, Ann Queensbury, Chris Parson, Judy Donovan, Drew Thompson\n\nCountry: .................. USA\nIMDB: ..................... http://www.imdb.com/title/tt0970411\nIMDB: ..................... Rating 6.4\n\nDuration: ................. 01:34:43\nFile Size: ................ 4459 Mb\n\nVideo Codec: .............. AVC\nFrame Rate: ............... 24 Fps\nVideo BitRate: ............ 4942 Kbps\nAspect Ratio: ............. 2.40:1\nResolution: ............... 1280x528\n\nAudio Codec: .............. DTS\nAudio BitRate: ............ 1509 Kbps\nChannels: ................. 6\nSampling Rate: ............ 48000 Hz\n\nLanguage: ................. English\nSubtitles: ................ Spanish\n\n\nMonster House director Gil Kenan takes the helm for this children\\'s fantasy about two young heroes who attempt to solve an ancient mystery in time to prevent their underground city from being swallowed by darkness. The City of Ember was built over 200 year ago, \ndeep below the earth, where the destruction of a mass-scale disaster couldn\\'t reach it. Equipped with a massive generator and vast supplies, the people of Ember have thrived happily for generations -- but the city wasn\\'t meant to be lived in forever. The generator is \nbreaking down and the supplies are running out, but two centuries in isolation have robbed the Emberites of their knowledge -- nobody knows how the electric lights work anymore, and nobody understands that there\\'s something beyond the city besides darkness. \nNobody, that is, besides Lina (Saoirse Ronan) and Doon (Harry Treadaway), two teenagers who still have the hope that everyone else has lost to ignorance and apathy -- not to mention a sheet of instructions left by the Builders themselves explaining how to leave the \ncity. But the 200-year-old paper is falling apart, and pieces are missing. So with the lights threatening to flicker out for the last time and leave Ember in darkness forever, Lina and Doon set out on an adventure through the streets, sewers, and dark caverns of Ember to \nput the pieces back together. To solve the mystery, they\\'ll have to get inside the Builders\\' heads, and avoid the grasp of corrupt Mayor Cole (Bill Murray), who wants to keep Ember the way it is -- no matter what the cost.","torrent":{"xt":"urn:btih:272088a46f4e63451aad2a13c68fd988428ef1ec","amp;dn":"City.Of.Ember.2008.720p.BluRay.x264-RETEIL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"272088a46f4e63451aad2a13c68fd988428ef1ec","infoHashBuffer":{"type":"Buffer","data":[39,32,136,164,111,78,99,69,26,173,42,19,198,143,217,136,66,142,241,236]},"announce":[],"urlList":[]}}