{"title":"The Cars - Strap Me In [promo].VOB","uid":11775318,"size":268605440,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:27a8f0ee848803c3878bd918633de5e4ac44e423&amp;dn=The+Cars+-+Strap+Me+In+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":1,"time":1427260188,"description":"The Cars - Strap Me In [promo].VOB\n\n\nHQ uber rare promo music video from a promo DVD. &quot;Strap Me In&quot; is a 1987 song by The Cars, appearing on their sixth studio album Door to Door.\n\nLike its predecessor, &quot;You Are the Girl&quot;, a music video was produced for &quot;Strap Me In&quot;. The video featured the band playing in a barren wasteland as a couple fought. It was also the final video the Cars made before they broke up, with the next video being made for &quot;Sad Song&quot; in 2011.\n\n&quot;Strap Me In&quot; first saw release on the Door to Door album in August 1987, opening the second side of the album. In September 1987, &quot;Strap Me In&quot; also saw single release in America (as well in Japan, Germany, and Australia) as the follow-up to the top-twenty single &quot;You Are the Girl&quot;. However, it was unable to match the chart success of its predecessor, only managing to reach #85 on the Billboard Hot 100, although it did reach #4 on the Billboard Mainstream Rock chart. A follow-up single, &quot;Coming Up You&quot; performed marginally better, hitting #74 in America.\n\n&quot;Strap Me In&quot; was noted in the Just What I Needed: The Cars Anthology liner notes as the &quot;standout track&quot; from Door to Door, which also said, &quot;'Strap Me In' proved that [Ric] Ocasek could still turn an automotive double-entendre with the best of them.&quot;\n\n\nThe Cars are an American rock band that emerged from the new wave scene in the late 1970s. The band originated in Boston, Massachusetts, with lead singer, rhythm guitarist and songwriter Ric Ocasek, lead singer and bassist Benjamin Orr, lead guitarist Elliot Easton, keyboardist Greg Hawkes and drummer David Robinson. They were signed to Elektra Records by George Daly, then A&amp;R head, in 1977.\n\nThe Cars were at the forefront in merging 1970s guitar-oriented rock with the new synth-oriented pop that was then becoming popular and which would flourish in the early 1980s. The Cars started fresh with their debut album The Cars which went on to go platinum in late 1978. The Cars' debut album was called a &quot;genuine rock masterpiece&quot; by AllMusic, and was propelled by the success of &quot;Just What I Needed&quot; which had helped get the band signed by Elektra Records.\n\nThe band broke up in 1988, and Ocasek had always discouraged talk of a reunion since then, telling one interviewer in 1997 &quot;I'm saying never and you can count on that.&quot; Bassist Benjamin Orr died in 2000 from pancreatic cancer. In 2005, Easton and Hawkes joined with Todd Rundgren to form a spin-off band, The New Cars, which performed classic Cars and Rundgren songs alongside new material. The surviving original members reunited in 2010 to record a new album, titled Move Like This, which was released May 10, 2011, and a tour to start on the same day.\n\nThe Cars have been an influence on many bands over the years, as evidenced by the list of varied artists that have covered their songs. These include Nirvana (who covered &quot;My Best Friend's Girl&quot; at their last-ever live performance on March 1, 1994), Smashing Pumpkins (&quot;You're All I've Got Tonight&quot;), Melvins (&quot;Candy-O&quot;), Red House Painters (&quot;All Mixed Up&quot;), Alkaline Trio (&quot;Bye Bye Love&quot;), Ziggy Marley (&quot;Drive&quot;), Poison (&quot;Just What I Needed&quot;), Deftones (&quot;Drive&quot;), and Hayseed Dixie (&quot;My Best Friend's Girl&quot;), among others.\n(video has a white &quot;vh1 classic&quot; logo at the bottom right)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Strap_Me_In&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Strap_Me_In&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://postimg.org/image/6ls6oik8z/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/6ls6oik8z/&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 9558kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bits]\n   Duration: 00:04:20 :)\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.8\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:27a8f0ee848803c3878bd918633de5e4ac44e423","amp;dn":"The+Cars+-+Strap+Me+In+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27a8f0ee848803c3878bd918633de5e4ac44e423","infoHashBuffer":{"type":"Buffer","data":[39,168,240,238,132,136,3,195,135,139,217,24,99,61,229,228,172,68,228,35]},"announce":[],"urlList":[]}}