{"title":"The Deliberate Dumbing Down of America: A Chronological Paper Tr","uid":11390539,"size":11688568,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:282426d84ebe69378da31191f9785d3894aabd6a&amp;dn=The+Deliberate+Dumbing+Down+of+America%3A+A+Chronological+Paper+Tr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1415321263,"description":"In this book you will discover &quot;how good teachers across America have been forced to use controversial, non-academic methodology in their classrooms; how &quot;school choice&quot; is being used to further dangerous reform goals, and how home schooling and private education are especially vulnerable; how workforce training (school-to-work) is an essential part of an overall plan for a global economy, and how this plan will shortcircuit your child's future career plans and opportunities; [and] how the international, national, regional, state and local agendas for education reform are all interconnected and have been for decades. The deliberate dumbing down of America is a chronological history of the past 100+ years of education reform. Each chapter takes a period of history and recounts the significant events, including important geopolitical and societal contextual information. Citations from government plans, policy documents, and key writings by leading reformers record the rise of the modern education reform movement&quot;","torrent":{"xt":"urn:btih:282426d84ebe69378da31191f9785d3894aabd6a","amp;dn":"The+Deliberate+Dumbing+Down+of+America%3A+A+Chronological+Paper+Tr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"282426d84ebe69378da31191f9785d3894aabd6a","infoHashBuffer":{"type":"Buffer","data":[40,36,38,216,78,190,105,55,141,163,17,145,249,120,93,56,148,170,189,106]},"announce":[],"urlList":[]}}