{"title":"Total Commander 8.52 LitePack|PowerPack|ExtremePack +Key-AppzDam","uid":12296521,"size":362239226,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2826212072d28545e2351698710611ae1346e18e&amp;dn=Total+Commander+8.52+LitePack%7CPowerPack%7CExtremePack+%2BKey-AppzDam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AppzDam","files":25,"time":1440624053,"description":"For more info visit : appzdam.net\n\nTotal Commander (former Wincmd) is a file manager for Windows similar to the Windows Explorer. But Total Commander uses a different approach: it has two fixed windows side by side like a well-known file manager for DOS.\n\nFeatures :\n\nExtremePack Commander 8.52 Total - file manager Total Commander 8.51 with the best plug-ins and selected portable (portable) programs.\nLitePack Commander 8.52 Total - file manager Total Commander 8.51 with minimal changes. Legal Russian version with pickup your keys\nCommander PowerPack 8.52 Total - file manager Total Commander 8.51 with the best plug-ins and utilities. Legal Russian version with pickup at the time of installation located in the Installer folder of keys.\nThe use of hot keys as in the original DOS\nSupport drag and drop objects using the Drag-and-Drop\nExtended copying, moving, renaming and deleting entire directories\nProcessing and Image files as folders, subfolders\nCommand line for the simple starting programs with the specified parameters\nExtended search function with full-text search in any files between different drives\nBuilt-in file viewer (press F3) to view files of any size in HEX, binary or text format\nInternal function unpacking ZIP-file without the intervention of external tools\nCustomizable main menu\nInternal unpacking archives ZIP, ARJ, LZH, GZ, TAR, RAR and ACE formats\nInternal packer ZIP-archives\nWorking with network drives and FTP-servers\nAnd many other possibilities\nFull Unicode support in most functions where possible, including FTP, built-in ZIP-packer interface and plug-ins\nThe help file is now available in the default HTML-format (CHM)\nSupport for most file operations, file names longer than 259 characters (up to 1022)\nCompare by content allows to compare text files of different types, for example, ANSI and UTF-8\nHeader file panel (the path to the current directory) can act as control the mouse or keyboard navigation bar\nAn option to display the contents of another toolbar (BAR-file) in the form of pop-up menu button on the parent panel, instead of switching between panels\nDisplay the list of FTP-connections icons and hierarchical structure with custom virtual folders\nProtect FTP-saved passwords with a master password using AES256 encryption algorithm\nFTP, mode PORT: Ability to specify an external IP-address of the Internet router\nRunning through the command-line options internal viewer, comparison tools by content and directory synchronization without opening the main window of Total Commander\nEdited by Ctrl + Z format descript.ion comments now have a maximum length of 4095 characters, and support line breaks\nOption to synchronize also empty directories, option to copy just specific file properties\nAdded support checksum SHA1 format\nThe ability to use the Windows key for custom keyboard shortcuts\nOn 64-bit versions of Windows can use 64-bit shell extensions in the context menu\nNew internal command cm_SwitchX64Redirection, to enable / disable the forwarding of calls to the System32 folder for 64-bit Windows\nInternal unpacking a multivolume RAR-archives as well as RAR-archives, where the encrypted names of packed files\nCopying files / folders in a single operation in a few selected directories recipient\nQuick search with search dialog: Output button, to show only files / directories that match the filter\nChange the character encoding in the internal viewer.\nInternal system file associations, for example, using Total Commander from a USB flash drive\nPortable version works without any installation on your computer.\n\nWhat's New :\n\nAdded 64-bit version of the plug 3 AmpView 3.3 Beta\nAdded Destroy Windows Spying for blocking espionage\nUpdated file manager Total Commander to 8.52 Final\nUpdated editor instead of pad AkelPad to 4.94 Final\nUpdated module to display the menu startup AutoRuns 13.4\nUpdated Disk Cleaner Wise Disk Cleaner 8.81.617 to\nUpdated registry cleaner Registry Cleaner 8.71.558 to\nUpdated module opening passwords Password Cracker 4.1.5\nUpdated the best task manager System Explorer to 7.00\nUpdated Russian popular RAR Archiver to 5.30 Beta 2\nUpdated module opening of RAR-archive UnRAR to 5.30.2.1679\nUpdated PDF-viewer SumatraPDF 3.1.10196 in sLister\nUpdated plugin count the size of folders DirSizeCalc 2.22\nUpdated plugin advanced speakers to ShellDetails 1.25\nUpdated plug-in view of information about the files to the FileInfo 2.22\nUpdated plug-in to work with mht-files MhtUnPack 2.0\nUpdated plug-in WebDAV-access WebDAV servers to 2.7\nUpdated NSIS installer build the new version 3.0 Beta 2\nUpdated MediaInfo to 0.7.7.6 in the plugin wdx_TCMediaInfo\n\nNotes :\n\nThe keys are picked up during installation. If it does not copy the keys in the program folder\n\nFAQ :\n\n1. It will work in 32 &amp; 64 bit?\n\n- Yes\n\n2. Is this multilanguage?\n\n- Yes\n\n3. Is this Activated?\n\n- Activator (Crack/Key) provided just read install notes section or .txt/.nfo files for treatment procedure.\n\n4. My antivirus detect as virus?\n\n- Just disable it until process not complete because some of antivirus count keygen,crack,patch as false +ve. Don't worry all files safely checked by us","torrent":{"xt":"urn:btih:2826212072d28545e2351698710611ae1346e18e","amp;dn":"Total+Commander+8.52+LitePack%7CPowerPack%7CExtremePack+%2BKey-AppzDam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2826212072d28545e2351698710611ae1346e18e","infoHashBuffer":{"type":"Buffer","data":[40,38,33,32,114,210,133,69,226,53,22,152,113,6,17,174,19,70,225,142]},"announce":[],"urlList":[]}}