{"title":"Stalin - A Biography By Robert Service ABEE","uid":9345349,"size":2267207,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28894be9a49d25316673de682ab12fb2b5f2ea60&amp;dn=Stalin+-+A+Biography+By+Robert+Service+ABEE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"The_Abee","files":3,"time":1387031401,"description":"Stalin: A Biography By Robert Service ABEE\n__\n &lt;a href=&quot;\nhttp://beeimg.com/images/a60619877492.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://beeimg.com/images/a60619877492.jpg&lt;/a&gt;\n\nAbout:\n__\n\nOverthrowing the conventional image of Stalin as an uneducated political administrator inexplicably transformed into a pathological killer, Robert Service reveals a more complex and fascinating story behind this notorious twentieth-century figure. Drawing on unexplored archives and personal testimonies gathered from across Russia and Georgia, this is the first full-scale biography of the Soviet dictator in twenty years.\n\nService describes in unprecedented detail the first half of Stalin's life--his childhood in Georgia as the son of a violent, drunkard father and a devoted mother; his education and religious training; and his political activity as a young revolutionary. No mere messenger for Lenin, Stalin was a prominent activist long before the Russian Revolution. Equally compelling is the depiction of Stalin as Soviet leader. Service recasts the image of Stalin as unimpeded despot; his control was not limitless. And his conviction that enemies surrounded him was not entirely unfounded.\n\nStalin was not just a vengeful dictator but also a man fascinated by ideas and a voracious reader of Marxist doctrine and Russian and Georgian literature as well as an internationalist committed to seeing Russia assume a powerful role on the world stage. In examining the multidimensional legacy of Stalin, Service helps explain why later would-be reformers--such as Khrushchev and Gorbachev--found the Stalinist legacy surprisingly hard to dislodge.\n\nRather than diminishing the horrors of Stalinism, this is an account all the more disturbing for presenting a believable human portrait. Service's lifetime engagement with Soviet Russia has resulted in the most comprehensive and compelling portrayal of Stalin to date.\n\nPaperback: 736 pages\nPublisher: Belknap Press (September 25, 2006)\nLanguage: English\nISBN-10: 0674022580\nISBN-13: 978-0674022584\n\nSee a tiny collection of my torrents. And, find your favorite books there.  ;)\n_____________________________________\n                                                                                                                                                   &lt;a href=&quot;\nhttp://thepiratebay.se/user/The_Abee/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/The_Abee/&lt;/a&gt;\n_____________________________________\n \n\n  \n                `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n                 SEED PLEASE , LET OTHERS GET IT TOO. \n                `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n\n\n                                                      :)__Abee\t\n","torrent":{"xt":"urn:btih:28894be9a49d25316673de682ab12fb2b5f2ea60","amp;dn":"Stalin+-+A+Biography+By+Robert+Service+ABEE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28894be9a49d25316673de682ab12fb2b5f2ea60","infoHashBuffer":{"type":"Buffer","data":[40,137,75,233,164,157,37,49,102,115,222,104,42,177,47,178,181,242,234,96]},"announce":[],"urlList":[]}}