{"title":"[SexuallyBroken] Fresh faced Amy Faye bound on sybian 540p","uid":12174405,"size":174056087,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:29062fb9aea9fd8ba5fe14c17eb5ca5b6c28c30a&amp;dn=%5BSexuallyBroken%5D+Fresh+faced+Amy+Faye+bound+on+sybian+540p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pornboy89","files":1,"time":1438286075,"description":"[SexuallyBroken] Jun , 2015 - Amy Faye - Fresh faced Amy Faye bound on sybian and throat trained by hard cock, multiple orgasms! - 540p\n\n.......:::Screenshots:::.......\n &lt;a href=&quot;\nhttp://imgnemo.com/?v=536434&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?v=536434&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgnemo.com/?g=924425&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?g=924425&lt;/a&gt;\n\nDescription:\n\nBrunette Amy Faye is adorable and fresh faced, a lifestyler that got into the industry to better explore all of her deviant desires. Who are we to deny her better access to all the dick, orgasms and bondage her kinky little heart craves? What can we say, we are just givers like that. Let's see just how much we can break this one.\n\nBound down and shackled to a sybian, Amy is ready for the ride of her life. A sybian is, quite simply, the world's most powerful vibrator. It sounds like a jet engine taking off. Once a pussy is placed on it, it WILL cum. Over and over. For as long as we desire and as long as electricity in flowing in our building. This should be fun. Time for some multi tasking throat training. Dick, meet tender throat.\n\nOne after the other, the cocks slam home balls deep, reshaping out her face pussy until it is custom fitted. This is her new purpose in life, to just be a hole for our use. As the dicks drive in, the drool pours out. All the while the sybian is works its magic between her bound thighs. Her eyes go glassy and her body goes limp as wave after wave of orgasms wash over her bound flesh.\n\nThe relentless face pounding and multiple orgasms does the trick, blasting her into sexually subspace. Amy is left messy and dazed, covered in her own drool and cum. We leave her with a black ballgag wedged between her well used mouth, just to remind her what that hole is meant for. We will be back for another round when we feel the urge","torrent":{"xt":"urn:btih:29062fb9aea9fd8ba5fe14c17eb5ca5b6c28c30a","amp;dn":"%5BSexuallyBroken%5D+Fresh+faced+Amy+Faye+bound+on+sybian+540p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29062fb9aea9fd8ba5fe14c17eb5ca5b6c28c30a","infoHashBuffer":{"type":"Buffer","data":[41,6,47,185,174,169,253,139,165,254,20,193,126,181,202,91,108,40,195,10]},"announce":[],"urlList":[]}}