{"title":"Australian Pharmacy Law and Practice, 2E 2013 [PDF][Dr.Carson] V","uid":11112516,"size":8803580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:293ecdecdf72ad3719bf62e15f7df7d5419ba748&amp;dn=Australian+Pharmacy+Law+and+Practice%2C+2E+2013+%5BPDF%5D%5BDr.Carson%5D+V&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vickey1992","files":1,"time":1411776019,"description":"Book: Australian Pharmacy Law and Practice, 1e\nAuthors: John S. Low PhC MSHP, Laetitia Hattingh MPharm BPharm GCAppLaw AACPA\nAustralian Pharmacy Law &amp; Practice addresses the current issues surrounding pharmacy law and regulation in Australia. As the Federal Government moves to implement a national registration and accreditation scheme for pharmacists, the pharmacy workforce is set to become more mobile as a result. There has been no greater time than now for practising pharmacists and students to understand the implications of current legislation and legal provisions underpinning their area of practice. This text provides a comprehensive analysis and discussion of the legislation and practice standards which are relevant to the practice of pharmacy. As well as covering specific pieces of legislation relating to the regulation of pharmacy practice and drug control, Australian Pharmacy Law &amp; Practice includes important sections on legal concepts and the Australian constitution; the evolution of pharmacy practice and ethics; privacy legislation; occupational health and safety; and professional conduct including matters regarding investigation, discipline, and legal proceedings. Australian Pharmacy Law &amp; Practice is the first text of its kind to address pharmacy practice in all its facets in the unique context of the Australian legal framework. It will be a valuable resource to students and overseas trained pharmacists seeking registration in Australia, as well as to qualified practitioners who seek to better understand the laws and standards that govern the profession.Unique to the Australian marketplace - presently there is no publication dealing specifically with pharmacy law and ethics in this countryEach chapter includes - learning objectives, review questions and activities, and further readingsThe inclusion of quotation from case law - provides an opportunity for readers to learn from history.\n\n\n\nCopyright to the respective owners.If you like this book then please buy it.\nSharing is caring,Seed this torrent so others could enjoy it too.","torrent":{"xt":"urn:btih:293ecdecdf72ad3719bf62e15f7df7d5419ba748","amp;dn":"Australian+Pharmacy+Law+and+Practice%2C+2E+2013+%5BPDF%5D%5BDr.Carson%5D+V","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"293ecdecdf72ad3719bf62e15f7df7d5419ba748","infoHashBuffer":{"type":"Buffer","data":[41,62,205,236,223,114,173,55,25,191,98,225,95,125,247,213,65,155,167,72]},"announce":[],"urlList":[]}}