{"title":"The Company Band - Sign Here, Here and Here  192kbs","uid":4975971,"size":23079938,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:296d460181febdbeea5e78ed233db3fc0076cedc&amp;dn=The+Company+Band+-+Sign+Here%2C+Here+and+Here++192kbs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BullyPisten","files":4,"time":1246003442,"description":"The Company Band is a Rock Supergroup featuring Clutch frontman Neil Fallon, Fireball Ministry frontman James Rota, CKY drummer Jess Margera, Guitarist Dave Bone, and Fu Manchu bassist Brad Davis.\n\nThe group was formed by James Rota, Dave Bone and Jason Diamond in 2006 as a side project when they had free time. After a show in 2006 where Fireball Ministry was supporting CKY, Rota approached Margera about playing drums with them. Jess agreed and the band made some instrumental tracks. Later, Fallon agreed to appear as a guest vocalist on one of the songs. Eventually Fallon became a full member of the group and the line-up was complete.\n\nThe band was invited to record at Bam Margera's recording studio, The Hobbit Hole on Bam's Pennsylvania Estate, and was mixed by Andrew Alekel at Grandmaster Recorders in Hollywood. The band's debut EP, Sign Here, Here and Here was released through the iTunes Store, with a CD released in February 2008.\n\n\n\nSign Here, Here and Here is an EP by The Company Band.\n\nThis is The Company Band's debut recording, it was recorded at Bam Margera's personal studio The Hobbit Hole during 2007.\n\nThe CD was mixed by Andrew Alekel at Grandmaster Recorders in Hollywood.\n\nTrack listing\n\nAll songs written and composed by Neil Fallon, Jess Margera, Dave Bone, James Rota and Jason Diamond.. \n\n\nSign Here, Here and Here\n\n# \tTitle \tLength\n\n1. \t&quot;Company Man&quot;   \t\n2. \t&quot;Fortune's a Mistress&quot;   \t\n3. \t&quot;Spellbinder&quot;   \t\n4. \t&quot;Heartache &amp; Misery&quot;   \t\n","torrent":{"xt":"urn:btih:296d460181febdbeea5e78ed233db3fc0076cedc","amp;dn":"The+Company+Band+-+Sign+Here%2C+Here+and+Here++192kbs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"296d460181febdbeea5e78ed233db3fc0076cedc","infoHashBuffer":{"type":"Buffer","data":[41,109,70,1,129,254,189,190,234,94,120,237,35,61,179,252,0,118,206,220]},"announce":[],"urlList":[]}}