{"title":"Killing Pablo: The Hunt for the World's Greatest Outlaw","uid":11783004,"size":592447,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:297cf3d25ec6e9a415ad786dfcd4ed18c72692ff&amp;dn=Killing+Pablo%3A+The+Hunt+for+the+World%27s+Greatest+Outlaw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427666515,"description":"Killing Pablo is the story of the fifteen-month manhunt for Colombian cocaine cartel kingpin Pablo Escobar, whose escape from his lavish, mansionlike jail drove a nation to the brink of chaos. In a gripping, up-close account, acclaimed journalist Mark Bowden exposes the never-before-revealed details of how U.S. military and intelligence operatives covertly led the mission to find and kill the world's most dangerous outlaw. Drawing on unprecedented access to the soldiers, field agents, and officials involved in the chase, as well as hundreds of pages of top-secret documents and transcripts of Escobar's intercepted phone conversations, Bowden creates a narrative that reads as if it were torn from the pages of a Tom Clancy technothriller. Killing Pablo also tells the story of Escobar's rise, how he built a criminal organization that would hold an entire nation hostage -- and the stories of the intrepid men who would ultimately bring him down. There is Steve Jacoby, the leader of Centra Spike, the ultrasecret U.S. special forces team that would use cutting-edge surveillance technology to find one man among a nation of 37 million. There is Morris Busby, U.S. ambassador to Colombia, who would convince the Bush administration to approve the deployment of the shadowy Delta Force operators who would be the key to the drug lord's demise. And there is Escobar's archenemy, Col. Hugo Martinez, the leader of Colombia's federal police, who would turn down a $6 million bribe, survive countless attempts on his life, and endure a humiliating exile while waging his battle against the drug lord's criminal empire. It was Martinez's son, raised in the shadow of constant threat from Escobar's followers, who would ultimately track the fugitive to a Bogota rooftop on the fateful day in 1993 when the outlaw would finally meet his end. Action-packed and unputdownable, Killing Pablo is a tour de force of narrative journalism and a stark portrayal of rough justice in the real world","torrent":{"xt":"urn:btih:297cf3d25ec6e9a415ad786dfcd4ed18c72692ff","amp;dn":"Killing+Pablo%3A+The+Hunt+for+the+World%27s+Greatest+Outlaw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"297cf3d25ec6e9a415ad786dfcd4ed18c72692ff","infoHashBuffer":{"type":"Buffer","data":[41,124,243,210,94,198,233,164,21,173,120,109,252,212,237,24,199,38,146,255]},"announce":[],"urlList":[]}}