{"title":"Banned Cartoon - Coal Black and the Sebben Dwarfs","uid":7589974,"size":48629946,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:29c501408e2ffe64e5ac72dfe877c50511bb82a8&amp;dn=Banned+Cartoon+-+Coal+Black+and+the+Sebben+Dwarfs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AthePG2","files":2,"time":1346513075,"description":"Coal Black and de Sebben Dwarfs (working title: So White and de Sebben Dwarfs) is a Merrie Melodies animated cartoon directed by Bob Clampett, produced by Leon Schlesinger Productions, and released to theatres on January 16, 1943 by Warner Bros. Pictures and The Vitaphone Corporation. The film is notable for being an all-black parody of the Brothers Grimm fairy tale Snow White, known to its audience from the popular 1937 Walt Disney animated feature Snow White and the Seven Dwarfs. The stylistic portrayal of the characters, however, is an example of darky iconography, which was widely accepted in American society at the time. As such, it is one of the most controversial cartoons in the classic Warner Bros. library, has been rarely seen on television, and has never been officially released on home video. However, it is often named as one of the best cartoons ever made, in part for its African-American-inspired jazz and swing music, and is considered one of Clampett's masterpieces.","torrent":{"xt":"urn:btih:29c501408e2ffe64e5ac72dfe877c50511bb82a8","amp;dn":"Banned+Cartoon+-+Coal+Black+and+the+Sebben+Dwarfs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29c501408e2ffe64e5ac72dfe877c50511bb82a8","infoHashBuffer":{"type":"Buffer","data":[41,197,1,64,142,47,254,100,229,172,114,223,232,119,197,5,17,187,130,168]},"announce":[],"urlList":[]}}