{"title":"DB - Gabriella Paltrova and The Pope.avi","uid":12330337,"size":1475705972,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:29c5b2eb453418215925f0422e3860eac26bc4cb&amp;dn=DB+-+Gabriella+Paltrova+and+The+Pope.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Lost213","files":1,"time":1441181064,"description":"From time to time I like to change things up a bit, and today is one of those days. As the interview is coming to an end, I notice this smirk on Gabby's face and I can't help to think that she is not taking this as serious as she should be. I approach her, slap her across her smiling face, snatch her up by her throat, rip her clothes away, and show her that today I will not tolerate her shit.\n\n\n\nWe put her in a straight jacket, tether her to our rig and begin the day. She likes to squirm, so I slowly take her legs out of the equation. She is now suspended and completely helpless. She endures a heavy flogging before I attack her sensitive pussy and rip multiple orgasms out of her.\n\n\n\nNext she is locked into a floating spread eagle, with metal traps ensuring that she can't move at all. A zipper is applied and left to increase the suffering. Her feet get the full treatment including paddling, bands, and the cattle prod. She is allowed to orgasms, but then there is that zipper that we still have to rip from her body.\n\n\n\nIn the final scene she is on her back, legs spread, and her feet at the perfect height for more torment. The assault on her sensitive soles continues until we break this little slut. Then her ass is fucked and she is made to cum more than she can handle.\n\nScreens: http://mega-pix.eu/image/p","torrent":{"xt":"urn:btih:29c5b2eb453418215925f0422e3860eac26bc4cb","amp;dn":"DB+-+Gabriella+Paltrova+and+The+Pope.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29c5b2eb453418215925f0422e3860eac26bc4cb","infoHashBuffer":{"type":"Buffer","data":[41,197,178,235,69,52,24,33,89,37,240,66,46,56,96,234,194,107,196,203]},"announce":[],"urlList":[]}}