{"title":"Weekends At Grandpas 3 (2015) WEB-DL","uid":12237375,"size":2039750891,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2b0d0fc18f34f436ed561ee4525046b1f74f84ed&amp;dn=Weekends+At+Grandpas+3+%282015%29+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Ctrlme","files":3,"time":1439689037,"description":"Weekends At Grandpas 3 (2015) WEB-DL\n\nScreenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/NuT&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/NuT&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/NuV&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/NuV&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/Nub&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/Nub&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/Nul&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/Nul&lt;/a&gt;\n\nMiranda Mills, Hope Harper, Rachel Rose\n\nThey'll do anything to make them happy! All taboo sex between young chicks and old men that take full advantage! But grandpa! It just seems so wrong! Miranda Mills - Dear Diary: The college applied rejected me or some reason. Since Grandpa is on the board of directors I figured he may be able to help. When I asked him about it Grandpa explained that in order for me to get in to the college of my dreams I'd have to do some things for him. When I figured out he meant sex I was a bit shocked but kind of turned on too. I agreed and we sealed the deal with some of the hottest sex I've ever had. I think I really love my Grandpa. Dear Diary: A few days later Grandpa came by and gave me the good news, my application was accepted. I was so excited I started sucking his cock right there in my room. Grandpa must have enjoyed it too, I've never swallowed that much cum in my life. Hope Harper - Dear Diary: I've been having really kinky thoughts about grandpa. Everytime he visits, he drives his corvette over and I imagine him taking me back to his house and taking me right there in the hall! Well, my naughty fantasy finally came true! Last night grandpa came and picked me up for my birthday dinner and everything happened just like I imagined it would! We started kissing in the corvette and things got steamy so we took our fun inside! We were kissing and undressing and next thing I know we are taking turns going down on one another! Oh my gosh grandpa is soooo huge! I decided to let him take me right then and there and we started making passionate love. I really want to spend more alone time with grandpa! Rachel Rose - Dear Diary: I've been wanting to take a trip after graduation but funds were pretty tight. I thought I could get some money out of my grandpa so I went to visit him. Apparently I'm not the first granddaughter to come looking for a favor because Grandpa already had a deal in mind. I picked up on what he was suggesting, and soon was sucking his cock. Grandpa has a pretty nice cock so it wasn't hard to get off when I rode him but when he took over he didn't last very long inside me before he came. I wonder if I can get more money if he knocks me up too? Dear Diary: The next morning I went into his room and started rubbing his cock through the blanket getting him rock hard. I started sucking his cock and soon we were fucking like crazy again.\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n\n               If you like this torrent, please post a comment!\n            \n                            Don't forget to seed!\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n &lt;a href=&quot;\nhttps://pirates-forum.org/User-Ctrlme&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-Ctrlme&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.vg/user/Ctrlme/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.vg/user/Ctrlme/&lt;/a&gt;","torrent":{"xt":"urn:btih:2b0d0fc18f34f436ed561ee4525046b1f74f84ed","amp;dn":"Weekends+At+Grandpas+3+%282015%29+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b0d0fc18f34f436ed561ee4525046b1f74f84ed","infoHashBuffer":{"type":"Buffer","data":[43,13,15,193,143,52,244,54,237,86,30,228,82,80,70,177,247,79,132,237]},"announce":[],"urlList":[]}}