{"title":"Soccer in Sun and Shadow (2013) Eduardo Galeano (multi)","uid":9505863,"size":19644022,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2bad0c0d9f4ba6654471d9d13d6102515cd59fab&amp;dn=Soccer+in+Sun+and+Shadow+%282013%29+Eduardo+Galeano+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1390316607,"description":"Soccer in Sun and Shadow by Eduardo Galeano\n\n\nFormat: mobi/epub/azw3\nLength: 256 pages\nGenre: Non-Fiction/Football-Soccer\nDate: 23 August 2013\n\nIn this witty and rebellious history of world soccer, award-winning writer Eduardo Galeano searches for the styles of play, players, and goals that express the unique personality of certain times and places.\n\nIn &quot;Soccer in Sun and Shadow,&quot; Galeano takes us to ancient China, where engravings from the Ming period show a ball that could have been designed by Adidas to Victorian England, where gentlemen codified the rules that we still play by today and to Latin America, where the &quot;crazy English&quot; spread the game only to find it creolized by the locals.\n\nAll the greats--Pele, Di Stefano, Cruyff, Eusebio, Puskas, Gullit, Baggio, Beckenbauer--have joyous cameos in this book. yet soccer, Galeano cautions, &quot;is a pleasure that hurts.&quot; Thus there is also heartbreak and madness. Galeano tells of the suicide of Uruguayan player Abdon Porte, who shot himself in the center circle of the Nacional's stadium; of the Argentine manager who wouldn't let his team eat chicken because it would bring bad luck; and of scandal-riven Diego Maradona whose real crime, Galeano suggests, was always &quot;the sin of being the best.&quot;\n\nSoccer is a game that bureaucrats try to dull and the powerful try to manipulate, but it retains its magic because it remains a bewitching game--&quot;a feast for the eyes...and a joy for the body that plays it&quot;--exquisitely rendered in the magical stories of &quot;Soccer in Sun and Shadow.&quot;\n\nAuthor:\n\nEduardo Galeano is one of Latin America's most distinguished writers. He is the author of the three-volume &quot;Memory of Fire; Open Veins of Latin America; Soccer in Sun and Shadow; The Book of Embraces; Walking Words; Upside Down; &quot;and &quot;Voices in Time.&quot; Born in Montevideo in 1940, he lived in exile in Argentina and Spain for years before returning to Uruguay. His work has been translated into twenty-eight languages. He is recipient of many international prizes, including the first Lannan Prize for Cultural Freedom and the Casa de las Americas Prize. ","torrent":{"xt":"urn:btih:2bad0c0d9f4ba6654471d9d13d6102515cd59fab","amp;dn":"Soccer+in+Sun+and+Shadow+%282013%29+Eduardo+Galeano+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bad0c0d9f4ba6654471d9d13d6102515cd59fab","infoHashBuffer":{"type":"Buffer","data":[43,173,12,13,159,75,166,101,68,113,217,209,61,97,2,81,92,213,159,171]},"announce":[],"urlList":[]}}