{"title":"TOUCH OF PINK  2004","uid":4223569,"size":730411055,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2bd0c7238652fede7e3f37d59fc88654d8fa72ad&amp;dn=TOUCH+OF+PINK++2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jebpac66","files":2,"time":1212710037,"description":"TOUCH OF PINK  (GAY Interest)\n\nYear: 2004\nUSA: Sony Pictures Classics\nCast: Jimi Mistry, Kyle MacLachlan, Kristen Holden-Reid, Suleka Mathew, Veena Sood, Brian George, Raoul Bhaneja, Andrew Gillies, Malika Mendez, Liisa Repo-Martell\nDirector: Ian Iqbal Rashid\nCountries: Canada / UK\nUSA: 92 mins\nUSA Rated: R for sexual content and brief language \n\nA comic clash of cultures, values and sexuality, TOUCH OF PINK is a romantic comedy featuring Alim (Jimi Mistry), a young South Asian-Canadian, now living in London, who is so caught up in the romance, style and dreams of the old movies that he thinks he&amp;#039;s living with the spirit of Cary Grant (Kyle MacLachlan).\n\nBut Alim&amp;#039;s ideal life in London with lover Giles (Kristen Holden-Reid) begins to unravel when his mother Nuru (Suleka Mathew) shows up. She&amp;#039;s come to London to find Alim a proper Ismaili-Muslim girlfriend and to convince him to come home to Canada and join the family for his cousin&amp;#039;s spectacular wedding. Once in Toronto, Alim&amp;#039;s different worlds begin to collide and he has to choose between his fantasy life with Cary and the earthier pleasures of real life.\n\n==================================================================================\n\nCanadian writer/director Ian Iqbal Rashid makes his feature film debut with the romantic comedy Touch of Pink. Jimi Mistry plays Alim, an young gay Ismali-Canadian living in a fashionable section of London. He has an active fantasy life involving Kyle MacLachlan, who appears as the charming ghost of Cary Grant. Alim also has an active social life in the real world with his actual boyfriend Giles (Kristen Holden-Ried). His life of leisure is interrupted when his mother Nuru (Suleka Mathew) arrives in town unexpectedly from Toronto. She also has a secret plan to take him back with her to Canada so he can settle down and find a nice Muslim girl to marry. Touch of Pink premiered at the Sundance Film Festival in 2004. \n\n~ Andrea LeVasseur, All Movie Guide","torrent":{"xt":"urn:btih:2bd0c7238652fede7e3f37d59fc88654d8fa72ad","amp;dn":"TOUCH+OF+PINK++2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bd0c7238652fede7e3f37d59fc88654d8fa72ad","infoHashBuffer":{"type":"Buffer","data":[43,208,199,35,134,82,254,222,126,63,55,213,159,200,134,84,216,250,114,173]},"announce":[],"urlList":[]}}