{"title":"Matthew Kelly - The Four Signs of a Dynamic Catholic","uid":10198865,"size":27162485,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2bd3918d49a7bec62b74b7cd83d3d76d3ab95082&amp;dn=Matthew+Kelly+-+The+Four+Signs+of+a+Dynamic+Catholic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ancapcatholic","files":-1,"time":1400737796,"description":"This MP3 features audio excerpts from Matthew Kelly's book &quot;The Four Signs of a Dynamic Catholic.&quot;\n\nAs human beings we are constantly engaging and disengaging in everything we do. We engage and disengage at work, in marriage, as parents, in our quest for health and well-being, in personal finances, environmentally, politically, and, of course, we engage and disengage spiritually.\n\nIf you walk into any Catholic church next Sunday and look around, you will discover that some people are highly engaged, others are massively disengaged, and the majority are somewhere in between, Why? What is the difference between highly engaged Catholics and disengaged Catholics?\n\nAnswering this question is essential to the future of the Catholic Church. If we truly want to engage Catholics and reinvigorate parish life, we must first discover what drives engagement among Catholics. Matthew Kelly explores this question in his groundbreaking new book, and the simplicity of what he discovers will amaze you.\n\nFiletype: MP3\nLength: 56:22\n &lt;a href=&quot;\nhttp://www.lighthousecatholicmedia.org/store/title/the-four-signs-of-a-dynamic-catholic-book-excerpts-on-cd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lighthousecatholicmedia.org/store/title/the-four-signs-of-a-dynamic-catholic-book-excerpts-on-cd&lt;/a&gt;\n\n---\n\nIf you enjoy this presentation, please support Lighthouse Catholic Media, NFP, which is a 501(c)(3) Not For Profit Company that seeks to answer the call for a New Evangelization. Lighthouse Catholic Media specializes in promoting the Catholic Faith through high quality presentations on audio CDs and MP3s from many of the best Catholic speakers in both English and Spanish. You can purchase CD copies of this presentation to give to your friends and family and find many other wonderful presentations available for MP3 download at https://www.lighthousecatholicmedia.org/ \n\nYou can also support Lighthouse Catholic Media and the New Evangelization by making a tax-deductible donation at https://www.lighthousecatholicmedia.org/donate\n\nYou can also help me share more by tipping BTC: 1N3Y2HNWe3xWY4qdYricHRKz58zqqi5MZp","torrent":{"xt":"urn:btih:2bd3918d49a7bec62b74b7cd83d3d76d3ab95082","amp;dn":"Matthew+Kelly+-+The+Four+Signs+of+a+Dynamic+Catholic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bd3918d49a7bec62b74b7cd83d3d76d3ab95082","infoHashBuffer":{"type":"Buffer","data":[43,211,145,141,73,167,190,198,43,116,183,205,131,211,215,109,58,185,80,130]},"announce":[],"urlList":[]}}