{"title":"PC Ã‚Â» JUST CAUSE 2 Full Game directplay by globe@","uid":5459781,"size":1250523659,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2bd38888cf219d9beaa631bbd61ba73b39687da4&amp;dn=PC+%C3%82%C2%BB+JUST+CAUSE+2+Full+Game+directplay+by+globe%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"globeplus","files":-1,"time":1269436415,"description":"* Hello PC great games fans ...\n\n\n* Play the new JUST CAUSE game ...\n\n\n* The freeware FREEARC is needed to extract the arc file\n\n\n* ADDICIONAL INFORMATION FOR ANTIVIRUS PROBLEMS USING THIS GAME : \n  \n  - FOR THE POPULAR AVG DEACTIVATE ONLY THE RESIDENT SHIELD , TO THE OTHER ANTIVIRUS THAT CAUSE INCONVENIENCES USING THE GAME JUST DEACTIVATE THEM BEFORE USING THE FILE , THANK YOU .\n \n( this happen because the dll that help the main executable have a little different structure that can induce some antivirus for a potencial virus file , but the file in question is absolute clean and safe to have in the computer )\n\n\n* STORY : (text extracted from wikipedia) *\n\n* The gameplay is similar to that of its predecessor, in which the player is free to roam the game's open world at will, not having to focus on the game's storyline. In this it is similar to that of other sandbox style action games like Mercenaries.\n\nSeveral new additions and improvements to the game have been highlighted by lead designer, Peter Johansson. The AI has been rewritten to use a planning system which enables enemies to perform varying actions. In game enemies can use the environment to their advantage, taking cover behind objects, and adapting dynamically to the objects around them. Additional elements include vertical gameplay and a manual aiming system that allows the player to have full control over the cross-hair, allowing for the pinpointing of specific limbs with varied crippling effects. Just Cause 2 also has an adaptive difficulty system, gradually scaling the difficulty as the player does more in the game.\n\nThe game takes place on the fictional island of Panau, situated in the Malay Archipelago[citation needed]. It is geographically similar to both New Zealand and Hawaii.\n\nThere are several new weapons in Just Cause 2, including a rocket launcher with laser-controlled rockets, a one-handed grenade launcher, remote-triggered C4, and a detachable mounted minigun. There are several new vehicles, including a Boeing 737, with a greater variance in the handling of different vehicles. Ground surfaces now have a large influence on the player's controls, with respect to the abilities of road vehicles on rough terrain. There is also a real-time deformation system and individual components that can come loose from vehicles.\n\nInitially, the player must acquire weapons and vehicles in the field of their own accord. Early in the game the player encounters a black market supplier, from whom weapons can be purchased along with vehicles, with an option to have them delivered to the player's location via helicopter drop. As the game progresses, additional weapons and vehicles become available on the black market. All weapons and vehicles on the black market have parameters that can be upgraded in several steps, by building upgrades with weapon and vehicle components. There are over 2,000 parts that the player can acquire.\n\n\n\nMINIMUM SYSTEM REQUIREMENTS :\n=============================\n\nOperating System: Microsoft Windows Vista or Windows 7 (Windows XP is unsupported) \nProcessor: Dual-core CPU with SSE3 (Athlon 64 X2 4200 / Pentium D 3GHz) \nGraphics Card: Nvidia Geforce 8800 Series / ATI Radeon HD 2600 Pro with 256MB memory or equivalent DX10 card with 256MB memory \nMemory: 2GB RAM \nDirectX: Microsoft DirectX 10 \nHard Drive: 10GB of free drive space \nOptical Drive: DVD-ROM drive \nSound Card: 100% DirectX 10 compatible sound card \nInternet Connection: Internet connection required for product activation \nInput: Keyboard and mouse (Microsoft Xbox 360 controller optional)\n\n\n\n\n                          ***** enjoy ... *****\n\n","torrent":{"xt":"urn:btih:2bd38888cf219d9beaa631bbd61ba73b39687da4","amp;dn":"PC+%C3%82%C2%BB+JUST+CAUSE+2+Full+Game+directplay+by+globe%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bd38888cf219d9beaa631bbd61ba73b39687da4","infoHashBuffer":{"type":"Buffer","data":[43,211,136,136,207,33,157,155,234,166,49,187,214,27,167,59,57,104,125,164]},"announce":[],"urlList":[]}}