{"title":"Total DC Comics for 3/12/2014 (darkhomr) [ALL]","uid":9762127,"size":830114906,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2c40be8a2512b4ca2cbdee1ddfabe5cc80b4d3c9&amp;dn=Total+DC+Comics+for+3%2F12%2F2014+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dadrkhomr","files":21,"time":1394827365,"description":"This is the 3rd week of a Total DC pack.  Similar to my Total Marvel pack, this gathering of comics will include both DC Universe and non-universe titles.  What will be in here will be Vertigo comics, non-DC Universe titles, and any digital titles released by Friday morning.  This release has 9 DC Universe comics 7 non-Universe titles and 5 digital titles.  \n\nMy release packs are as follows: \n \nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\n\n\nAstro City #10 (CBR 3/12/2014)\n\nWinged Victory, Samaritan and the Confessor take down the villain targeting her - and then she has to face the fallout. Will Astro City's most prominent super heroine survive? Don't miss the grand finale of this four-part epic! \n\nBatgirl #29 (CBR 3/12/2014)\n\nDead before sunrise! Batgirl and the Talon known as Strix race to stop the new villain SILVER, who has ties to I, VAMPIRE star Andrew Bennett! \n\nBatman #29 (CBR 3/12/2014)\n\nThe 'DARK CITY' chapter of 'ZERO YEAR' reaches its conclusion in this amazing, extra-sized issue! Now, the next chapter of Zero Year is almost upon us, and we've saved the best for last! What corners of Batman's past will be revealed? And how will they impact his very near future? Find out here! \n\nCoffin Hill #6 (CBR 3/12/2014)\n\nEve comes face to face with her nightmare from a decade ago - and this time, she can't turn away. As innocent lives hang in the balance, Eve must embrace the legacy of the Coffin Witch to put her family curse to rest...or die trying in the final issue of this storyline! \n\nConstantine #12 (CBR 3/12/2014)\n\nForever Evil: Blight - Part 16 of 18 John Constantine versus Nick Necro for the soul of Zatanna! Continues in this month's TRINITY OF SIN: PANDORA #9! \n\nFBP Federal Bureau Of Physics #8 (CBR 3/12/2014)\n\nDuring dismantle and removal duty in the 51st state, Rosa and Adam are invited to take part in an experiment that will test their limits and blur their concept of reality. \n\nGreen Lantern Corps #29 (CBR 3/12/2014)\n\nJohn Stewart and his team are surrounded by Durlans and Braid Clann on an unfriendly world. Their only hope is to fight their way out! And in the shadows of the Universe, the Corps' worst nightmare is coming true: The Sinestro Corps is stirring! \n\nInjustice: Year Two #5 (CBR 3/12/2014)\n\nGanthet of the Guardians of Oa visits Superman to confront him about his rule over Earth. But Superman has his own issues with Ganthet--concerning Krypton. \n\nJustice League 3000 #4 (CBR 3/12/2014)\n\nThe Justice League of the future learns the terrible truth behind their creation! \n\nJustice League of America #13 (CBR 3/12/2014)\n\nThe fate of the Justice League revealed! Will Manhunter and Stargirl be alive long enough to learn the truth? This combo pack edition includes a redemption code for a digital download of this issue. \n\nNightwing #29 (CBR 3/12/2014)\n\nWith Nightwing questioning his purpose, will he be able to stop Mr. Zsasz's relentless rampage through Chicago? Don't miss this epic story that ties into the events of FOREVER EVIL! \n\nRoyals Masters Of War #2 (of 6) (CBR 3/12/2014)\n\nAs THE ROYALS continues, the truce is broken thanks to Prince Henry's actions during the Battle of Britain! Now, Royals across the world are entering World War II - and that includes the oldest and most powerful of them all, the immortal Emperor Jimmu of Japan. Meanwhile, Henry, Arthur and Rose travel to the United States to attempt to convince President Roosevelt to join the conflict. Will Arthur's drunkenness and Henry's attraction to his sister torpedo the alliance? And who is the uninvited visitor on the White House lawn? \n\nScooby Doo Where Are You #43 (CBR 3/12/2014)\n\nThe Mystery Machine pulls into a small town as the gang plans for some rest and relaxation. But the video game Shaggy and Scooby buy has a problem: the game's villain, Lord Vicious, has been terrorizing the local townspeople! Will they solve the mystery before this menace wins the game? \n\nSmallville: Lantern #1 (CBR 3/12/2014)\n\nThe Green Lantern ring for space sector 2813 was inactive for years after Krypton's end, until of the Argo colony recalled it to service. As none of Zod's followers are suitable candidates, the ring begins to search.\n\nSuperboy #29 (CBR 3/12/2014)\n\nThe son of Superman and his team of humanoid hybrids return to the present-day DC Universe in search of revenge and a chance at changing the world into their own perverted image of a perfect world. \n\nSuperman Wonder Woman #6 (CBR 3/12/2014)\n\nTeen Titans Go #5 (CBR 3/12/2014)\n\nWe all know the Teen Titans are great at throwing &quot;hat parties&quot; and &quot;meatball parties&quot;...but can they throw a regular ol' &quot;party party?&quot; Don't miss who's on the guess list! \n\nWhen the Phantom Zone is breached by Zod, Superman and Wonder Woman are forced to do the unthinkable to stop the tyrant from global destruction. But can they do what must be done - and will the world forgive them? \n\nThe Vampire Diaries #16 (CBR 3/12/2014)\n\nMaude's arrival in Mystic Falls in the fall of 2013 has added complications to the already stormy relationship between Elena and Katherine. Whose philosophy will prevail as they end Stefan's former lover's reign of terror? \n\nAlso included in this pack are \n\nBeware the Batman #10 \nGeneral Mills Presents Justice League #8\nGeneral Mills Presents Justice League #9\n","torrent":{"xt":"urn:btih:2c40be8a2512b4ca2cbdee1ddfabe5cc80b4d3c9","amp;dn":"Total+DC+Comics+for+3%2F12%2F2014+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c40be8a2512b4ca2cbdee1ddfabe5cc80b4d3c9","infoHashBuffer":{"type":"Buffer","data":[44,64,190,138,37,18,180,202,44,189,238,29,223,171,229,204,128,180,211,201]},"announce":[],"urlList":[]}}