{"title":"Last Vikings, The - Seaver - [Non-Fiction] PDF_(K-Slender)","uid":8921673,"size":2523213,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2cd5f0d76e67a7e227977a1cea82825c0a42ef22&amp;dn=Last+Vikings%2C+The+-+Seaver+-+%5BNon-Fiction%5D+PDF_%28K-Slender%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"K-Slender","files":3,"time":1379268375,"description":"English | 2010 | ISBN: 1845118693 | 288 pages | PDF | 2.31 Mb\n\n\nLate in the tenth century, the Norse Vikings embarked on a voyage of no return. Leaving Iceland first for Greenland, from there they sailed onwards to North America, setting foot on its shores five hundred years before Columbus' first journeys of discovery. But by about AD 1500 their settlements were abandoned and the Norse Greenlanders and their explorations of the New World receded into the realms of myth. What happened between these momentous events? How did the Vikings really live -- and die -- and why have so many myths and legends grown up around this mysterious people of the sea?\n\nDrawing on her deep knowledge of the culture and history of the region as well as the most up-to-date evidence from archaeology, medieval history and the evocative Sagas, Seaver weaves together a compelling and authoritative history. Alongside their spectacular achievements and discoveries, she also vividly evokes the last Vikings daily lives and explains why their apparent departure from Greenland in 1500 was not quite such a dramatic schism in the historical record as is often assumed. This compelling history of a people living at the fringes of the known world offers an illuminating entree into the world of the Norse Greenlanders which will captivate all who have ever wondered about the fate of the Vikings and will stand as the definitive work for years to come. ","torrent":{"xt":"urn:btih:2cd5f0d76e67a7e227977a1cea82825c0a42ef22","amp;dn":"Last+Vikings%2C+The+-+Seaver+-+%5BNon-Fiction%5D+PDF_%28K-Slender%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cd5f0d76e67a7e227977a1cea82825c0a42ef22","infoHashBuffer":{"type":"Buffer","data":[44,213,240,215,110,103,167,226,39,151,122,28,234,130,130,92,10,66,239,34]},"announce":[],"urlList":[]}}