{"title":"Iain M. Banks - Transition","uid":13993039,"size":392406353,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2dc07e530f4c4a9b17c583c3739520fb83a36ddb&amp;dn=Iain+M.+Banks+-+Transition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":4,"time":1458718964,"description":"There is a world that hangs suspended between triumph and catastrophe, between the dismantling of the Wall and the fall of the Twin Towers, frozen in the shadow of suicide terrorism and global financial collapse. Such a world requires a firm hand and a guiding light. But does it need the Concern: an all-powerful multiverse-manipulating organization with a malevolent presiding genius, pervasive influence and numberless invisible operatives in possession of extraordinary powers?\r\n\r\nAmong those operatives are Temudjin Oh, of mysterious Mongolian origins, an un-killable assassin who journeys between the peaks of Nepal, a version of Victorian London and the dark palaces of Venice under snow; Adrian Cubbish, a restlessly greedy City trader; and a nameless, faceless state-sponsored torturer known only as the Philosopher, who moves between time zones with sinister ease.\r\n\r\nThen there are those who question the Concern: the bandit queen Mrs. Mulverhill, roaming the worlds recruiting rebels to her side; and Patient 8262, under sedation and feigning madness in a forgotten hospital ward, in hiding from a dirty past.\r\n\r\nAs these vivid, strange and sensuous worlds circle and collide, the implications of turning traitor to the Concern become horribly apparent, and an unstable universe is set on a dizzying course.\r\n\r\n\r\n\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:2dc07e530f4c4a9b17c583c3739520fb83a36ddb","amp;dn":"Iain+M.+Banks+-+Transition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dc07e530f4c4a9b17c583c3739520fb83a36ddb","infoHashBuffer":{"type":"Buffer","data":[45,192,126,83,15,76,74,155,23,197,131,195,115,149,32,251,131,163,109,219]},"announce":[],"urlList":[]}}