{"title":"Just A Minute   (BBC Radio - Series 58 - 2009)","uid":5112133,"size":134028289,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2dcb316f9ddfa7e7c01f092296e3cd5bf278b330&amp;dn=Just+A+Minute+++%28BBC+Radio+-+Series+58+-+2009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eddie1969","files":-1,"time":1254866044,"description":"Just a Minute was devised by the late Ian Messiter who came up with the idea on the top of a number 13 bus.  He suddenly remembered being given the horrible task of speaking for one minute without hesitation or deviation by one of his school masters.\n\nProducer David Hatch put the pilot show before a BBC development board who were sceptical that the series would run for more than six programmes.\n\nThirty-five years later, Chairman Nicholas Parsons continues to attempt - and mostly succeed - in keeping control over a roll-call of celebrity contenders attempting to talk on a subject for sixty seconds without hesitation, repetition or deviation.\n\n\n\nEpisodes\n\nThis is the latest Series 58 as broadcast on BBC Radio 4.\n\nEpisode 1 : 27th Jul 2009. With Sue Perkins, Pam Ayres, Tony Hawks and Tim Rice.\n\nEpisode 2 : 3rd Aug 2009. With Paul Merton, Shappi Khorsandi, Gyles Brandreth and Kit Hesketh-Harvey.\n\nEpisode 3 : 10th Aug 2009. With Stephen Fry, Paul Merton, Jenny Eclair and Charles Collingwood.\n\nEpisode 4 : 17th Aug 2009. With Paul Merton, Shappi Khorsandi, Gyles Brandreth and Kit Hesketh-Harvey.\n\nEpisode 5 : 24th Aug 2009. With Paul Merton, Sue Perkins, Mike McShane, Paul Sinner.\n\nEpisode 6 : 31st Aug 2009. With Paul Merton, Richard Herring, Janey Godley, Sue Perkins.  \n\nEpisode 7 : 7th Sep 2009. With Jenny Eclair, Stephen Fry, Paul Merton, Charles Collingwood.\n\nEpisode 8 : 14th Sep 2009. With Graham Norton, Gyles Brandreth, Paul Merton and Suki Webster.\n\nEpisode 9 : 21st Sep 2009. With Tony Hawks, Pam Ayres, Sue Perkins and Tim Rice.\n\nEpisode 10 : 28th Sep 2009. With Graham Norton, Paul Merton, Gyles Brandreth, Pauline McLynn.\n\n\n\n\nSource : BBC Radio 4\nType : MPEG 1 Layer 3\nBitrate : 64 kpbs\nMode : stereo\nFrequency : 22050 Hz\nEncoder : Lame","torrent":{"xt":"urn:btih:2dcb316f9ddfa7e7c01f092296e3cd5bf278b330","amp;dn":"Just+A+Minute+++%28BBC+Radio+-+Series+58+-+2009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dcb316f9ddfa7e7c01f092296e3cd5bf278b330","infoHashBuffer":{"type":"Buffer","data":[45,203,49,111,157,223,167,231,192,31,9,34,150,227,205,91,242,120,179,48]},"announce":[],"urlList":[]}}