{"title":"Trepper-Great Game-Memoirs of Spy Hitler Couldn't Silence(1977)","uid":7022403,"size":1839631,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2dd173d2f5472f181aa4264a4f23e82940db6cbe&amp;dn=Trepper-Great+Game-Memoirs+of+Spy+Hitler+Couldn%5C%27t+Silence%281977%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1328890224,"description":"This is Leopold Trepper's mindblowing book The Great Game - Memoirs of the Spy Hitler Couldn't Silence (1977) which presents an incredible but real account of his own experience as head of a Russian spy network in occupied France. For the author, a Polish Jew who emigrated to Israel during the 1920s only to be expelled by David Ben Gurion for organizing unions that included Arabs as well as Jews and who later became a Soviet citizen, he and his cohorts operated not only under the noses of the Nazis but as well under constant threat of Stalin, who was busy purging the Red Army even as the Nazi Germany was arming itself. Trepper was the Soviet GRU Officer who ran the Red Orchestra which was the name given by the Gestapo to an anti-Nazi resistance movement in Berlin, as well as to Soviet espionage rings operating in German-occupied Europe and Switzerland during World War 2. The Great Game is an unique historic memoir and a poignant portrayal of the incredible bravery of the people who fought fascism during the 30s and 40s. 450 pages, some pictures. A must read for everyone. \n","torrent":{"xt":"urn:btih:2dd173d2f5472f181aa4264a4f23e82940db6cbe","amp;dn":"Trepper-Great+Game-Memoirs+of+Spy+Hitler+Couldn%5C%27t+Silence%281977%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dd173d2f5472f181aa4264a4f23e82940db6cbe","infoHashBuffer":{"type":"Buffer","data":[45,209,115,210,245,71,47,24,26,164,38,74,79,35,232,41,64,219,108,190]},"announce":[],"urlList":[]}}