{"title":"Mob Rules - What the Mafia Can Teach Legitimate Businessman - Lo","uid":9233480,"size":677879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2dfc9c89c4e9c590f7a1a556665979971f7de0ae&amp;dn=Mob+Rules+-+What+the+Mafia+Can+Teach+Legitimate+Businessman+-+Lo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1385127080,"description":"The average Mafia don knows more about effective leadership than a trunkful of Fortune 500 CEOs.\n\nFor all the mob's well-deserved reputation for violence and immorality, its most successful members have always been remarkably astute businessmen. Former mobster Louis Ferrante reveals their surprisingly effective management techniques and explains how to apply them in any legitimate business.\n\nAs an associate of the Gambino Family, Ferrante pulled off some of the biggest heists in U.S. history before the age of twenty-one, netting millions of dollars. His natural talent for management led bosses like John Gotti to rely on him. Now he offers time-tested Mafia wisdom, such as:\n\n* Three can keep a secret (if two are dead): Build trust with your colleagues.\n* You don't always need a gun to hit a target: Lead people without force.\n* It's never personal: When circumstances demand it, never hesitate to pull the trigger.\n\nFerrante brings his real-life experience to the book, offering fascinating insights into Mafia behavior and sharing behind-the-scenes episodes almost as outrageous as those occurring on Wall Street every day.\n","torrent":{"xt":"urn:btih:2dfc9c89c4e9c590f7a1a556665979971f7de0ae","amp;dn":"Mob+Rules+-+What+the+Mafia+Can+Teach+Legitimate+Businessman+-+Lo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dfc9c89c4e9c590f7a1a556665979971f7de0ae","infoHashBuffer":{"type":"Buffer","data":[45,252,156,137,196,233,197,144,247,161,165,86,102,89,121,151,31,125,224,174]},"announce":[],"urlList":[]}}