{"title":"Anche i boia muoiono - Fritz Lang [DivX - Ita Mp3] [Tntvillage]","uid":5107797,"size":1457672704,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2e51397b25d1acbff2fae264ff3aa27db867aad7&amp;dn=Anche+i+boia+muoiono+-+Fritz+Lang+%5BDivX+-+Ita+Mp3%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"darayava","files":1,"time":1254509510,"description":"Visit this info link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=111976 http://img518.Imageshack.us/img518/2470/giornatamemoria288x150nx2.png\n\nVisit this info link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=11466  Visit this link: http://img367.Imageshack.us/img367/5986/secondaguerra288x150jj4.png\n\nPosted by Darayava\n\nANCHE I BOIA MUOIONO\ndi Fritz Lang\n\n\n Visit this link: http://www.terminalvideo.com/images/articles/lrg/30/img_229230_lrg.jpg\n\n[quote=Evidenzio]\n\nTITOLO ORIGINARIO: Hangmen also die\nREGIA: Fritz Lang\nSCENEGGIATURA: Fritz Lang - Bertolt Brecht\nATTORI: Walter Brennan (Professor Stepan Novotny) - Brian Donlevy (Frantisek Svoboda) - Anna Lee (Mascha Novotny) - Dennis O'Keefe (Jan Horak) - Hans von Twardowski (Reinhard Heydrich) - Alexander Granach (Alois Gruber) - Tonio Selwart (Hass, capo della Gestapo) - Reinhold Schunzel (ispettore Ritter) - Gene Lockhart (Emil Czaka) - George Irving (il poeta Nezval)\nFOTOGRAFIA: James Wong Howe\nMONTAGGIO: Gene Fowler jr.\nMUSICHE: Hanns Eisler (la canzone &quot;No Surrender&quot; ÃƒÂ¨ di Hanns Eisler e Sam Coslow)\nPRODUZIONE: United Artists\nDISTRIBUZIONE: Artisti Associati\nPAESE: USA 1934\nGENERE: Drammatico\nDURATA: 131 Min\nFORMATO: bn\n\n\n[/quote]\n\n\n\nIl film, frutto della collaborazione tra Lang e Brecht, ambientato a Praga nel 1942, ÃƒÂ¨ incentrato sull'uccisione del governatore da parte di un partigiano e sull'attivitÃƒÂ  della Resistenza per evitare rappresaglie sulla popolazione civile.\n(Unione delle ComunitÃƒÂ  Ebraiche Italiane)\n\n\n - Trama - \n  \nPraga 1942. PoichÃƒÂ© gli operai della Skoda non lavorano abbastanza il &quot;Reichsprotektor&quot; Reinhard Heydrich ordina alcune esecuzioni per dare un esempio. Poco dopo viene ferito gravemente in un attentato. I tedeschi proclamano lo stato di emergenza e impongono il coprifuoco. Il dottor Frantisek Svoboda (Brian Donlevy), l'attentatore, viene accolto in casa del professor Stepan Novottny (Walter Brennan), un patriota. Quest'ultimo ÃƒÂ¨ preso in ostaggio dalla Gestapo insieme a quattrocento notabili di Praga. Svoboda vorrebbe costituirsi, ma un amico lo dissuade: &quot;Quattrocento vite che cosa sono mai in questa guerra di milioni di uomini?&quot; Mascha Novotny (Anna Lee) lo prega di salvare la vita di suo padre, quindi si dirige verso il comando della Gestapo. Un volantino, &quot;Cittadini di Praga, tacete!&quot; la fa riflettere. Alla Gestapo Mascha viene messa a confronto con una testimone dell'attentato che ÃƒÂ¨ stata torturata, ma entrambe le donne tacciono. I tedeschi perquisiscono l'abitazione di Novotny e Jan Horak (Dennis O'Keefe), fidanzato di Mascha, ÃƒÂ¨ interrogato dall'ispettore Alois Gruber (Alexander Granach).\n\nI membri della Resistenza ceca diffidano di Emil Czaka (Gene Lockhart), ricco birraio e doppiogiochista.\n\nL'ispettore invita Jan al Deutsches Kabarett (&quot;Vietato l'ingresso ai cechi e ai cani&quot;) e tenta di portarlo dalla sua parte. Intanto muoiono i membri della Resistenza. Nel ristorante &quot;Alla quaglia d'oro&quot; Mascha insulta pubblicamente Czaka, facendo in modo che venga sospettato dell'uccisione di Heydrich, poi lo denuncia alla Gestapo, ma viene trattenuta. Mentre la Resistenza persegue l'obiettivo di eliminare Czaka salvando gli ostaggi, Gruber intuisce da una notazione di Jan l'identitÃƒÂ  dell'attentatore e si reca all'ospedale di Svoboda. Qui l'ispettore ÃƒÂ¨ soffocato con i cuscini dai patrioti. Jan li ha raggiunti, accusa Czaka dell'omicidio. Gli agenti della Gestapo eliminano il birraio e Mascha viene rilasciata. Qualche tempo dopo si scopre che Czaka era innocente. Il nuovo &quot;Reichsprotektor&quot; scorre un documento segreto: &quot;Considerando che un inasprimento del terrore non avrebbe indotto la popolazione a denunciare l'assassino, siamo stati costretti - per non infirmare il principio tedesco di autoritÃƒÂ  - ad attenerci al partito di riconoscere Czaka il colpevole e chiudere cosÃƒÂ¬ le indagini&quot;..\n\n\n - Recensioni - \n  \nDopo Duello mortale Lang, sotto contratto alla Fox, inizia le riprese di Confirm or Deny, ma vi deve rinunciare per motivi di salute ed il film passa ad Archie Mayo. Nel 1942 pensa ad un'opera sul celebre pistolero Billy the Kid e lavora per i primi quattro giorni a Moontide (Ondata d'amore), dopodichÃƒÂ© viene rimpiazzato dal solito Mayo. Nel 1943 insieme a Oliver H. P. Garrett scrive Hell Afloat (L'inferno galleggiante), un soggetto basato sull'incendio della &quot;Moor Castle&quot;, che viene rifiutato dalla Metro. Infine coglie una buona occasione alla United Artists e - contravvenendo al monito del suo ex persecutore Zanuck (&quot;Non faccia vedere troppe svastiche. Non vogliamo vederle in questo paese.&quot;) - realizza Hangmen Also Die! (Anche i boia muoiono). Dieci giorni dopo l'attentato a Heydrich, il regista stende insieme a Brecht una scaletta dell'opera. In seguito ci saranno problemi con John Wexley che - nonostante le proteste di Lang e Hans Eisler - riesce a farsi accreditare come unico autore della sceneggiatura. Com'ÃƒÂ¨ diverso il clima cupo di Anche i boia muoiono da quello comico e polacco, del film antinazista To Be or Not to Be (Vogliamo vivere!), diretto da Lubitsch appena un anno prima, proprio per la United Artists. Forse i produttori si aspettavano da Lang una prova analoga, ma una cosa ÃƒÂ¨ certa: all'ufficio Heys non piacque. &quot;Credete che possiamo approvare un film in cui ogni ceco, implicitamente, viene presentato come un mentitore?&quot;.\n\nLang dovette piegarsi a modificare in parte l'assunto, ma il tocco di Brecht resta e brucia ancora.\n\nIl film non ÃƒÂ¨ un capolavoro. Anzi si sviluppa tortuosamente e a strappi, seguendo l'intenzione didattica degli autori. Si trovano comunque situazioni e personaggi indimenticabili. CosÃƒÂ¬ Heydrich, effeminato e feroce, di continuo si tormenta un foruncolo sul viso, mentre il professor Novotny matematicamente illustra la virtÃƒÂ¹ del silenzio: &quot;Di certe cose ÃƒÂ¨ meglio non parlare. Ad esempio: tu ne parli ad A, A ne accenna a B, B lo confida a C, C lo dice in segreto a D, che a sua volta ÃƒÂ¨ vicino a E e a F, F ne parla a G e G significa Gestapo&quot;. Gruber ÃƒÂ¨ un ritratto grosziano, come ÃƒÂ¨ ambigua e piccante la falsa relazione fra Mascha e Frantisek. Rimangono nella memoria le strade &quot;espressioniste&quot;; di Praga, ma anche gli interni gelidi del comando di polizia tedesca, le ombre &quot;sataniche&quot; che avvolgono l&quot;anziana popolana torturata in modo semplicissimo e crudele: facendo cadere tutta la notte una stecca dello schienale di una sedia, per poi chiederle di raccoglierla. Un secondino con la frusta passa e ripassa davanti alla cella della donna, mentre la luce proietta una rete di sbarre all'interno (come non pensare a un'influenza di Lang sul Rossellini di Roma cittÃƒÂ  aperta?). Nella piazza della cittÃƒÂ  vecchia di Praga la statuetta della morte suona, sul celebre orologio, l'ora del funerale di Heydrich e quella dell'esecuzione dei patrioti. Infine il gioco del destino alla &quot;Quaglia d'oro&quot;, individuato dai tre tavoli a cui siedono rispettivamente Czaka, una spia di Gruber e Mascha con Svoboda. Le menzogne della Resistenza sono volte al bene.\n\n - Parola di...Fritz Lang - \n  \n&quot;Non mi davano lavoro, neppure Howard Hughes che ,tramite un intermediario, mi aveva promesso, Dio, il mondo e tutti i tesori di Golconda. Ero in castigo e non sapevo nemmeno perchÃƒÂ© (...) Finalmente il mio avvocato scoprÃƒÂ¬ che mi avevano inserito in una lista nera perchÃƒÂ© ero comunista! Io non sono mai stato comunista. Non sono mai stato membro del partito comunista. Avevo moltissimi amici comunisti. Ai tempi di Roosvelt era chic appartenere al partito. Quando venni in America, le grandi potenze - l'Inghilterra, anche la Francia - cercavano di contenere Hitler, e cosa successe in realtÃƒÂ ? Che non importava niente a nessuno di quello che stava accadendo in Germania. Alcuni di noi lo capirono in anticipo, ma gli unici a opporsi veramente (noi credevamo che fossero gli unici) furono i comunisti. Questa fu una delle ragioni per cui tanta gente di Hollywood passÃƒÂ² dalla parte dei comunisti, perchÃƒÂ© credevano che il partito comunista fosse il solo gruppo che combatteva effettivamente i nazisti. (...)\n\nPiÃƒÂ¹ tardi il controllo di queste iniziative passÃƒÂ² ai comunisti, cosÃƒÂ¬ nell'era McCarthy molti di noi vennero accusati di essere comunisti. Non era vero: noi eravamo liberali.&quot;\n[Scheda tratta da Fritz Lang di Stefano Socci, Ed. Il Castoro Cinema.]\n\nNOTE:\nSegnalazione della Commissione Internazionale dei Giornalisti alla Biennale di Venezia del 1946\nfonte &quot;RdC - Cinematografo.it&quot;\n\n\n Visit this link: http://imgcash4.Imageshack.us/img340/1515/ancheiboia1.png     Visit this link: http://imgcash3.Imageshack.us/img193/8831/ancheiboia2.png\n\n Visit this link: http://imgcash6.Imageshack.us/img98/9936/ancheiboia3.png     Visit this link: http://imgcash3.Imageshack.us/img98/3276/ancheiboia4.png\n\n::: - Scheda tecnica  del DivX - :::\n::: - dati ottenuti con AviInfo - :::\n \n\nName..........: Fritz Lang - Anche i boia muoiono.avi\nFilesize......: 1.3Gb\nRuntime.......: 02:08:12\nVideo Codec...: DivX5\nVideo Bitrate.: 1.3Mbps\nFrame Size....: 640x480\nFrame Rate....: 25fps\nAudio Codec...: mp3\nAudio Bitrate.: 192Kbps\nAudio Freq....: 44KHz\nAudio Channels: Stereo \n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:2e51397b25d1acbff2fae264ff3aa27db867aad7","amp;dn":"Anche+i+boia+muoiono+-+Fritz+Lang+%5BDivX+-+Ita+Mp3%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e51397b25d1acbff2fae264ff3aa27db867aad7","infoHashBuffer":{"type":"Buffer","data":[46,81,57,123,37,209,172,191,242,250,226,100,255,58,162,125,184,103,170,215]},"announce":[],"urlList":[]}}