{"title":"The 'Nam","uid":5179721,"size":1019668134,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2e5c8e945a65cc734a74a17e727583af0044545f&amp;dn=The+%5C%27Nam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brodahisou","files":-1,"time":1259174233,"description":"The 'Nam was a war comic book series detailing the U.S. War in Vietnam from the perspective of active-duty soldiers involved in the conflict. It was written by Doug Murray, initially illustrated by Michael Golden, edited by Larry Hama and published by Marvel Comics for seven years beginning in 1986, which was originally intended to roughly parallel the analogous events of the period of major American military involvement in Vietnam from 1966 to 1972.\n\nThe comic is structured as the narrative of a fictional soldier, Private First Class Edward Marks (but sometimes following other characters), as he experiences real events that occurred during the conflict. Each issue of the comic occurs one month after the previous issue, detailing events that occurred approximately 20 years prior to the publication date.\nThe events depicted are sometimes famous ones, such as the Tet Offensive of 1968, and sometimes more personal ones, depicting the interaction between soldiers or between soldiers and the local populace of Vietnam, or between soldiers and their families, friends and others in the United States.\nSome of the stories are typical of those in war comics of any era, such as the interaction with a callous officer or a description of combat, while others are unique to Vietnam, such as the experience of soldiers on leave bearing the personal burden of animosity from civilians opposed to the war.\n\nMany changes occurred in the series after the first 12 issues; the use of newsprint was abandoned in favor of slicker paper with higher color intensity.  Artist Mike Golden was also replaced. Murray left when changes in editorial policies took place.  Don Daley took over and wanted to include super heroes and not continue the series in real-time.  Had he continued with the book, Murray wanted the main character from the first year, Ed Marks, to come back to Vietnam as a reporter and deal with the subject of Agent Orange.\n\nIn the early 1990s, flagging sales drove Marvel to place the then-popular character The Punisher in several guest appearances in The 'Nam.  After the series' conclusion, an epilogue of sorts was published in the form of a Punisher special, The Punisher Invades The 'Nam: Final Invasion which included the unpublished issues #85 and 86.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:2e5c8e945a65cc734a74a17e727583af0044545f","amp;dn":"The+%5C%27Nam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e5c8e945a65cc734a74a17e727583af0044545f","infoHashBuffer":{"type":"Buffer","data":[46,92,142,148,90,101,204,115,74,116,161,126,114,117,131,175,0,68,84,95]},"announce":[],"urlList":[]}}