{"title":"Ronald Jenkees - Ronald Jenkees","uid":5139556,"size":87521187,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2ea395e0ba6beca829e58b775e33f8a653cb8280&amp;dn=Ronald+Jenkees+-+Ronald+Jenkees&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nitrus0x","files":14,"time":1256797447,"description":"Tech info:\nmp3 encoded with lame -V0 preset (high quality vbr)\n\n\nAlbum info:\n\nThis is Ronald Jenkees first album (self titled)\n\nPlease support Ronald Jenkees by at least buying the mp3s from his web site at:  &lt;a href=&quot;\nhttp://www.ronaldjenkees.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ronaldjenkees.com/&lt;/a&gt;\n\nIf you don't know who he is, do asearch and be amazed  \n\n\nThe following review is shamelessly stolen from http://cdbaby.com/cd/ronaldjenkees: \n\nEver had one of those moments that catch you completely off guard? Listening to Ronald Jenkees' debut self titled album does just that. It instantly commands you to sit up and pay attention.\n\nBased on Ronald'sperformances I expected his album would be good, but I didn't expect it to be amazing. Deep inside this cap wearing, easy-attitude apparent goof-ball lays the soul of an accomplished musician. Who knew the unassuming geek had it in him?\n\nThis album could have easily been a series of FL Studio loops with some crazy keyboard solos layered over top, but thankfully this isn't the case. Instead there are very well thought out arrangements that could easily satisfy the most discerning of instrumental music aficionados.\n\nThat said, the last two of the fourteen tracks (which seem slightly out of place to have been included on this album) are not instrumental with Ronald's unique rapping ability taking the serious edge away. The most notable being '56k Rap', where Ronald tells the humorous story of buying a 100mhz Dell with 56k modem and being the master of the Internet, performed with the attitude of an online gangsta. It works surprisingly well.\n\nThe insane improv keyboard solos Ronald is famous for are not featured as heavily as you would have thought, if hisperformances are anything to go by. But that should not by any means discourage you.\n\nThe 14 tracks cover a broad range of moods, but Ronald makes no apologies for a preference towards the easy listening style of 'phat' beats which compliment a well generated atmosphere.\n\nOn the subject of atmosphere, there is a movie soundtrack quality to a lot of the tracks, and if he were interested Ronald could probably forge a career in said arena.\n\nIt's hard to choose the most stand out tracks as they all offer something quite unique, but so far 'Loui', 'Gold Spinners', 'Almost Undamaged' and 'Neptune' are on the highest rotation.\n\nIf you haven't guessed by now I am quite enthusiastic about this album, and so I will rank it accordingly: 4.5 stars out of 5.\n\nTracklist wrote:\n1. (00:03:26) Ronald Jenkees - Derty\n2. (00:03:25) Ronald Jenkees - Neptune\n3. (00:03:19) Ronald Jenkees - Canon In D Remix\n4. (00:04:15) Ronald Jenkees - Clutter\n5. (00:03:43) Ronald Jenkees - Super-Fun\n6. (00:02:21) Ronald Jenkees - The Rocky Song Remixed\n7. (00:04:02) Ronald Jenkees - Snap\n8. (00:02:45) Ronald Jenkees - The Sunfish Song\n9. (00:03:22) Ronald Jenkees - Loui\n10. (00:03:43) Ronald Jenkees - Gold Spinners\n11. (00:04:10) Ronald Jenkees - Remix To A Remix\n12. (00:04:47) Ronald Jenkees - Almost Undamaged\n13. (00:03:03) Ronald Jenkees - 56K (Rap)\n14. (00:03:23) Ronald Jenkees - Ain't No Thang (Rap)","torrent":{"xt":"urn:btih:2ea395e0ba6beca829e58b775e33f8a653cb8280","amp;dn":"Ronald+Jenkees+-+Ronald+Jenkees","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ea395e0ba6beca829e58b775e33f8a653cb8280","infoHashBuffer":{"type":"Buffer","data":[46,163,149,224,186,107,236,168,41,229,139,119,94,51,248,166,83,203,130,128]},"announce":[],"urlList":[]}}