{"title":"Worms 3D &amp; Worms Forts Under Siege [PS2] [PAL]","uid":5415745,"size":1271928444,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:2eba3e43704c2e41df49c304fb2c085df82cde64&amp;dn=Worms+3D+%26+Worms+Forts+Under+Siege+%5BPS2%5D+%5BPAL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thenoobish","files":1,"time":1267909689,"description":"Worms 3D / Worms Forts Under Siege (2in1)\nRelease: 2003/2005\nGenre: Turn-based strategy\nDeveloper: TEAM17\nPublisher: SEGA\nPlatform: PS2\nRegion: PAL\nMedia: DVD5\nAge: Any\nLanguage: RUS, ENG, FRA, DEU, ITA, ESP / RUS, ENG, FRA\nType of translation: Worms 3D: text 10 points /\nWorms Forts: excellent text and voice of worms!\nMultiplayer: 4x\nDescription:\nWorms 3D:\nComrades Worms - is not only a valuable mucus, but the three-dimensional game, which completely removes the tower for everyone from small to big! If you are not afraid to spend the next month at the computer, do not eat, drink, do not sleep, you can safely buy this masterpiece. Why? Because it is a war, a wonderful black humor, and because the worm, from which we were not expecting anything more than useless goo ... And then - such a sensation! These guys pink krushat each other kettles on the background of magnificent landscapes. Moreover, for better crash, they use almost all of that will fall under their tentacles: karate, bazookas and rifles, dynamite and ropes, bananas, sheep, drills and jackhammers. And guys are not only good fight, but well hidden. Good hoarded worm, for example, your efforts are deeply buried under the ground and quietly polyethylene in the walkie-talkie - a real Rimbaud sand pits! Do not be afraid of anyone or anything! Boldly Lead ringed his team into battle and fight for peace in the world!\n1.4 Player / Memory Card 8Mb (min-117Kb)\nWorms Forts Under Siege:\nIn the Middle Ages, even the common people know the simple truth: the main thing - to take the enemy's castle, the rest is not important. Who said that the worms do not own locks, or that they do not need to take? Your attention is invited to the game Worms Forts: Under Siege.\nWherever the action takes place - in ancient Egypt, in Troy, in the Land of the Rising Sun or the court of King Arthur, your task is simple - defeat all enemies and destroy their fortress! Have patience, exert forces, and most importantly - think head! From now on you will be able to build and defend your own castle - anywhere, anytime. Uncompromising chervyachi battle unfolding in different parts of the globe - and even in different eras!\n1.4 Player / Memory Card 8Mb (min-117Kb)\nP.S. For those who need both of these games can have them on one disc. An ISO image is packed in RAR archive to the maximum compression. In the first four screenshots of Worms 3D, three Worms Forts. Poster made himself, you can save and print as the cover! My first, a trial distribution","torrent":{"xt":"urn:btih:2eba3e43704c2e41df49c304fb2c085df82cde64","amp;dn":"Worms+3D+%26+Worms+Forts+Under+Siege+%5BPS2%5D+%5BPAL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2eba3e43704c2e41df49c304fb2c085df82cde64","infoHashBuffer":{"type":"Buffer","data":[46,186,62,67,112,76,46,65,223,73,195,4,251,44,8,93,248,44,222,100]},"announce":[],"urlList":[]}}