{"title":"SimCopter.iso","uid":5200479,"size":654106624,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2f0991f3e7785f1b4919ac92f19ecefec22de532&amp;dn=SimCopter.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"goriya2","files":1,"time":1260135337,"description":"This is SimCopter.\n\nMany of you will remember it as the game with the horrible graphics but really fun gameplay where you get to fly around in SimCity 2000 cities putting out fires, rescuing idiots, chasing down runaway trains and so on.\n\nThis has been one of my favorite Maxis games ever since I got it -- right up there with:\n\n* SimTower, which they actually just translated from Japanese into English\n\n* SimCity 2000 + SCURK\n\nThis won't play straight off the CD unless you have a glide.dll installed, but if you use the installer, it will be installed and then it should work. (Hopefully, it won't overwrite any glide wrappers you might have installed...) Which is kind of strange, because I didn't think SimCopter *used* any hardware acceleration, and I certainly don't have the Voodoo 1 that the included glide.dll seems to be intended for, so it makes me wonder why (a) they didn't just use LoadLibrary() to load glide.dll and (b) they didn't test that running it off the CD on a plain Windows system worked for this release. I'm pretty sure it worked with my old SimCopter CD...\n\nNote: This might seem obvious to many of you, but if you want to edit the cities or create your own, you should hunt down a copy of SimCity 2000 Special Edition and use either the game or the accompanying copy of SCURK to create / edit cities.","torrent":{"xt":"urn:btih:2f0991f3e7785f1b4919ac92f19ecefec22de532","amp;dn":"SimCopter.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f0991f3e7785f1b4919ac92f19ecefec22de532","infoHashBuffer":{"type":"Buffer","data":[47,9,145,243,231,120,95,27,73,25,172,146,241,158,206,254,194,45,229,50]},"announce":[],"urlList":[]}}