{"title":"The Jesus Legend: A Case for the Historical Reliability of the S","uid":9728322,"size":1164856,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f4025861d5861fabde942a87fd608ec30bd89c9&amp;dn=The+Jesus+Legend%3A+A+Case+for+the+Historical+Reliability+of+the+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"adamryanx","files":1,"time":1394330089,"description":"Jesus Legend, The: A Case for the Historical Reliability of the Synoptic Jesus \n\n\nEven mature Christians have trouble defending the person and divinity of Christ. The Jesus Legend builds a convincing interdisciplinary case for the unique and plausible position of Jesus in human history. He was real and his presence on the planet has been well documented. The authors of the New Testament didn't plant evidence, though each writer did tell the truth from a unique perspective. This book carefully investigates the Gospel portraits of Jesus particularly the Synoptic Gospels assessing what is reliable history and fictional legend. The authors contend that a cumulative case for the general reliability of the Synoptic Gospels can be made and boldly challenge those who question the veracity of the Jesus found there.\n\nFrom the Back Cover\n&quot;This is one of the most important books on methodological issues in the study of Jesus and the Gospels to have appeared for a long time. It deserves to be widely read.&quot;--Richard Bauckham, University of St. Andrews\n\n&quot;The Jesus Legend is the best book in its class. Eddy and Boyd demonstrate mastery of the disciplines essential for critical assessment of the Gospels and competent investigation of the historical Jesus. I recommend this book in the highest terms.&quot;--Craig A. Evans, Acadia Divinity College; author of Fabricating Jesus: How Modern Scholars Distort the Gospels\n\n&quot;A clearly written, carefully researched, and powerfully argued defense of the historical reliability of the Synoptic Gospels. What makes this book noteworthy is the careful treatment of underlying issues in historical methodology and philosophy. A pleasure to read and a wonderful resource for those who have encountered troubling skeptical claims about the Gospels.&quot;--C. Stephen Evans, Baylor University\n\n&quot;I am gratified that my friends and colleagues Paul Eddy and Greg Boyd have taken my work as seriously as they have in this comprehensively researched book. I urge any reader of my books to read this one alongside them!&quot;--Robert M. Price, Center for Inquiry Institute and fellow of the Jesus Seminar\n\n&quot;Eddy and Boyd have provided a thoroughly compelling cumulative argument--one of the very best available--for the reliability of the Synoptic Jesus tradition. Their book constitutes a superb treatment of the various issues, involving both fresh research and a brilliant synthesis of material from a variety of relevant disciplines.&quot;--Craig S. Keener, Palmer Seminary\n\n&quot;Eddy and Boyd have surveyed technical and popular writing alike, in meticulous detail, and present what can be concluded responsibly about the trustworthiness of the Synoptic Gospels and the portraits of Jesus they contain. They compile a detailed and erudite case that supports Christian faith. Highly recommended!&quot;--Craig L. Blomberg, Denver Seminary\n\n&quot;Well-written and organized, containing a masterful command of the literature. Eddy and Boyd show the difference between an open historical investigation of the life of Jesus and much of today's fictional writing that claims to be historical research concerning the origin of Christianity. A very useful introduction for college and seminary students.&quot;--Robert H. Stein, The Southern Baptist Theological Seminary\n\n\n\nAbout the Author\n\nPaul Rhodes Eddy (Ph.D., Marquette University) is professor of biblical and theological studies at Bethel University in St. Paul, Minnesota. Gregory A. Boyd (Ph.D., Princeton Theological Seminary) is the senior pastor at Woodland Hills Church in St. Paul, Minnesota. Eddy and Boyd are authors or coauthors of several books, including Across the Spectrum.","torrent":{"xt":"urn:btih:2f4025861d5861fabde942a87fd608ec30bd89c9","amp;dn":"The+Jesus+Legend%3A+A+Case+for+the+Historical+Reliability+of+the+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f4025861d5861fabde942a87fd608ec30bd89c9","infoHashBuffer":{"type":"Buffer","data":[47,64,37,134,29,88,97,250,189,233,66,168,127,214,8,236,48,189,137,201]},"announce":[],"urlList":[]}}