{"title":"The Cash Nexus: Money and Power in the Modern World, 1700-2000 ","uid":8641871,"size":12131315,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3006dc85b41781053557761d9e4f6610c98bcb26&amp;dn=The+Cash+Nexus%3A+Money+and+Power+in+the+Modern+World%2C+1700-2000+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":1,"time":1372895162,"description":"From Publishers Weekly\nIn a work that neatly marries the subjects of his previous books, Ferguson, who made his name with controversial popular histories of World War I (Pity of War, 1999) and the Rothschild banking empire (House of Rothschild, 1998), continues to challenge conventional wisdom. Here, he argues that the enormous expense of war, which forces governments into fiscal innovation, is the primary agent of financial change and its political repercussions, which sometimes include starting new wars. In Ferguson's view, political crises defined broadly to include those spurred by religion, law and culture cause both wars and financial disasters; the ensuing political outcomes determine the long-term economic fallout. Economic events, on the other hand, affect politics in indirect and unpredictable ways. Emphasizing the nuances and exceptions to his argument, he marshals economic statistics to support it, though he does not discuss alternative explanations for financial change. Despite frequent, jarring digressions into the minutiae of 1980s British politics and in praise of Thatcherism, the book is lucidly argued. But for a history that focuses so much on war, it includes little discussion of the military. Most controversially, Ferguson challenges the orthodox assumption that the world is headed toward a peaceful, prosperous and democratic global future. Economic success does not always lead to stability, he argues, and economic freedom is neither necessary for economic growth nor sufficient for political freedom. Nor, he warns, will economic globalization necessarily lead to greater economic or political cooperation. (Mar.) Forecast: This book will be more talked about than read, though it will attract serious readers. Like Ferguson's The Pity of War, its merits should outlive the controversy over its predictions.\nCopyright 2001 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\nFrom Library Journal\nIn this scholarly tome, Ferguson (history, Jesus Coll., Oxford; The Pity of War) presents a heavily noted, high-level economic analysis of the impact of economic trends on political change. As he thoroughly analyzes the nexus between economics and politics, he delves deep into the complex relationship among economic principles and international war, political changes in major countries, social liberalization, and national demographics. He challenges the prevailing principles of well-known author Paul Kennedy (The Rise and Fall of the Great Powers), specifically that economic change is the prime mover of political change, contending rather that the conflicting impulses of sex, violence, and power are together more powerful than money. In the book's many dense chapters, Ferguson argues that political institutions have often dominated economic development, and he deftly integrates historical trends and eras, multiple economic principles and theory, as well as modern economic growth and development. This very complex economic analysis will well serve larger university libraries supporting higher-level study in economics, especially international economic theory. Dale Farris, Groves, TX\nCopyright 2001 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n &lt;a href=&quot;\nhttp://www.amazon.com/The-Cash-Nexus-Modern-1700-2000/dp/0465023266/ref=sr_1_1?ie=UTF8&amp;qid=1372887785&amp;sr=8-1&amp;keywords=the+cash+nexus&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Cash-Nexus-Modern-1700-2000/dp/0465023266/ref=sr_1_1?ie=UTF8&amp;qid=1372887785&amp;sr=8-1&amp;keywords=the+cash+nexus&lt;/a&gt;","torrent":{"xt":"urn:btih:3006dc85b41781053557761d9e4f6610c98bcb26","amp;dn":"The+Cash+Nexus%3A+Money+and+Power+in+the+Modern+World%2C+1700-2000+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3006dc85b41781053557761d9e4f6610c98bcb26","infoHashBuffer":{"type":"Buffer","data":[48,6,220,133,180,23,129,5,53,87,118,29,158,79,102,16,201,139,203,38]},"announce":[],"urlList":[]}}