{"title":"Plants Vs Zombies [NTSC][Xbox360][Multi5][Spanish][www.consolasa","uid":5857610,"size":7838695875,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:301e844dbc4eba6098dcb0a8def0fb952631087a&amp;dn=Plants+Vs+Zombies+%5BNTSC%5D%5BXbox360%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"consolasatope","files":4,"time":1285865064,"description":"DescripciÃƒÂ³n:\n\nReleased: 2010\nGenre: Strategy (Real-time) / Arcade\nDeveloper: PopCap Games\nPublisher: PopCap Games\nPlatform: XBOX 360\nPublication Type: License\nLanguage: Spanish\nRegion: NTSC\n\nResumen:\nGay cartoon arcade game in which we have to protect your home from hordes of zombies variety, planting flowers in their path. Scorching sun and fog here on the side of the undead, so it is early to choose sites for seedlings. Get ready to grow their plants in a totally new game-Action-Strategy from PopCap! A crowd of funny zombie tries to invade vvash home, and your only defense - an arsenal of 49 plants. Use a toy gun, wall-nuts, cherry bombs, etc. to defuse the 26 kinds of zombies before they can reach your front door. Zombies have their own special skills, so you need to think fast and grow plants to fight zombies. But be careful how you use your limited supply of plants and grains, you have to fight with funny dead at the levels with different modes of sunlight. C 5 game modes you will be hard to miss. Funny never dies!\n\nFeatures:\n1. Crazy gameplay. The army of zombies against flowers in pots - what could be crazier?\n2. Bright gameplay. Seated potato mines, machine guns set pea, put batteries - sunflowers, and use them to dispose of zombies in all colors and sizes.\n3. Fun and dynamism. Throughout all levels of the game still manages to amaze and amuse you, than refutes the slogan &quot;Interesting kazualok not happen.\n4. Sound and picture. Great, nice sound and good picture guarantee millions of people glued to the screen.\n5. Ease of use. Intuitive actions that will not cause difficulties even for players who do not know English.\n","torrent":{"xt":"urn:btih:301e844dbc4eba6098dcb0a8def0fb952631087a","amp;dn":"Plants+Vs+Zombies+%5BNTSC%5D%5BXbox360%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"301e844dbc4eba6098dcb0a8def0fb952631087a","infoHashBuffer":{"type":"Buffer","data":[48,30,132,77,188,78,186,96,152,220,176,168,222,240,251,149,38,49,8,122]},"announce":[],"urlList":[]}}