{"title":"[Evil Angel] ASS TITANS","uid":13173321,"size":2345256167,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:30335b0185b17157500961cf345e53952cd9f5d8&amp;dn=%5BEvil+Angel%5D+ASS+TITANS&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ImgSnaps","files":4,"time":1452262578,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/Ir\r\n \nhttp://imgsnaps.com/image/It\r\n\r\nDescription:\r\n\r\nRaul Cristian's all-sex, distinctively shot, all-European productions have cornered a segment of the male-dominant fan base that likes to see heavily-styled bitches from Eastern Europe getting erotically abused by the Cruel Media stable of big, beefy-cocked bastards. In Raul's words, these guys are the &quot;best terminators,&quot; muscular studs who completely take over their scenes, and are only matched by a parade of exceptionally beautiful sluts who surrender their asses, their personal space and their dignity for your masturbational pleasure.\r\n\r\nRaul Cristian`s all-sex, distinctively shot, all-European productions have cornered a segment of the male-dominant fan base that likes to see heavily-styled bitches from Eastern Europe getting erotically abused by the Cruel Media stable of big, beefy-c*cked bastards. In Raul`s words, these guys are the best terminators, muscular studs who completely take over their scenes, and are only matched by a parade of exceptionally beautiful sluts who surrender their asses, their personal space and their dignity for your masturbational pleasure.\r\n\r\n\r\nStarring\tPhoenix Marie, Marco Banderas, Kristina Rose, Toni Ribas, David Perry, Ian Scott, Jessica Bangkok,Mike Angelo, Savannah Stern, Jessica Lynn, Madelyn Marie, Savannah Gold, Cayden Moore, Tony Garcia","torrent":{"xt":"urn:btih:30335b0185b17157500961cf345e53952cd9f5d8","amp;dn":"%5BEvil+Angel%5D+ASS+TITANS","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30335b0185b17157500961cf345e53952cd9f5d8","infoHashBuffer":{"type":"Buffer","data":[48,51,91,1,133,177,113,87,80,9,97,207,52,94,83,149,44,217,245,216]},"announce":[],"urlList":[]}}