{"title":"High School Musical 2 (2007)","uid":5689935,"size":4699369884,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:304fe65bf6513b79b497bd9f3384afb10180df33&amp;dn=High+School+Musical+2+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Pioen","files":10,"time":1279052190,"description":"High School Musical 2 (2007)       \n\n\nVerenigde Staten\nFamilie / Muziek\n105 minuten / 111 minuten (Extended Version)\n\ngeregisseerd door Kenny Ortega\nmet Zac Efron, Vanessa Anne Hudgens en Ashley Tisdale\n\nIedereen van de East High Wild Cats heeft een baantje bij de Evan's Country Club, dat eigendom is van Ryan en Sharpay's ouders. Elk jaar organiseert de countryclub een talentenjacht waar ze het het op moeten nemen tegen een andere club. Deze race wordt echter lastiger dan de voorgaande jaren, omdat Sharpay Ryan laat vallen en een duet met Troy wil doen tijdens de talentenjacht.\n\nEnglish\n\nThe Wildcats are back. They start off getting out of school, where Shar Pay makes sure Troy has job at her country club. Troy then in returns gets everyone else a job at the country club too. Gabrielle is the new lifeguard, while Troy, Chad, and the others work in the kitchen. At the country club there is a talent show, which Sharpay and Ryan win every year. Kelsie had written a song for Troy and Gabrielle to sing at the talent show, which later on Sharpay takes (at a faster tempo) for her and Troy to sing at the talent show. Sharpay plots to take Troy away from Gabrielle,by getting him a better job than the rest of the Wildcats. Troy starts changing, all for a &quot;scholarship&quot;, starting to act like a jerk, which results in Gabrielle breaking up with Troy, saying she doesn't belong there. After Troy loses all his friends, because he began acting like a jerk and had found out that Sharpay had made it where no Junior Staffers can perform in the talent show, he decides to do something about it, and asks for his old job back with the rest of his friends and quits the talent show leaving Sharpay with nothing, since she had ditched her brother to perform with Troy. She then goes back to Ryan, who had been working with the Junior Staffers on an act, who then leaves her saying she always wanted the spotlight, now she has it. Troy ends up doing the talent show, thinking that he would be performing with Sharpay. He learns a new song within a matter of minutes.\n\n\nRipper...................: mp3president\nRipped with..............: ImgBurn 2.5.1.0\nAudio Format.............: 5.1\nAudio Language...........: Nederlands/Engels\nSubtitles................: Nederlands/Engels/Spanish/Portuguese\nFile Format..............: Part**.rar [ISO]\nAantal RAR Bestanden.....: 94\nSource Movie.............: DvD5 pal\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \n\n \nGenre : Familiefilm\nMuziek\n \nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/41946&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/41946&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0810900&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0810900&lt;/a&gt;\n \n\n*****************************************\n\nBrought to you by \nPioen\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan \n\t\t \n \n \n","torrent":{"xt":"urn:btih:304fe65bf6513b79b497bd9f3384afb10180df33","amp;dn":"High+School+Musical+2+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"304fe65bf6513b79b497bd9f3384afb10180df33","infoHashBuffer":{"type":"Buffer","data":[48,79,230,91,246,81,59,121,180,151,189,159,51,132,175,177,1,128,223,51]},"announce":[],"urlList":[]}}