{"title":"DVD Shrink 3.2.0.15.rar","uid":4698197,"size":1118753,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3063ca73393548666a95c8d87826df603b9b4cab&amp;dn=DVD+Shrink+3.2.0.15.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"StealThemBlind","files":1,"time":1233629031,"description":" &lt;a href=&quot;http://www.stealingthemblind.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.stealingthemblind.com&lt;/a&gt;\n\nDVD Shrink is a freeware DVD transcoder focused on ease of use. The application is contained within a single executable file that is a mere 1 megabyte in size. The program features a decryption algorithm and a VBR encoder, and the user is also able to choose how the compression is to be distributed across the DVD. DVD Shrink can automatically re-compress video, to as little as 39% of its original size, depending on the aspect ratio of the original DVD (with a corresponding loss in quality) to allow it to fit on a standard DVDÃ‚Â±R(W), a Dual-Layer DVD+R, or any user-defined custom size. When &quot;Deep Analysis&quot; and &quot;Adaptive Error Compensation&quot; options are selected, the quality of the resulting DVD is increased. These options are time-consuming because DVD Shrink runs through the DVD once doing the analysis, and then again doing the encoding. During the encoding it decodes, decompresses, re-compresses and recodes the video.\n\nDVD Shrink operates in two main modes, &quot;Reauthor&quot; and &quot;Full Disk&quot;.\n\nIn &quot;Reauthor&quot; mode, the interface allows the user to choose specifically which DVD elements (Main Title, audio tracks and subtitles, and Special Features) to retain on the &quot;shrunken&quot; DVD; Menus are not selectable. The compression is Automatic if the Main Title only is selected, to fit it onto the selected size of DVD. If Special Features are also selected, their compression may be manually selected at the minimum possible using the Custom Ratio option, to give disk space to the Main Title.\n\nIn &quot;Full Disk&quot; mode, DVD Shrink allows the user to make a functionally identical backup copy without changes. Sections of the DVD, such as unwanted messages or logos/titles, can be replaced with still images, saving disk space for the Main Title. The compression can be Automatic or Manual, which allows selection of greatest compression for Menus or Special Features, saving disc space for the Main Title.\n\nIn either mode, the program has options to facilitate the stripping of the CSS copy protection, User operation prohibition (prohibiting skipping over previews or &quot;FBI Warnings&quot; and so on), and also allows the copy to be either made region-free, (the default setting) or set for any region code. Extra software (such as AnyDVD, RipIt4me, or DVD Decrypter) may be required to remove more recent forms of copy protection such as Macrovision Ripguard. DVD Shrink can also shrink hard disk files already ripped by programs that can overcome more recent copy protection systems, but that do not offer the 2-layer to 1-layer compression.\n\nOnce the DVD has been downsized, the resulting output is an ISO file or a DVD VIDEO TS folder. It should be noted that the program cannot burn these images itself, as it does not contain a built-in burning engine[1]. It can however pass the burning job to either Nero (version 7 or lower), ImgBurn (version 2.3.2.0 or lower), or DVD Decrypter as long as these programs are installed. This process appears transparent to the end user. Alternatively, the resulting ISO file may be burned with any software capable of writing ISO files.\n\nAlthough DVD Shrink gives the user free rein over compression settings for individual tracks on the DVD, removing content altogether is not allowed as there is a risk of upsetting the DVD's menu software. Audio tracks and subtitles can, however, be removed. DVD Shrink also gives the alternative option of transferring selected sections as a series of stills, which acts as a high-compression &quot;placeholder&quot; for the original.\n\nRecent events (increase in processor speed, lower cost terrabyte disk storage, RAID drive functionality, etc.) have made it easier to store the ISO files directly to hard drive, in effect creating large scale DVD media servers. Playback of these ISO files can be done directly on a network connected computer running a virtual DVD ROM emulator (like Daemon Tools Lite), or even through open source media systems (like XBMC).\n\nDVD Shrink has other, less controversial uses. In particular, the 8-cm discs produced by the new DVD-based video camcorders are not fully compatible with all computers and DVD players; &quot;ripping&quot; them with DVD Shrink (or a similar program) and re-recording them to standard-sized DVDs is a quick and very effective solution to this problem. It also allows the recorded footage to be used with drives that do not support 8-cm discs, such as slot-loading drives (often used in Apple Macintosh computers).","torrent":{"xt":"urn:btih:3063ca73393548666a95c8d87826df603b9b4cab","amp;dn":"DVD+Shrink+3.2.0.15.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3063ca73393548666a95c8d87826df603b9b4cab","infoHashBuffer":{"type":"Buffer","data":[48,99,202,115,57,53,72,102,106,149,200,216,120,38,223,96,59,155,76,171]},"announce":[],"urlList":[]}}