{"title":"Red Krayola - Introduction (2006)","uid":3509848,"size":71555994,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3091a80a07a4128f830c7ee2c181f4d3ccfa2914&amp;dn=Red+Krayola+-+Introduction+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Rabidrichard","files":15,"time":1154888158,"description":"Red Krayola's vibrancy - and continuing relevancy - can perhaps be traced not only to Mayo Thompson's own vision of engaging pop music head-on, but also to the band's ever-evolving cast. On Introduction, Mayo Thompson teams with longtime members Stephen Prina and Tom Watson. John McEntire recorded and mixed the set, and bassist Noel Kupersmith and accordionist Charlie Abel fill out the group. Thompson and cohorts make a move that was only hinted in the beautiful piano parts on 2004's Japan in Paris in L.A. Introduction is the most accessible album Red Krayola has ever issued, song-oriented and sparse. After a spoken word intro, Thompson folds &quot;Will the Circle Be Unbroken&quot; into a darkly prophetic weave, a point of engagement with how far not only music but culture have not only broken the circle but shattered it. Abel's accordion is a fine companion to Thompson's odd yet unpretentious rant about dislocation and global warming. Here country music, ragtime, folk music, and rock all come together, to shift and turn along with the various terrains he reveals in his narrative, eventually returning to the standard as a way of taking it out, of returning the circle, bruised and bloodied but unbroken. &quot;Note to Selves&quot; has an intro worthy of Jimmy Webb or Van Dyke Parks in the late '60s, then opens onto a beautiful ballad. &quot;Psy Ops&quot; is reminiscent of Captain Beefheart, and if it were a tribute it would be pleasing to the great Van Vliet. The continuing tale of &quot;Puff the Magic Dragon&quot; is from the other side, with gorgeous, warm, distorted guitars, and a shuffling drum line make this tune a wonder. More experimental tracks, such as &quot;Greasy Street,&quot; never lose their pop focus. Thompson's engagement with pop here is not a trick; nor is it a gimmick. &quot;Swerving,&quot; &quot;It Will Be (Delivered),&quot; and &quot;Vexations&quot; will delight most fans of Thompson's to see how well he understands the indie rock form as well. The only truly &quot;experimental&quot; track on here is &quot;! Elegy,&quot; and even here, those with a fairly open mind will be lulled, hypnotized, and seduced by its shape and beauty. Introduction is the sound of a &quot;new&quot; Red Krayola, one not heard before; one that reveals more about Thompson than perhaps anyone ever knew. This is one of those records that will leave listeners still scratching their heads and smiling (at the same time) after repeat listens for years to come. - Thom Jurek, AMG","torrent":{"xt":"urn:btih:3091a80a07a4128f830c7ee2c181f4d3ccfa2914","amp;dn":"Red+Krayola+-+Introduction+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3091a80a07a4128f830c7ee2c181f4d3ccfa2914","infoHashBuffer":{"type":"Buffer","data":[48,145,168,10,7,164,18,143,131,12,126,226,193,129,244,211,204,250,41,20]},"announce":[],"urlList":[]}}