{"title":"Oracle-11g Anti Hacker Cookbook","uid":7873620,"size":4163547,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:311a24e5801bbcb708e5522240f451a1f6da2980&amp;dn=Oracle-11g+Anti+Hacker+Cookbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1354284548,"description":"Oracle 11g Anti-hackers Cookbook\n\n\nRelease Date: October 25, 2012\nOver 50 recipes and scenarios to hack, defend, and secure your Oracle Database\n\nLearn to protect your sensitive data by using industry certified techniques\nImplement and use ultimate techniques in Oracle Security and new security features introduced in Oracle 11g R2\nImplement strong network communication security using different encryption solutions provided by Oracle Advanced Security\nIn Detail\n\nFor almost all organizations, data security is a matter of prestige and credibility. The Oracle Database is one of the most rich in features and probably the most used Database in a variety of industries where security is essential. To ensure security of data both in transit and on the disk, Oracle has implemented the security technologies to achieve a reliable and solid system. In Oracle 11g Anti-Hacker's Cookbook, you will learn about the most important solutions that can be used for better database security\n\n&quot;Oracle 11g Anti-hacker's Cookbook&quot; covers all the important security measures and includes various tips and tricks to protect your Oracle Database.\n\n&quot;Oracle 11g Anti-hacker's Cookbook&quot; uses real-world scenarios to show you how to secure the Oracle Database server from different perspectives and against different attack scenarios. Almost every chapter has a possible threads section, which describes the major dangers that can be confronted. The initial chapters cover how to defend the operating system, the network, the data and the users. The defense scenarios are linked and designed to prevent these attacks. The later chapters cover Oracle Vault, Oracle VPD, Oracle Labels, and Oracle Audit. Finally, in the Appendices, the book demonstrates how to perform a security assessment against the operating system and the database, and how to use a DAM tool for monitoring.\n\nWhat you will learn from this book\n\nGet to grips with configuring a secure server at operating system level for Oracle Database\nMaster how to secure data by using Oracle Cryptographic API and Transparent Data Encryption\nGet step-by-step instructions to implement a solid audit strategy by using the built in solutions and fine grained auditing\nUnderstand how to segregate and protect data access by using Oracle Vault\nLearn about different types of attacks and how to implement a solid defence against them\nEmpathize the attacks and interceptions by using different techniques and tools such as sniffing, man-in-the-middle, brute force and password crackers.\nApproach\n\nThis cookbook has recipes written in simple, easy to understand format with lots of screenshots and insightful tips and hints.\n\nWho this book is written for\n\nIf you are an Oracle Database Administrator, Security Manager or Security Auditor looking to secure the Oracle Database or prevent it from being hacked, then this book is for you\n\nThis book assumes you have a basic understanding of security concepts.","torrent":{"xt":"urn:btih:311a24e5801bbcb708e5522240f451a1f6da2980","amp;dn":"Oracle-11g+Anti+Hacker+Cookbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"311a24e5801bbcb708e5522240f451a1f6da2980","infoHashBuffer":{"type":"Buffer","data":[49,26,36,229,128,27,188,183,8,229,82,34,64,244,81,161,246,218,41,128]},"announce":[],"urlList":[]}}