{"title":"Cosmic Consciousness PDF (Richard M. Bucke)","uid":4398424,"size":38340270,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3184b9d669e6b3048f958ff42b506489f0a819ff&amp;dn=Cosmic+Consciousness+PDF+%28Richard+M.+Bucke%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"darkpoet1978","files":1,"time":1221549313,"description":"This is not some New Age Hippie crap...  Originally found on the Internet.  Scanned and made into a PDF by an unknown person to whom I thank.\n\nFrom http://en.wikipedia.org/wiki/Richard_Maurice_Bucke\n\nThe magnum opus of Bucke's career was a book that he researched and wrote over many years titled Cosmic Consciousness: A Study in the Evolution of the Human Mind. It was published the year before his death in 1901, and has been continuously republished ever since. In it, Bucke described his own experience, that of contemporaries (most notably Whitman, but also unknown figures like &quot;C.P.&quot;), and the experiences and outlook of historical figures including Buddha, Jesus, Paul, Plotinus, Muhammad, Dante, Francis Bacon, and William Blake.\n\nBucke developed a theory involving three stages in the development of consciousness: the simple consciousness of animals; the self-consciousness of the mass of humanity (encompassing reason, imagination, etc.); and cosmic consciousness - an emerging faculty and the next stage of human development). Among the effects of this progression, he believed he detected a lengthy historical trend in which religious conceptions and theologies had become less and less fearful.\n\nSurprisingly, Bucke seems to think this progression is more evolutionary than spiritual (the work of Charles Darwin probably dominated most educated discourse in 1899). In Cosmic Consciousness (starting with Part 2, Chapter 2, Section 4) he explains how animals developed the sense noise detection in order to survive. Noise detection evolves by including frequency measurements which we experience as tones. Further development in this area culminates in the ability to experience and enjoy music. Likewise, animals developed the sense of light detection which then progressed to black-and-white vision. Some animals (including humans) progressed further by including frequency measurements which we experience as colors, but only mankind extended this into the appreciation of visual beauty including art. Bucke states that initially, only a small number of humans would have been able to experience music or see colors, but eventually these new traits would race through human society until only a very small number of people would not be able to hear music or experience colors.\n\nStarting in the book's Part 3, Section 3, Bucke hypothesizes that next stage of human mental development, which he named &quot;Cosmic Consciousness&quot;, is slowly beginning to appear but will eventually spread widely throughout all of humanity.","torrent":{"xt":"urn:btih:3184b9d669e6b3048f958ff42b506489f0a819ff","amp;dn":"Cosmic+Consciousness+PDF+%28Richard+M.+Bucke%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3184b9d669e6b3048f958ff42b506489f0a819ff","infoHashBuffer":{"type":"Buffer","data":[49,132,185,214,105,230,179,4,143,149,143,244,43,80,100,137,240,168,25,255]},"announce":[],"urlList":[]}}