{"title":"Nancy Kress - Sleepless Trilogy","uid":11624548,"size":631613631,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:319f4b8d0672d6e082e86e3ad3f8092b7947c0f0&amp;dn=Nancy+Kress+-+Sleepless+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":6,"time":1417603769,"description":"\nBeggars in Spain\nBorn in 2008, Leisha Camden is beautiful, extraordinarily intelligent . . . and one of an ever-growing number of human beings who have been genetically modified to never require sleep.\n\nOnce she and &quot;her kind&quot; were considered interesting anomalies. Now they are outcasts -- victims of blind hatred, political repression and shocking mob violence meant to drive the &quot;Sleepless&quot; from human society . . . and, ultimately, from the Earth itself.\n\nBut Leisha Camden has chosen to remain behind in a world that envies and fears her &quot;gift&quot; -- a world marked for destruction in a devastating conspiracy of freedom . . . and revenge.\n\n---\n\nBeggars and Choosers\nIn a future America strangely altered by genetic modifications, millions of ordinary people are supported by the efforts of handsome and intellectually-superior gene-modified humans. These, in turn, are running scared in the face of the near-superhuman powers of the Sleepless, radically altered humans who have their own agenda for humanity. The Sleepless have withdrawn from the rest of the race to an island retreat, from which they periodically release dazzling scientific advances. Most of the world is on the verge of collapse, overburdened by a population of jobless drones and racked by the results of irresponsible genetic research and nanotechnology. Will the world be saved? And for whom?\n\n---\n\nBeggars Ride\nNancy Kress, one of the leading writers of science fiction today, has written a number of provocative and award-winning stories and novels. But it is with the Beggars trilogy that she has reached the pinnacle of her success. Developed out of her Hugo and Nebula Award-winning novella, &quot;Beggars in Spain,&quot; the trilogy was launched with Beggars in Spain (1993), also a Nebula nominee for best novel, and continued in Beggars and Choosers (1995). Both received widespread praise and unusual enthusiasm. Locus, for instance, referred to &quot;the joy of reading a work of SF so intelligent, humane, involving, utterly genuine...magnificent,&quot; and went on to say, &quot;It is Kress's brilliant achievement in Beggars and Choosers, that scientific progress and human idealism, the driving forces behind some of the best hard SF...,never leave behind the passionate muddle that is life....&quot;\n\n\n---\n\n\nFormat: MP3\nBitrate: 32 Kbps\nUnabridged","torrent":{"xt":"urn:btih:319f4b8d0672d6e082e86e3ad3f8092b7947c0f0","amp;dn":"Nancy+Kress+-+Sleepless+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"319f4b8d0672d6e082e86e3ad3f8092b7947c0f0","infoHashBuffer":{"type":"Buffer","data":[49,159,75,141,6,114,214,224,130,232,110,58,211,248,9,43,121,71,192,240]},"announce":[],"urlList":[]}}