{"title":"Another Perfect Stranger (Christian Movie)","uid":4574802,"size":704592940,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3331072ccd3a3d05f29d59b13bc4d68c8affbd4d&amp;dn=Another+Perfect+Stranger+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"IndianChristian","files":3,"time":1229191407,"description":"Another Perfect Stranger (Christian Movie)\n\nAnother must buy movie for all Christians. Infact I would recommend that Christians buy several copies of this movies and distribute it to friends and foes alike. This movie has to be in the top five of all Christian movies produced ever. \nThis is the sequel to the movie &quot;The Perfect Stranger&quot;.\n\nNikki's daughter is grown and off to college. Sarah thinks her parents are insane to believe that her mother actually had dinner with the Lord. But now she is engaged in a conversation with a stranger that make her question her thoughts and ideas on faith and beliefs.\n\nAs in &quot;The Perfect Strange&quot;, this film will bring the question to the viewer as to what they would do if they could have a one-on-one with the Lord. This film will be enjoyed by all and may start great conversations between generations. This movie really answers some great questions about God's love for us in a crazy, evil world and really hits home on the religion vs. relationship aspect of our walk with God. \n\nLanguage: English\nSubtitles: None\nRun Time: 81 minutes\nMy Rating: 10/10\nQuality: 9.5/10 (Dvdrip)\n\nIf financially possible, please buy this CD/DVD to keep Christian films in business. If Christians won't buy Christian films then who will?\n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God's word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\n&quot;Don't ask me what Christ can do for you! \nHe has done all he could. \nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n\t\t","torrent":{"xt":"urn:btih:3331072ccd3a3d05f29d59b13bc4d68c8affbd4d","amp;dn":"Another+Perfect+Stranger+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3331072ccd3a3d05f29d59b13bc4d68c8affbd4d","infoHashBuffer":{"type":"Buffer","data":[51,49,7,44,205,58,61,5,242,157,89,177,59,196,214,140,138,255,189,77]},"announce":[],"urlList":[]}}