{"title":"The Tibetan Book of the Dead","uid":11801944,"size":18924534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:334a125e13371d1aabfcb06b2aa1c3057c02db6d&amp;dn=The+Tibetan+Book+of+the+Dead+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alongway","files":1,"time":1428422420,"description":"The Tibetan Book of the Dead: Or the After-Death Experiences on the Bardo Plane, according to Lama Kazi Dawa-Samdup's English Rendering by W. Y. Evans-Wentz\n\n\nThe Tibetan Book of the Dead is one of the texts that, according to legend, Padma-Sambhava was compelled to hide during his visit to Tibet in the late 8th century. The guru hid his books in stones, lakes, and pillars because the Tibetans of that day and age were somehow unprepared for their teachings. Now, in the form of the ever-popular Tibetan Book of the Dead, these teachings are constantly being discovered and rediscovered by Western readers of many different backgrounds--a phenomenon which began in 1927 with Oxford's first edition of Dr. Evans-Wentz's landmark volume. While it is traditionally used as a mortuary text, to be read or recited in the presence of a dead or dying person, this book--which relates the whole experience of death and rebirth in three intermediate states of being--was originally understood as a guide not only for the dead but also for the living. As a contribution to the science of death and dying--not to mention the belief in life after death, or the belief in rebirth--The Tibetan Book of the Dead is unique among the sacred texts of the world, for its socio-cultural influence in this regard is without comparison","torrent":{"xt":"urn:btih:334a125e13371d1aabfcb06b2aa1c3057c02db6d","amp;dn":"The+Tibetan+Book+of+the+Dead+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"334a125e13371d1aabfcb06b2aa1c3057c02db6d","infoHashBuffer":{"type":"Buffer","data":[51,74,18,94,19,55,29,26,171,252,176,107,42,161,195,5,124,2,219,109]},"announce":[],"urlList":[]}}