{"title":"Paramore (2013) [FLAC]","uid":8345443,"size":445447170,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:339ca372bfe315a9f4c00c7440668dd3551d665e&amp;dn=Paramore+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1365190444,"description":"\n  Paramore (2013) [FLAC]\n\n  Released: 2013\n  Duration: 1:03:56\n  Genre: Pop/Rock\n  Style: Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  01 Fast in My Car\n  02 Now \n  03 Grow Up \n  04 Day Dreaming\n  05 Moving On (Interlude)\n  06 Aint it Fun \n  07 Part II \n  08 Last Hope \n  09 Still into You \n  10 Ankle Biters \n  11 Holiday (Interlude) \n  12 Proof \n  13 Hate to See Your Heart Break\n  14 (One of Those) Crazy Girls \n  15 Im Not Angry Anymore (Interlude) (\n  16 Be Alone \n  17 Future \n\n  Although their blend of emo-pop and slick, anthemic rock &amp; roll eventually made them stars on both sides of the Atlantic, Paramore began humbly enough in Franklin, TN, where Hayley Williams met brothers Josh and Zac Farro after moving to town from Mississippi. Already a powerhouse vocalist at the age of 13, Williams joined a band that the Farro siblings had formed with local guitarist Taylor York. She left the group soon after, signing with Atlantic Records as a solo artist instead, but clashed with the label over the direction of her music. Seeking to front her own band, Williams convinced Atlantic to let her piece together a full lineup. Josh and Zac Farro were recruited for the job, as were guitarist Jason Bynum and bassist Jeremy Davis.\n\n  From the start, Paramore's poppy melodies andsongwriting seemed to contradict the fact that none of the bandmates (with the exception of Davis) were older than 18. To help attract a younger audience, Atlantic decided to share the band with Fueled by Ramen, a Florida-based label with a strong roster of emo-pop acts. Fueled by Ramen officially co-signed the group in April 2005, and Paramore's full-length debut, All We Know Is Falling, was released later that summer. In addition to a performance at New Jersey's Bamboozle Festival and multiple dates on the Warped Tour circuit, Paramore played shows with such simpatico bands as Simple Plan and Straylight Run. Hunter Lamb replaced Bynum on guitar in December 2005, and the band spent the following summer on the Warped Tour once again, cementing its relationship with the fans who had caught the previous summer's shows. Lamb parted ways with the group in early 2007 to get married, and Paramore continued onward as a quartet.","torrent":{"xt":"urn:btih:339ca372bfe315a9f4c00c7440668dd3551d665e","amp;dn":"Paramore+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"339ca372bfe315a9f4c00c7440668dd3551d665e","infoHashBuffer":{"type":"Buffer","data":[51,156,163,114,191,227,21,169,244,192,12,116,64,102,141,211,85,29,102,94]},"announce":[],"urlList":[]}}