{"title":"Futurebirds - Baba Yaga [2013][EAC,log,cue. FLAC]","uid":8386902,"size":444816761,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:33a869bfdc29917943c7ab792c28e71b6a4604fd&amp;dn=Futurebirds+-+Baba+Yaga+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":17,"time":1366308625,"description":"01. Virginia Slims (5:43)\n02. Serial Bowls (3:24)\n03. American Cowboy (4:35)\n04. Tan Lines (5:10)\n05. Felix Helix (3:50)\n06. Dig (6:28)\n07. Keith &amp; Donna (6:41)\n08. The Light (3:07)\n09. Death Awaits (6:06)\n10. The Doewg (2:45)\n11. Womeo (5:10)\n12. Strangers (4:58)\n13. St. Summercamp (8:38)\n\nBaba Yaga, the Fat Possum-issued sophomore outing from Athens, Georgia-based country psych-rockers The Futurebirds, finds the sweet spot between Big Star, My Morning Jacket, and Band of Horses, offering up a spirited 13-song set that's as effervescent as it is impermeable. Doused in enough reverb to give both Surfer Blood and The Vaccines a run for their money, and built on a foundation of roots rock, country-folk, and rural indie pop, The Futurebirds have crafted a dense yet likable tonic to the winter doldrums. It's one that manages to make well-worn tropes sound vital, especially when those melodies are delivered in ragged yet rich four-part harmonies, as is the case with standout cuts like &quot;Virginia Slims,&quot; &quot;Tan Lines,&quot; &quot;Keith and Donna,&quot; and the Fables of the Reconstruction-era R.E.M.-inspired &quot;Serial Bowls.&quot; Named after a bony, child-eating crone from Eastern European folklore, Baba Yaga's uncomplicated musicality is offset by its colorful vernacular, which ranges from the cosmic (&quot;Felix Helix,&quot; &quot;Death Awaits&quot;) to the plain offbeat (&quot;Womeo,&quot; &quot;The Doewg&quot;), yet never loses its Southern conviviality. There are times when the stadium-size production feels a little too much like a band-aid, desperately trying to oversell some of the less memorable material, much of which resides within the album's unfalteringly midtempo-heavy midsection, but Baba Yaga isn't really a record to be picked over. If anything, it feels like alt-country's answer to stoner metal (and a decidedly healthier one at that), providing the listener with a soundtrack that's as tailor-made for hazy summer afternoons as it is for the inky black curtain of night.","torrent":{"xt":"urn:btih:33a869bfdc29917943c7ab792c28e71b6a4604fd","amp;dn":"Futurebirds+-+Baba+Yaga+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33a869bfdc29917943c7ab792c28e71b6a4604fd","infoHashBuffer":{"type":"Buffer","data":[51,168,105,191,220,41,145,121,67,199,171,121,44,40,231,27,106,70,4,253]},"announce":[],"urlList":[]}}