{"title":"The Marvel Saga:  The Official History Of The Marvel Universe","uid":7737409,"size":290061612,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:33e1b4bca62d29ad2278c8bcace71ef3cb944992&amp;dn=The+Marvel+Saga%3A++The+Official+History+Of+The+Marvel+Universe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SplhcbPrime","files":-1,"time":1350521414,"description":"The Marvel Saga:  The Official History of the Marvel Universe was a comic book series which attempted to condense the first 25 years of Marvel Universe events into a sequential, narrative story.\n\nThe series was researched and written by Peter Sanderson, and edited by Danny Fingeroth.  It was published over 25 issues from December, 1985 to December, 1987.  The story follows Marvel continuity as closely as possible from the inception of the Marvel Universe, and it is stated in the first issue that there is nothing in the series that has not already been printed in previous Marvel comics.  The illustration of the comics was mostly made up from excerpts from the original comics in which the events being described took place, with the addition of some new artwork to describe some of the events mentioned.\n\nThe series was meant to be a cohesive and quick way for newcomers to catch up on the entirety of the Marvel Universe at once, featuring the stories of the biggest and most important events in the Universe (up to 1987,) including origins of most of the major Marvel characters.  It also allows readers to see how stories from many different series are related and how they fit together in chronological order.  Since the series ended in 1987, many more important events and facts have been introduced that may affect the stories told in the series, but it still represents the basic early storyline of the Marvel Universe.\n\nThis torrent contains ALL 25 issues of this very cool compilation.\n\nThese are not my scans.  All praise and glory to the original scanners, please.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:33e1b4bca62d29ad2278c8bcace71ef3cb944992","amp;dn":"The+Marvel+Saga%3A++The+Official+History+Of+The+Marvel+Universe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33e1b4bca62d29ad2278c8bcace71ef3cb944992","infoHashBuffer":{"type":"Buffer","data":[51,225,180,188,166,45,41,173,34,120,200,188,172,231,30,243,203,148,73,146]},"announce":[],"urlList":[]}}