{"title":"Fourplay - Esprit De Four (2012) 2012 HDTracks 24-44.1-FLAC","uid":11043663,"size":643023346,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:33f6e6ff33fdd6cd9fb6c7abd823efb1a088ca27&amp;dn=Fourplay+-+Esprit+De+Four+%282012%29+2012+HDTracks+24-44.1-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"hal4000","files":-1,"time":1410918075,"description":"Fourplay is a contemporary jazz quartet in the United States. The original members of the group were Bob James (keyboards), Lee Ritenour (guitars), Nathan East (bass), and Harvey Mason (drums). In 1997, Lee Ritenour left the group and Fourplay chose Larry Carlton as his replacement. In 2010, Larry Carlton left Fourplay and was replaced by Chuck Loeb.\n\nFor over 20 years, the collaborative ensemble Fourplay has grown ever more cohesive in its approach to modern jazz. When the three founding members added guitarist Chuck Loeb to the lineup for 2010's Let's Touch the Sky, the group attained perfect dialogic balance. Fourplay had made fine records before, but the guitar chair always felt either under- or overutilized. Though the long established leader, Loeb's writing, arranging, and playing are more ensemble-oriented than either of his two predecessors, Lee Ritenour or Larry Carlton. On Esprit de Four, Fourplay display themselves as among the most intuitive, forward-thinking, and focused groups in modern jazz -- yet remain very accessible. While their aesthetic has been and remains contemporary, they employ classic approaches to composition, melodic improvisation, rhythm, and harmony. Loeb's &quot;December's Dream&quot; kicks things off. It's an airy composition that weaves together folk, pop, jazz, and even Americana. The shimmering cymbal work of Harvey Mason highlights the interplay between Bob James and Loeb, while Nathan East's bassline instills the melody with an irresistible groove. On &quot;Sonnymoon,&quot; his bassline is deeply funky, preceding a fine exchange between the rich colors in Loeb's chords and the warm texture of James' electric piano, all given weight by Mason's trademark breaks. The latter's title tune presents a Brazilian groove illustrated by Loeb's acoustic guitar atop unobtrusive background synth and organic percussion. James supports with fills and subtle timbral voicings. Vocals have been prevalent on past Fourplay records, but here they are upfront only on the bluesy nocturnal soul of East's &quot;All I Wanna Do,&quot; and the closer, a vocal version of James' &quot;Put Our Hearts Together,&quot; sung beautifully by Seiko Matsuda. The rest are used as wordless textures, like another instrument in the mix. The tune, originally an instrumental, was written by James for a concert in Japan right after the earthquake and tsunami. His daughter Hilary heard it and asked to write lyrics for an abbreviated version. Both are present here. The instrumental commences as a haunting, pop-classical piece that gives way to a weave of lyric conversation that eventually becomes a swinging post-bop jam with an excellent solo by James. Esprit de Four is a shining example of jazz as a collaborative endeavor; these well-established soloists play as equals in a band that communicates on a level that most groups only dream of.\n\nHDTracks-PCM-24Bit-44.1Khz-FLAC.","torrent":{"xt":"urn:btih:33f6e6ff33fdd6cd9fb6c7abd823efb1a088ca27","amp;dn":"Fourplay+-+Esprit+De+Four+%282012%29+2012+HDTracks+24-44.1-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33f6e6ff33fdd6cd9fb6c7abd823efb1a088ca27","infoHashBuffer":{"type":"Buffer","data":[51,246,230,255,51,253,214,205,159,182,199,171,216,35,239,177,160,136,202,39]},"announce":[],"urlList":[]}}