{"title":"Dallas Cowboys Cheerleaders Making The Team S09E02 WEBRip x264.m","uid":10783836,"size":176324971,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:34016d17d8bc66a6f93fb9af36dc6311f8b65737&amp;dn=Dallas+Cowboys+Cheerleaders+Making+The+Team+S09E02+WEBRip+x264.m&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"herbsmokinfreak","files":1,"time":1408194814,"description":"With 55 high caliber girls making it to the finals, it's intimidating for the 30 veterans as they join the audition process and must fight to keep their place on the team. Kitty Carter takes no prisoners as she prepares girls for their solos. Panel interviews reveal who is intellectually ready to handle being a DCC. No one wants to be the dumb girl in the room, but some can't help it. As the dance portion of finals begins, the girls bring their best as they dance for their lives and a chance to become part of the most elite team in the world. The solos excite celebrity judge Melissa Rycroft as she looks for the &quot;it&quot; girls. When the ladies move down to the field, the nervous excitement skyrockets as they are shown dancing on the world's largest indoor video screen. Every mistake and extra pound is magnified. Suddenly, some veterans' spots are on the line. When the judges deliberate, it becomes clear just being super pretty doesn't cut it. As Kelli Finglass, the DCC director, announces the 43 girls who've made training camp, the direction of lives literally changes in an instant, causing tears of happiness and sobs of sorrow. \n\nEnjoy!\n\n420","torrent":{"xt":"urn:btih:34016d17d8bc66a6f93fb9af36dc6311f8b65737","amp;dn":"Dallas+Cowboys+Cheerleaders+Making+The+Team+S09E02+WEBRip+x264.m","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34016d17d8bc66a6f93fb9af36dc6311f8b65737","infoHashBuffer":{"type":"Buffer","data":[52,1,109,23,216,188,102,166,249,63,185,175,54,220,99,17,248,182,87,55]},"announce":[],"urlList":[]}}