{"title":"Global Social Issues - Christopher G. Bates","uid":12105559,"size":11058030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34050a9195f5a608456a4816eb70f1705cddc879&amp;dn=Global+Social+Issues+-+Christopher+G.+Bates&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1436447805,"description":"This landmark reference is a comprehensive, one-stop, interdisciplinary resource that examines current, critical social issues in historical and global contexts. Nearly 150 in-depth, balanced, and thought-provoking articles cover a broad range of critically important topics: the environment, health, science, the media, ethnic conflicts, poverty, and immigration, to name just a few. Each original, signed article provides historical context as well as a thorough discussion and analysis of contemporary issues facing today's interconnected global society. \n\nArticles also include essential primary documents, as well as extensive further reading lists, Web sites of notable institutions and organizations, statistical data, and photographs. In all, Global Social Issues provides essential, objective information that enables students to understand and evaluate the major challenges facing human society worldwide and to foster awareness and critical thinking as &quot;global citizens&quot; of the 21st century.\n\nReview\n\n&quot;Global Social Issues: An Encyclopedia is the type of reference work that students will naturally turn to in order to locate background information on a topic. Each chapter provides a straightforward treatment that places the issue in historic context while keeping a focus on current status and recent developments. In addition, each chapter offers solid leads to books, journal articles, and Web resources useful in furthering a student's research. Libraries serving undergraduates and high school students with assignments on global issues will find this set worth considering.&quot; --Against the Grain\n\n&quot;This valuable three-volume reference work will be especially useful for undergraduate students because it covers topics that are of high interest and frequently chosen. ... The essays offer readers thorough and detailed background on each issue, including historical development and contemporary perspectives. Especially useful are the current statistics that are frequently included. ... This set is particularly valuable for its international coverage and clear explanations of social issues with historical perspectives. The 70-page index increases functionality and improves the subject access. An indispensable addition for college libraries and for large high school collections. Highly recommended. Lower- and upper-level undergraduates; general readers.&quot; --Choice\n\n&quot;Although there are numerous works on globalization which discuss, in whole or in part, many of the same subjects, this one stands out for its explicit emphasis on social issues. ... Admittedly ambitious, it, nonetheless, accomplishes what it sets out to do (i.e., address many of the major issues confronting global society). Students of global studies and international relations should find it a useful source for authoritative overviews and background information. Recommended for both academic and public libraries.&quot; --Reference Reviews","torrent":{"xt":"urn:btih:34050a9195f5a608456a4816eb70f1705cddc879","amp;dn":"Global+Social+Issues+-+Christopher+G.+Bates","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34050a9195f5a608456a4816eb70f1705cddc879","infoHashBuffer":{"type":"Buffer","data":[52,5,10,145,149,245,166,8,69,106,72,22,235,112,241,112,92,221,200,121]},"announce":[],"urlList":[]}}