{"title":"Assassination (Ansatsu) - 1964 ","uid":6706517,"size":1703422083,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3444577a491a53daea3c502e32b5eb39a66c1fd8&amp;dn=Assassination+%28Ansatsu%29+-+1964+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jericho_cane","files":6,"time":1317192154,"description":"Assassination (or Ansatsu) marked Masahiro Shinoda's first attempt at a period film, and is widely considered to be his finest achievement. Previously gaining fame and status alongside Nagisa Oshima and Kiju Yoshida, challenging established Japanese cinema with tales of reckless youth, The Dry Lake (1960) and the seminal yakuza drama Pale Flower (1964) Shinoda graduated from Shochiku, where, like Shohei Imamura, his grounding was working as an assistant to Yasujiro Ozu.\n\nThe story of Assassination begins with the events of 1853 when four black ships, the foreign steamboats of Commander Matthew Perry, anchored at Edo Bay, sparking civil unrest and the major political maneuvering that saw the end of the Tokugawa Shogunate. At a time when assassination had become a disturbing political tool, Shinoda's film follows Hachiro Kiyokawa (Tetsuro Tamba), an ambitious, masterless samurai whose allegiances drift dangerously between the Shogunate and the Emperor. Filmed in richly stylish black and white 'Scope by cinematographer Masao Kosugi, Shinoda's film explores the character of Kiyokawa as he singlehandedly attempts, against a backdrop of betrayal and abrupt violence, to prevent the outbreak of civil war.\n\nWith an award-winning score by Toru Takemitsu (Pitfall, The Face of Another) and a deft, twisting narrative structure, Assassination's profound nihilism has a striking contemporary resonance which fiercely displays the director's skill and individual vision. The Masters of Cinema Series is proud to present Assassination for the first time on home video in the West.","torrent":{"xt":"urn:btih:3444577a491a53daea3c502e32b5eb39a66c1fd8","amp;dn":"Assassination+%28Ansatsu%29+-+1964+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3444577a491a53daea3c502e32b5eb39a66c1fd8","infoHashBuffer":{"type":"Buffer","data":[52,68,87,122,73,26,83,218,234,60,80,46,50,181,235,57,166,108,31,216]},"announce":[],"urlList":[]}}