{"title":"Viniyoga Therapy for the Upper Back, Neck &amp; Shoulders with G","uid":9092171,"size":1411553180,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:346b387efd60ba1c0d1f32e71c13e2b07546e4c1&amp;dn=Viniyoga+Therapy+for+the+Upper+Back%2C+Neck+%26amp%3B+Shoulders+with+G&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"acer47x","files":-1,"time":1382622857,"description":"Viniyoga Therapy for the Upper Back, Neck and Shoulders features short, simple therapeutic yoga practices carefully designed to alleviate pain and promote health in the upper back, neck and shoulders. For the first time ever on DVD, benefit from the expert guidance of Gary Kraftsow, one of the world's leading yoga therapists. Founder of the American Viniyoga Institute, Gary is the designer of the only yoga practices demonstrated to be effective for back pain in a National Institutes of Health-sponsored clinical study. If you are one of the 8 out of 10 Americans who have or will experience back pain, make the powerful therapeutic practices on this DVD a part of your everyday regimen for health and well-being!\n\nHighlights from this DVD include:\n- Presentation on Understanding Back Pain and the application of yoga therapy.\n- Technique Workshop on how to safely perform postures and movements.\n- Focused practice for Upper Back and Neck Therapy.\n- Focused practice for Neck and Shoulder Therapy.\n- Integrated practice for sustained upper back Strength and Stability.\n- Bonus MP3s of all practices for audio-only classes at home or on the go.","torrent":{"xt":"urn:btih:346b387efd60ba1c0d1f32e71c13e2b07546e4c1","amp;dn":"Viniyoga+Therapy+for+the+Upper+Back%2C+Neck+%26amp%3B+Shoulders+with+G","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"346b387efd60ba1c0d1f32e71c13e2b07546e4c1","infoHashBuffer":{"type":"Buffer","data":[52,107,56,126,253,96,186,28,13,31,50,231,28,19,226,176,117,70,228,193]},"announce":[],"urlList":[]}}