{"title":"4Media DVD Copy [SN]","uid":4443976,"size":9615964,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:34912324a8eef5f52bb56e89e1511aa44aa77311&amp;dn=4Media+DVD+Copy+%5BSN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Nadav_Peretz","files":4,"time":1223947913,"description":"4Media DVD Copy for Mac Introduction\n\n4Media DVD Copy for Mac can copy DVD on Mac or clone DVD for Mac with the entire DVD movie in 1:1 ratio perfectly in the case of copying DVD-5 to DVD-5, DVD-9 to DVD-9, DVD-5 to DVD-9; and compress DVD-9 (dual-layer DVD) to one DVD-5 disc easily. 4Media DVD Copy for Mac software also allows you to copy DVD to DVD for Mac.\nThe Mac DVD burning software has many other advanced features such as selecting subtitles and audio tracks, removing menus and so on, which could help you create customized DVD copy for Mac.\nThe Mac DVD Burner contains powerful functions of DVD burning. The Mac DVD burning software can not only copy DVD movie to ISO file or DVD folder and backup DVD to hard disk drive on Mac, but also burn DVD for Mac to copy ISO file and DVD folder to DVD. Do not hesitate to free download 4Media DVD Copy for Mac to make your DVD copying easy and fast!\n\n\n\nKey Features\n# High speed in DVD copying and easy-to-handle\nThe DVD copy Mac software can burn DVD in fast speed with simple settings. You can control Mac DVD burning easily without any problem. The whole interface of the Mac DVD burner is friendly to use;\n# Compress DVD-9 to one DVD-5\n4Media DVD Copy for Mac helps you compress DVD-9 (dual-layer DVD) to one DVD-5 disc easily on Mac OS X;\n# Copy DVD movie on Mac in 1:1 ratio\nThe DVD copy Mac software can copy DVD movie with the entire disc perfectly including titles, menus, subtitles and audio tracks. And it supports copying DVD-9 to DVD-9, DVD-5 to DVD-5, DVD-5 to DVD-9 in 1:1 ratio;\n# Support lossless dual layer DVD copy\nThe Mac DVD copying software can copy DVD-9 with the entire DVD movie to 8.5GB dual layer recordable media (DVD+R/RW, DVD-R/RW) in 1:1 ratio;\n# You can create customized DVD copying at will\nThe DVD copy software for Mac allows you to select subtitles or audio tracks to create customized DVD copying and optionally remove DVD menus and copy DVD with main movie separately to preserve anything you want;\n# High flexibility\n4Media DVD Copy for Mac supports both NTSC and PAL DVD movie copying. The DVD copy Mac software works well with DVD+-R/RW, DVD-RAM, most DVD players and burners, and Dual Layer 8.5GB disc;\n# Mac DVD backup software/Mac DVD burner\n4Media DVD Copy for Mac is also a Mac DVD Burner as it copies the whole DVD movie to DVD in 1:1 ratio.\n\nSystem Requirement:\n# MAC OS X v10.4 or higher operating system;\n# Intel Core Duo processor, POWER G5 processor or above;\n# 512M RAM;\n# 20MB free hard disk space for installation; 20GB free hard disk space for temporary files;\n# DVD-R, DVD-RW, DVD+R, DVD+RW, DVD+R DL, DVD-RAM.","torrent":{"xt":"urn:btih:34912324a8eef5f52bb56e89e1511aa44aa77311","amp;dn":"4Media+DVD+Copy+%5BSN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34912324a8eef5f52bb56e89e1511aa44aa77311","infoHashBuffer":{"type":"Buffer","data":[52,145,35,36,168,238,245,245,43,181,110,137,225,81,26,164,74,167,115,17]},"announce":[],"urlList":[]}}