{"title":"Knuckles the Malevolent Nun","uid":8590145,"size":50614048,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:34cfe1223c38fcae1f38b387e5db48bb7efa66ee&amp;dn=Knuckles+the+Malevolent+Nun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1371620427,"description":"Issues 1-2 of 'Knuckles the Malevolent Nun'\n\nFantagraphics Books, 1991, 28 pages each\n\nWritten and Illustrated by Cornelius Stone and Roger Langridge\n\nWith further contributions from Lizzy Bee, Scott Gray, Dylan Horrocks, Stephen Jewell, Michael Lamb, Will Saunders, Scott Gray, Andy Pants, Will Saunders\n\nThe blurb below does not relate specifically to either of the books in this upload, although I'm pretty sure some of those stories do appear in these volumes. Still, it gives you a good idea of what you're in for with this one...\n\nBack from the dead in the first of an occasional series - the scourge of 1980s student newspapers, everybody's favourite &quot;naughty auntie&quot; Knuckles the Malevolent Nun returns to challenge the status quo, molest farm animals and show you her rosary. Original creators Cornelius Stone and Roger Langridge are in the saddle again, and there's an eye-watering assortment of guest artists offering their own interpretations of her gorgeous visage (and parts south). This issue sees Her Malevolence travel to a cosmic sewer, abuse her fly, contemplate eating an endangered species or two, prove that Humpty Dumpty was pushed, and pose nude for a reality-bending masterpiece guaranteed to fry your mind. (Scenes of Knuckles eating a Cruntucky Fried CruntTMburger are, however, not for the faint of heart.) ","torrent":{"xt":"urn:btih:34cfe1223c38fcae1f38b387e5db48bb7efa66ee","amp;dn":"Knuckles+the+Malevolent+Nun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34cfe1223c38fcae1f38b387e5db48bb7efa66ee","infoHashBuffer":{"type":"Buffer","data":[52,207,225,34,60,56,252,174,31,56,179,135,229,219,72,187,126,250,102,238]},"announce":[],"urlList":[]}}