{"title":"FINAL FANTASY V Android","uid":11831634,"size":151876789,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:34d429244ca4d20256bee63fbe69458767784338&amp;dn=FINAL+FANTASY+V+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"pacolovac","files":2,"time":1429575290,"description":"== About the game:\n&quot;Final Fantasy V might not represent the high point of the series, but Square Enix's sympathetic graphical overhaul and that ever-engrossing job system mean that it feels surprisingly fresh in 2013&quot; - Pocket Gamer\n\nFINAL FANTASY V first debuted in 1992 as the fifth installment in the iconic FINAL FANTASY series. This wildly popular RPG was the first in the series to sell over two million copies.\nThis groundbreaking title allowed players to customize their characters with an unprecedented degree of freedom thanks to a new job and ability system that further improved and refined the job change system used in FINAL FANTASY III. The title also saw the introduction of more detailed and expressive 2D character models, which helped further fuel the player's imagination, making the story even more immersive and fun to play.\n\nStory\n\nEarth, water, fire, and wind...\nThese are the four crystals that bring peace and prosperity to the world,\nbut they have lost their power and are now on verge of destruction.\nIt all started with a strange change in the wind...\nSensing something ominous astir, the young traveler Bartz astride his chocobo, Princess Lenna of Castle\nTycoon, the mysterious Galuf, an old man with a bad case of amnesia, and the pirate captain Faris soon find that fate has brought the former strangers together.\nWith spirits fired by strong will and purpose, the four heroes set out on an epic adventure.\n\n&quot;*WARNING*\nIf a login error occurs when accessing cloud save data, please try again after either toggling off your device's screen lock feature or toggling on the auto-rotate screen feature. If the error persists, please contact the Square Enix Support Center. We apologize for any inconvenience, and hope you enjoy playing FINAL FANTASY V.&quot;\n\n\n== Features:Good graphics\nExpanded subject line and map\n\n\n== Version:Final Fantasy V v1.1.1 from October 24, 2014\nFull Release\n\n\n ============\n OTHER/INFO\n ============\n(error from the original on Google Play should be fixed)\n\n\n\n== Instructions:1. Copy .apk file to your Android, run and install it\n2. Copy folder &quot;com.square_...&quot; to SDCARD/ANDROID/OBB (sometimes device/android/obb)\nIf OBB doesn't exist create it in your Android in the root directory (main system directory)\nPlay &amp; enjoy!\n\n\n== System Requirements:\nAndroid 4.0+\n\n\n If you enjoyed the game then share with others by seeding!\nSupport game development and buy the game!\n\n\nGame made by \nSquare Co., Ltd. and then Matrix Software for Android","torrent":{"xt":"urn:btih:34d429244ca4d20256bee63fbe69458767784338","amp;dn":"FINAL+FANTASY+V+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34d429244ca4d20256bee63fbe69458767784338","infoHashBuffer":{"type":"Buffer","data":[52,212,41,36,76,164,210,2,86,190,230,63,190,105,69,135,103,120,67,56]},"announce":[],"urlList":[]}}