{"title":"Orange Goblin - Back From The Abyss  mp3   2014","uid":11089231,"size":110664100,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3535f912b5df037a46e5d2022ffc7bc0de42bc96&amp;dn=Orange+Goblin+-+Back+From+The+Abyss++mp3+++2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"analogkid6103","files":15,"time":1411499361,"description":"Orange Goblin, previously Our Haunted Kingdom, are a heavy metal band from the United Kingdom that formed in 1995. The band's lineup currently consists of singer Ben Ward, guitarist Joe Hoare, bassist Martyn Millard, and drummer Chris Turner.\n\nOrange Goblin was originally formed in 1995 under the name Our Haunted Kingdom. They released a split 7&quot; with Electric Wizard in 1996 on Rise Above Records before adopting the moniker Orange Goblin. The bands first three albums were stoner/doom. On 2002's Coup de Grace they began to add punk, doom metal, and other influences to their sound.\n\nTheir first five releases were issued by Rise Above Records. Rhythm guitarist Pete O'Malley left the band in 2004 to pursue a career as an artist. On December 16, 2005 the band celebrated its tenth anniversary with a concert at the Underworld club in Camden also featuring Scissorfight and Blood Island Raiders. Their 2007 album, Healing Through Fire was released on Mayan/Sanctuary Records. On September 3, 2008 the band announced that they had signed with Candlelight Records and were working on material for a new album with a September 2009 release date in mind. It was then announced in May 2009 that &quot;Songwriting for the new album is ongoing but looks very promising with the skeleton of four or five new songs already in place. Two rough working titles for the new songs include Red Tide Rising and The Bishop's Wolf&quot;. The band had earlier announced that it had postponed the recording sessions for the new album due to &quot;unforeseen circumstances&quot; and apologised to the fans assuring them that &quot;it will be worth the wait&quot;. Twelve months later, in March 2010, a statement was issued by the band stating that while they were not necessarily never going to release a new album ever again, the prospective forthcoming album was to be postponed for the foreseeable future. The band announced they will be recording new material in August 2011. Once mentioned on Ricky Gervais' XFM radio show. This recording was indeed completed in September 2011 and is set to be released early in February 2012 under the name of 'A Eulogy for the Damned' by Candlelight Records.\n\nIn mid-2010 the band's back catalog was reissued on Rise Above Records in digipack form. In mid-December 2010 they celebrated their fifteenth anniversary with support coming from British blues-rock band Firebird - featuring previous members of Carcass and Spiritual Beggars - and American doom-rock band Solace culminating in their annual Christmas show in London.\n\nOrange Goblin also performed at the 2011 Maryland Deathfest music festival in Baltimore, Maryland in the United States.\n\n01.Sabbath Hex 04:47\n02.Uebermensch 03:57\n03.The Devils Whip 02:15\n04.Demon Blues 04:40\n05.Heavy Lies the Crown 06:19\n06.Into the Arms of Morpheus 07:07\n07.Mythical Knives 04:48\n08.Bloodzilla 04:10\n09.The Abyss 05:33\n10.Titan 01:59\n11.Blood of Them 05:47\n12.The Shadow Over Innsmouth 02:54\nGenre: Stoner\nSubgenre: Stoner Rock\nBitrate: Vbr\nSize: 105.54 MB\nShow/Hide Files:\n15 files\n\n\nMembers\n\nBen Ward - vocals, guitar\nJoe Hoare - guitar\nMartyn Millard - bass\nChris Turner - drums","torrent":{"xt":"urn:btih:3535f912b5df037a46e5d2022ffc7bc0de42bc96","amp;dn":"Orange+Goblin+-+Back+From+The+Abyss++mp3+++2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3535f912b5df037a46e5d2022ffc7bc0de42bc96","infoHashBuffer":{"type":"Buffer","data":[53,53,249,18,181,223,3,122,70,229,210,2,47,252,123,192,222,66,188,150]},"announce":[],"urlList":[]}}