{"title":"PMA Science of Success Course / Napoleon Hill","uid":8211538,"size":9783589,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:355bb99ebdc6beb5f68e686cd79f90e08e8150e8&amp;dn=PMA+Science+of+Success+Course+%2F+Napoleon+Hill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DType99","files":-1,"time":1362250032,"description":"The Positive Mental Attitude Science of Success Course!\n\nThis is a sort of updated version of Law of Success, and was one of the last books Napoleon Hill wrote towards the end of his life.\n\nNapoleon Hill provides you with the cutting edge tools to revolutionize your daily life. The course will unleash the power and ability inside you! It also helps you to discover and develop the real you, what you really dream of and how to reach your goals.\n\nSuccess does not happen either by hope or by chance. Change yourself, eliminate the limiting beliefs, find new potentials, enhance your personality and develop a new path to success from our most exclusive course.\n\nThis coursebook is usually combined with: \n* &quot;Think and Grow Rich,&quot; (free online)\n* &quot;Your Right to Be Rich&quot; (aka: &quot;Napoleon Hill's Rare Recordings,&quot; found on the 'net), and\n* The 17 success scrolls (free online)\n\nThis long-lost course is now yours to help spread to the world Napoleon Hill's vision of a happier, more complete and more prosperous life. You now possess a guide to greater fulfillment in every aspect of your life - personal, spiritual as well as financial. This course is founded on no creed or brand but consists of fundamentals of all enduring success and all constructive human achievement in every field of human endeavor. It supports religion yet it is a part of none. It is so universal in its nature that it leads its students inevitably to success in all occupations.","torrent":{"xt":"urn:btih:355bb99ebdc6beb5f68e686cd79f90e08e8150e8","amp;dn":"PMA+Science+of+Success+Course+%2F+Napoleon+Hill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"355bb99ebdc6beb5f68e686cd79f90e08e8150e8","infoHashBuffer":{"type":"Buffer","data":[53,91,185,158,189,198,190,181,246,142,104,108,215,159,144,224,142,129,80,232]},"announce":[],"urlList":[]}}