{"title":"[Mark_McDonnell]The Art and Feel of Making it Real Gesture Drawi","uid":11087688,"size":9871881,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35cc2eaca8acc8134c0d943f1759f03594129ac7&amp;dn=%5BMark_McDonnell%5DThe+Art+and+Feel+of+Making+it+Real+Gesture+Drawi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1411479728,"description":"Mark McDonnell's The Art and Feel of Making it Real: Gesture Drawing for the Animation and Entertainment Industry is the one-source book animation and entertainment enthusiasts have been waiting for! This self-published hardback contains 208-pages of full color illustrations and instruction offering artists the key to opening the door to the long guarded secrets of studio only techniques, theories and practices. This book will help explain how to design and capture the essence of life through the knowledge of gesture drawing, increase observation skills and use basic design principles that will help to fuel the power of your imagination . . . all of which are important and necessary skills to have in the animation and entertainment industry! This book applies to animators, storyboard artists, visual development artists, concept designers and any person interested in working in the animation and entertainment industry. From hobbyists to industry professionals, this is the book that will help you create successful images with a strong focus on storytelling skills! Mark McDonnell has blended his own sensibilities of instruction as well as continued teaching Walt Stanchfield's theories and practices at the Walt Disney Company to its employees and artists. This book is in addition to Stanchfield's previous thoughts and practices and is more focused on tailoring teachings and words of wisdom to the industry and how it functions in today's times. It comes with a foreword by the legendary Eric Goldberg (Director/Supervising Animator at the Walt Disney Animation Studios), and contributing words by Andreas Deja (Supervising Animator/Visual Development Artist at the Walt Disney Animation Studios), Marcelo Vignali (Art Director/ Visual Development Artist at Sony Pictures Animation), and industry instructor Karl Gnass (Master Draftsman &amp; Figure Drawing Instructor).\n\nPublisher: Creativemarks 2009 | 208 Pages | ISBN: 0982231776 | PDF | 10 MB\n\nEditorial Reviews\nReview\nMark McDonnell's book The Art &amp; Feel of Making it Real, is a smart and useful guide for any young artist and/or student, who is interested in a career in animation or illustration. The book's chapters explain vividly, what points to keep in mind when it comes to anatomy, motion, caricature and composition. His beautiful illustrations show clearly step by step how to go about it. Mark's long experience in working in the entertainment industry will not only help readers to apply a structured approach toward their art, it will also inspire them to do better work. --Andreas Deja (Walt Disney Feature Animation - Supervising Animator, Visual Development Artist)\n\nIn the world of art, drawing the human figure with knowledge and understanding is one of the more difficult tasks an artist can endeavor to do. But, drawing the human figure with a sense of life, sympathy and sincerity is the most difficult of tasks a muse, if you will having eluded many a great artist throughout the ages. Mark McDonnell is not only a tremendous draftsman, whose drawings convey a knowledge and understanding of the human figure, but more than that he has captured that illusive quality with a fearless approach that breathes life into each of his drawings. In this collection, Mark makes it abundantly clear that it is his fearlessness, and love of the life that surrounds him, that has enabled him to capture that muse that all artists endeavor to attain the muse of life. --Marcelo Vignali (Sony Pictures Animation - Art Director, Visual Development Artist)\n\nYou not only feel but you see Mark s enthusiasm and love for his subject in this refreshingly simple and clear presentation. This is a wonderful homage to Walt Stanchfield teachings as well as a testament to Mark's own growing development and talent as an artist. It is particularly fun to watch how effortlessly he expresses character and story. Mark demonstrates a real command of his subject and fortunately for us, a willingness to share it. --Karl Gnass (Master Draftsman &amp; Figure Drawing Instructor)\nAbout the Author\nMark McDonnell is a top designer working in the Animation and Entertainment Industries that has worked in a wide variety of skill sets such as Character Design, Layout Design, Look Development, Graphic Design, and as an Instructor. He is currently instructing studio employees at The Walt Disney Company. He has worked for a wide range of studios that include: Walt Disney Feature, Disney Toon Studios, Walt Disney Television Animation, Pixar, Miramax, Fox, H.I.T. Entertainment, New Line, Mattel, Sony, Legendary Pictures, The Jim Henson Company, Big Idea Inc. and many more. ","torrent":{"xt":"urn:btih:35cc2eaca8acc8134c0d943f1759f03594129ac7","amp;dn":"%5BMark_McDonnell%5DThe+Art+and+Feel+of+Making+it+Real+Gesture+Drawi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35cc2eaca8acc8134c0d943f1759f03594129ac7","infoHashBuffer":{"type":"Buffer","data":[53,204,46,172,168,172,200,19,76,13,148,63,23,89,240,53,148,18,154,199]},"announce":[],"urlList":[]}}