{"title":"Genesis: Six Of The Best (Milton Keynes, UK 2/10/82) SE","uid":4208480,"size":379083455,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:35ce0b15a5a8b99b41542d66113a6309b662efa5&amp;dn=Genesis%3A+Six+Of+The+Best+%28Milton+Keynes%2C+UK+2%2F10%2F82%29+SE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"FatFreddy247","files":39,"time":1211931309,"description":"All Genesis fans,\n\n\nThis is the Special Edition of the legendary Genesis show from 1982 where Phil Collins, Tony Banks, Mike Rutherford, Daryl Stuermer and Chester Thompson reunited with former bandmates Peter Gabriel and Steve Hackett in support of the WOMAD festival that had been a critical success but commercial disaster earlier that year.  With Gabriel facing financial ruin his and Genesis Manager Tony Smith suggested this reunion concert which was quickly agreed to by all...\n\n- In typical Gabriel style I had had big dream.  My general philosophy is go for what you want and accept what you get, but with WOMAD we ended up in a financial disaster.  The first festival in 1982 was a magnificent event with Echo And The Bunnymen, the Burundis, Jon Hassell.  We put it on during schooltime so there were lots of schools working on projects about world music; it was very exciting, fresh, passionate.  But the people just didn't come.  There was a rail strike that weekend and even though we thought we had enough names to pull in an audience we were hopelessly under each day, and suddenly realised the financial consequences.\n\nThe debts were more than I could ever hope to sort out personally.  I had some horrible phone calls and death threats from people who I owed money to.  It was a very oppressive nightmare.  Tony Smith offered to speak to the band to see if they could help and they were extremely gracious.  I do think it helped that I had been a little generous at the time of my leaving and they were certainly extremely generous on this occasion.  The money from that reunion concert was enough to pay off the debts and allow us to keep WOMAD going. -\n\n - Peter Gabriel \n\n\nFor the first time the entire digitally remastered concert is presented along with soundboard recording of the rehearsals.\n\n\nThe original FLAC lossless files were downloaded from http://torrent.genesis-movement.org, converted to MP3 using Switch Sound File Converter then cover artwork embedded and finally encoded to base 224Kbps VBR gapless MP3 using iTunes 7.6.2.9.\n\n\nABOUT THE RECORDING:\nTom Morgenstern of TM Productions is quoted as saying, -this is a compilation of three or four different AUD recordings and probably none of them were 1st generation.  Anyway, these were the best available sources around, carefully chosen, restored and sound-aligned.  Its still a mediocre AUD recording, but some parts are well balanced and not too distorted - its listenable at least, some say, for the very first time-\n\nRUMOURS OF A PRO RECORDING:\nAlthough the band have been quoted several times as saying there was no proper recording or filming of this concert, eye witnesses continue to contradict this.  -I can assure you all with 100% absolute certainty the band are wrong.  The whole concert was fully recorded and filmed by at the very least 1 pro camera, and Im pretty sure there where 3 pro cameras.  This is not a rumour or myth or what-have-you, its a solid fact - I know because I spent part of the time standing right behind the camera operator on the top tier of the scaffolding tower, and the audio recording was taking place below me.  I can also tell you that Peter Gabriel has a copy of the film on VHS, I dont think its a finished video, but rather some raw footage if I remember correctly.  Peter Gabriel has said that he is not happy about releasing any of it due to his bad performance, so even if it did get an official airing I suspect he would overdub quite a bit anyway. There have been many arguments about this in the past, but Peter just prefers to overdub than keep it as is - this pretty much goes for anything, not just this concert so I seriously doubt he will have a change of heart anytime soon.  I also remember there was some discussion at the time as to some form of release for WOMAD but this was before the show and Im not party to what was said afterwards. -\n\n - Orbos\n\n\nA FANS-EYE VIEW:\nTaken from the FAde003 release liner notes:\n\nRaindrops keep falling on my head, they keep falling on my head...\n\nFor over 24 hours it had been pouring, but nobody was snoring. Let me tell you \nthat this was no bowl, but rather a gently sloping hill now representing a quagmire, upon which stood some 60,000 eagerly awaiting and impatient fans, crammed together like sardines in the most inhumane of settings.  Those that suffered through one of the worst days in British weather for an outdoor rock concert didn't allow their spirits to be dampened though.\n\nWe were there to see Peter reunited with Genesis!\n\nSome there had never accepted his departure, whereas others, such as myself, were there to see what all the fuss had been about. Okay, I may have been weaned on the &quot;early years&quot; of Genesis and I still loved that period immensely, but I was only a kid back then and by the time I got around to seeing the band live, Peter (and Steve) had already left. Besides, Genesis were still a force to be reckoned with...\n\nWe wondered how the current Genesis line-up might compromise the possibilities that a reunion could bring. Perhaps Peter might appear out of place or more of a sidekick. Wondering, we grew impatient as the show became increasingly delayed due to the weather. The crowd took out their frustrations on the more annoying support acts that jarred against this progressive reconnaissance by throwing beer bottle, but on the whole they were remarkably well behaved under the circumstances. \nWe waited for what seemed like an eternity. Finally the lights dimmed and a steady drumbeat filled the void. And then... what an entrance! Out flew the Angel from a coffin, launching into a set list of classic Genesis that we dared not dream they would play. The place went nuts. Rain, sardines, cold and grey... who cared anymore? \n\nThe result was that this was different from other shows I had attended in England where Genesis fans sat quietly, listened politely and cheered in-between songs. Tonight we sang our hearts out non-stop for two hours, and yelled and screamed throughout. Oh, if only Steve Hackett was there it would have been perfect. Of course, we all love Daryl on guitar, but Steve was an essential part of that early period and I thought the band's sound and compositions suffered the most when he left. \n\nAnyway, it took me a good hour to realize that I had not taken my eyes off of Peter, and for the first time I realized why Genesis had been viewed as \nGabriels backing band. He was animated on stage in a way that Phil wasn't and those old songs simply had more soul with Peter leading them. It was impossible to look elsewhere, especially when he put on the old costumes, recreating scenes that we had only been able to see in photographs - the days when Genesis were about visual theatrics as much as their music. Tonight these were his songs and Gabriel reclaimed his angels. \n\nAs the band returned for the first encore, a wave of cheering swept though the crowd at the sudden realisation of a new face on stage: Hackett had come out to complete the line-up for the encores! I just about filled my pants and tried to say something intelligible, but all I could muster at this point sounded something like -Myeahhaackkett-. I just about lost it right then and there, but it didnt matter because so had everyone else around me. We all freaked out and sloshed around in the mud and jumped and danced and hugged and then, then....then it was all over never to happen again. &lt;well not until 2010&gt;\n\nLet me tell you that this was THE band, this was THE lineup and this was THE concert. We were well rewarded for the wait, and I wouldnt have swapped it for anything.\n\n-Its been a long, long time - hasnt it?-\n\n\nTHE CONCERT: Milton Keynes Bowl, 02-Oct-1982\n\n01. Introduction By Jonathan King 01:55 \n02. Back In NYC 07:40 \n03. Dancing With The Moonlit Knight (Intro) 01:41 \n04. Carpet Crawlers 05:08 \n05. Greeting By Peter Gabriel 01:44 \n06. Firth Of Fifth 09:40 \n07. The Musical Box 12:29 \n08. Solsbury Hill 05:20 \n09. Turn It On Again 06:53 \n10. The Lamb Lies Down On Broadway 07:41 \n11. Fly On A Windshield 02:57 \n12. Broadway Melody Of 1974 01:38 \n13. In The Cage 08:20\n14. Tube Story 02:48\n15. Suppers Ready 30:05 \n16. I Know What I Like 12:37 \n17. The Knife 05:52\n18. Closing Words 00:56\n\n\nTHE REHEARSALS: September 1982\n\n19. Back In NYC\t05:57\n20. Dancing With The Moonlit Knight 04:02\t\n21. The Carpet Crawlers 05:45\n22. Firth Of Fifth 09:03\n23. The Musical Box 10:46\n24. The Lamb Lies Down On Broadway 06:38\n25. Fly On A Windshield 04:38\n26. In The Cage 09:21\n27. Suppers Ready 24:06\n28. The Knife 03:48\n29. Solsbury Hill [Take 1] 01:52\n30. Solsbury Hill [Take 2] 03:25\n31. Solsbury Hill [Take 3] 05:04\n\nTotal Running Time: 3:34:51 \n\n","torrent":{"xt":"urn:btih:35ce0b15a5a8b99b41542d66113a6309b662efa5","amp;dn":"Genesis%3A+Six+Of+The+Best+%28Milton+Keynes%2C+UK+2%2F10%2F82%29+SE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35ce0b15a5a8b99b41542d66113a6309b662efa5","infoHashBuffer":{"type":"Buffer","data":[53,206,11,21,165,168,185,155,65,84,45,102,17,58,99,9,182,98,239,165]},"announce":[],"urlList":[]}}