{"title":"Araluen by Judy Nunn","uid":9646936,"size":748711,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3661440e7b9f4cb81252f5a61831b8a8dffc389a&amp;dn=Araluen+by+Judy+Nunn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":1,"time":1393019010,"description":"\nA spell-binding, multi-generational novel, set in the ruthless world of movie-making. On a blistering hot day in 1850, George and Richard Ross take their first steps on Australian soil after three long months at sea. All they have is each other, and a quarterly remittance from their irate father who has banished them to the Colonies. \n\nA decade on, and the brothers are the owners of successful vineyard, Araluen, nestled in a beautiful green valley not far from Adelaide. Now a successful businessman, George has laid down the roots of his own Ross dynasty, born of the New World. But building a family empire - at any cost - can have a shattering effect on the generations to come ... From the South Australian vineyards of the 1850s to the opulence and corruption of Hollywood's golden age... \n\nFrom the relentless loneliness of the outback to mega-budget movie-making in modern-day New York... Judy Nunn weaves an intricate web of characters and locations in this spellbinding saga of the Ross family and its inescapable legacy of greed and power.\n\nGenre: Historical Fiction","torrent":{"xt":"urn:btih:3661440e7b9f4cb81252f5a61831b8a8dffc389a","amp;dn":"Araluen+by+Judy+Nunn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3661440e7b9f4cb81252f5a61831b8a8dffc389a","infoHashBuffer":{"type":"Buffer","data":[54,97,68,14,123,159,76,184,18,82,245,166,24,49,184,168,223,252,56,154]},"announce":[],"urlList":[]}}