{"title":"Quick Start to Rigging in Maya Vol 2 - DigitalTutors 720p MP4","uid":10209858,"size":390488287,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:366a1539972488090b4e088305085655d198b526&amp;dn=Quick+Start+to+Rigging+in+Maya+Vol+2+-+DigitalTutors+720p+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ihatethisrecaptcha","files":15,"time":1400898742,"description":"Quick Start to Rigging in Maya: Volume 2\n \nAbout this course:\nWelcome to Volume 2 of the Quick Start to Rigging in Maya, a series of specially constructed courses meant to be followed in sequence and interspersed with valuable exercises to reinforce learned concepts. \n\nIn this volume, we'll build on the concepts covered in volume 1. We'll start by talking about expressions. We'll discuss the important topic of rotation order, and how it can be used to prevent Gimbal Lock issues. We'll learn a cool technique for cleaning up transformation values on constrained objects, and how to set up dynamic parenting systems to make our rigs more flexible. We'll even get into the topic of Blend Shapes, and learn how they can be used for facial animation. \n\nThese courses are designed to be taken in sequence so we really encourage you to start with Volume 1 before continuing with this section. We also encourage you to take advantage of the assignments that follow each volume. These assignments will allow you to take what you've learned and apply those tools and techniques to your own projects.","torrent":{"xt":"urn:btih:366a1539972488090b4e088305085655d198b526","amp;dn":"Quick+Start+to+Rigging+in+Maya+Vol+2+-+DigitalTutors+720p+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"366a1539972488090b4e088305085655d198b526","infoHashBuffer":{"type":"Buffer","data":[54,106,21,57,151,36,136,9,11,78,8,131,5,8,86,85,209,152,181,38]},"announce":[],"urlList":[]}}