{"title":"Papers,Please 1.1.65","uid":14419541,"size":34784269,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3677988134c816ed1ed62d389e5acbe14c224267&amp;dn=Papers%2CPlease+1.1.65&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"goliv","files":1,"time":1461530500,"description":"Papers,Please is a video game created by indie game developer Lucas Pope, developed and published under his pseudonym 3909. It focuses on the emotional toll of working as an immigration officer, deciding whom to let in and whom to exclude from entering the fictional dystopian country of Arstotzka.The game was released on August 8, 2013, for Microsoft Windows and OS X, for Linux on February 12, 2014, and for the iPad on December 12, 2014.A port for the PlayStation Vita was announced in August 2014.\r\n\r\nThe gameplay of Papers, Please focuses on the work life of an immigration inspector at a border checkpoint for the fictitious country of Arstotzka in the year 1982. The player inspects arrivals' documents and uses an array of tools to determine whether the papers are in order for the purpose of keeping undesirable individuals such as terrorists, wanted criminals, or smugglers out of the country. When discrepancies are discovered, the player may interrogate the applicant about the discrepancy, and possibly demand further information, such as fingerprints or a full body scan in order to clear the discrepancy, find proof required to deny the entrant, or find enough incriminating evidence required to arrest the entrant. There are opportunities for the player to have the applicant detained and the applicant may, at times, attempt to bribe the inspector. The player ultimately must stamp the individual's to accept or deny entry unless the entrant is arrested; only at this point is the player told of any mistakes they may have made by way of a printout. Generally the player can make two mistakes without penalty, but subsequent mistakes will cost the player as a monetary demerit from their day's salaries. The player has a limited amount of real time, representing a full day shift at the checkpoint, to process as many arrivals as possible.\r\n\r\nAt the end of each in-game day, the player earns money based on how many people have been processed (5 credits for each individual processed) and bribes collected, less any penalties for mistakes, and then must decide on a simple budget to spend that money on rent, food, heat, and other necessities in low-class housing for themselves and their family. The player must also make certain not to earn too much money, lest they be reported and have all the money they had accumulated thus far confiscated by the government. As relations between Arstotzka and nearby countries deteriorate, sometimes due to terrorist attacks, new sets of rules are gradually added, based on the game's story, such as denying entry to citizens of specific countries or demanding new types of documentation. The player may be challenged with moral dilemmas as the game progresses, such as allowing the supposed spouse of an immigrant through despite lacking complete papers at the risk of accepting a terrorist into the country. The game uses a mix of randomly generated entrants and special encounters. Randomly generated entrants are created using templates.\r\n\r\nA mysterious organization known as EZIC also appears, with several of its members appearing at the checkpoint, giving the inspector orders to help bring down the government and establish a new one; the player can choose whether to help this organization or not, letting their members through to assassinate certain powerful individuals the organization deems too corrupt to live and even personally killing two high-ranking officials for the organization.\r\n\r\nThe game has a scripted story mode with twenty possible endings depending on the player's actions, as well as an unlockable, randomized endless-play mode.\r\n\r\nOther countries in game include Antegria, United Federation, Obristan, Republia, Impor, and Kolechia. Every country has its own collectible token which are obtained by doing a few things. Collecting most of the tokens require doing things that will generate citations.\r\n\r\nFONT:Wikipedia\r\n\r\nPLEASE COMMENT ANY QUESTION AND I WILL TRY ANSEWER OK\r\n\r\nAND THANKS TO DOWNLOAD THIS GAME :^)","torrent":{"xt":"urn:btih:3677988134c816ed1ed62d389e5acbe14c224267","amp;dn":"Papers%2CPlease+1.1.65","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3677988134c816ed1ed62d389e5acbe14c224267","infoHashBuffer":{"type":"Buffer","data":[54,119,152,129,52,200,22,237,30,214,45,56,158,90,203,225,76,34,66,103]},"announce":[],"urlList":[]}}