{"title":"The Confidence Code - Katty Kay &amp; Claire Shipman - Audiobook","uid":10507839,"size":194945411,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3684846256ef01d91cd5374ba5e167ab7cc5e4f5&amp;dn=The+Confidence+Code+-+Katty+Kay+%26amp%3B+Claire+Shipman+-+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1404804598,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\nThe Confidence Code: The Science and Art of Self-Assurance - What Women Should Know\n\nWritten by: Katty Kay, Claire Shipman\nNarrated by: Sandy Rustin\nLength: 6 hrs and 45 mins\nFormat: Unabridged\nRelease Date:04-15-14\nProgram Type: Audiobook\n\nFollowing the success of Lean In and Why Women Should Rule the World, the authors of the best-selling Womenomics provide an informative and practical guide to understanding the importance of confidence - and learning how to achieve it - for women of all ages and at all stages of their career.\n\nWorking women today are better educated and more well-qualified than ever before. Yet men still predominate in the corporate world. In The Confidence Code, Claire Shipman and Katty Kay argue that the key reason is confidence.\n\nCombining cutting-edge research in genetics, gender, behavior, and cognition - with examples from their own lives and those of other successful women in politics, media, and business - Kay and Shipman go beyond admonishing women to &quot;lean in&quot;. Instead, they offer the inspiration and practical advice women need to close the gap and achieve the careers they want and deserve.","torrent":{"xt":"urn:btih:3684846256ef01d91cd5374ba5e167ab7cc5e4f5","amp;dn":"The+Confidence+Code+-+Katty+Kay+%26amp%3B+Claire+Shipman+-+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3684846256ef01d91cd5374ba5e167ab7cc5e4f5","infoHashBuffer":{"type":"Buffer","data":[54,132,132,98,86,239,1,217,28,213,55,75,165,225,103,171,124,197,228,245]},"announce":[],"urlList":[]}}