{"title":"The Jim Henson Hour RESTORED Buster Pointdexter / KD Lang (Muppe","uid":9078619,"size":4812065147,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:36b4236d754e7bce18a717691900df083bed52a1&amp;dn=The+Jim+Henson+Hour+RESTORED+Buster+Pointdexter+%2F+KD+Lang+%28Muppe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":204,"time":1382344328,"description":"The Jim Henson Hour Episode 108\n&quot;Videotape&quot; with Buster Pointdexter\nThe Storyteller: The True Bride\n\nThe Jim Henson Hour Episode 109\n&quot;Garbage&quot; with KD Lang\nThe Storyteller: Sapsorrow\n\n\nBeautifully restored by the acclaimed editor of The Thief and the Cobbler: Recobbled Cut, this is the best copy of these Jim Henson Hour episodes you're likely to see unless they receive some sort of official DVD release. Multiple rare VHS sources were painstakingly cleaned and combined, with DVD and laserdisc sources used where possible.\n\nArguably, The Jim Henson Hour showed the Muppet team at their creative peak, with remarkable live-action fantasy like The Storyteller sharing space with Kermit and the Muppet gang. It was an ideal showcase for what they were capable of. \n\nHowever, when NBC showed the series in 1989 it failed in the ratings and was quickly cancelled, with some episodes going unaired. Although certain Jim Henson projects from this era have made it to DVD, VHS, and VOD [The Storyteller, Song of the Cloud Forest, Miss Piggy's Hollywood], no complete and uncut Jim Henson Hour episode has ever been released on DVD or any other format, with two known exceptions - two very rare KSS laserdiscs of Dog City and Monster Maker, dubbed in Japanese.\n\nThe first half of most episodes featured MuppetTelevision, with Kermit, Gonzo, Fozzie, Miss Piggy and new characters in the high-tech Inner Tube TV control room, with celebrity guests. The second half of most episodes were fantasy specials. Often the series had an environmental message.\n\n----\n\nThe Jim Henson Hour Episode 108\n&quot;Videotape&quot; with Buster Pointdexter\n\nAt MuppetTelevision, the band and Gonzo are prerecorded on videotape. Solid Foam perform &quot;The Music Keeps Rollin' Along.&quot; Buster Pointdexter performs &quot;All Night Party.&quot; Bootsie and Brad have a tea party with Talking Teddy and Sergeant Killer Death Machine. And there's a ghost story with Fozzie Bear.\n\nIn the acclaimed fantasy series The Storyteller, John Hurt tells the tale of The True Bride.\n\n--\n\nThe Jim Henson Hour Episode 109\n&quot;Garbage&quot; with KD Lang\n\nMuppetTelevision is covered in talking garbage, who refuse to leave the station. KD Lang performs &quot;(Waltz Me) Once Again Around That Dance Floor&quot; and the Sesame Street favorite &quot;I Love Trash.&quot; Bootsie and Brad fail to explain how boys and girls are different. Kermit tells the story of how the Nightingale got its voice. The Garbage sings &quot;On the Road Again.&quot;\n\nIn the acclaimed fantasy series The Storyteller, John Hurt tells the tale of Sapsorrow (Alison Doody).\n\n--\n\n\nSpecial Features:\n\n&quot;The Music Keeps Rolling Along&quot; Music Video (Secrets of the Muppets version)\n\nMuppet Babies &quot;I'm Gonna Always Love You&quot; Music Video (The Merv Griffin Show with Jim Henson and Frank Oz)\n\nEpisode Trailers: Dog City, KD Lang, Buster Pointdexter, Ted Danson\n\nRestoration Comparison: No high-quality source was available for the pre-titles scene. See how the restorationist made it watchable.\n\nLion Outtake\n\n&quot;World of Jim Henson&quot; documentary clip (Featuring scenes from The Jim Henson Hour)\n\nKD Lang episode alternate mono audio track\n\n\n\nAlso available: Dog City, Monster Maker, Smokey Robinson, Inner Tube (Pilot)\n\n\n\nIn order to burn this to DVD, delete the DVD-ROM folder.\n","torrent":{"xt":"urn:btih:36b4236d754e7bce18a717691900df083bed52a1","amp;dn":"The+Jim+Henson+Hour+RESTORED+Buster+Pointdexter+%2F+KD+Lang+%28Muppe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36b4236d754e7bce18a717691900df083bed52a1","infoHashBuffer":{"type":"Buffer","data":[54,180,35,109,117,78,123,206,24,167,23,105,25,0,223,8,59,237,82,161]},"announce":[],"urlList":[]}}