{"title":"Are We Alone_Alien Encounters xvid S01&amp;S02- USA SpaceSciTheo","uid":8286040,"size":1467370996,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:375c71a65204d31c50f34f3cf38183195a40fb1d&amp;dn=Are+We+Alone_Alien+Encounters+xvid+S01%26amp%3BS02-+USA+SpaceSciTheo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"psspss","files":5,"time":1363947489,"description":"Are We Alone_Alien Encounters xvid S01&amp;S02- USA SpaceSciTheories Series (2012-2013)\n\nI converted these to smaller xvids and FIXED some of the audio out of sync\nin 3 of the episodes..\nmovie database called 2 specials as Season 1 so I left it that way\ndoesnt matter does it\n\n\nso this is more Talking Heads (theorists) if like these type of shows?\n\n\nInfo---\n\n\nAlien Encounters\nDCL \nScience Channel's ARE WE ALONE? month returns to viewers with a search for answers to bold new questions about mankind's search for extraterrestrial life. Beginning Tuesday, March 5 at 10/9c, Science Channel renews its partnership with the SETI Institute and is once again pushing the boundaries of the unknown. Four all-new, world premiere episodes feature leading scientists on the hunt for alien life forms that lie beyond Earth, examine the probable human response to actual aliens landing on Earth, and divulge fascinating new scientific discoveries about the existence of extraterrestrials.\n&quot;ARE WE ALONE? month was a big hit for Science Channel last March. We invited viewers to join the search for extraterrestrial life, and it's clear that everyone enjoys programming of an alien kind,&quot; said Debbie Adler Myers, executive vice president and general manager, Science Channel. &quot;Especially the way our network approaches it - with a uniquely scientific perspective. This year, Science Channel has four world premieres that use stunning visuals, world-renowned experts and enthralling storytelling that help us to once again own the alien category.&quot;\nLast year in the two-part special ALIEN ENCOUNTERS, distinguished scientists examined how extraterrestrials might communicate with Earth and discussed the ramifications. Now, the aliens have answered humanity's call and after traveling billions of miles they've landed on our planet in all-new, world premiere episodes of ALIEN ENCOUNTERS: THE INVASION on Tuesday, March 5 at 10/9c and ALIEN ENCOUNTERS: THE OFFSPRING on Tuesday, March 12 at 10/9c.\nScience is constantly looking for evidence of life in outer space. In the world premiere of ALIENS: THE DEFINITIVE GUIDE on Tuesday, March 19 at 10/9c and Tuesday, March 26 at 10/9c, viewers trek to stunning, remote locations on Earth and throughout the galaxy to gain a better understanding of what mankind currently knows about life beyond our planet including on Earth-like exoplanets.\nDuring ARE WE ALONE? month Science Channel will also air premiere NASA'S MISSION TO MARS on Tuesday, March 19 at 9/8c. This in-depth special reveals \n\n\n\nHelp to SEED if grabbing!! I cant do it alone","torrent":{"xt":"urn:btih:375c71a65204d31c50f34f3cf38183195a40fb1d","amp;dn":"Are+We+Alone_Alien+Encounters+xvid+S01%26amp%3BS02-+USA+SpaceSciTheo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"375c71a65204d31c50f34f3cf38183195a40fb1d","infoHashBuffer":{"type":"Buffer","data":[55,92,113,166,82,4,211,28,80,243,79,60,243,129,131,25,90,64,251,29]},"announce":[],"urlList":[]}}