{"title":"THE SECRET EVIDENCE-Ufo:s(WTC-SWE)","uid":4437848,"size":1565441918,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3785232ad55fd621fbf7d40a1d3fea144299a3c5&amp;dn=THE+SECRET+EVIDENCE-Ufo%3As%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"WTC-SWE","files":-1,"time":1223656587,"description":"UFO:s\n\n                               THE SECRET EVIDENCE\n                              ---------------------\n\n\n\n\nThis 2 hour television programme set out to solve some of the great UFO mysteries, perhaps even provide a catch-all explanation for the whole field of Ufology.  'UFOs: The Secret Evidence' was written and presented by journalist Nick Cook, who has been an aviation editor and aerospace consultant for the world-renowned trade publication &quot;Jane's Defence Weekly&quot;.  His impeccable credentials might suggest a rather stuffy approach to the subject, but Nick Cook actually brings with him a down-to-earth, common sense approach which is refreshing.  His stance on UFOs seems open-minded and objective.  He also manages to gain interviews with some very intriguing individuals from the aerospace and intelligence fields.\n\nThe programme started by asserting that UFO reports began during the Second World War.  This is an incorrect assertion, unfortunately, ignoring a wealth of historical evidence dating back centuries.  Still, it's probably fair to say that the first official military reports on the subject were generated in the 1940s, and that is the focus of Nick's investigation.  He tackled the phenomenon of the 'Foo Fighters' reported by airmen during WWII and, with John Dering (a senior scientist at SARA), considered the possibility that the Nazis were sending up prototype Unmanned Aerial Vehicles which were &quot;reusable&quot;!  \n\nA bizarre technological artefact known as 'the Fly Trap' was visited, and the theory that it was a test-rig for Nazi flying saucers was discussed.  This was in the context of a secret Nazi underground base where derro-like scientists played with glowing bell-shaped devices which seemed to defy gravity.  This was research which led to the death of several scientists, allegedly......etc..\n\n\n\n\n\n\nFile Size: 1,45 GB\nFormat: AVI\nLength: 01:40:53\nVideo Codec: XviD MPEG-4\nVIdeo Bitrate: 2020 kbit/s\nAudio Bitrate: 192 kbit/s\nAudio Codec:MPEG Layer -3 (AC3)\nSubtitles: (N/A) \n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0907285/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0907285/&lt;/a&gt;\n\n\n\nENJOY:\n\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n(Please seed so others can enjoy)","torrent":{"xt":"urn:btih:3785232ad55fd621fbf7d40a1d3fea144299a3c5","amp;dn":"THE+SECRET+EVIDENCE-Ufo%3As%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3785232ad55fd621fbf7d40a1d3fea144299a3c5","infoHashBuffer":{"type":"Buffer","data":[55,133,35,42,213,95,214,33,251,247,212,10,29,63,234,20,66,153,163,197]},"announce":[],"urlList":[]}}