{"title":"Uncertainty in the Electric Power Industry by  Christoph Weber.p","uid":11019598,"size":14535909,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37b212141bc89ccc523cd2ec32a3941d3e8123dc&amp;dn=Uncertainty+in+the+Electric+Power+Industry+by++Christoph+Weber.p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"thilanga123","files":1,"time":1410547642,"description":"Uncertainty in the Electric Power Industry: Methods and Models for Decision Support\n\nby Christoph Weber\n\n\n\nProduct Details\nTitle: Uncertainty in the electric power industry\nISBN: 9780387230481\nPublisher: Springer Science &amp; Business Media\nOn date: Jan 6, 2006 - Business &amp; Economics -\nPages: 317 pages\n\nReview\nAround the world, liberalization and privatization in the electricity industry have lead to increased competition among utilities. At the same time, utilities are now exposed more than ever to risk and uncertainties, which they cannot pass on to their customers through price increases as in a regulated environment. Especially electricity-generating companies have to face volatile wholesale prices, fuel price uncertainty, limited long-term hedging possibilities and huge, to a large extent, sunk investments. In this context, Uncertainty in the Electric Power Industry: Methods and Models for Decision Support aims at an integrative view on the decision problems that power companies have to tackle. It systematically examines the uncertainties power companies are facing and develops models to describe them - including an innovative approach combining fundamental and finance models for price modeling. The optimization of generation and trading portfolios under uncertainty is discussed with particular focus on CHP and is linked to risk management. Here the concept of integral earnings at risk is developed to provide a theoretically sound combination of value at risk and profit at risk approaches, adapted to real market structures and market liquidity. Also methods for supporting long-term investment decisions are presented: technology assessment based on experience curves and operation simulation for fuel cells and a real options approach with endogenous electricity prices.","torrent":{"xt":"urn:btih:37b212141bc89ccc523cd2ec32a3941d3e8123dc","amp;dn":"Uncertainty+in+the+Electric+Power+Industry+by++Christoph+Weber.p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37b212141bc89ccc523cd2ec32a3941d3e8123dc","infoHashBuffer":{"type":"Buffer","data":[55,178,18,20,27,200,156,204,82,60,210,236,50,163,148,29,62,129,35,220]},"announce":[],"urlList":[]}}