{"title":"Cassandra Cain Remix EvilBatgirl to BlackBat 2006.05-2011.10 v2","uid":9648738,"size":229791078,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:38f631e8ac9272ff910be92923a2a603956b8288&amp;dn=Cassandra+Cain+Remix+EvilBatgirl+to+BlackBat+2006.05-2011.10+v2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bsg4you","files":-1,"time":1393041956,"description":"Cassandra Cain Remix - Evil Batgirl to Black Bat - 2006.05-2011.10 Version2\n10x English cbr files 229770051bytes - 4x FANEDIT compilations, 6x HQ Batgirl Vol2\n\nNOTE: if you have already downloaded the first release of Cassandra.Cain.Remix-EvilBatgirl.to.BlackBat-2006.05-2011.10, you only need to download the 6 new HQ versions of Batgirl VOlume2. See the version2 UPDATE comment below.\n\nThis is an ordered collection of 10 cbr comics that cover the amazing Cassandra Cain, aka Batgirl, aka Black Bat, from after her own series ended with Batgirl v1-73 2006-04 until her final DC Comics appearance in Batman Gates of Gotham 05 2011-10. Despite her own series having decent sales figures, DC decided to end it and bring Cassandra back as a villain after the One Year Later event in Robin v2-148 2006-05. This was probably the most controversial (even hated) change that DC made with One Year Later. Cassandra was (and is) very popular; she was voted Favorite Heroine 4 years in a row in the Annual Wizard Fan Awards from 1999-2002. Cass fans were shocked not only at her evil turn but also her diminished fighting skills and her new, super articulate speaking ability. DC Comics got the message from the fan uprising in forums and Cassandra web sites (including the fantastic Casstoons) and in Teen Titans 43-46 in 2007 they started to back out Cassandra's evil nature. With Batman and the Outsiders 01-09 in 2008, Cassandra was on her way back to the good side. Then Cass had a 6 issue mini-series in 2008-2009 that settled Slade and her father's bad influence on her and solidified her position in the Bat Family. She goes on to try to re-form and lead the Outsiders after Batman's seeming death. Finally, Cassandra shed's (literally) the Batgirl mantle and fights crime in Tokyo and then back in Gotham as the Black Bat. Cassandra Cain fans can only hope that DC Comics will bring her back in a good way but there's been no indication of her reappearance yet.\n\nThis collection consists of 4 FANEDITS and the 6 issues of Batgirl volume2 2008-2009 put in chronological order based on the events and not publication. There are a few Cassandra appearances that are not included but all of these are just cameo stand ins, e.g. she appears with a crowd of others in a single panel with no lines and no special impact on the story. Examples of this are Black Canary volume3-02 and Countdown 48, 35, 05 and Gotham Underground 07, 09 and Batgirl v3-24.\n\nNotes:\n- The stories and fights in the fanedits were condensed to just focus on Cassandra, e.g. in the Teen Titans. Also, parts of stories are omitted if they don't include Cassandra, e.g. Salah getting killed and Thunder being seriously injured in Batman and the Outsiders plus all of the Gates of Gotham flashbacks.\n- Pages were ordered by when they happened, not when they were published or listed within an issue. This changed the ordering of World War III and Batman and the Outsiders 12 and 14.\n- Most text boxes that carry over from or to deleted pages have been edited out but a few were left in the 4 fanedits.\n\nCassandra Cain Remix, 10 comics:\n\nCassandraCainRemix01.EvilBatgirl.2006-05.to.2007-07.FANEDIT 39735691b\n76pages: custom cover and 26 custom pages (using GIMP), Select pages-panels from:\nWorldWarIII01-02 Robin148-151 Supergirl13-14 TeenTitans43-46 Robin 161-162\nplus 5 covers including Cassandra in the back\n\nCassandraCainRemix02.BatgirlAndTheOutsiders1.2008-01.to.2008-09.FANEDIT 23230192b\n36pages: 17 custom pages (using GIMP), Select pages-panels from:\nBatmanAndTheOutsiders02-09\nplus 4 covers including Cassandra in the back\n\nCassandraCainRemix03.Batgirl.volume2.v2 HQ, no ads, no letters, no DC page, no tags\nCassandraCainRemix03.Batgirl.volume2-01.2008-09.noads.v2 14,684,689b 22pages\nCassandraCainRemix04.Batgirl.volume2-02.2008-10.noads.v2 15,673,888b 23pages\nCassandraCainRemix05.Batgirl.volume2-03.2008-11.noads.v2 20,968,978b 22pages\nCassandraCainRemix06.Batgirl.volume2-04.2008-12.noads.v2 20,566,354b 22pages\nCassandraCainRemix07.Batgirl.volume2-05.2009-01.noads.v2 10,482,220b 23pages\nCassandraCainRemix08.Batgirl.volume2-06.2009-02.noads.v2 16,994,304b 22pages\n\nCassandraCainRemix09.BatgirlAndTheOutsiders2.2008-10.to.2009-02.FANEDIT 29291728b\n48pages: 15 custom pages (using GIMP), Select pages-panels from:\nBatmanAndTheOutsiders02-09\nplus 4 covers including Cassandra in the back\n\nCassandraCainRemix10.BatgirlToBlackBat.2009-07.to.2011-10.FANEDIT 38143640b\n70pages: custom cover and 25 custom pages (using GIMP), Select pages-panels from:\nBatmanTheNetwork BatgirlV3-01,06 RedRobin-17,25 BatmanInc06 GatesOfGotham01-05\nplus 3 covers including Cassandra in the back\n\nVersion2 UPDATE: The Cassandra Cain Remix has been updated with a Higher Quality version of the 6 issues of Batgirl Volume2. The new version2 scans have much less noise, little or no hatching and appear to have truer color than version1. The 6 issues are over 30% larger in size:\nv1 72.6MB 76,174,589bytes\nv2 94.8MB 99,368,800bytes\n\nThe FANEDITS in the CassandraCainRemix are the same as in v1, the following are untouched:\nCassandraCainRemix01.EvilBatgirl.2006-05.to.2007-07.FANEDIT\nCassandraCainRemix02.BatgirlAndTheOutsiders1.2008-01.to.2008-09.FANEDIT.cbr\nCassandraCainRemix09.BatgirlAndTheOutsiders2.2008-10.to.2009-02.FANEDIT.cbr\nCassandraCainRemix10.BatgirlToBlackBat.2009-07.to.2011-10.FANEDIT.cbr\n\nPlease check out other fanedits, webisodes, trailers, commentaries and podcasts from DC Comics, Battlestar Galactica, Star Trek Enterprise and more at:\n &lt;a href=&quot; https://thepiratebay.se/user/bsg4you/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/bsg4you/&lt;/a&gt;\nand leave any corrections, criticism, comments and requests.\n\nThanks, bsg4you","torrent":{"xt":"urn:btih:38f631e8ac9272ff910be92923a2a603956b8288","amp;dn":"Cassandra+Cain+Remix+EvilBatgirl+to+BlackBat+2006.05-2011.10+v2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38f631e8ac9272ff910be92923a2a603956b8288","infoHashBuffer":{"type":"Buffer","data":[56,246,49,232,172,146,114,255,145,11,233,41,35,162,166,3,149,107,130,136]},"announce":[],"urlList":[]}}