{"title":"Panzertruppen: The Complete Guide to the Creation &amp; Combat E","uid":9058382,"size":130010768,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3968bdd535ee07712e025aaff33ac8ad220830af&amp;dn=Panzertruppen%3A+The+Complete+Guide+to+the+Creation+%26amp%3B+Combat+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1381999722,"description":"Panzertruppen: The Complete Guide to the Creation &amp; Combat Employment of Germanys Tank Force 1933-1942 (Schiffer military history) (v. 1)\nby Thomas L. Jentz\n\nDESCRIPTION:\nIn September of 1939, the world was astounded by Germany's ability to defeat Poland in less than a month. With the world still puzzled by the suddenness of this event, Denmark, Norway, Holland, Belgium, and France fell in rapid succession to the German onslaught, leaving Britain in shock. Greece and Yugoslavia were rapidly over-run during April of 1941, while German-Italian forces advanced rapidly in North Africa. Russia's turn was next, when German forces began pulverizing their forces in June of 1941. How had Germany achieved victory after victory, often against numerically superior enemy forces? The answer came in two words-Panzer and Blitzkrieg. When and how had Germany built its Panzer forces and trained them for the Blitzkrieg? When was each Panzer unit formed? What was their organization? Why were Panzer units disbursed among the Panzer-Divisions. leichte Divisions, and Armee-Korps? When were the various types of Panzers developed? What were their armament, armor protection, capability? How many of each type were produced? What tactics did they use? How successful were they in combat? This is the only book that provides detailed answers to these and other questions related to how German tankers fought in World War II. Tom Jentz found the answers to these questions bu digging through original records for the past tweny-five years. The content os this book is derived solely from these original records consisting of war diaries, reports, and technical and tactical manuals written during the war. The story is told as recorded by those responsible for decisions in developing the Panzertruppen and by those who fought in the Panzers. As work on this book progressed it became apparentthat the story of the Panzertruppen was divided into two distinctly separate phases; offensive and defensive. This first volume presents the offensive phase up to October 1942. A second volume is planned that will cover the defensive phase to the end of the war. Tom Jentz is also the author of Germany's Panther Tank: The Quest of Combat Supremacy(available from Schiffer Publishing Ltd.)\n\nAmzon.com title link: &lt;a href=&quot;\nhttp://www.amazon.com/Panzertruppen-Complete-Creation-Employment-1933-1942/dp/0887409156&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Panzertruppen-Complete-Creation-Employment-1933-1942/dp/0887409156&lt;/a&gt;\n\nPanzertruppen 2: The Complete Guide to the Creation &amp; Combat Employment of Germany's Tank Force 1943-1945\nby Thomas L. Jentz\n\nDESCRIPTION:This companion volume presents how the Panzertruppen fought during their defensive struggle with details on the units, organizations, types of Panzers, and tactics.\n\nAmzon.com title link:\n\n","torrent":{"xt":"urn:btih:3968bdd535ee07712e025aaff33ac8ad220830af","amp;dn":"Panzertruppen%3A+The+Complete+Guide+to+the+Creation+%26amp%3B+Combat+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3968bdd535ee07712e025aaff33ac8ad220830af","infoHashBuffer":{"type":"Buffer","data":[57,104,189,213,53,238,7,113,46,2,90,175,243,58,200,173,34,8,48,175]},"announce":[],"urlList":[]}}