{"title":"Rawlicious at Home-Angus Crawford &amp; Chelsea Clark.epub","uid":11584090,"size":17876429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a3eafbe615c9b77d55c658942c888caee5cab11&amp;dn=Rawlicious+at+Home-Angus+Crawford+%26amp%3B+Chelsea+Clark.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eternalpb","files":-1,"time":1417152967,"description":"ISBN: 0449016188 | 2014 | EPUB | \n208 pages | \n17 MB\n\nFrom the owners of the Rawlicious raw food restaurants, comes an inspiring, easy-to-follow cookbook. Learn about the numerous benefits of raw food and how to make healthy, simple and delicious raw meals at home. \n     Clear away any preconceptions you have about raw food. Rawlicious is the perfect primer for anyone who is considering increasing their raw food intake--from contemplators to full-out converts. And who better to write an informative, fuss-free raw food cookbook than Angus Crawford and Chelsea Clark, owners and founders of the popular Rawlicious raw food restaurants? With five successful locations in Canada and now one in NYC, they're proving that going raw doesn't mean sacrificing the flavor or the fun of food. \n   Rawlicious is a beautifully photographed cookbook and an appealing introduction to raw food, including recipes, straightforward advice and a 5-day diet challenge. Crawford and Clark offer up over 100 raw recipes--that are also vegan and gluten free--straight from the Rawlicious kitchens in full colour, with step-by-step instructions. Indulge in Smoothies, Nori Rolls, Lasagna, Pad Thai, Coffee Cheesecake and even a little Mint Chocolate Chip Ice Cream. The Rawlicious philosophy is simple: you don't have to be 100% raw, because a little goes a long way.\n\nANGUS CRAWFORD and CHELSEA CLARK are the co-owners of six Rawlicious restaurants.  The two hardworking entrepreneurs are firmly dedicated to serving their guests only what can truly be described as 'real food'. You won't find any additives or preservatives here, only an abundance of healthy, creative and vibrant dishes","torrent":{"xt":"urn:btih:3a3eafbe615c9b77d55c658942c888caee5cab11","amp;dn":"Rawlicious+at+Home-Angus+Crawford+%26amp%3B+Chelsea+Clark.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a3eafbe615c9b77d55c658942c888caee5cab11","infoHashBuffer":{"type":"Buffer","data":[58,62,175,190,97,92,155,119,213,92,101,137,66,200,136,202,238,92,171,17]},"announce":[],"urlList":[]}}