{"title":"Genesis (Complete) (No ads)","uid":7826525,"size":249624887,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3a4f18359fdec6297c5b6b0582799290646fb5a3&amp;dn=Genesis+%28Complete%29+%28No+ads%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SplhcbPrime","files":-1,"time":1352941225,"description":"Genesis was a comic book crossover storyline that ran through a self-titled, four-issue, weekly mini-series, and was published by DC Comics in August, 1997. The series was written by John Byrne and drawn by Ron Wagner and Joe Rubinstein. The series was critically panned for the lack of long-term effects on continuity and retroactively changing the nature of the powers of various superheroes by suggesting that all superpowers were actually manifestations of The Source, in the form of a Grand Unified Theory.\n\nThe storyline centers on The New Gods of New Genesis and their enemy, Darkseid, and involves all of DC's super-powered characters. The storyline introduced the concept of the Godwave, an interstellar phenomenon that, on its first pass, created gods on various planets through the universe, such as the Greek, Egyptian, and Norse pantheons on Earth. The Godwave then reached the edge of the universe and bounced back, creating superhumans on its second pass.\n\nThe series focused on how the wave threatens reality when it rebounds back to its starting point on its third pass. Darkseid attempts to seize the power of the Godwave, which disrupts the abilities of various superheroes, either neutralizing them or drastically altering them. The wave also had the after-effect of making humans feel like something was missing. Some simply think it's a case of the blues, while others despair so badly they commit suicide.\n\nThe heroes of Earth and The New Gods of New Genesis battle to prevent Darkseid from accomplishing his nefarious plans. Darkseid's forces again stage an invasion of Earth before travelling to the Source Wall to confront the heroes.\n\nThis torrent was created to honor a request.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and authors/artists/publishers,) please.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:3a4f18359fdec6297c5b6b0582799290646fb5a3","amp;dn":"Genesis+%28Complete%29+%28No+ads%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a4f18359fdec6297c5b6b0582799290646fb5a3","infoHashBuffer":{"type":"Buffer","data":[58,79,24,53,159,222,198,41,124,91,107,5,130,121,146,144,100,111,181,163]},"announce":[],"urlList":[]}}