{"title":"La compagnia dell'anello - The Fellowship of the Ring - Extende","uid":6618432,"size":13373713373,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:3b17e407c770c293c60dca6abee0dedbd7833c2a&amp;dn=La+compagnia+dell%5C%27anello+-+The+Fellowship+of+the+Ring+-+Extende&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":7,"uploader":"proximun","files":1,"time":1313884499,"description":"Scheda film\n\nTitolo originale - Original title: The Lord of the Rings: The Fellowship of the Ring\nNazionalitÃƒÂ  - Country: New Zealand - USA\nAnno - Year: 2001                                    \nGenere - Gender: Action - Adventure - Drama\nRegia - Director: Peter Jackson\nSoggetto - Writer: J.R.R. Tolkien, Fran Walsh\nSceneggiatura - Screenplay: Fran Walsh\nEffetti speciali - Special Effects:  Gudrun Abbott, Michael Abott, Gino Acevedo, Karen Adcock, Greg Allison, Erica Anderson, Matt Appleton, Michael J. Asquith, Rebecca Asquith, Keith Barclay\nEffetti visivi - Visual Effects: Holly Acton, Richard Addison-Wood, Matt Aitken, Greg Allen, Jon Allitt, Colin Alway, John B. Anderson, Tony Anderson, Malcolm Angell, Bernd Angerer, Elisabeth Arko\nProduzione - Production: Peter Jackson, Barrie M. Osborne, Tim Sanders, Fran Walsh\nProduttore esecutivo - Executive producer: Michael Lynne, Mark Ordesky, Robert Shaye, Bob Weinstein, Harvey Weinstein\nCooproduttore - co-producer: Rick Porras, Jamie Selkirk\nGestione produzione - Production Management: Bridget Bourke, Rosemary Dority, Carla Fry, Carol Kim, Nikolas Korda, Zane Weiner, Jonas Thaler\nMusiche - Music: Howard Shore\nData di uscita - Release date: 18 January 2002 (Italy)\nLingua originale - Lenguage: English, Sindarin\nEditoriale - Editorial Department: Cindy Bowles, Billy A. Campbell, Jack Deutchman, Bob Doyle, Mark Hawthorne, Zane Holmes, Brent Kaviar, Jody Levin, Shanon Moratti, Jon Newell, Jabez Olssen, Jo Priest\nFotografia - Cinematography: Andrew Lesnie\nMontaggio - Film Editing: John Gilbert\nScenografia - Production Design: Grant Major\nDipartimento artistico - Art department: Tim Abbot, Daniel Aird, Christopher Aitken, Jacqui Allen, Ruben Allen, Judy Alley, Tristan 'Stan' Alley, Karl Anton, Andrew Baguley, Michael Baker, Ben Beemsterboer\nCostumi - Costumes: Ngila Dickson, Richard Taylor\nTrucco - Make up: Margaret Aston, Margaret Aston, Rick Findlater, Marjory Hamlin, Nancy Hennah, Mark Kinaston-Smith, Peter King, Bronwyn Knott, Davina Lamont, Vivienne MacGillicuddy, Angela Mooar\nDurata - During: 178 min original version, 228 min this version\nArt director: Joe Bleakley, Dan Hennah, Philip Ivey, Rob Outterside, Mark Robins\nCasting: Victoria Burrows, Amy Hubbard, Liz Mullane, Ann Robinson\nStunts: Sala Baker, Jeff Barber, Daniel W. Barringer, Trevor Bau, Brett Beattie, Alice Capper-Starr, Justin B. Carter, Praphaphorn 'Fon' Chansantor, Rodney Cook, Augie Davis, Mana Hira Davis, Branko Dordevich\nCast: Alan Howard, Elijah Wood, Noel Appleby, Sean Astin, Sala Baker, Sean Bean, Cate Blanchett, Orlando Bloom, Billy Boyd, Marton Csokas, Megan Edwards, Michael Elsworth, Mark Ferguson, Ian Holm, Christopher Lee, Lawrence Makoare, Andy Serkis, Brent McIntyre, Ian McKellen, Peter McKenzie, Sarah McLeod, Dominic Monaghan, Viggo Mortensen, Ian Mune, Craig Parker, Cameron Rhodes, John Rhys-Davies, Martyn Sanderson, Harry Sinclair, Liv Tyler, David Weatherley, Hugo Weaving, Victoria Beynon-Cole, Lee Hartley, Sam La Hood, Chris Streeter, Philip Grieve, Jonathan Jordan, Semi Kuresa, Clinton Ulyatt, Paul Bryson, Lance Fabian Kemp, Jono Manks, Ben Price, Billy Jackson, Katie Jackson\nRest of Cast: Peter Corrigan, Lori Dungey, Norman Forsey, Bill Johnson, Elizabeth Moody, Brian Sergent, Timothy Bartlett, Jarl Benzon, JÃƒÂ¸rn Benzon, Rachel Clentworth, Sabine Crossen, Taea Hartwell, Peter Jackson, Alan Lee, Thomas McGinty, Bret McKenzie, Kate O'Rourke, Shane Rangi\n\nTrama\n\nIl film pur ispirandosi all'opera di Tolkien, in realtÃƒÂ  si prende come ogni adattamento alcune licenze, cercando comunque di rispettare lo spirito dell'autore.\nA differenza del romanzo nel prologo del film si narra della seconda era, in cui sono stati forgiati gli anelli, spiegando come Bilbo sia infine entrato in possesso dell'Unico Anello.\nLa prima parte del prologo, tratta dall'ultimo racconto de Il Silmarillion, narra dei diciannove anelli che Sauron Signore di Mordor ha donato alle razze della Terra di Mezzo: sette anelli sono stati dati ai nani, tre agli elfi e nove ai re degli uomini; tutti questi, perÃƒÂ², sono stati ingannati dall'oscuro signore, il quale ne forgiÃƒÂ² uno, l'Unico Anello, con lo scopo di dominare tutti gli altri.\nNella battaglia contro Sauron, Isildur taglia a Sauron il dito al quale ÃƒÂ¨ infilato l'Unico Anello, ottenendo cosÃƒÂ¬ un'insperata vittoria. Impossessatosi dell'Anello, si lascia perÃƒÂ² irretire dal malvagio potere in esso contenuto e non ascolta il consiglio di Elrond, che gli dice di gettarlo nella bocca del vulcano su Monte Fato per sconfiggere definitivamente il nemico.\nQuesta scelta gli costerÃƒÂ  la vita e porterÃƒÂ  alla rovina la razza degli uomini, mentre vengono cosÃƒÂ¬ perse le tracce dell'Anello, che viene in seguito ritrovato da Gollum. Anche l'infelice essere viene irretito dal malvagio potere di Sauron, ed infine inspiegabilmente smarrisce l'Anello, forse per volontÃƒÂ  dell'oggetto stesso, che viene poi ritrovato da Bilbo Baggins.\nLa storia comincia con i preparativi per il compleanno di Bilbo, impegnato nella stesura della sua autobiografia: Andata e ritorno. Nel frattempo si avvicina al villaggio di Hobbiville lo stregone Gandalf il Grigio, anch'egli invitato ai festeggiamenti.\nDurante la festa Bilbo indossa davanti a tutti gli ospiti l'anello e scompare, con l'intenzione di andare a Gran Burrone e non farsi ritrovare mai piÃƒÂ¹. Prima della partenza perÃƒÂ² ÃƒÂ¨ affrontato da Gandalf, che lo spinge a lasciare l'Anello al nipote Frodo.\nDopo qualche tempo Gandalf torna ad Hobbiville e studia l'anello, scoprendo la sua origine. La natura dell'anello ÃƒÂ¨ confermata indiscutibilmente quando gettandolo nel fuoco al suo interno compare l'incisione con il testo:\nÃ‚Â« Un anello per domarli, un anello per trovarli, un anello per ghermirli e nel buio incatenarli. Ã‚Â»\nGandalf riferisce a Frodo che Sauron ÃƒÂ¨ risorto spiritualmente per tornare in cerca dell'anello, per questo motivo ha inviato i Cavalieri Neri (Nazgul) a Hobbiville. Frodo, su suggerimento di Gandalf, decide di partire per Brea per non far trovare l'anello al nemico. Con lui parte anche Sam, il suo giardiniere, mentre Gandalf si dirige alla torre di Orthanc (ad Isengard), per parlare con Saruman, capo dell'Ordine degli Stregoni, in cerca di consigli.\nSaruman ha visto quanto sta accadendo tramite il Palantir, la pietra veggente, e ha deciso di schierarsi dalla parte dell'Oscuro Signore. Ignaro di ciÃƒÂ² Gandalf si reca da lui per informarlo degli eventi, ma Saruman cerca di indurlo ad allearsi a lui. Nasce uno scontro da cui Gandalf esce sconfitto ed ÃƒÂ¨ imprigionato nella torre di Orthanc.\nSaruman crea un esercito di orchi al servizio di Sauron, nel frattempo Gandalf scappa grazie all'aiuto di Gwahir, una delle Grandi Aquile.\nDurante il viaggio i due Hobbit (Frodo e Sam) incontrano due loro congiunti, Merry e Pipino, che si uniscono al loro viaggio; purtroppo sono intercettati ed inseguiti dai Cavalieri Neri, ma riescono comunque a raggiungere la locanda del Puledro impennato a Brea, e lÃƒÂ¬ attendono, invano, l'arrivo di Gandalf. Nella locanda incontrano il ramingo Grampasso.\nFrodo per sbaglio indossa l'Anello per la prima volta, diventando invisibile: tutto quello che lo circonda assume un aspetto distorto, circondato da una mistica nebbia. I Cavalieri Neri, attirati dalla forza magica dell'Anello, cercano di ucciderlo, ma il piccolo Hobbit ÃƒÂ¨ salvato dall'intervento di Grampasso.\nIl ramingo allora si unisce agli Hobbit per accompagnarli a Gran Burrone da Elrond; durante il viaggio sono raggiunti dai Nazgul che feriscono Frodo con un pugnale di Morgul, e solo l'intervento di Grampasso, che li respinge con il fuoco, evita conseguenze ancor piÃƒÂ¹ gravi. Ad aiutare Frodo, che sta male dopo la pugnalata ricevuta, arriva Arwen, figlia di Elrond, che con il suo cavallo lo conduce a Gran Burrone proteggendolo dai Nazgul: qui Elrond lo cura e qui Frodo, al suo risveglio, incontra Gandalf, i suoi amici Hobbit, e suo zio Bilbo (molto invecchiato da quando ha lasciato l'Anello).\nIl Consiglio di Elrond si riunisce a Gran Burrone, con rappresentanti di tutte le razze, tra cui Gimli per i nani, Legolas per gli elfi, e Boromir per gli uomini. Prima che si tenga il Consiglio Arwen annuncia di voler rinunciare alla sua immortalitÃƒÂ  per vivere da mortale con Grampasso che cerca invano di dissuaderla. Il consiglio decide, con un certo dispiacere di Boromir, di distruggere l'anello portandolo a Mordor e gettandolo nel Monte Fato, dove ÃƒÂ¨ stato forgiato.\nFrodo si offre volontario per compiere la missione ed a lui si uniscono Gandalf, Grampasso (che nel frattempo si ÃƒÂ¨ rivelato come Aragorn, erede di Isildur e del trono di Gondor), Legolas, Gimli, Boromir, Sam, Pipino e Merry: ÃƒÂ¨ questa la compagine che prenderÃƒÂ  il nome di &quot;Compagnia dell'Anello&quot;. Bilbo regala a Frodo due oggetti magici, che lo aiuteranno nel corso del suo viaggio: Pungolo, una spada incantata la cui lama s'illumina non appena ci sono orchi nelle vicinanze ed una corazza fatta di Mithril, un metallo dei nani caratterizzato da straordinaria leggerezza e grande resistenza. La strada scelta per arrivare alla meta ÃƒÂ¨ inizialmente la Breccia di Rohan, da cui la Compagnia devierÃƒÂ  poi per il passo di Caradhras. Alla fine gli ostacoli posti da Saruman costringeranno il gruppo a passare per le miniere di Moria, regno di Balin, cugino di Gimli.\n\nPlot\n\nIn the Second Age of Middle-earth, the One Ring is forged by the Dark Lord Sauron in order to conquer the lands of Middle-earth. A Last Alliance of Elves and Men is formed to counter Sauron and during a battle on the foot of Mount Doom, Prince Isildur, son of King Elendil, who is slain by Sauron in the battle, picks up his father's broken sword and slashes at Sauron's hand, separating him from the Ring and vanquishing his army. However, due to Sauron's &quot;life force&quot; being bound to the Ring, the Dark Lord is not completely defeated unless the Ring itself is destroyed, but Isildur, corrupted by the Ring's power, refuses to do so. Sometime later, Isildur is ambushed and killed by Orcs and the Ring is lost in a river. Thousands of years later, the Ring is claimed by the creature Gollum causing him to obsess over it. Finally, the Ring abandons Gollum and is found by Bilbo Baggins, a hobbit from the Shire.\nSixty years later, following his 111th birthday party, Bilbo leaves the Ring to his nephew, Frodo Baggins. Meanwhile, the wizard Gandalf the Grey rides to Minas Tirith to search for answers regarding Bilbo's magic ring only to learn that it is, in fact, Sauron's One Ring. Gandalf returns to Bag End and tells Frodo to leave the Shire immediately with the Ring. Gandalf catches Samwise Gamgee eavesdropping by a window and decides to send him along with Frodo. Gandalf rides to Isengard to meet with Saruman the White who reveals to Gandalf that the NazgÃƒÂ»l, or Ringwraiths, have left Minas Morgul to capture the Ring and kill whoever carries it. Gandalf attempts to flee to warn Frodo, but Saruman, having already been corrupted to Sauron's cause, imprisons Gandalf atop his tower Orthanc. Gandalf is then forced to watch as Saruman, following Sauron's orders, commands the Orcs of Isengard to construct weapons of war and produce a new breed of Orc fighters called the Uruk-Hai.\nWhile traveling to Bree, Frodo and Sam are soon joined by fellow hobbits, Merry and Pippin. After encountering a Ringwraith on the road, they manage to reach Bree only to discover that Gandalf hasn't arrived. Instead, Frodo meets a man called &quot;Strider&quot;, a friend of Gandalf who agrees to lead them to Rivendell. They continue travelling and spend the night on the hill of Weathertop, where they are attacked by the NazgÃƒÂ»l. Strider fights off the Ringwraiths, but Frodo is grievously wounded with a morgul blade which will cause him to turn into a wraith if not attended to with the proper care. While chased by the NazgÃƒÂ»l, Frodo is taken by the Elf Arwen to the Elven haven of Rivendell, and healed by her father, Elrond (the leader of the Elves at the battle of Mount Doom 3,000 years before). Arwen also uses her magic to cut off the pursuing Ringwraiths at the Ford of Bruinen, summoning a surge of water that sweeps the Ringwraiths away.\nIn Rivendell, Frodo finds Gandalf, who explains why he didn't meet them at Bree and that he had escaped Orthanc and Saruman's clutches with the help of an eagle. Later, Elrond calls a council to decide what should be done with the Ring. Elrond warns against keeping the Ring in Rivendell for long, knowing that the Elven realm could come under attack from both Mordor and Isengard. The Ring can only be destroyed by throwing it into the fires of Mount Doom, where it was forged. Frodo volunteers to take the Ring to Mount Doom and is accompanied by his hobbit friends and Gandalf, as well as Strider, who is revealed to be Aragorn, the rightful heir to the throne of Gondor. Also travelling with them are the Elf Legolas, the Dwarf Gimli and Boromir, the son of the Steward of Gondor. Together they comprise the Fellowship of the Ring.\nThe Fellowship set out and try to pass the mountain Caradhras, but they are stopped by Saruman's wizardry. At Gimli's insistence, they decide to seek safety and travel under the mountain through The Mines of Moria. Frodo agrees, but while traveling through the mines, they are attacked by Goblins and a Cave Troll, and encounter a Balrog, an ancient demon of fire and shadow, at the Bridge of Khazad-dÃƒÂ»m. Gandalf confronts the Balrog on the bridge, allowing the others to escape the subterranean realm, but the monster drags him into the abyss below. The group flees to the Elven realm of LothlÃƒÂ³rien, where they are sheltered by its rulers, Galadriel and her husband Celeborn. That night, Frodo meets Galadriel, who tells him that it is his destiny to handle the Ring and ultimately destroy it. Before they leave, Galadriel gives Frodo the Phial of Galadriel, and the other members also receive gifts from them. Taking the straight path to Mordor, they travel on the River Anduin towards Parth Galen.\nAfter landing at Parth Galen, Boromir tries to take the Ring from Frodo, believing that it is the only way to save his realm. Frodo manages to escape by putting the Ring on his finger and vanishing. Aragorn encounters Frodo, but unlike Boromir, Aragorn chooses not to take the Ring. Knowing that the Ring's temptation will be too strong for the Fellowship, Frodo decides to leave them and go to Mordor alone. Meanwhile, the rest of the Fellowship are attacked by Uruk-hai, who Saruman had ordered to hunt down the Fellowship and take back the Ring. Merry and Pippin, realizing that Frodo is leaving, distract the orcs allowing Frodo to escape. Boromir rushes to the aid of the two hobbits, but is mortally wounded by the orc commander Lurtz. Before Lurtz can finish Boromir, Aragorn arrives and decapitates Lurtz after a swordfight. Boromir regrets having attempted to steal the Ring, but is forgiven by Aragorn before he dies. Merry and Pippin are captured, prompting Aragorn, Gimli and Legolas to begin their pursuit of the orcs with the intent of rescuing the hobbits, leaving Frodo to his fate. Frodo returns to the banks of the river and begins rowing across when Sam appears and swims out after Frodo, insisting to keep his promise to Gandalf to look after Frodo. Frodo accepts Sam's presence as together they continue their journey through the hills of Emyn Muil.\n\nScheda tecnica - Data Sheet\n\nGenerale\n\nNome completo                    : La compagnia dell'anello.mkv\nFormato                          : Matroska\nDimensione                       : 12,5 GiB\nDurata                           : 3h 48min\nBitRate totale                   : 7 811 Kbps\nData di codifica                 : UTC 2011-07-01 15:25:44\nCreato con                       : mkvmerge v4.8.0 ('I Got The...'wink.gif built on May 24 2011 03:12:58\nCompressore                      : libebml v1.2.0 + libmatroska v1.1.0\n\nVideo\nID                               : 1\nFormato                          : AVC\nFormato/Informazioni             : Advanced Video Codec\nProfilo del formato              : &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;440c2d232c0408706a75&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nImpostazioni del formato, CABAC  : Si\nImpostazioni del formato, ReFram : 4 fotogrammi\nCodec ID                         : V_MPEG4/ISO/AVC\nDurata                           : 3h 48min\nBitRate nominale                 : 5 818 Kbps\nLarghezza                        : 1 920 pixel\nAltezza                          : 800 pixel\nAspectRatio                      : 2,40:1\nFrameRate                        : 23,976 fps\nColorSpace                       : YUV\nChromaSubsampling                : 4:2:0\nBitDepth/String                  : 8 bits\nTipo di scansione                : Progressivo\nBit/(Pixel*Frame)                : 0.158\nTitolo                           : Il Signore degli Anelli: La Compagnia dell'Anello - Extended Edition 2011 - AVCHD 1080p\nCompressore                      : x264 core 115 r2008 4c552d8\nImpostazioni compressione        : cabac=1 / ref=4 / deblock=1:-2:-1 / analyse=0x3:0x133 / me=umh / subme=10 / psy=1 / psy_rd=1.00:0.00 / mixed_ref=1 / me_range=32 / chroma_me=1 / trellis=2 / 8x8dct=1 / cqm=0 / deadzone=21,11 / fast_pskip=1 / chroma_qp_offset=-2 / threads=3 / sliced_threads=0 / nr=0 / decimate=1 / interlaced=0 / bluray_compat=0 / constrained_intra=0 / bframes=5 / b_pyramid=2 / b_adapt=2 / b_bias=0 / direct=3 / weightb=1 / open_gop=0 / weightp=2 / keyint=240 / keyint_min=24 / scenecut=40 / intra_refresh=0 / rc_lookahead=40 / rc=2pass / mbtree=1 / bitrate=5818 / ratetol=1.0 / qcomp=0.60 / qpmin=0 / qpmax=69 / qpstep=4 / cplxblur=20.0 / qblur=0.5 / vbv_maxrate=50000 / vbv_bufsize=50000 / nal_hrd=none / ip_ratio=1.40 / aq=1:1.00 / zones=288752,328417,q=27\nLingua                           : Italiano\n\nAudio #1\nID                               : 2\nFormato                          : DTS\nFormato/Informazioni             : Digital Theater Systems\nProfilo del formato              : ES\nCodec ID                         : A_DTS\nDurata                           : 3h 48min\nModalitÃƒÂ                          : Costante\nBitRate                          : 1 510 Kbps\nCanali                           : 7 canali / 6 canali\nPosizione dei canali             : Front: L C R, Side: L R, Back: C, LFE / Front: L C R, Side: L R, LFE\nSamplingRate                     : 48,0 KHz\nBitDepth/String                  : 24 bits\nDimensione della traccia         : 2,41 GiB (19%)\nTitolo                           : DTS ITA 6.1\nLingua                           : Italiano\n\nAudio #2\nID                               : 3\nFormato                          : AAC\nFormato/Informazioni             : Advanced Audio Codec\nProfilo del formato              : HE-AAC / LC\nCodec ID                         : A_AAC\nDurata                           : 3h 48min\nCanali                           : 2 canali\nPosizione dei canali             : Front: L R\nSamplingRate                     : 48,0 KHz / 24,0 KHz\nTitolo                           : AAC ITA 2.0\nLingua                           : Italiano\n\nAudio #3\nID                               : 4\nFormato                          : AAC\nFormato/Informazioni             : Advanced Audio Codec\nProfilo del formato              : LC\nCodec ID                         : A_AAC\nDurata                           : 3h 48min\nCanali                           : 6 canali\nPosizione dei canali             : Front: L C R, Side: L R, LFE\nSamplingRate                     : 48,0 KHz\nTitolo                           : AAC ENG 5.1\nLingua                           : Inglese\n\nTesto #1\nID                               : 5\nFormato                          : UTF-8\nCodec ID                         : S_TEXT/UTF8\nCodec ID/Informazioni            : UTF-8 Plain Text\nTitolo                           : Italian Forced\nLingua                           : Italiano\n\nTesto #2\nID                               : 6\nFormato                          : UTF-8\nCodec ID                         : S_TEXT/UTF8\nCodec ID/Informazioni            : UTF-8 Plain Text\nTitolo                           : Italian\nLingua                           : Italiano\n\nTesto #3\nID                               : 7\nFormato                          : UTF-8\nCodec ID                         : S_TEXT/UTF8\nCodec ID/Informazioni            : UTF-8 Plain Text\nTitolo                           : English Forced\nLingua                           : Inglese\n\nTesto #4\nID                               : 8\nFormato                          : UTF-8\nCodec ID                         : S_TEXT/UTF8\nCodec ID/Informazioni            : UTF-8 Plain Text\nTitolo                           : English Hearing Impaired\nLingua                           : Inglese\n\nMenÃƒÂ¹\n00:00:00.000                     : entongue.gifrologue: One Ring To Rule Them All\n00:07:36.789                     : en:Concerning Hobbits\n00:10:35.551                     : en:The Shire\n00:15:39.855                     : en:Very Old Friends\n00:19:58.488                     : en:A Long-expected Party\n00:25:32.614                     : en:Farewell Dear Bilbo\n00:29:57.378                     : en:Keep It Secret, Keep It Safe\n00:32:10.678                     : en:The Account Of Isildur\n00:34:51.798                     : en:At The Green Dragon\n00:36:18.176                     : en:The Shadow Of The Past\n00:45:04.159                     : en:The Passing Of The Elves\n00:46:44.301                     : en:Saruman The White\n00:51:21.411                     : en:A Short Cut To Mushrooms\n00:55:12.434                     : en:Bucklebury Ferry\n00:57:30.071                     : en:At The Sign Of The Prancing Pony\n01:03:31.516                     : en:The Nazgul\n01:07:16.115                     : en:The Midgewater Marshes\n01:08:53.587                     : en:The Spoiling Of Isengard\n01:10:35.940                     : en:A Knife In The Dark\n01:15:15.385                     : en:The Caverns Of Isengard\n01:17:46.620                     : en:Flight To The Ford\n01:24:11.546                     : en:Rivendell\n01:26:12.500                     : en:Many Meetings\n01:29:41.584                     : en:The Fate Of The Ring\n01:33:14.672                     : en:The Sword That Was Broken\n01:35:54.081                     : en:The Evenstar\n01:37:32.972                     : en:The Council Of Elrond\n01:45:45.000                     : en:Gilraen's Memorial\n01:48:44.867                     : en:Bilbo's Gifts\n01:50:01.262                     : en:The Departure of the Fellowship\n01:53:07.673                     : en:The Ring Goes South\n01:57:51.483                     : en:The Pass of Caradhras\n02:04:19.769                     : en:Moria\n02:10:52.113                     : en:A Journey in the Dark\n02:20:11.461                     : en:Balin's Tomb\n02:20:11.192                     : en:The Bridge of Khazad-Dum\n02:29:52.648                     : en:Lothlorien\n02:33:05.298                     : en:Caras Galadhorn\n02:40:22.318                     : en:The Mirror of Galadriel\n02:46:02.325                     : en:The Fighting Uruk-Hai\n02:47:43.718                     : en:Farewell to Lorien\n02:53:06.206                     : en:The Great River\n02:57:58.457                     : entongue.gifarth Galen\n03:04:26.219                     : en:The Breaking of the Fellowship\n03:11:42.155                     : en:The Departure of Boromir\n03:14:22.483                     : en:The Road Goes Ever On\n03:20:42.695                     : en:Credits\n03:28:23.155                     : en:Official Fan Club Credits\n\nTrailer\n\nITA\n\nEng\n\nIMDB &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0120737/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0120737/&lt;/a&gt;","torrent":{"xt":"urn:btih:3b17e407c770c293c60dca6abee0dedbd7833c2a","amp;dn":"La+compagnia+dell%5C%27anello+-+The+Fellowship+of+the+Ring+-+Extende","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b17e407c770c293c60dca6abee0dedbd7833c2a","infoHashBuffer":{"type":"Buffer","data":[59,23,228,7,199,112,194,147,198,13,202,106,190,224,222,219,215,131,60,42]},"announce":[],"urlList":[]}}