{"title":"Evil by Design: Interaction Design To Lead Us Into Temptation ","uid":8744026,"size":37809322,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b4b7b86268404f8498109ee05c08066fe24b9ee&amp;dn=Evil+by+Design%3A+Interaction+Design+To+Lead+Us+Into+Temptation+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1374871276,"description":"Learn how companies make us feel good about doing what they want. Approaching persuasive design from the dark side, this book melds psychology, marketing, and design concepts to show why we're susceptible to certain persuasive techniques. Packed with examples from every nook and cranny of the web, it provides easily digestible and applicable patterns for putting these design techniques to work. Organized by the seven deadly sins, it includes:\n Pride -- use social proof to position your product in line with your visitors' values\n Sloth -- build a path of least resistance that leads users where you want them to go\n Gluttony -- escalate customers' commitment and use loss aversion to keep them there\n Anger -- understand the power of metaphysical arguments and anonymity\n Envy -- create a culture of status around your product and feed aspirational desires\n Lust -- turn desire into commitment by using emotion to defeat rational behavior\n Greed -- keep customers engaged by reinforcing the behaviors you desire\n Now you too can leverage human fallibility to create powerful persuasive interfaces that people will love to use -- but will you use your new knowledge for good or evil?\n\n2013\n\nepub","torrent":{"xt":"urn:btih:3b4b7b86268404f8498109ee05c08066fe24b9ee","amp;dn":"Evil+by+Design%3A+Interaction+Design+To+Lead+Us+Into+Temptation+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b4b7b86268404f8498109ee05c08066fe24b9ee","infoHashBuffer":{"type":"Buffer","data":[59,75,123,134,38,132,4,248,73,129,9,238,5,192,128,102,254,36,185,238]},"announce":[],"urlList":[]}}