{"title":"The Master AKA Master Ninja - Lee Van Cleef 2 DVD Complete Set","uid":4744020,"size":8979484672,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3b64090a7faeeb07e9188f57f50d9b6320e026a6&amp;dn=The+Master+AKA+Master+Ninja+-+Lee+Van+Cleef+2+DVD+Complete+Set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"frit0","files":22,"time":1235719740,"description":"Here's both dvd's of THE MASTER, the old ninja/fu tv series\n\nThe Master follows the character of John Peter McAllister, an American veteran who stayed in Japan following World War II and became a ninja master. At the beginning of the series, McAllister, now an old man, leaves Japan for the United States in search of a daughter he did not know he had. This flight from his ninja life is seen as dishonorable by his fellow ninja, including his former student, Okasa (Sho Kosugi), who attempts to assassinate him. Escaping with a minor wound, McAllister finds himself in the small town of Ellerston, where he believes his daughter resides. Along the way, he meets a drifter named Max Keller, who aids the ninja master in a bar fight, but is subsequently thrown through a window, a recurring event for the hot-headed Keller. Max desires to learn to fight like a ninja, but McAllister is reluctant to train him, feeling him to be too emotional. When Max gets involved in a dispute between Mr. Christensen (Clu Gulager), a ruthless developer, and the Trumbulls (Claude Akins, Demi Moore), a father and daughter who run an airport targeted by Christensen, McAllister decides to train him to survive.\n\nThe pair goes on to have many adventures traveling the country in search of McAllister's daughter, who of course is never found, as the series only lasted one season. Keller and McAllister often get sidetracked by oppressed people, and invariably McAllister uses his ninja skills to help save the day, hopefully teaching Max at the same time. Max spends a lot of time getting thrashed, however.\n\nA recurring enemy is Okasa, the rogue pupil of McAllister, who continually tracks his old master down and tries to kill him. In the first episode, the two duel and McAllister wins. However, the old master refuses to kill his opponent, preferring to renounce his ninja ways. Of course, this leads to Okasa's future attempts.\n\nprops to the original ripper/upper\n\nSMOKE IT IF YOU GOT IT!\n\n-fadizzly fiddly frit0 yazza","torrent":{"xt":"urn:btih:3b64090a7faeeb07e9188f57f50d9b6320e026a6","amp;dn":"The+Master+AKA+Master+Ninja+-+Lee+Van+Cleef+2+DVD+Complete+Set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b64090a7faeeb07e9188f57f50d9b6320e026a6","infoHashBuffer":{"type":"Buffer","data":[59,100,9,10,127,174,235,7,233,24,143,87,245,13,155,99,32,224,38,166]},"announce":[],"urlList":[]}}