{"title":"Marine Corps Intelligence Activity Malaysia Country Handbook ","uid":10582622,"size":1311308,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b9a276f8d9afe8885b036d36affc6e261f80a94&amp;dn=Marine+Corps+Intelligence+Activity+Malaysia+Country+Handbook+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1405707294,"description":"The following guide is part of a series of handbooks covering basic information and statistics about countries around the world produced by the Marine Corps Intelligence Activity. The handbooks are not released to the public.\n\nMalaysia Country Handbook\nOctober 2002 180 pages\n(PDF 1.25 MB)\n\n1. This handbook provides basic reference information on Malaysia, including its geography, history, government, military forces, and communications and transportation networks. This information is intended to familiarize military personnel with local customs and area knowledge to assist them during their assignment to Malaysia.\n\n2. This product is published under the auspices of the U.S. Department of Defense Intelligence Production Program (DoDIPP) with the Marine Corps Intelligence Activity designated as the community coordinator for the Country Handbook Program. This product reflects the coordinated U.S. Defense Intelligence Community position on Malaysia.\n\n3. Dissemination and use of this publication is restricted to official military and government personnel from the United States of America, United Kingdom, Canada, Australia, NATO member countries, and other countries as required and designated for support of coalition operations.\n\n4. The photos and text reproduced herein have been extracted solely for research, comment, and information reporting, and are intended for fair use by designated personnel in their official duties, including local reproduction for training. Further dissemination of copyrighted material contained in this document, to include excerpts and graphics, is strictly prohibited under Title 17, U.S. Code.","torrent":{"xt":"urn:btih:3b9a276f8d9afe8885b036d36affc6e261f80a94","amp;dn":"Marine+Corps+Intelligence+Activity+Malaysia+Country+Handbook+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b9a276f8d9afe8885b036d36affc6e261f80a94","infoHashBuffer":{"type":"Buffer","data":[59,154,39,111,141,154,254,136,133,176,54,211,106,255,198,226,97,248,10,148]},"announce":[],"urlList":[]}}