{"title":"A Short History of Ireland  (BBC Radio - Part 3)","uid":5150788,"size":106362131,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3b9da55a3c374ce541a89a6d36271a5a125b8ae9&amp;dn=A+Short+History+of+Ireland++%28BBC+Radio+-+Part+3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dougietrotter","files":-1,"time":1257545152,"description":"SHORT HISTORY OF IRELAND 021-030 (BBC7 History) - radioarchive.cc\n\nFhg MP3, 128Kbps, 44Khz, Stereo, CBR\n\n\n\nThe Rich and Turbulent Story of Ireland, from the Ice Age to World War II\n\nshi_021 Land Of  Savage Irish - Catalan Pilgrim Amid Irish\nshi_022 Richard IIs Great Expedition To Ireland - The Pale\nshi_023 Beyond The Pale - Garret Mor Fitzgerald The Great Earl Of Kildare\nshi_024 Garret Og And Silken Thomas Fitzgerald - The Rebellion Of Silken Thomas\nshi_025 The Church In Turmoil - Sober Ways, Politic Drifts And Amiable Persuasion\nshi_026 Conn Bacach ONeill Visits London - Religious Strife And Plantation\nshi_027 Shane The Proud - The Fall Of Shane ONeill\nshi_028 Failed Plantation And A Bloody Feast In Belfast - An English Queen, A Scottish Lady And A Dark Daughter\nshi_029 Holy War In Munster - The Plantation Of Munster\nshi_030 The Wreck of the Armada - The Last Voyage of the Girona\n\nNB: Produced as double episodes so there will be 120 instead of the original 240.\nThe two episode titles are delimited by a -.\nThis should take 12 torrent - given luck\n\nAbout the Series\n----------------\nA Short History of Ireland started on 27 March, 2006 and ran for a total of 240 episodes, taking an historical journey spanning the Ice Age, the arrival of Christianity, the Viking era, Brian Boru, the Norman invasion, the plantation and the famine through to the creation of the Irish Free State.\n\nWritten by Dr. Jonathan Bardon OBE, QUB, each programme was read by local actors Frances Tomelty, James Greene and Richard Dormer, who interweave eye-witness accounts, letters and diary extracts from the times with the historical facts.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:3b9da55a3c374ce541a89a6d36271a5a125b8ae9","amp;dn":"A+Short+History+of+Ireland++%28BBC+Radio+-+Part+3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b9da55a3c374ce541a89a6d36271a5a125b8ae9","infoHashBuffer":{"type":"Buffer","data":[59,157,165,90,60,55,76,229,65,168,154,109,54,39,26,90,18,91,138,233]},"announce":[],"urlList":[]}}