{"title":"Maleem Mahmoud Ghania with Pharoah Sanders","uid":4671837,"size":102646193,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3bf6978173a5c2c6cea50b759b061ec9c835af5e&amp;dn=Maleem+Mahmoud+Ghania+with+Pharoah+Sanders&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bjdprivate","files":9,"time":1232761417,"description":"Produced by Bill Laswell in 1994, this collaboration between Malian Maleem Mahmoud Ghania and Pharoah Sanders is , in my opinion, the greatest of the &quot;Back to Africa&quot; albums released in the Nineties. \n\nThis disc reproduces a meeting between Sanders and the master Gnawa musician Maleem Mahmoud Ghania. Gnawa people are Morrocan descendents of black African slaves, who have maintained a spiritual and musical tradition that is an amalgam of Sufi mysticism and elements of West African spirit religion. The music is haunting. It is a vocal music, driven by an instrument called the guimbri...a bass lute with gut stings and a head made out of camel hide. The musician plucks the strings and slaps the head to create a sound somewhere between a bass guitar and a drum. The rest of the ensemble consists of a responding chorus who accompany the music with hand claps and Krkaba, loudly resounding hand cymbals. The music is equal parts Sufi ceremonial music and West African drum ritual. On it's own the music is compelling.\nBut over top of this on many of the tracks on the album, Pharoah Sanders let's loose on some of the most firey, spirit filled improvisation that he's done since the late 60s. Not all of this is out...some is quite beautiful and very melodic. His ballad Peace in Essaouira is deeply moving. But even when he maintains tonal structures and specific pitches in his improvising, there is a spirit here which is bracing. And when he goes out....watch out! It's a true meeting of the two groups, not a gimmick.\nThis is an album that will give you energy and literally raise the spirits. I find that I can't keep still while listening to it. It is true trance music. - Amazon review","torrent":{"xt":"urn:btih:3bf6978173a5c2c6cea50b759b061ec9c835af5e","amp;dn":"Maleem+Mahmoud+Ghania+with+Pharoah+Sanders","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bf6978173a5c2c6cea50b759b061ec9c835af5e","infoHashBuffer":{"type":"Buffer","data":[59,246,151,129,115,165,194,198,206,165,11,117,155,6,30,201,200,53,175,94]},"announce":[],"urlList":[]}}