{"title":"MARC ANTHONY Libre FLAC","uid":6118473,"size":324217083,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3c1db4af9f5f79ca2ff41863c40238ce4451c699&amp;dn=MARC+ANTHONY+Libre+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rjordan21","files":-1,"time":1295655643,"description":"Out of the thousands of albums I own, Libre is easily one of my favorites. It is almost impossible for me to do anything else but listen/dance/smile while this is on. I don't speak a word of Spanish and it doesn't matter one bit at all. That voice, the outstanding musicianship..... incredible. \n\nTheres a palpable sense of joy in Marc Anthonys voice. The salsa star and pop sensation may be slight in stature, but when he opens his mouth to sing, the sheer power and passion of his tenor grabs a hold of your heart and makes you sit up and pay attention. The king of contemporary salsa was born and raised in New York City, but as good as Anthony is in his native tongue, he is triumphant when he sings in Spanish. Like Youssou NDour, Celia Cruz, and other great voices, Anthonys intensity and purpose transcend language barriers: even if you dont understand his words, its difficult not to feel what he is expressing. On his first salsa collection since 1997s potent Contra la Corriente (and his first CD since his 1999 self-titled, slightly watered-down pop smash) Marc Anthony allows the emotionality of the rhythm to take control. Backed by a topnotch band, Anthonys supple voice carries the beat along, and on tracks like the propulsive De Que Depende he soars. His joy and the joy of hearing a great singer are contagious.\n\nRipped to FLAC using EAC in Secure Mode","torrent":{"xt":"urn:btih:3c1db4af9f5f79ca2ff41863c40238ce4451c699","amp;dn":"MARC+ANTHONY+Libre+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c1db4af9f5f79ca2ff41863c40238ce4451c699","infoHashBuffer":{"type":"Buffer","data":[60,29,180,175,159,95,121,202,47,244,24,99,196,2,56,206,68,81,198,153]},"announce":[],"urlList":[]}}