{"title":"Norton Partition Magic 8.05 (Full + Untouched )","uid":7184223,"size":255965184,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3c5ecae9dce5069bd961d0c333936b34bb8f9e23&amp;dn=Norton+Partition+Magic+8.05+%28Full+%2B+Untouched+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PandShare","files":1,"time":1334369552,"description":"Norton Partition Magic 8.05 lets you easily organize your hard drive by creating, resizing, copying, and merging disk partitions. \n\nSeparate your operating system, applications, documents, music, photos, games, and backup files to reduce the risk of data loss if your system crashes. You can use Norton PartitionMagic 8.0 to run multiple operating systems safely. \n\nPartitionMagic is a great partition manager for Windows. With it, users can manage the partitions using a visual interface. In the past, these kind of tasks had to be done using DOS applications that required a great deal of know-how. Now, thanks to Partition Magic, users can create, delete, copy, merge, split, and format partitions and discs, and change their file systems. After installation, the program will be able to do all of these tasks, however, it will have to go to DOS mode to complete some of the changes, so some restarts are to be expected. Even though many applications can handle partitions, Partition Magic has been the most popular application around for ages, mainly because how easy it is to use. Hard discs are depicted by a big bar with code colors. With a few clicks, a partition can be created and formatted. What's even better, users can adjust the sizes of partitions with drag and drop functionality. Furthermore, after a logical partition is created and unit letters change, an integrated application will search for missing or faulty links and repair them automatically. This is a must-have application for anyone who works a lot with partitions or disks and needs to be always on top of problems. \n\nPreview the effects of partitioning a hard drive before implementing anything \n*Safely manage multiple operating systems \n*Partition hard drives as large as 80 GB \n*Access and partition external USB drives \n*Undelete a deleted partition from rescue disks \n*Remotely copy, move, delete, and create partitions across a TCP/IP connection. \n*Divides hard drive into two or more partitions \n*Runs multiple operating systems on the same PC \n*BootMagicâ„¢ makes it easy to switch between operating systems \n*Copy, move, resize, split, or merge partitions \n*Guides you through the partitioning process \n*Easy to find, copy and paste files in both WindowsÂ® and LinuxÂ® partitions \n*Create and modify partitions up to 300GB* \n*Supports USB 2.0, USB 1.1, and FireWireÂ® external drives** \n*Supports and converts partitions among FAT, FAT32, NTFS, Ext2, and Ext3 file systems \n*Enlarge an NTFS partition without restarting computer","torrent":{"xt":"urn:btih:3c5ecae9dce5069bd961d0c333936b34bb8f9e23","amp;dn":"Norton+Partition+Magic+8.05+%28Full+%2B+Untouched+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c5ecae9dce5069bd961d0c333936b34bb8f9e23","infoHashBuffer":{"type":"Buffer","data":[60,94,202,233,220,229,6,155,217,97,208,195,51,147,107,52,187,143,158,35]},"announce":[],"urlList":[]}}