{"title":"Kids Picture Yourself Knitting","uid":9254232,"size":11147301,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cc222c7e1a2134f8a566eec54849a3cf99c42c9&amp;dn=Kids+Picture+Yourself+Knitting&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1385524140,"description":"Can you picture yourself knitting? Do you want to learn how to make fun and colorful scarves, hats, and more for your friends and family? Kids! Picture Yourself Knitting shows kids just like you all you need to know about knitting, from needles and yarn, to simple stitches, and how to put it all together to create a finished piece. You'll learn about different types of yarn and knitting needles and how to choose the right ones for your projects, as well as the other tools you'll need to keep handy when you begin knitting. Once you've got your yarn and needles, you'll learn how to hold and work with them, common knitting terms, and fundamental knitting stitches such as the knit and the purl. With the basics covered, the book will show you how to read a knitting pattern, finish off and start a new ball of yarn, and try out some advanced knitting skills to help you put the finishing touches on your projects. The book features seven cool projects to help you practice your new knitting skills including hats, scarves, a pillow, and a purse. Each project features full-color pictures to help you gather the supplies you need, and step-by-step directions lead you through it from start to finish. Get ready to make your own unique wearable and shareable knitted creations!","torrent":{"xt":"urn:btih:3cc222c7e1a2134f8a566eec54849a3cf99c42c9","amp;dn":"Kids+Picture+Yourself+Knitting","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cc222c7e1a2134f8a566eec54849a3cf99c42c9","infoHashBuffer":{"type":"Buffer","data":[60,194,34,199,225,162,19,79,138,86,110,236,84,132,154,60,249,156,66,201]},"announce":[],"urlList":[]}}