{"title":"DECTalk access32 v4.6 (speech engine)","uid":4915035,"size":6772256,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3cd7fa41cffe8a2bb8c4588b3b9e9b4b1ff62fa4&amp;dn=DECTalk+access32+v4.6+%28speech+engine%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"UltraLeetJ","files":1,"time":1243378964,"description":"DECTalk is a speech synth that is used for many things, one of them is its interesting yet intricate ability to sing. This copy can be used in conjunction with software that will support the interface, but not screen readers. I'll take care of that other version later if I can find it. Installation &amp; activation Instructions (these are also found on text file inside): This copy of DECTalk access32 was taken from Kurzweil 1000 v8, and includes an authorization disk (see dectalk keydisc.exe)\nIf you don't have any available floppies, or this disk fails, read further for another installation method.\nPlease note, if you are running win9x, you will *need* to use the keydisk, unless your floppy controler is either disabled or doesn't exist from the bios point-of-view.\n\n***installation with no auth disk***\n\nIf you are installing DECTalk access 32 onto an NT-based system, I.e. Windows 2000 or Windows Xp) with no physical floppy drive or floppy controler, the following steps are not necessary, and access32 should install without error.\n\nIf you do not have a registered copy of Kurzweil on your system, and you are running Windows 2000 or xp on a system equipped with a floppy drive, do the following before installing access32 on your system:\n\n1. Go to your device manager.\n2. Locate the item in the tree view that says &quot;floppy disk drives&quot;\n3. Open this branch and Delete the entry for your floppy drive.\n4. Find the item in the tree view that says &quot;floppy disk controlers&quot;. Open the branch and delete your floppy controler as well.\n5. Run the DECTalk access32 installer.\n\nAfter installation, you will be prompted to restart your machine. After this is done, access32 will be loaded as a service, and can be used as your default synthesizer for anything that supports DAPI (this does not include dolphin products, such as Hal or Supernova. Sorry).\n\nAlternatively, you can manually start the service without restarting your machine by going to the run dialogue, typing &quot;services.msc&quot; and finding the &quot;KESI SmitNt Service&quot;.\n\nNote: this procedure does not work on win9x systems unless the floppy controler is disabled at the bios level.","torrent":{"xt":"urn:btih:3cd7fa41cffe8a2bb8c4588b3b9e9b4b1ff62fa4","amp;dn":"DECTalk+access32+v4.6+%28speech+engine%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cd7fa41cffe8a2bb8c4588b3b9e9b4b1ff62fa4","infoHashBuffer":{"type":"Buffer","data":[60,215,250,65,207,254,138,43,184,196,88,139,59,158,155,75,31,246,47,164]},"announce":[],"urlList":[]}}