{"title":"Code Geass: Lelouch of the Rebellion R1 [English Dubbed]","uid":4644165,"size":4313681820,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3d43f60f11f40dda4a1a1f240b64fd77263675a2&amp;dn=Code+Geass%3A+Lelouch+of+the+Rebellion+R1+%5BEnglish+Dubbed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Dead_Jester","files":-1,"time":1231821051,"description":"On August 10, 2010, a.t.b., the Holy Empire of Britannia overpowered Japanese forces and conquered the country with their new, powerful, robotic weapons, the Knightmare Frames, in less than a month. In the aftermath of Britannia's invasion, Japan lost its freedom, its rights, and even its name, becoming Area 11 of the Britannian Empire. The Japanese people, renamed as &quot;Elevens&quot;, are forced to survive in poor neighborhoods, while Britannians live in first-class settlements. Rebel elements persist, however, as pockets of Japanese organizations struggle against the Empire for the independence of Japan.\n\nAfter his father, the Emperor of Britannia, failed to prevent the assassination of his mother, an attack which also left his sister blind and crippled, the young prince Lelouch vowed to destroy Britannia. Seven years later, he accidentally becomes mixed up with &quot;terrorists&quot; in Area 11 and encounters a mysterious girl named C.C., who gives him the power of Geass. With it, he finally has the power that he needs to defeat Britannia and fulfill his two wishes: to seek revenge for his mother and to construct a world in which his beloved sister Nunnally can live happily.\n\n\nAs with my other 2 uploads this is TV rip, not quite DVD quality but very much watchable.\n\n\nIf you download this PLEASE SEED!\n\n\nEnjoy this great show!\t\t","torrent":{"xt":"urn:btih:3d43f60f11f40dda4a1a1f240b64fd77263675a2","amp;dn":"Code+Geass%3A+Lelouch+of+the+Rebellion+R1+%5BEnglish+Dubbed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d43f60f11f40dda4a1a1f240b64fd77263675a2","infoHashBuffer":{"type":"Buffer","data":[61,67,246,15,17,244,13,218,74,26,31,36,11,100,253,119,38,54,117,162]},"announce":[],"urlList":[]}}