{"title":"I Think I Love My Wife(2007)DVDRip.AC3(ENG)-DROCK","uid":6483037,"size":733313024,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3d4ef4fdd13f8cd80dc051b4d28fe1fb2cefb8eb&amp;dn=I+Think+I+Love+My+Wife%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drock232","files":-1,"time":1308601041,"description":"Actor/comedian Chris Rock directs and stars in this American remake of Eric Rohmer' s classic French comedy Chloe in the Afternoon. Richard Cooper (Rock) is a high-powered investment banker with a beautiful wife and two wonderful children. Though on the surface it would appear that Richard could want nothing more out of life, his thoughts always seem to drift toward sex. Whether it's during his daily commute into the city, his endless barrage of meetings, or even his downtime changing diapers at home, Richard's mind is constantly preoccupied by fantasies about the women he sees on the commuter train, on the city streets, and in the boardroom. Richard's daily life has gradually devolved into a blur of mind-numbing banality, and these days sexual fantasy has become his sole means of escaping the constant pressures of work and fatherhood. Though Richard never had any real intention of cheating on his faithful but preoccupied wife Brenda (Gina Torres), a chance run-in with his old friend Nikki (Kerry Washington) -- a drop-dead gorgeous stunner who appears at his office door one day seeking career advice from the successful banker -- finds his steely resolve fast turning flimsy. It's not long before the smitten Richard and the smoldering Nikki are meeting for clandestine lunches, and temptation begins to turn Richard's once-predictable life upside down. As his uncontrollable fantasies begin to lead him down the dangerous path of infidelity, the man who once kept his libido safely in check finds it increasingly difficult to refrain from acting on his impulses. \n\nRipped with Autogk.\n\nLength: 1 Hour 34 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:3d4ef4fdd13f8cd80dc051b4d28fe1fb2cefb8eb","amp;dn":"I+Think+I+Love+My+Wife%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d4ef4fdd13f8cd80dc051b4d28fe1fb2cefb8eb","infoHashBuffer":{"type":"Buffer","data":[61,78,244,253,209,63,140,216,13,192,81,180,210,143,225,251,44,239,184,235]},"announce":[],"urlList":[]}}