{"title":"Jack Jones 5 Albums","uid":4190547,"size":339287774,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3d4fb72211981283d551c7f8cb5fb3861f54b9bf&amp;dn=Jack+Jones+5+Albums+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mingy2","files":65,"time":1210931485,"description":"Jack Jones 5 Albums \n\n\n\n\nJack Jones (born January 14, 1938) is an American jazz and pop singer. He was one of the most popular vocalists of the 1960s.\n\n\nHe was rated highly by Frank Sinatra and Tony Bennett and a major influence on Scott Walker. Judy Garland called him the best jazz singer in the world, although Jones was always a straight pop singer (even when he recorded contemporary material) and rarely ventured in the direction of jazz. Jones won two Grammy Awards. He performs concerts around the world and remains popular in Las Vegas. Some of his best-known songs are &quot;I Can&amp;#039;t Believe I&amp;#039;m Losing You&quot;, &quot;L.A. Break Down&quot;, &quot;The Way That I Live&quot;, &quot;Wives and Lovers&quot; (1964 Grammy Award, Best Pop Male Performance)&quot;, &quot;The Race Is On&quot;, &quot;Lollipops and Roses&quot; (1962, Grammy Award, Best Pop Male Performance), &quot;The Impossible Dream&quot;, &quot;Lady&quot;, &quot;What I Did for Love&quot;, and &quot;The Love Boat Theme&quot;. He recorded &quot;Strangers in the Night&quot; before Sinatra did.\n\nHis birth name is John Allan Jones and he was the only son of actors Allan Jones and Irene Hervey. Jack Jones was born in Los Angeles in the very night that his father, singer and movie star Allan Jones, recorded his signature song &quot;Donkey Serenade&quot;. The young Jones attended University High School in West Los Angeles and studied drama and singing. His first professional break was with his father, when Allan Jones was performing at the Thunderbird Hotel and Casino in Las Vegas. He recorded a couple of demos for songwriter Don Raye and started to being noticed by the music industry. In 1959, Jones was signed to Capitol Records and released an album (This Love of Mine) and a few singles. None of these records sold well and his contract was cut short. These early singles were compiled in the budget album The Romantic Voice of Jack Jones, released in the early seventies in the UK by the label Music For Pleasure.\n\nAfter he was dropped by Capitol, Jones was drafted and spent some time in the US Air Force. Back to civilian life, he had more luck with his next company, Kapp Records. In August, 1961 he recorded the ballad &quot;Lollipops and Roses&quot; (a song by Tony Velona) and it was a hit in the following year. In the Kapp years, Jones recorded almost twenty albums, including Shall We Dance, This Was My Love, She Loves Me, Call Me Irresponsible, IÂ´ve Got a Lot of Living To Do!, Bewitched, Wives and Lovers, Dear Heart, Where Love Has Gone, My Kind of Town, The Impossible Dream, The In Crowd, Jack Jones Sings, Lady, Our Song, etc... Young, handsome and well groomed, Jack Jones was an anomaly in the sixties, eschewing rock and roll trends and opting for the big band sound, lush romantic ballads and the Great American Songbook, although sometimes he recorded something more pop, country or bossa nova oriented. Besides the good choice of material, Jones worked with top arrangers like Billy May, Marty Paich, Shorty Rogers, Jack Elliott, Ralph Carmichael, Bob Florence, Don Costa and Pete King.\n\nJones moved from Kapp (in the UK, London Records), to RCA Records in 1967. His first album in the new company was called Without Her. The following releases, If You Ever Leave Me, L.A. Break Down, and Where is Love were in the same style of the classic Kapp records. After A Jack Jones Christmas, he decided to renew his musical direction and image. At the time, he had changed his appearance from the smooth club entertainer of the 1960s&amp;#039; Las Vegas scene to the longhaired singer of the early seventies. A Time For Us (1970) marks the transition towards a middle of the road sound in the Jack Jones career. He started to record more contemporary material, including covers of people like Randy Newman, Harry Nilsson, Carole King, Paul Williams, Richard Carpenter, Gordon Lightfoot, Gilbert O?Sullivan, etc... The album Bread Winners (1972) was a tribute to the band Bread, with eight songs written by David Gates and two by Jimmy Griffin and Robb Royer. Two of his more acclaimed albums of that period were dedicated to two French songwriters: Jack Jones Sings Michel Legrand (1971), and Write Me a Love Song, Charlie (1974), with songs by Charles Aznavour. The Full Life (1977) was produced by Jones and Bruce Johnston of the Beach Boys. In this album, Jones recorded &quot;Disney Girls (1957)&quot; (Johnston&amp;#039;s most well known song) and &quot;God Only Knows&quot;, a Beach Boys classic. His last LP for RCA was With One More Look At You (1977) - the title song is a Paul Williams composition from the picture A Star Is Born. In 1979, he moved to MGM Records, recording the album Nobody Does it Better, which featured disco tracks of The Love Boat theme and his Grammy winner, &quot;Wives and Lovers&quot;. His second (and last) MGM album, Don&amp;#039;t Stop Now, featured duets with Maureen McGovern.\n\nSince 1980, he has recorded only a handful of albums, and now performs in various concert arenas and occasionally appears on the supper-club circuit. He has performed all over the world and has a large following in England, a place he visits almost every year. He is also well regarded in Japan, where a lot of his old records were released on CD. Although Jones records only sporadically, his new work is always well received. I Am a Singer (1987, USA Records) is considered by Jack Jones enthusiasts a minor classic. In 1992 he recorded for Sony Music The Gershwin Album, with songs written by George Gershwin and Ira Gershwin. In 1997 came NEW Jack Swing (Honest Entertainment), with Jones giving a big band treatment to old standards and assorted pop/rock songs. His most recent album is Jack Jones Paints a Tribute to Tony Bennett (Honest Entertainment, released in 1999), that was nominated for Best Traditional Pop Vocal Performance and Record of the Year. In March 2008, Jack Jones celebrated his 70 years of age and 50 years in show business with a concert at the McCallum Theatre (Palm Springs). The guests were jazz singer Patti Austin, songwriters Alan Bergman and Marilyn Bergman and singing impressionist Bob Anderson.\n\n\nJack Jones made his movie debut in Juke Box Rhythm (1959), a rock and roll exploitation production. He is Riff Manton, a young singer who is involved romantically with a princess (Jo Morrow). Jack sings three songs. Others performers featured were The Earl Grant Trio, Johnny Otis &amp; His Band and The Treniers. Jones has acted in such minor films as cult horror The Comeback and feature length British TV comedy, Cruise of the Gods. In the latter, he starred alongside comedy writers/actors Steve Coogan, David Walliams and Rob Brydon. He can be seen (very briefly) in Airplane II: The Sequel (1982), performing The Love Boat Theme\n\nThe singer was a staple in the sixties and seventies TV variety shows, performing on The Ed Sullivan Show, The Andy Williams Show, The Dick Cavett Show, The Hollywood Palace, The Smothers Brothers Comedy Hour, The Jerry Lewis Show, American Bandstand, This is Tom Jones, The Dean Martin Show, The Judy Garland Show, Playboy After Dark, The Jack Benny Program, The Steve Allen Show , etc... He twice hosted NBCÂ´s top rated rock and roll series Hullabaloo. Jones provided the famous opening theme for the television series The Love Boat from 1977 through 1985, and also made several guest appearances on the show. He also guested in the series The Rat Patrol, Police Woman, McMillan and Wife and The Hardy Boys/Nancy Drew Mysteries. The singer promoted the Chrysler New Yorker in the mid-70&amp;#039;s with the &quot;Its the talk of the town&quot; ad campaign. Previous to that, he sang the theme song of the series Funny Face. In 1990, Jones recorded Three Coins in the Fountain, which was used in the film Coins in the Fountain that same year. In these last two decades, Jones has been active in the musical theater, acting in Guys and Dolls, South Pacific and others. He went to national tour performing Don Quixote in Man Of La Mancha and was acclaimed by the critics.\n\n\nIn the second half of the sixties, Jones had a well-publicized relationship with actress Jill St. John and the two were briefly married. In the seventies, Jones was linked romantically to British actress Susan George. After that, he was involved with Kathy Simmons. From 1982 to 2005 he was married to British-born Kim Ely and they had a daughter, Nicole (born in 1991). Jones now lives in Palm Springs.\n\n\n\n\n\nJack Jones - She Loves Me 1963\n\n01 - She Loves Me\n02 - Real Live Girl\n03 - Our Language Of Love\n04 - Close Your Eyes\n05 - When I&amp;#039;m Not Near The Girl I Love\n06 - I Believe In You\n07 - The Lamp Is Low\n08 - On The Other Side Of The Tracks\n09 - Wouldn&amp;#039;t It Be Loverly?\n10 - My Mood Is You\n11 - Hit The Road To Dreamland\n12 - I Get Along Without You Very Well\n\nWith Jack Elliott And His Orchestra\n\n\n\n\n\n\nJack Jones - Lady  1967\n\n01 - Lady (Kusik / Singleton / Kaempfert)\n02 - A Beautiful Friendship (Cahn / Styne)\n03 - Free Again (Colby / Canfora / Baselli)\n04 - If You Never Come To Me (Jobim / Oliveira / Gilbert)\n05 - Nice &amp;#039;N&amp;#039; Easy (Bergman / Bergman / Spence)\n06 - Brother, Where Are You? (Brown)\n07 - Once Upon A Time (Adams / Strouse)\n08 - If You Go Away (McKuen / Brel)\n09 - And We Were Lovers (Bricusse / Goldsmith)\n10 - Girl Talk (Troup / Hefti)\n11 - Afraid To Love (Jones / Florence)\n12 - It&amp;#039;s Easy To Remember (Rodgers / Hart)\n\nArranged And Conducted By Marty Paich &amp; Ralph Carmichael\n\n\n\n\nJack Jones - Wives And Lovers  1964\n\n01 - Wives And Lovers\n02 - Toys In The Attic\n03 - Song About Love\n04 - I&amp;#039;m Moody\n05 - Angel Eyes\n06 - Fly Me To The Moon (In Other Words)\n07 - Charade\n08 - I Wish You Love\n09 - Nina Never Knew\n10 - Summertime Promises\n11 - I See Your Face Before Me\n12 - Come Rain Or Come Shine\n\n\n\n\n\nJack Jones - The Impossible Dream  1966\n\n01 - The Impossible Dream (The Quest)\n02 - The Shadow Of Your Smile\n03 - I Will Wait For You\n04 - Then Was Then And Now Is Now\n05 - All Or Nothing At All\n06 - Feeling Good\n07 - Alfie\n08 - Strangers In The Night\n09 - What Now My Love\n10 - This Is All I Ask\n11 - My Best Girl\n12 - You Better Go Now\n\n\n\n\n\nJack Jones - Dear Heart  1965\n\n01 - Dear Heart\n02 - You&amp;#039;re Sensational\n03 - Love Is Here To Stay\n04 - I&amp;#039;ll Get By\n05 - You&amp;#039;d Better Love Me\n06 - All The Things You Are\n07 - Emily\n08 - Thank Heaven For Little Girls\n09 - I&amp;#039;m Glad There Is You\n10 - When She Makes Music\n11 - Something&amp;#039;s Gotta Give\n12 - You&amp;#039;re My Girl","torrent":{"xt":"urn:btih:3d4fb72211981283d551c7f8cb5fb3861f54b9bf","amp;dn":"Jack+Jones+5+Albums+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d4fb72211981283d551c7f8cb5fb3861f54b9bf","infoHashBuffer":{"type":"Buffer","data":[61,79,183,34,17,152,18,131,213,81,199,248,203,95,179,134,31,84,185,191]},"announce":[],"urlList":[]}}