{"title":"DVD KidsCrew Disney/Pixar Deel 2(disney)(dutch) 2Lions-Team","uid":5039966,"size":4181713577,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3d778fa74c19a90e9d2a097a7c870939b1f33618&amp;dn=DVD+KidsCrew+Disney%2FPixar+Deel+2%28disney%29%28dutch%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Pioen","files":-1,"time":1249325251,"description":"DVD KidsCrew Disney/Pixar Deel 2 - 9 \n\n\n\nAlle films zijn van sublieme kwalteit en hebben allen Nederlandse audio.\n\n\nBambi \n\nVerenigde Staten\nAnimatie / Drama\n70 minuten\n\ngeregisseerd door David Hand\nmet de stemmen van Hardie Albright, Stan Alexander en Peter Behn\n\nHet hert Bambi wordt bij zijn geboorte uitgeroepen tot &quot;Prins van het Bos&quot;.\nWanneer hij ouder wordt raakt Bambi bevriend met andere dieren in het bos,\nleert hij te overleven, en wordt hij verliefd. Op een dag komen er echter\njagers langs, en wordt Bambi gedwongen om net zo moedig te zijn als zijn\nvader, en de andere herten in veiligheid te brengen.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1379&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1379&lt;/a&gt;\n\n\nPocahontas \n\nVerenigde Staten\nAnimatie / Familie\n78 minuten\n\ngeregisseerd door Mike Gabriel en Eric Goldberg\nmet de stemmen van Irene Bedard, Mel Gibson en Linda Hunt\n\nPocahontas, een Indiaans meisje, woont samen met haar volk in het latere Amerika.\nOp een dag komt er een Engels schip dat goud komt zoeken. Pocahontas en haar stam\nhouden zich verborgen, maar Pocahontas wordt toch gezien. Ze maakt kennis met een\nblanke man (John Smith) terwijl haar stam een hekel aan vreemden heeft. Er bloeit\neen vriendschap op. Wanneer ze samen gezien worden is dit het begin van diverse problemen.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1069&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1069&lt;/a&gt;\n\n\nDe Reddertjes \n\nVerenigde Staten\nAnimatie / Avontuur\n77 minuten\n\ngeregisseerd door John Lounsbery, Wolfgang Reitherman en Art Stevens\nmet de stemmen van Bob Newhart, Eva Gabor en Geraldine Page\n\nTwee dappere muizen gaan op weg gaan naar het Duivelsmoeras om het vermiste weesmeisje\nPenny te redden. Het avontuur begint als Penny's noodkreet in een fles in handen belandt\nvan de schichtige maar slimme muis Bernard en zijn elegante partner juffrouw Bianca.\nDe twee muizen doen hun belofte aan 'De Hulp-en Redvereniging' eer aan als zij Penny in\nallerijl redden uit de valse klauwen van de gemene Medusa... die Penny nodig heeft om een\njuweel van onschatbare waarde te vinden.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1233&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1233&lt;/a&gt;\n\n\nDe Kleine Zeemeermin \n\nVerenigde Staten\nAnimatie / Familie\n83 minuten\n\ngeregisseerd door Ron Clements en John Musker\nmet de stemmen van Jodi Benson, Christopher Daniel Barnes en Pat Carroll\n\nAriel, de jongste dochter van Koning Triton, is niet tevreden met het leven als zeemeermin.\nZe verlangt ernaar met de mensen te leven aan de oppervlakte. Ze krijgt uiteindelijk van de\nzeeheks Ursula de gelegenheid om drie dagen als mens door te brengen, om zo de man van haar\ndromen aan de haak te slaan.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/544&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/544&lt;/a&gt;\n\n\nLion King \n\nVerenigde Staten\nAnimatie / Familie\n84 minuten\n\ngeregisseerd door Roger Allers en Rob Minkoff\nmet de stemmen van Matthew Broderick, James Earl Jones en Jeremy Irons\n\nIn Afrika wordt de jonge leeuw Simba geboren als zoon van de leeuwenkoning Mufasa. Dat zint\nMufasa's jaloerse broer Scar absoluut niet, die nu niet langer de eerste troonopvolger is.\nTerwijl Simba een onbezorgde jeugd geniet in zijn vaders koninkrijk, smeedt Scar samen met\neen groep hyena's een plan om zowel Mufasa als Simba uit de weg te ruimen, en zo zelf de\nmacht te kunnen grijpen.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/458&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/458&lt;/a&gt;\n\n\n\n\nAlle films zijn van sublieme kwalteit en hebben allen Nederlandse audio. \n\n\nCategorie : Beeld\nFormaat : DVD5\nBron : Retail\nOndertitels : Geen\nGenre : Animatie\n\n\n\nIn deze fantastische collectie zijn de volgende films megenomen:\n\nAssepoester, Finding Nemo, Pinokkio, Sneeuwwitje, Brother Bear, Bambi, Pocahontas, De reddertjes, De Kleine Zeemeermin, Lion King, Belle en het Beest, De Klokkenluider van de Notre Dame, Mulan, Hercules, The Incredibles, Dombo, Fantasia, Peter Pan, Piratenplaneet, Taran en de Toverketel, 101 Dalmatiers, Aladin, Frank en Frey, Ichabod en Meneer Pad, Paniek op de Prairie, Dinosaur, Pooh's Lolifanten Film, Monster en Co, Lady en de Vagebond, Vrij en Vrolijk, Cars, Chicken Little, Robin Hood, Tarzan, Atlantis, Bee Movie, Jungle Boek, Toy Story, Meet the Robinsons, Teigetjes Film, Fantasia 2000, Een Luizenleven, Keizer Kuzco, Ratatouille, The Wild.\n\nThanks : CoolKidWeb\n\n*****************************************\n\nBrought to you by\nPioen\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum\n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:3d778fa74c19a90e9d2a097a7c870939b1f33618","amp;dn":"DVD+KidsCrew+Disney%2FPixar+Deel+2%28disney%29%28dutch%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d778fa74c19a90e9d2a097a7c870939b1f33618","infoHashBuffer":{"type":"Buffer","data":[61,119,143,167,76,25,169,14,157,42,9,122,124,135,9,57,177,243,54,24]},"announce":[],"urlList":[]}}