{"title":"South Park Banned Episodes MPEG4 AVI Anon2112","uid":6942044,"size":514900655,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3d9691f144e368374873862b86920458f201a5c3&amp;dn=South+Park+Banned+Episodes+MPEG4+AVI+Anon2112&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Anon2112","files":4,"time":1326082449,"description":":::::::::::::::::::::::::::::::\nSouth Park: The Banned Episodes\n:::::::::::::::::::::::::::::::\n\nThese three episodes are not available via any official channel, having been removed in response to threats of violence by religious extremists.  It's a moral imperative to keep these South Park episodes freely available on the Internet world-wide.  The bastards cannot be allowed to win!  Please seed for as long as possible.  And watch them!  The episodes themselves are the best possible commentary on what has happened.  - Anon2112\n\n:::::::::::::::::::::::::::::::\n\nSouth Park - S05E03 - Super Best Friends.avi\nOriginal Air Date: 07/04/2001\nStan, Kyle, Cartman and Kenny discover David Blaine, magician and cult leader, performing in the streets of South Park. Stan finds out early that the Blainiacs are not as nice as everyone thinks. He tries to convince the other boys they've been brainwashed, but they have forsaken their friends and families. Teaming up with Jesus, Stan calls upon all the Super Best Friends to destroy the magician and thwart the mass suicide pact he has launched.\n\nFrom http://en.wikipedia.org/wiki/Super_Best_Friends:\nIn 2005, cartoon depictions of Muhammad would become controversial during the Jyllands-Posten Muhammad cartoons controversy. The creators of South Park returned to this theme in later episodes, parodying censorship attempts. The 2006 episode &quot;Cartoon Wars Part II&quot; contained an image of Muhammad, removed by Comedy Central before airing. In response, the 2010 episode &quot;200&quot; contained a &quot;depiction&quot; of Muhammad inside a bear-suit. Further controversy ensued, and one group, &quot;Revolution Muslim&quot;, warned that South Park's creators would &quot;probably wind up like Theo van Gogh&quot;. Around this time, the original &quot;Super Best Friends&quot; episode was removed from the South Park Studios website.\n\nCodec: MPEG-4 Video (XVID)\nResolution: 512x384\nFrame rate: 24\nAudio: Stereo, 48000 Hz, 128 kb/s\n\n:::::::::::::::::::::::::::::::\n\nSouth Park - S14E05 - 200.avi\nOriginal Air Date: 04/14/2010\nThis show marked South Parks 200th episode. Led by Tom Cruise, two hundred celebrities, previously ridiculed by the town of South Park, file a class action lawsuit. They demand immunity from ever being made fun of again. When Stan begs them to accept his apology, they offer impossible terms and the boys ask the Super Best Friends for help.\n\nFrom http://en.wikipedia.org/wiki/200_%28South_Park%29:\nThe day after the episode aired, the episode was available for streaming on the site. After a week, like all other episodes, it was taken off due to copyright reasons. However, the message presented to the user for this episode is &quot;We apologize that South Park Studios cannot stream this episode.&quot; The sequel episode, &quot;201&quot;, also has not been made available for streaming, but a different message describes an intent to potentially eventually post that episode. Similarly the episode and its sequel are not available to stream or buy on services Netflix, iTunes, Hulu, or Amazon on Demand. Furthermore, digital copies of these episodes that were purchased prior to their ban from digital distribution are no longer available for streaming or download.\n\nCodec: MPEG-4 Video (XVID)\nResolution: 624x352\nFrame rate: 24\nAudio: Stereo, 48000 Hz, 128 kb/s\n\n:::::::::::::::::::::::::::::::\n\nSouth Park - S14E06 - 201.avi\nOriginal Air Date: 04/21/2010\nIn the exciting conclusion to this two-part blockbuster celebrating South Parks 200th episode, angry celebrities, violent ginger kids, and Mecha Streisand face off against the Super Best Friends and the South Park faithful. Its a destructive battle on the largest scale but all everyone wants to know is, &quot;Who is Eric Cartman's father?&quot;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/201_%28South_Park%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/201_%28South_Park%29&lt;/a&gt;\n\nCodec: MPEG-4 Video (XVID)\nResolution: 624x352\nFrame rate: 24\nAudio: Stereo, 48000 Hz, 128 kb/s\n\n:::::::::::::::::::::::::::::::\n\nTorrent created 01/08/2012 by Anon2112","torrent":{"xt":"urn:btih:3d9691f144e368374873862b86920458f201a5c3","amp;dn":"South+Park+Banned+Episodes+MPEG4+AVI+Anon2112","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d9691f144e368374873862b86920458f201a5c3","infoHashBuffer":{"type":"Buffer","data":[61,150,145,241,68,227,104,55,72,115,134,43,134,146,4,88,242,1,165,195]},"announce":[],"urlList":[]}}