{"title":"Infernal Restraints--yes, Yes, YES!  Winnie Rider","uid":10353494,"size":4472976643,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3da9f18298819c3dbde390f95740f5ac84fe865c&amp;dn=Infernal+Restraints--yes%2C+Yes%2C+YES%21++Winnie+Rider&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"merzedes","files":-1,"time":1402705590,"description":"yes, Yes, YES! | Winnie Rider\n\nJune 13, 2014\n\n\niPod, Low and High bitrate MP4 + Pics.\n\n\nWinnie Rider likes pussy torture. I'm not sure why we're bothering to say anything else. She's hot, she's willing, she's literally begging for us to hurt her. Her body language says as much as her voice. She leans forward when she tells us about how much enjoyment she gets from suffering through intense pussy punishment. Whatever metal bondage devices and pain toys we bring out she will readily play with. \n\nWinnie's wearing a pretty dress but not for long. OT cuts it away quickly, revealing her banging body. Her tits are large and firm. Her pussy is shaved clean, a perfect target for his whip to crack against. Her ass is a nice round target without a blemish on it. Not yet, at least. In a few minutes it is going to have a combination of bruises from a heavy caning and the light crisscrossing red marks of a harsh whipping. \n\nShe told us that her favorite thing was pussy torture, though, and we didn't forget. OT is going to flog, cane, whip and paddle her pussy without mercy. And that won't be all that happens. Bondage isn't just for arms and legs. Clamps and hooks contort her face until she looks exactly how OT wants her to.. It's uncomfortable and distracting but nothing is going to keep her from feeling the impacts that are going to come down on her exposed cunt. \n\nBy the time her slot is filled with the cold metal dildo she is so sore. It doesn't matter. OT pounds Winnie relentlessly with the toy until she has an explosive orgasm. That doesn't begin to describe the intensity. Winnie wasn't kidding when she said she loved pussy torture. Getting abused like she did had her dripping wet and ready to blow before the steel cock was even inside of her. She's crying but it doesn't stop her from cumming.  \n\nScreens &lt;a href=&quot;\nhttp://infernalrestraints.com/device/bondage/2014/06_13wrider/InfernalRestraints-Winnie-Rider-yes-Yes-YES.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://infernalrestraints.com/device/bondage/2014/06_13wrider/InfernalRestraints-Winnie-Rider-yes-Yes-YES.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:3da9f18298819c3dbde390f95740f5ac84fe865c","amp;dn":"Infernal+Restraints--yes%2C+Yes%2C+YES%21++Winnie+Rider","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3da9f18298819c3dbde390f95740f5ac84fe865c","infoHashBuffer":{"type":"Buffer","data":[61,169,241,130,152,129,156,61,189,227,144,249,87,64,245,172,132,254,134,92]},"announce":[],"urlList":[]}}