{"title":"Connect 360 v3.55 TheKaratyChicken","uid":6759243,"size":3555615,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:3df852e45c5a45114e27ab19597dc136ac2dc41e&amp;dn=Connect+360+v3.55+TheKaratyChicken&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KARATYCHICKEN","files":-1,"time":1319147664,"description":"INTRODUCING CONNECT360\n\nYour Xbox 360 is capable of playing back your music and videos and viewing your digital photos. With Connect360, your Mac's ready to share.\n\nConnect360 automatically indexes your iTunes and iPhoto libraries and shares them to your Xbox 360. You can then use the Xbox 360 Dashboard to browse and play your media, organized in the exact same way that it is on your Mac.\n\n\nITUNES, SMART\n\nYou can browse and play your iTunes music by song, artist, album, genre or playlist. As you add and remove content to/from your iTunes library, Connect360 keeps your Xbox 360 up to date.\n\nYou can even listen to your iTunes songs while playing a game on your Xbox 360! Now that's entertainment.\n\nFurther, Connect360 can automatically update your iTunes play count and play date for songs played on your Xbox 360.\n\n\nSHOUTCAST STREAMING\n\nConnect360 now supports streaming of live Internet radio broadcasts to your Xbox 360! Simply add any station to a playlist and enjoy the live tunes from your Xbox!\n\n\nIPHOTO IN VIVID HD\n\nWith Connect360, you can view your iPhoto photo library on your television screen, they're especially beautiful in vivid high definition.\n\nBrowse by photo album or watch a slideshow, its all easy and fun!\n\n\nHD VIDEO STREAMING\n\nConnect360 now supports WMV+WMA, H.264 and MPEG4 video sharing, allowing you to stream HD quality video right to your living room!\n\n\nAUTOMAGIC TRANSCODING\n\nAutomagic transcoding Connect360 features on-the-fly automatic transcoding of many formats so that you can effortlessly enjoy your media on your Xbox 360.\n\n\nWIRED OR WIRELESS\n\nConnect360 works with both the Xbox 360 built in network port (wired) and the Xbox 360 WiFi adapter.\n\nConnect360 will automatically detect your Xbox 360 and your Xbox 360 will automatically detect your Mac running Connect360.\n\nThe built in Access Control List (ACL) feature allows you to easily limit which Xbox 360s can connect to your Mac.\n\nIt gets even easier, Connect360 can now automatically configure your built-in Mac OS X firewall with a single click!","torrent":{"xt":"urn:btih:3df852e45c5a45114e27ab19597dc136ac2dc41e","amp;dn":"Connect+360+v3.55+TheKaratyChicken","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3df852e45c5a45114e27ab19597dc136ac2dc41e","infoHashBuffer":{"type":"Buffer","data":[61,248,82,228,92,90,69,17,78,39,171,25,89,125,193,54,172,45,196,30]},"announce":[],"urlList":[]}}