{"title":"Graham Oppy &amp; N. N. Trakakis - Twentieth-Century Philosophy ","uid":11069246,"size":1909334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e3a0e8ac947ffe1cb788802e7a38d4fd5a61f4a&amp;dn=Graham+Oppy+%26amp%3B+N.+N.+Trakakis+-+Twentieth-Century+Philosophy+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"philosophi","files":-1,"time":1411247281,"description":"Graham Oppy &amp; N. N. Trakakis - Twentieth-Century Philosophy of Religion: The History of Western Philosophy of Religion (Volume 5)\n\nThe twentieth century saw religion challenged by the rise of science and secularism, a confrontation which resulted in an astonishingly diverse range of philosophical views about religion and religious belief. Many of the major philosophers of the twentieth century - James, Bergson, Russell, Wittgenstein, Ayer, Heidegger, and Derrida - significantly engaged with religious thought. Idiosyncratic thinkers, such as Whitehead, Levinas and Weil, further contributed to the extraordinary diversity of philosophical investigation of religion across the century. In their turn, leading theologians and religious philosophers - notably Buber, Tillich and Barth - directly engaged with the philosophy of religion. Later, philosophy of religion became a distinct field of study, led by the work of Hick, Alston, Plantinga, and Swinburne. &quot;Twentieth-Century Philosophy of Religion&quot; provides an accessible overview of the major strands in the rich tapestry of twentieth-century thought about religion and will be an indispensable resource for any interested in contemporary philosophy of religion.","torrent":{"xt":"urn:btih:3e3a0e8ac947ffe1cb788802e7a38d4fd5a61f4a","amp;dn":"Graham+Oppy+%26amp%3B+N.+N.+Trakakis+-+Twentieth-Century+Philosophy+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e3a0e8ac947ffe1cb788802e7a38d4fd5a61f4a","infoHashBuffer":{"type":"Buffer","data":[62,58,14,138,201,71,255,225,203,120,136,2,231,163,141,79,213,166,31,74]},"announce":[],"urlList":[]}}