{"title":"The Cuckoo's Calling ","uid":8783190,"size":1712971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e926e4396fb77ad1e8fe2c09eabb61eb865f59d&amp;dn=The+Cuckoo%27s+Calling+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"livhre","files":-1,"time":1375762307,"description":"Format: ePub\n\nDRM stripped in Calibre.\n\nWhen a troubled model falls to her death from a snow-covered Mayfair balcony, it is assumed that she has committed suicide. However, her brother has his doubts, and calls in private investigator Cormoran Strike to look into the case. \n\nStrike is a war veteran - wounded both physically and psychologically - and his life is in disarray. The case gives him a financial lifeline, but it comes at a personal cost: the more he delves into the young model's complex world, the darker things get - and the closer he gets to terrible danger . . . \n\nA gripping, elegant mystery steeped in the atmosphere of London - from the hushed streets of Mayfair to the backstreet pubs of the East End to the bustle of Soho - The Cuckoo's Calling is a remarkable book. Introducing Cormoran Strike, this is the acclaimed first crime novel by J.K. Rowling, writing under the pseudonym Robert Galbraith.\n\nFollow me on twitter: @livhre\nRequest books on twitter: @livhre\nPlease seed and rate the torrents I upload. Go to kobobooks.com and choose books that you want uploaded and request them in the comments.\nNote: Comics on that site are in some weird ass format that only works on iOS and Android. To get those I have to go through the tired process of screen shots of each page, then create a word file, then convert to epub. Its a pain because even then the images may not show up right on some devices/apps","torrent":{"xt":"urn:btih:3e926e4396fb77ad1e8fe2c09eabb61eb865f59d","amp;dn":"The+Cuckoo%27s+Calling+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e926e4396fb77ad1e8fe2c09eabb61eb865f59d","infoHashBuffer":{"type":"Buffer","data":[62,146,110,67,150,251,119,173,30,143,226,192,158,171,182,30,184,101,245,157]},"announce":[],"urlList":[]}}