{"title":"Dick Sutphen - Heart Chakra Three Masters Meditation Journeys ","uid":12006482,"size":153528595,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3f1f0672650d89c3e6f2b5813148e0371668157c&amp;dn=Dick+Sutphen+-+Heart+Chakra+Three+Masters+Meditation+Journeys+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"elessedilgirl","files":6,"time":1433888112,"description":"In the tradition of Dick Sutphen's best-selling Temple of Light and Gateless Gate Meditation Journeys:\n\nHeart Chakra Meditation: A beautiful heart-opening meditation to increase the loving abundance in your life. You'll work with your spirit guide on releasing and cleansing exercises, then combine your energies to enhance the love in your life. This meditation will create a difference in your attitudes and outlook -- guaranteed. If you desire, you can program your MP3 player to skip the awakening and go directly into the following Three Masters Meditation.\n\nThree Masters Meditation: You become the central character on an enlightening journey. Actress Maria Bello voices the female roles. You'll walk a road leading to three Masters, and each will question you about important issues in your life. The old man sitting on a bench beside the road claims to meet and work with you in your dreams. He probes who you really are. You meet beautiful LeAura in a seaside village. She has you view some aspects of your life from a new perspective. Samara is the keeper of the lighthouse, and together you will explore the value of becoming an objective &quot;observer&quot; of life. Use this enjoyable meditation semi-regularly to remain on a growth track.\n\nThese Meditation Journeys are divided into multi-tracks, making them easy to listen to one at a time.\n\n01 Heart Chakra Induction 7.43\n02 Heart Chakra Meditation 18.28\n03 Heart Chakra Awakening 1.24\n04 Three Masters Induction 4.58\n05 Three Masters Meditation 29.30\n06 Three Masters Awakening 1.34\n\nMP3 - 320 kbps - CBR\n\nSource: WebRip","torrent":{"xt":"urn:btih:3f1f0672650d89c3e6f2b5813148e0371668157c","amp;dn":"Dick+Sutphen+-+Heart+Chakra+Three+Masters+Meditation+Journeys+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f1f0672650d89c3e6f2b5813148e0371668157c","infoHashBuffer":{"type":"Buffer","data":[63,31,6,114,101,13,137,195,230,242,181,129,49,72,224,55,22,104,21,124]},"announce":[],"urlList":[]}}