{"title":"State of Decay Update 4 + DLC nosTeam","uid":9274197,"size":534477307,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:40838abea11067803f61acd307404351a160f543&amp;dn=State+of+Decay+Update+4+%2B+DLC+nosTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"m3my","files":1,"time":1385829777,"description":"This is Patch(update) 4 + DLC Breakdown for State of Decay game, its for nosTeam version of full game. It should also work on Walmart version, but i didnt test this patch, i dont have walmart version anymore. \nRequired Update 1 by Walmart OR Patch 1 by nosTEAM and patch 2, 3 nosTEAM.\n\n* If you are using nosTEAM version:\n1. Install into main directory of the game.\n2. Enjoy game :)\n\n* If you are using WALMART version, should work like old ones, dont have walmart version anymore:\n1. Install SOD_patch#4+DLC_nosTEAM.exe into main folder of the game.\n2. Copy steam_api.dll from WALMART mounted image crack folder into your SOD game folder, overwrite.\n3. Run game as administrator.\n4. Enjoy game :)\n\nBig Thanks and all credits to nosTEAM.\n\n\nPatch Notes:\n\nUI:\nÂ· Enabled Breakdown DLC selection/upsell in the Main Menu\nÂ· Fixed the translated word 'Daily' in the Status tab of the Journal being too long\nÂ· Fixed a bug that would cause the leaderboards to not sync to latest live data.\n\nContent:\n\nÂ· Overhauled our loot distribution system. (Note: The system now takes into account how much of something you already have before it tells you what is in that new container. It takes out some of the random, yes, and it also takes out the rage moment where you get your 348th Widget even though you've never once seen the Wadget.)\nÂ· We now allow any playable character to get the Badass Achievement.\nÂ· Rebalanced the use of voices throughout the character list, reducing the chance of a male voice on a female character and vice versa\nÂ· Fixed a bug that would sometimes cause Freaks to have the wrong models (!)\nÂ· Model tweaks at the southern bridge military blockade\nÂ· Fixed a bug where leaping bite attack from the rear was doing no damage\nÂ· Fix for invincibility exploit using repeated use of the dodge while standing still.\nÂ· Followers can now be killed by Freaks, but you are given ample opportunity to save them.\nÂ· Attempted to make a more natural Feral zombie interaction with vehicles\nÂ· Jacob should no longer be killed off before Ed is saved.\nÂ· Made car door kills a bit more reliable; it would sometimes clip through the zombies or not stack multiple kills correctly.\nÂ· We now make one member of generic enclaves the leader, so the entire enclave can't go missing. (They would sometimes end up in limbo and unable to join you.)\nÂ· Fixed an issue that caused neighboring enclaves to sometimes not earn trust.\nÂ· Fixed incorrect community member being expelled from your community.\n\nSave/Load:\n\nÂ· Corrupted save repair: If we find an unplayable character in a player's save game, we replace them with an appropriate character. This fixes some cases where the save game would no longer load.\nÂ· Addressed an issue where old save games would show buildings as having loot, when they in fact did not.\nÂ· Performance tweaks to improve framerate\nÂ· Fixed a rare bug that cause the game to not load\nÂ· Fixed a bug that caused the physics system to compute more than necessary.\nÂ· Fixed a crash due to a floating point exception caused by the zombie spawning system\nÂ· Leaderboard data check. Sorry, can't be more specific. Because. ","torrent":{"xt":"urn:btih:40838abea11067803f61acd307404351a160f543","amp;dn":"State+of+Decay+Update+4+%2B+DLC+nosTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40838abea11067803f61acd307404351a160f543","infoHashBuffer":{"type":"Buffer","data":[64,131,138,190,161,16,103,128,63,97,172,211,7,64,67,81,161,96,245,67]},"announce":[],"urlList":[]}}