{"title":"Jethro Tull  The Best of Acoustic","uid":5187165,"size":507660640,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:413fd4b4adf807f04b29c60c04cfb9dacfae60fe&amp;dn=Jethro+Tull++The+Best+of+Acoustic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nothingreallymatters","files":9,"time":1259520003,"description":"To some, Jethro Tull will always be associated with Ian Anderson's flute playing and more rocking, arena-worthy moments. Like Led Zeppelin, Tull was all about balancing their sonic mood swings, as they could effortlessly transform between being loud &amp; proud rock &amp; rollers to more tranquil folksmen in the blink of an eye. \n\nThe 2007 compilation, The Best of Acoustic Jethro Tull is quite self-explanatory, as the 24-track set focuses solely on the &quot;unplugged&quot; side of Tull. But some of Tull's finest moments were acoustic guitar-based,including such early classics as &quot;Mother Goose,&quot; &quot;Skating Away (On the Thin Ice of the New Day),&quot; and &quot;Fat Man&quot; (here's a fun game to play: the next time you watch the movie Boogie Nights, try to spot the scene that uses the latter song). And while the never-ending title track from Thick as a Brick is primarily a rocking prog number, its intro is certainly one of Tull's finest acoustic moments, and is included here. However, The Best of Acoustic Jethro Tull isn't just about the early-'70s era, as it includes selections from all eras, including such forgotten or oft-overlooked tracks as &quot;Jack in the Green,&quot; &quot;Weathercock,&quot; and &quot;One Brown Mouse.&quot;\n\nIf you Like Tull. You would love this one. ","torrent":{"xt":"urn:btih:413fd4b4adf807f04b29c60c04cfb9dacfae60fe","amp;dn":"Jethro+Tull++The+Best+of+Acoustic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"413fd4b4adf807f04b29c60c04cfb9dacfae60fe","infoHashBuffer":{"type":"Buffer","data":[65,63,212,180,173,248,7,240,75,41,198,12,4,207,185,218,207,174,96,254]},"announce":[],"urlList":[]}}