{"title":"Magic of Faith by Joseph Murphy.zip","uid":10402395,"size":53081091,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:41766c724a8e5136d7201a5f7496469ce4344efd&amp;dn=Magic+of+Faith+by+Joseph+Murphy.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"spaceleftblank","files":1,"time":1403387125,"description":"Murphy was born in Ireland, the son of a private boys' school headmaster and raised a Roman Catholic. He studied for the priesthood and joined the Jesuits. In his twenties, an experience with healing prayer led him to leave the Jesuits and move to the United States, where he became a pharmacist in New York (having a degree in chemistry by that time). Here he attended the Church of the Healing Christ (part of the Church of Divine Science), where Emmet Fox had become minister in 1931.[1]\n\nIn the mid-1940s, he moved to Los Angeles, where he met Religious Science founder Ernest Holmes, and was ordained into Religious Science by Holmes in 1946, thereafter teaching at Rochester, New York, and later at the Institute of Religious Science in Los Angeles. A meeting with Divine Science Association president Erwin Gregg led to him being reordained into Divine Science, and he became the minister of the Los Angeles Divine Science Church in 1949, which he built into one of the largest New Thought congregations in the country. In the next decade, Murphy married, earned a PhD in psychology from the University of Southern California and started writing. After his first wife died in 1976, he remarried to a fellow Divine Science minister who was his longstanding secretary. He moved his ministry to Laguna Hills, Calif., where he died in 1981. His wife, Dr. Jean Murphy, continued in this ministry for some years afterwards.\n\n-Wikipedia","torrent":{"xt":"urn:btih:41766c724a8e5136d7201a5f7496469ce4344efd","amp;dn":"Magic+of+Faith+by+Joseph+Murphy.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41766c724a8e5136d7201a5f7496469ce4344efd","infoHashBuffer":{"type":"Buffer","data":[65,118,108,114,74,142,81,54,215,32,26,95,116,150,70,156,228,52,78,253]},"announce":[],"urlList":[]}}