{"title":"Heartland.S03E17.Ring.of.Fire.WS.XviD-err0001.avi","uid":5453151,"size":367042560,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:41a7dfc839938c6b7347814b7dc2aa06b5c86c40&amp;dn=Heartland.S03E17.Ring.of.Fire.WS.XviD-err0001.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"err0001","files":-1,"time":1269253936,"description":"Heartland S03E17: Ring of Fire\n\nThe resolution is 608x352 and the quality is pretty good in my opinion. This episode aired on CBC on Mar 21, 2010. The next new episode will be the season finale next Sunday, March 28. \n\nIn this episode, Amy's skills and ability to work with horses - along with her self-confidence - are really put to the test, as she enters a professional colt starting competition.\n\nWhat's a colt starting competition, you might ask? It's a 3-day event where each competitor is given a wild colt and has to gentle it in a certain amount of time. The participants are judged on their ability and results.\n\nThis was an event Amy's mother Marion used to compete in, and watching Amy in the ring brings back memories for Jack and Tim, who are there in the stands rooting for her, along with Ty, whose support and encouragement never waivers.\n\nThis competition is no walk in the park however, as she is competing against two seasoned pros - Garret, a professional cowboy and a true gentleman and sportsman, played by Heartland's real stunt coordinator Tom Eirikson, and a brash young competitor named Chase, played by guest star Torrance Coombs, who you may have seen on &quot;jPod,&quot; or as Culpepper on &quot;The Tudors.&quot;\n\nAnd some of you may recognize the ring announcer, played by Hugh McLennan, voice of the popular Spirit of the West Radio Show.\n\nOutside the competition Caleb goes through physical rehab to get back on the rodeo circuit as Ashley questions where their relationship is going and Mallory learns a lesson in friendship.\n\n\nepisode description information is from the blog at http://www.cbc.ca/heartland/\n","torrent":{"xt":"urn:btih:41a7dfc839938c6b7347814b7dc2aa06b5c86c40","amp;dn":"Heartland.S03E17.Ring.of.Fire.WS.XviD-err0001.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41a7dfc839938c6b7347814b7dc2aa06b5c86c40","infoHashBuffer":{"type":"Buffer","data":[65,167,223,200,57,147,140,107,115,71,129,75,125,194,170,6,181,200,108,64]},"announce":[],"urlList":[]}}