{"title":"Make Difficult People Disappear:  Deal with Stressful Behavior ","uid":8343112,"size":1161419,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41c478b0eedbb862a1995f9da17491afb260e112&amp;dn=+Make+Difficult+People+Disappear%3A++Deal+with+Stressful+Behavior+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365136102,"description":"\nMake Difficult People Disappear: How to Deal with Stressful Behavior and Eliminate Conflict by Monica Wofford\nWiley | 2012 | ISBN: 111827380X | English | 196 Pages | EPUB | 1.10 MB\n\nSave your organization by building the skills to deal with difficult people\nWe all have to work with people we can't stand to be around. Our challenge is to find creative ways to handle these difficult people. In the fable Make Difficult People Disappear, the skills and strategic plan needed to change your mindset are told through a clear, concise story. By first understanding the four main personality types in the workplace, Commander, Organizer, Relater, and Entertainer, readers can then devise effective strategies for diffusing unproductive and damaging behavior.\n\nThis book serves to change the mindset and behavior of people who deal with difficulty on a regular basis.\n\n* Wofford describes how through understanding our behavior differences and natural reactions to stress, that utilizing a plan based on these differences the difficulty simply seems to disappear\n* Advises everyone from frustrated executives to entrepreneurs tired of dealing with difficult people who suck the life out of their organizations","torrent":{"xt":"urn:btih:41c478b0eedbb862a1995f9da17491afb260e112","amp;dn":"+Make+Difficult+People+Disappear%3A++Deal+with+Stressful+Behavior+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41c478b0eedbb862a1995f9da17491afb260e112","infoHashBuffer":{"type":"Buffer","data":[65,196,120,176,238,219,184,98,161,153,95,157,161,116,145,175,178,96,225,18]},"announce":[],"urlList":[]}}