{"title":"Downie2.1.6.dmg","uid":12330055,"size":21205504,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:432d048c9445604d03780c2e30621c842e3d8016&amp;dn=Downie2.1.6.dmg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":9,"uploader":"Q8Wolfy","files":1,"time":1441173233,"description":"Downie 2\n\nDownie is the only video download for OS X you will ever need. It isn't simply another YouTube-downloader: Downie supports at this moment over 750 different sites! The full list may be viewed in Downie's preferences, under the Sites tab.\n\nWith each update, we add several new sites as per your requests - just send us a link to a web page that doesn't work and we'll most likely add it in the next update!\n\nKey features:\nSupports many sites - currently supports over 750 different sites (including YouTube, Vimeo, etc.) and the number is rapidly growing.\n4K video YouTube support - unlike many other YouTube downloaders, Downie supports HD video on YouTube, up to 4K.\nPostprocessing - need your video in MP4 for iTunes? Or want just the audio track? No problem, Downie can handle this for you automatically!\nQuick support - I respond to emails usually within 24 hours and often add support for requested sites in the next update.\nFrequent updates - Don't wait weeks for new sites to be supported, or bugs to be fixed! Downie is updated about once a week with new features, sites supported, etc.\nInternational - not only that Downie supports country-specific sites, it is localized into various languages. If your language is missing, contact us - we can offer you a free license in exchange for a translation.\nWhat's new in 2.0?\nNow requires OS X 10.9+. If you are still running OS X 10.8, do not install.\nAbility to pause and resume downloads (note that quitting Downie will cancel the download completely).\nAutomatic retry on network failure.\nHTTP downloads are now split into chunks (if supported by server), hence possibly speeding up downloads.\nAutomatic login detection. If your site requires you to login, Downie will pick this up and allow you to login using an inner browser.\nAdditional extraction methods. By default, Downie analyzes the source code of the web site and tries to extract a video file. This has the advantage of allowing you to often pick from several video qualities, but this method can miss on some media files. If Downie fails to find something on the page by analyzing it, it goes on to actually loading the page in an inner browser and looking for dynamically loaded media files.\nSee what videos are currently popular - there's a blue button right in the toolbar of the main window that shows the top 25 popular videos.\nSearch YouTube, Vimeo and more right from within the app.\nNow also downloads DMG, ZIP, RAR. We're accepting requests for non-video sites now as well.\nImage previews. Supported sites will now show image previews of the videos.\nHere's a few tips for using Downie:\n\nTo start, you can drag a link from any browser either on Downie's window, or the icon in the Dock.\nIf you have more links, or links within some text, just drop the whole thing onto Downie - it will scan the text for links.\nYou can use copy and paste as well - just press Command-O in Downie and you can insert all the links in the world!","torrent":{"xt":"urn:btih:432d048c9445604d03780c2e30621c842e3d8016","amp;dn":"Downie2.1.6.dmg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"432d048c9445604d03780c2e30621c842e3d8016","infoHashBuffer":{"type":"Buffer","data":[67,45,4,140,148,69,96,77,3,120,12,46,48,98,28,132,46,61,128,22]},"announce":[],"urlList":[]}}