{"title":"Thomas Merton - Dialogues with Silence: Prayers and Drawings (pd","uid":8182090,"size":2282196,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:434d851549fb336c1f212064db6cbab2876731ac&amp;dn=Thomas+Merton+-+Dialogues+with+Silence%3A+Prayers+and+Drawings+%28pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1361644169,"description":"Thomas Merton (edited by Jonathan Montaldo) - Dialogues with Silence: Prayers and Drawings (HarperOne, 2001). 189 pages.\n\npdf, semi-retail source. \n\nShort description:\n\nBrief collection of Merton's prayers and drawings.\n\nDescription:\n\nThomas Merton loved life with the passion of a romantic poet. At the age of twenty-six he chose to become a Trappist monk and began to pursue his ultimate, lifelong passion. From his austere quarters at Our Lady of Gethsemani Abbey in Trappist, Kentucky, Merton worked to change the world and to come closer to his God. The drawings and prayers in this volume are the intimate, beautifully rendered record of that pursuit -- Merton's dialogue with God. The prayers have been gathered from all of Merton's writings -- his books, journals, letters -- and are collected here, along with his largely unknown drawings, for the first time.In his drawings we see the evolution of Merton's art from purely representational to the more abstract, reflecting his interest in Zen and Eastern cultures. It is easy to see that art was in his genes; both of his parents were artists. With each prayer and in every brushstroke, we sense the depth of Merton's passion as we pause and incline our ear to his voice offering these heartfelt songs to God and to the world. &quot;Dialogues with Silence invites the reader to enter into that sacred realm of contemplation where we listen in silence and await the divine presence in our lives, where emptiness becomes the juncture for the interchange between the outer and inner worlds, where darkness is transformed into light -- the place where the voice of God is revealed.","torrent":{"xt":"urn:btih:434d851549fb336c1f212064db6cbab2876731ac","amp;dn":"Thomas+Merton+-+Dialogues+with+Silence%3A+Prayers+and+Drawings+%28pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"434d851549fb336c1f212064db6cbab2876731ac","infoHashBuffer":{"type":"Buffer","data":[67,77,133,21,73,251,51,108,31,33,32,100,219,108,186,178,135,103,49,172]},"announce":[],"urlList":[]}}