{"title":"Get Rid of Herpes by Sarah Wilcox","uid":8107082,"size":326985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43567f7d54e2c8ae08e9736390021f1627bd6dd2&amp;dn=Get+Rid+of+Herpes+by+Sarah+Wilcox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mybmdub","files":1,"time":1360096794,"description":"This is the eBook by Sarah Wilcox called Get Ride of Herpes.\n\n***********************************************************\n\nIn mid 2011 after months of tweaking and trialing without an outbreak I decided to publish  the method online as a full and easy to follow protocol, it's true there were already snippets of the herpes remedy scattered here and there but nothing that offered the whole story &amp; a full, concise &amp; easy to follow treatment method, which is what most of us need. \n\nSince publishing,  the response I received was simply  staggering &amp; very inspiring.  This method was more than just a lucky fluke which just happened to work for me, No.. This herpes remedy actually worked &amp; helped most of the people who applied and followed the instructions. \n\nI've received countless comments like the one's below:\n\n \n\nHaven't had an outbreak since using your info\n\n&quot;Herpes has plagued me on and off for over 5 years. Thought I had tried every way to get rid of herpes until I read your book. I can't say if this will cure my herpes for sure but I haven't had an outbreak since using your info, coincidence?, not sure yet I'll keep you informed&quot;.\nThank You, Becca (Customer Comments) \n\n \n\nVery useful for the condition as mine has improved since\n\n&quot;Hi, I recently purchased your get rid of herpes report. I found the information very useful for the condition as mine has improved since. I was impressed by the whole automated payment, delivery and ease with which I could download your product&quot;.\n\nRegards Isla T  (Customer Comments) \n\n \n\nBlisters gone in 2 days\n\n&quot;All I can say is a huge thank you, as after just two days the blisters were gone. I am now three weeks in to the protocol and no outbreaks since, everything is going great&quot;\nMark (UK)  (Customer Comments)","torrent":{"xt":"urn:btih:43567f7d54e2c8ae08e9736390021f1627bd6dd2","amp;dn":"Get+Rid+of+Herpes+by+Sarah+Wilcox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43567f7d54e2c8ae08e9736390021f1627bd6dd2","infoHashBuffer":{"type":"Buffer","data":[67,86,127,125,84,226,200,174,8,233,115,99,144,2,31,22,39,189,109,210]},"announce":[],"urlList":[]}}