{"title":"Anesthesia Student Survival Guide: A Case-Based Approach","uid":6512217,"size":11740537,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44217d8329c61e5e3f887d0de56cb2e0e07c8229&amp;dn=Anesthesia+Student+Survival+Guide%3A+A+Case-Based+Approach&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1309675327,"description":"Jesse M. Ehrenfeld, Richard D. Urman, Scott Segal, &quot;Anesthesia Student Survival Guide: A Case-Based Approach&quot; \n Publisher: Springer | ISBN: 0387097082 | edition 2010 | PDF | 519 pages | 11.1 mb\n\n Anesthesia Student Survival Guide: A Case-Based Approach is an indispensable introduction to the specialty. This concise, easy-to-read, affordable handbook is ideal for medical students, nursing students, and others during the anesthesia rotation. Written in a structured prose format and supplemented with many diagrams, tables, and algorithms, this pocket-sized guide contains essential material covered on the USMLE II-III and other licensing exams. The editors, who are academic faculty at Harvard Medical School, summarize the essential content with 32 informative and compelling case studies designed to help students apply new concepts to real situations. Pharmacology, basic skills, common procedures and anesthesia subspecialties are covered, too, with just the right amount of detail for an introductory text. The unique book also offers a section containing career advice and insider tips on how to receive good evaluations from supervising physicians. With its combination of astute clinical instruction, basic science explanation, and practical tips from physicians that have been there before, this handbook is your one-stop guide to a successful anesthesia rotation.","torrent":{"xt":"urn:btih:44217d8329c61e5e3f887d0de56cb2e0e07c8229","amp;dn":"Anesthesia+Student+Survival+Guide%3A+A+Case-Based+Approach","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44217d8329c61e5e3f887d0de56cb2e0e07c8229","infoHashBuffer":{"type":"Buffer","data":[68,33,125,131,41,198,30,94,63,136,125,13,229,108,178,224,224,124,130,41]},"announce":[],"urlList":[]}}