{"title":"Blue.Planet.e06.Coral.Seas.720p.x264","uid":5031776,"size":1467041989,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:44b06b34a6b414012380fd5f949c0a3eb6f0a128&amp;dn=Blue.Planet.e06.Coral.Seas.720p.x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"n3ttik","files":1,"time":1248947969,"description":"BBC - Blue Planet - Coral Seas - 720p\n\nBroadcast 17 October 2001, the next instalment is about coral reefs, which are so crowded that they play host to a perpetual battle for space, even among the coral itself. It starts life as a larva that becomes a polyp. Having multiplied, it hardens into a limestone skeleton and grows to form a reef. As the community flourishes, animals develop relationships with one another and such a place can feature a huge variety of ocean life. Although corals feed nocturnally on plankton, sunlight is vital because even though they are animals, each contains millions of single-celled algae. This in turn is the favoured sustenance of the humphead parrotfish, whose jaws are so powerful that it erodes much of the reef into fine sand. Algae also grows on the top of the reef and a battle for grazing rights between shoals of powder blue and convict tangs is shown, the former being initially overwhelmed by the latter's weight of numbers before regaining the upper hand. The night-time hunting of a marbled ray alerts other predators and a group of whitetip reef sharks moves in, from which few are safe. Several breeding strategies are examined, including the acrobatic habits of brown surgeonfish and the colourful courtship of the flamboyant cuttlefish. Humpback whales are visitors to the reef and males establish their seniority by the loudness and strength of their song. Being fixed to the seabed, corals must synchronise their reproduction with lunar phases and the rising spring temperatures.","torrent":{"xt":"urn:btih:44b06b34a6b414012380fd5f949c0a3eb6f0a128","amp;dn":"Blue.Planet.e06.Coral.Seas.720p.x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44b06b34a6b414012380fd5f949c0a3eb6f0a128","infoHashBuffer":{"type":"Buffer","data":[68,176,107,52,166,180,20,1,35,128,253,95,148,156,10,62,182,240,161,40]},"announce":[],"urlList":[]}}