{"title":"Europa - Complete Trilogy by Joseph Robert Lewis","uid":10407504,"size":1119034,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44b17bc7fe5a6def133ac2738a9cf2c85fea1394&amp;dn=Europa+-+Complete+Trilogy+by+Joseph+Robert+Lewis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":1,"time":1403475866,"description":"\nThis collection includes all three books in the Europa series of dark fantasy adventures: Omar the Immortal, Freya the Huntress, and Wren the Fox Witch.\n\nOmar the Immortal\n\nOmar Bakhoum has walked the earth for four thousand years, trying to unlock the mysteries of life and death. In Marrakesh he joins an airship expedition beyond the glaciers of northern Europa in search of a legendary country called Ysland. There, he hopes to learn about the aether mist that reveals the walking dead and the strange metal called sun-steel that can capture a human soul.\n\nFreya the Huntress\n\nLast night, Freya's sister was bitten by a horrific beast in the snowy hills of Ysland. Now, Freya has only a few hours to find a cure for this strange plague before her sister becomes a ravening fox demon.\n\nWren the Fox Witch\n\nWren has followed the mysterious Omar Bakhoum from her home in Ysland across the frozen wastes of Europa to the warring cities of Constantia and Stamballa, where war is the least of Wren's problems. On steam-driven ironclads she encounters more of Omar's immortal brethren, and in the icy streets she finds a legion of frozen corpses waging a war of their own against the living.\n\nGenre: Sci-Fi/Fantasy","torrent":{"xt":"urn:btih:44b17bc7fe5a6def133ac2738a9cf2c85fea1394","amp;dn":"Europa+-+Complete+Trilogy+by+Joseph+Robert+Lewis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44b17bc7fe5a6def133ac2738a9cf2c85fea1394","infoHashBuffer":{"type":"Buffer","data":[68,177,123,199,254,90,109,239,19,58,194,115,138,156,242,200,95,234,19,148]},"announce":[],"urlList":[]}}