{"title":"Affluenza (Hard to Find PBS Documentary)","uid":3891008,"size":476404523,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4616c886dea36c61ff5fc1928576bfc7a9ed9e8e&amp;dn=Affluenza+%28Hard+to+Find+PBS+Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SkepticalProgressive","files":2,"time":1195040204,"description":"Af-flu-en-za n. 1. The bloated, sluggish and unfulfilled feeling that results from efforts to keep up with the Joneses. 2. An epidemic of stress, overwork, waste and indebtedness caused by dogged pursuit of the American Dream. 3. An unsustainable addiction to economic growth. 4. A television program that could change your life. \n\nAffluenza is a one-hour television special that explores the high social and environmental costs of materialism and overconsumption. \n\nThrough revealing personal stories, expert commentary, hilarious old film clips, dramatized vignettes, and \\&quot;anti-commercial\\&quot; breaks, Affluenza examines the high cost of achieving the most extravagant lifestyle the world has ever seen. \n\nLast year, Americans, who make up only five percent of the world\\&amp;#039;s population, used nearly a third of its resources and produced almost half of its hazardous waste. Add overwork, personal stress, the erosion of family and community, skyrocketing debt, and the growing gap between rich and poor, and it\\&amp;#039;s easy to understand why some people say that the American Dream is no bargain. Many are opting out of the consumer chase, redefining the Dream, and making \\&quot;voluntary simplicity\\&quot; one of the top 10 trends of the \\&amp;#039;90s. \n\nAffluenza travels across the country to show you men and women who are working and shopping less, spending more time with friends and family, volunteering in their communities, and enjoying their lives more. A brief sampling: \n\nIn Colorado Springs, religious conservatives worry about the impact of materialism on American life, advertisements invade the local school district, and a family struggles with a potent case of Affluenza . \n\nIn Seattle, Vicki Robin and Joe Dominguez, authors of the best-selling book, Your Money or Your Life, help others get off the work-and-spend treadmill to find more meaning in their lives. \n\nIn Vancouver, Canada, activists known as \\&quot;Adbusters\\&quot; design humorous \\&quot;subvertisements\\&quot; that expose how advertisements manipulate us. \n\nIn Redmond, Washington, two teenagers create an award-winning play that spoofs the materialistic life of Barbie dolls. \n\nAffluenza is hosted by National Public Radio\\&amp;#039;s engaging Scott Simon. It was produced by John de Graaf and Vivia Boe, the team who produced the critically acclaimed PBS special on another American epidemic, Running Out of Time. Affluenza is a production of KCTS/Seattle and Oregon Public Broadcasting and was made possible by a grant from The Pew Charitable Trusts.","torrent":{"xt":"urn:btih:4616c886dea36c61ff5fc1928576bfc7a9ed9e8e","amp;dn":"Affluenza+%28Hard+to+Find+PBS+Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4616c886dea36c61ff5fc1928576bfc7a9ed9e8e","infoHashBuffer":{"type":"Buffer","data":[70,22,200,134,222,163,108,97,255,95,193,146,133,118,191,199,169,237,158,142]},"announce":[],"urlList":[]}}