{"title":"Never Unarmed, by Lynn Thompson, of Cold Steel","uid":10821718,"size":42697766912,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:46e73cb9fe64b5f5295f11c29950b6c62b313cd7&amp;dn=Never+Unarmed%2C+by+Lynn+Thompson%2C+of+Cold+Steel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":null,"files":109,"time":1408544661,"description":"&quot;Never Unarmed&quot; is a new six disc DVD compilation from Cold Steel. It features Lynn Thompson, the president of Cold Steel, explaining and demonstrating his significant knowledge and talents with a variety of firearms. \n\nA free man has the inalienable, God given right to defend his person, family, loved ones and property from violent assault, unlawful seizure, confiscation, or trespass. Since firearms are currently at the top of the force continuum it is essential that a free man possess them in abundance and be skilled in their use or he will not long enjoy his precious freedom. Never Unarmed is a very broad look at an enormously wide subject; the firearms and ammunition you need to own or acquire for recreation, hunting, survival, and self-defense.\n\nFilmed over 2 1/2 years, it's a HUGE undertaking and features Lynn C. Thompson with the gloves off as he discusses the pros and cons of air guns, .22 handguns, .22 rifles, mini revolvers, pocket pistols, service revolvers, service pistols, big bore handguns, single shot handguns, single shot rifles, double rifles, bolt action rifles, pump action rifles, lever action rifles, semi auto rifles, single and double shotguns, pump action shotguns, and semi automatic shotguns. In format, Never Unarmed will be mostly show and tell, with tactical and training insights from time to time, as well as thought provoking demonstrations regarding the use of cover, concealment, improvised fighting positions, home-made shields and much much more. At times the presentation can become quite graphic as Lynn teaches how to defend yourself against dangerous animals as well as how to neutralize violent human adversaries.\n\nMeant for an international audience, it offers lots of options for those who don't enjoy the freedom, security and access to justice we do in the U.S.A. and are already severely restricted in their ability to keep and bear arms.\n\nAbsolutely chock full of non stop action, graphic demonstrations, and exciting feats of speed, accuracy, and fire power, Never Unarmed is guaranteed to blow you away and change the way you look at and think about firearms forever.\n\nDisc 1A\nAir Guns and Mini Revolvers\nDisc 1B\nPocket Pistols and .22 Handguns\n\nDisc 2A\n.22 Rifles and Service Revolvers 1\nDisc 2B\nRevolvers 2 and Service Pistols\n\nDisc 3A\nBig Bore Revolvers and Single Shot Pistols\nDisc 3B\nSingle Shotguns/Rifles and Double Shotguns\n\nDisc 4A\nPump Action and Semi-automatic Shotguns\nDisc 4B\nBolt Action Rifles\n\nDisc 5A\nLever Action Rifles\nDisc 5B\nSemi-automatic Rifles\n\nDisc 6\nBig Bore Rifles\n","torrent":{"xt":"urn:btih:46e73cb9fe64b5f5295f11c29950b6c62b313cd7","amp;dn":"Never+Unarmed%2C+by+Lynn+Thompson%2C+of+Cold+Steel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46e73cb9fe64b5f5295f11c29950b6c62b313cd7","infoHashBuffer":{"type":"Buffer","data":[70,231,60,185,254,100,181,245,41,95,17,194,153,80,182,198,43,49,60,215]},"announce":[],"urlList":[]}}