{"title":"FF Kay Glass - Just One Bite (Part 1 and 2)","uid":9013825,"size":586568,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:46fba627ab1de0fb4f30f6b1582ea06608b336b7&amp;dn=FF+Kay+Glass+-+Just+One+Bite+%28Part+1+and+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kiralou","files":2,"time":1381158174,"description":"Love Bite (Just One Bite #1)\n\nDiandra Malone is only 28 years old when her life changes forever. Years of infertility left her depressed, but she's finally pregnant. Before she has a chance to process the news, she finds out her husband has been brutally murdered. \n\nLizbeth Snyder was a cop before she was framed for a crime she didn't commit and kicked off the force. Living a desperate life on the streets, salvation comes from the oddest direction: the finding of Jonah Malone's body. \n\nNow she's living a wonderful life with Diandra and baby RaeLynn. The downside? Diandra is a vampire, and Lizbeth is being hunted by a very dangerous vampire- dangerous, and held in high esteem in the community. What will the future bring for these women, and how will Diandra handle her new vampire life? Find out how life changes with just one bite...\n\nBitten By Regret (Just One Bite #2) \n\nFour months can change so many things. Diandra has come to terms with being a vampire and what that means for her. Lizbeth has landed a new case, and it's a nasty one: someone is selling tainted heroin on the Delaware streets, a potent mix that's intended to kill. Jonah returns, seeking a favor from his former wife, and grudgingly from her new love as well. Is a favor all he wants, or is he seeking a way back to the life he had before? RaeLynn is older, growing more every day. This special baby has more tricks up her tiny sleeves! \n\nLizbeth races the clock to stop the tainted drugs from killing anyone else, while Diandra deals with the regret she feels over the twists her life has taken with just one bite.","torrent":{"xt":"urn:btih:46fba627ab1de0fb4f30f6b1582ea06608b336b7","amp;dn":"FF+Kay+Glass+-+Just+One+Bite+%28Part+1+and+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46fba627ab1de0fb4f30f6b1582ea06608b336b7","infoHashBuffer":{"type":"Buffer","data":[70,251,166,39,171,29,224,251,79,48,246,177,88,46,160,102,8,179,54,183]},"announce":[],"urlList":[]}}