{"title":"Gary Wright - Touch And Gone [1977][2008][320 KBPS]","uid":8178752,"size":148609658,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:47306daa09c8c0b8df720bcb61cca4f8665e40db&amp;dn=Gary+Wright+-+Touch+And+Gone+%5B1977%5D%5B2008%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"LameDuck69","files":14,"time":1361583011,"description":"Gary Wright - Touch And Gone [1977][2008][Bonus Tracks]\n\n\n\n\n\n01 Touch And Gone\n02 Starry Eyed\n03 Something Very Special\n04 Stay Away\n05 Night Ride\n06 Sky Eyes\n07 Lost In My Emotions\n08 Can't Get Above Losing You\n09 The Love It Takes\n10 Touch An Gone [Disco Mix][Bonus Track]\n11 Can't Get Above Losing You [Alternate Version][Bonus Track\n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nGary Malcolm Wright (born April 26, 1943) is an American musician, best known for his songs &quot;Dream Weaver&quot; and &quot;Love Is Alive&quot; as well as his work with the British band Spooky Tooth.\n\nWright was born and raised in Cresskill, New Jersey. He attended Tenafly High School in Tenafly, New Jersey.\n\nA former child actor, Wright appeared in the 1954 original Broadway production of the long-running musical, Fanny (888 performances), having originated the role of Acolyte and then subsequently replacing Lloyd Reese in the role of Cesario, the son of Fanny. The title role of Fanny was originated by Florence Henderson who later gained worldwide fame as matriarch Carol Brady in the long-running TV series, The Brady Bunch. According to Henderson, Reese had to be replaced by Wright because (in her own words): &quot;He (Reese) was a New York boy and puberty struck very early. It wasn't long till he looked like my boyfriend!&quot;\n\nIn 1959, Wright made his first commercial recording with Billy Markle as the duo Gary &amp; Billy for the 20th Century Fox Records record label. The songs released were &quot;Working After School&quot; and &quot;Lisa&quot;. In the 1960s, Wright went to Europe to continue studying psychology. In 1967, he joined the band Spooky Tooth as singer and keyboardist. In 1970 Wright was involved as a record producer with the Liverpool based folk music band Arrival, and he was also a member of the folk rock band Howl the Good who had played alongside Arrival at the Isle of Wight Festival 1970. During this period, he also befriended George Harrison and was invited to contribute piano to Harrison's All Things Must Pass. Around this time he also played piano on Nilsson's &quot;Without You&quot;. On November 23, 1971, Wright appeared on an episode of The Dick Cavett Show in a band called Wonder Wheel, performing &quot;Two Faced Man&quot;, a song he wrote. George Harrison plays slide guitar in this band as a favor, since Wright had played piano on Harrison's album All Things Must Pass. The episode can be viewed on the DVD The Dick Cavett Show: Rock Icons: Disc 3.\n\nAfter Spooky Tooth split in 1974, Wright continued his solo career, culminating in his album The Dream Weaver and its title track &quot;Dream Weaver&quot;. The single peaked at #2 for three weeks on the Billboard Hot 100 in 1976, sold over one million copies. The song was awarded a gold disc by the RIAA in March 1976. It has been featured in the Wayne's World feature film and soundtrack album as well as in the feature films The People vs. Larry Flynt (1996) and Toy Story 3 (2010).\n\nLater in 1976, his follow-up single &quot;Love Is Alive&quot; also reached #2, for two weeks. Ronnie Montrose played guitar on the song &quot;Power of Love&quot; from the album. The Dream Weaver was a hit album, becoming multi-platinum. However, Wright's subsequent releases were not nearly as popular, either critically or commercially, and his career quickly stalled. But Wright continued to make albums throughout the 1970s, 1980s, and 1990s. Wounded Bird Records reissued The Light of Smiles, Touch and Gone, Headin' Home and The Right Place in October 2008; all except Headin' Home featured extra tracks.\n\nWright's last success on the Billboard Hot 100 was in 1981, when he returned with &quot;Really Wanna Know You&quot; (co-written by Ali Thomson). His 1981 song &quot;Comin' Apart&quot;, from the album The Right Place, was sampled by Armand Van Helden for the 2004 club song titled &quot;My My My&quot;. The song was remixed in 2006 by Andreas S. Jensen. &quot;Heartbeat&quot;, also from The Right Place, was re-recorded in 2007 as a dance track by Topmodelz. In 1984 Chaka Khan included her cover version of &quot;Love Is Alive&quot; (re-titled &quot;My Love Is Alive&quot;) on her album I Feel for You.\n\nIn 1986, Wright contributed the song &quot;Hold On to Your Vision&quot; to the soundtrack of the Sylvester Stallone movie Cobra. &quot;Better By You, Better Than Me,&quot; a song written by Wright for Spooky Tooth, was covered by Judas Priest on their 1978 album Stained Class.\n\nIn 2008, Wright toured with Ringo Starr &amp; His All-Starr Band. In November 2008, Wright released the six-track EP, Waiting to Catch the Light, on the Larkio Music label. In late 2008, Wright also released The Light of a Million Suns, which featured a re-recorded version of &quot;Love Is Alive&quot; in which son Dorian gets a recording credit.\n\nIn 2010, Wright toured again with Ringo Starr &amp; His All-Starr Band, along with Rick Derringer, Edgar Winter, Richard Page, Wally Palmer, and Gregg Bissonette. Wright released an album in June 2010 called Connected. Special guests on the record include Ringo Starr, Joe Walsh, and Jeff &quot;Skunk&quot; Baxter.\n\nWright resides in Palos Verdes Estates, California with wife Rose. He has two adult sons, Dorian and Justin. Justin is a member of the band Intangible.\n\n","torrent":{"xt":"urn:btih:47306daa09c8c0b8df720bcb61cca4f8665e40db","amp;dn":"Gary+Wright+-+Touch+And+Gone+%5B1977%5D%5B2008%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47306daa09c8c0b8df720bcb61cca4f8665e40db","infoHashBuffer":{"type":"Buffer","data":[71,48,109,170,9,200,192,184,223,114,11,203,97,204,164,248,102,94,64,219]},"announce":[],"urlList":[]}}