{"title":"Kay Griggs - CIA - Gay, Saudi Prince &amp; Manservant - DVD","uid":5889101,"size":4584538112,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:480c4066c4020e27c48a472f304da06bf1d95cc3&amp;dn=Kay+Griggs+-+CIA+-+Gay%2C+Saudi+Prince+%26+Manservant+-+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"shareallnwo","files":-1,"time":1287166375,"description":"Kay Griggs - CIA - Gay, Saudi Prince &amp; manservant - FIGHT In Hallway\n\nMany years ago someone was told by members of the elites that homosexuality is used to maintain cohesion among the men and women once they get into the circle of real power. (The Nazi men who escaped to South America when WWII was almost over maintained this structure of living. The reason given by the Nazis was that females are not to be trusted and that they stir up disharmony amongst the men when brought into the center of power.) The females, heterosexuals, are kept outside the center of power. Kay touched on the subject a little, but she could not understand why, the reason for it.\n\n---------------------------\n\nGagaT Discussion / Saudi prince sexually abuses and kills manservant:\n\nAwhile back some one posted a video documentary from Kay Griggs, whose husband was CIA and was one of the men who brought over the then young Saudi princes to the United States to attend private school. She was told by her CIA husband that they (he and the other guys) introduced gay sex to the Saudi princes and had sex with them many, many times. The boys then were of preteen and teen ages. \n\nThe DVD totals over 7 hours, but the footage is packed with information told to her by her CIA husband. If you do watch the video you will understand more about why the world is so fucked up.\n\n---------------------------\n\nArticle:\n\nhXXp://www.breitbart.com/article.php?id=CNG.5b3e724751faa659e1b7987bc2c3ee02.281&amp;show_article=1\n\nSaudi prince strangled servant at London hotel - gay lover, escort\n\nOct 5, 2010, 12:03 PM US/Eastern\n\nSaudi Prince Saud Bin Abdulaziz Bin Nasir Bin Abdulaziz al Sau -- seen here through a tinted window of a police van in February 2010 -- strangled and beat his male servant to death during an apparent sex attack in a London hotel room, a British court has heard.\n\n\nA gay Saudi prince beat and strangled his male servant to death in a frenzied sexual assault at their luxury London hotel suite, a court heard on Tuesday.\n\nSaud Bin Abdulaziz Bin Nasir al Saud, 34, who is a grandson of Saudi Arabia's King Abdullah, killed Bandar Abdullah Abdulaziz on February 15 after abusing him for weeks, the court heard.\n\nThe 32-year-old victim was found with severe injuries including bite marks on his cheeks in a bloodstained bed in the suite at the Landmark Hotel, which he was sharing with the prince, prosecutors said.\n\nProsecutor Jonathan Laidlaw told the jury at the Old Bailey in London, England's Central Criminal Court, that Saud had admitted the lesser charge of manslaughter but denied murder and a separate count of grievous bodily harm.\n\nLaidlaw said the two men had been staying together at the hotel for nearly a month as part of an &quot;extended holiday&quot; that had also taken them to Italy, Hungary, the Czech Republic and Morocco.\n\nSaud had claimed the pair were friends and that he was heterosexual, but the court heard the prince had ordered gay escorts in London and had frequently looked at websites for gay massage parlours and escort agencies.\n\n&quot;The defendant's concealing of the sexual aspect to his abuse of the victim was for altogether more sinister reasons and it tends to suggest that there was a sexual element to the circumstances of the killing,&quot; said Laidlaw.\n\nBloodstains found on the pillow and the room were &quot;consistent with the victim having been the subject of a series of separate assaults before he was killed&quot;, he added.\n\nSaud told police they drank at the hotel bar until the early hours of the morning on February 15 before returning to the room and that when he woke in the afternoon he could not rouse the victim, the court heard.\n\nThe prince was &quot;shocked and upset&quot; and had tried to clean up some of the blood and wash some of Abdulaziz's bloodstained clothing when hotel staff and a Saudi embassy staffer came to the room, Laidlaw said.\n\nA post-mortem found that Abdulaziz had suffered heavy blows to the head, injuries to the brain and ears and severe neck injuries which were &quot;consistent with an episode of manual compression&quot;.\n\nThere were also bite marks on the cheeks which had &quot;an obvious sexual connotation&quot;, Laidlaw said. The injuries showed the &quot;ferocity of the attack to which he had been subjected,&quot; he added.\n\nThe prince had attacked his servant on several previous occasions, including one that was caught on security camera footage in the hotel's lift in January, he said.\n\nThe jury was shown the footage in which Abdulaziz was seen cowering as Saud rained blows on his head.\n\nThe prince appeared in the dock with a shaven head and listening through an interpreter. His father is a nephew of King Abdullah and his mother is one of the king's daughters.\n","torrent":{"xt":"urn:btih:480c4066c4020e27c48a472f304da06bf1d95cc3","amp;dn":"Kay+Griggs+-+CIA+-+Gay%2C+Saudi+Prince+%26+Manservant+-+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"480c4066c4020e27c48a472f304da06bf1d95cc3","infoHashBuffer":{"type":"Buffer","data":[72,12,64,102,196,2,14,39,196,138,71,47,48,77,160,107,241,217,92,195]},"announce":[],"urlList":[]}}