{"title":"Procrastination: Stop Fucking Procrastinating And Do Some Work","uid":14247743,"size":530612,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4855a8bc422c68484a775d8c3112282825a50469&amp;dn=Procrastination%3A+Stop+Fucking+Procrastinating+And+Do+Some+Work&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dwizzlex10","files":1,"time":1460163033,"description":"Do YOU procrastinate? Odds indicate that the answer is a resounding yes. We all do, up to an extent. Some more, some less, but at the end of the day, we all have that inner drive to do less than what we can. But know what? That's BS. We weren't born that way. We acquired those traits as we aged, and somewhere along the way, they became habit. But not anymore; it's time to stop. That's why this book will help you unlock the best version of yourself. It doesn't what you do for a living, you need to be productive to suceed in life. The fact is that the amount of success you achieve both in business and life is determined by your ability to get down to work, overcome impeding barriers (like that awful little voice in our head that prevents of from working), ultimately increasing the quality of your output in less and less time! It’s determined by the ability to GET DOWN TO WORK, go out and exercise, maintain your diet. It's determined by the ability to do what you have to do, when you have to do it, whether you feel like it or not","torrent":{"xt":"urn:btih:4855a8bc422c68484a775d8c3112282825a50469","amp;dn":"Procrastination%3A+Stop+Fucking+Procrastinating+And+Do+Some+Work","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4855a8bc422c68484a775d8c3112282825a50469","infoHashBuffer":{"type":"Buffer","data":[72,85,168,188,66,44,104,72,74,119,93,140,49,18,40,40,37,165,4,105]},"announce":[],"urlList":[]}}