{"title":"Creating Trees in Maya_ Paint Effects_Forest Techniques Part 3 H","uid":8818531,"size":2880807204,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4871b3817692167c4e165e5059c9c3416c4c53b1&amp;dn=Creating+Trees+in+Maya_+Paint+Effects_Forest+Techniques+Part+3+H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sum1_here","files":-1,"time":1376643751,"description":":General:\nComplete name: Creating Trees in Maya_ Paint Effects_Forest Techniques Part 3 HD 720p mkv - sum1_here\nFormat: Matroska\nSize: 2.68 GB \nDuration4+ hrs\nOverall Bitrate: 765 Kbps\nLanguage: English\nSub Title: None\nEncoder: sum1_here\nSource: mov Thanks\n\n\n \n\n:Video:\nFormat/Info: Advanced Video Codec\nBitrate: 706 Kbps\nWidth: 1280 pixels\nHeight: 720 pixels\nDisplay aspect ratio: 16:9\nFrame rate: 12.000 fps\n\n \n\n:Audio:\nFormat: Advanced Audio Codec\nNominal Bitrate: 128 Kbps\nChannel(s): 2 channels\nSampling rate: [I]44.1 KHz\n\n\n\n \n\n\nDetails:\n15 Videos\nIn this DVD, Alex demonstrates how to use the Paint Effects engine in Maya to create realistic trees. We begin by looking at the default PFX library, which has been converted to polygons for a Mental Ray workflow in an interactive instancer driven scene. Alex then thoroughly demonstrates how to customize a tree, using a library preset as a start point. All relevant paint effects attributes as discussed so that it becomes clear how to create trees that match the desired look for branching, leaves and behavior. Creating custom textures in Photoshop and setting up miaMaterials is then explored using Physical Sun/Sky and photographic camera exposure. Tree animation with wind turbulence, including how to create a randomized library from a user-defined preset, is generated in preparation for incorporating trees into a high-poly park scene. Techniques for populating the park with trees, as well as plants, grass and ground leaves, are discussed in a dynamic and flexible workflow via surface emission, instancing and particle expressions. Alex renders the animated scene, including his ZDepth workflow, compositing the final result in After Effects using the Lenscare, Magic Bullet and Sapphire plug-ins. He also shares his techniques for using volume primitives to create volumetric fog effects, rendered as a separate pass, creating a final 4k comp of the park scene. In conclusion, a variety of tips for creating custom trees are shared in order to make the default library a more useful start point for professional projects including broadleaf, palm, pine, willow and bamboo.\n\n\n \n\n \n\n \n\nWe are on FaceBook, Post Your Request, suggestion, and find upcomming Release of Silver RG, you will find all Silver RG Encoders at FB Page so keep in touch\n\n \n\n\n:Greetz:\nTo All Silver RG Encoders, All SilverTorrentHD Encoders &amp; All Other P2P RGs\n\n:Note:\nMake sure its real Silver RG Release From Silver RG Member,A video sample is included in the folder for those who want to check quality and compatibility before downloading the whole movie.\n\nWe Are Looking For Early Access To Anything You Can Provide CAMS, TS, DVD Screeners, VHS Screeners, DVDRips, Direct Audio, Early Music Release, Anything You Can Provide Seedboxes, Accounts, Dedicated Servers \n\n:Support:\nTook 5 Hours to Encode &amp; 24 Hours to Upload &amp; Seed\nTook 30 Minutes to Create Description/Screen Shots etc...\nTakes 10 Seconds to say&quot;Thank You&quot;, or 4 seconds to say &quot;Whoooo&quot;\n","torrent":{"xt":"urn:btih:4871b3817692167c4e165e5059c9c3416c4c53b1","amp;dn":"Creating+Trees+in+Maya_+Paint+Effects_Forest+Techniques+Part+3+H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4871b3817692167c4e165e5059c9c3416c4c53b1","infoHashBuffer":{"type":"Buffer","data":[72,113,179,129,118,146,22,124,78,22,94,80,89,201,195,65,108,76,83,177]},"announce":[],"urlList":[]}}