{"title":"Bad For Each Other (1953 ) Xvid 1cd - Charlton Heston, Liz Scott","uid":11426138,"size":996493312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:48a34bfa66b689821f8135b9c7ea7cbf601ade34&amp;dn=Bad+For+Each+Other+%281953+%29+Xvid+1cd+-+Charlton+Heston%2C+Liz+Scott&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SaM","files":-1,"time":1415667667,"description":"Bad For Each Other (1953 ) Xvid 1cd - Charlton Heston, Liz Scott [DDR]\n\nBad for Each Other is a 1953 film directed by Irving Rapper, and starring Charlton Heston and Lizabeth Scott.\n\n    CAST:-\n    Charlton Heston as Dr. Tom Owen\n    Lizabeth Scott as Helen Curtis\n    Dianne Foster as Joan Lasher\n    Mildred Dunnock as Mrs. Mary Owen, Tom's mother\n    Arthur Franz as Dr. Jim Crowley\n    Ray Collins as Dan Reasonover\n    Marjorie Rambeau as Mrs. Roger Nelson\n    Lester Matthews as Dr. Homer Gleeson\n    Rhys Williams as Dr. Leslie M. Scobee\n\nDirected by Irving Rapper\nRunning time 83 minutes\n\nMOVIE PLOT:- Bad For Each Other (1953)\nArmy colonel and doctor Tom Owen returns home to Coalville, Pennsylvania, on leave. He learns from wealthy mine owner Dan Reasonover that his brother Floyd, a mine safety engineer killed in an explosion, had betrayed Reasonover's trust; he had been embezzling and stealing even more money by purchasing cheap, substandard equipment. Floyd was also heavily in debt. Tom wants to pay it all back, though Dan Reasonover tries to talk him out of it.\n\nTwice divorced socialite Helen Curtis, Dan's daughter, meets Tom at a party and likes what she sees. Helen asks him for a date, during which she informs him she has arranged for him to meet Dr. Homer Gleeson. Gleeson runs a fancy Pittsburgh clinic catering to the upper class. Gleeson's associate has quit to start his own practice, so he offers Tom the vacancy. Knowing that Tom has vowed to pay his late brother's debts, she talks him into accepting, despite Tom's contentment in the Army and his mother's disapproval. Tom's first task is hiring a nurse; he selects Joan Lasher, an attractive and idealistic young woman who intends to become a doctor herself.\n\nTom and Helen begin dating. Eventually, Tom proposes to her, and she accepts. Her own father warns him that her wealth had poisoned her first two marriages, but Tom remains adamant.\n\nLasher becomes disappointed that Tom treats wealthy society patients for minor ailments when he could be doing more good elsewhere. Dr. Jim Crowley, a former sergeant who was inspired by Tom's example to resume his medical studies, comes to Tom to ask for a job, not for the money (though he is poor) but for the experience of working and learning from such a superb surgeon. Tom sends him to see Dr. Lester Scobee, who cares for the miners of Coalville.\n\nEmergency surgery is needed for Mrs. Roger Nelson, Helen's rich and influential aunt. Her personal physician, Gleeson, pleads with Tom to perform the operation for him, as he himself has not done any surgery in ten years. When Tom does so, unethically, Lasher quits. Gleeson decides to charge Mrs. Nelson an exorbitant fee, which he splits with Tom. Helen's aunt eventually finds out who actually operated on her. Though she is grateful, she questions his ethics. Before Tom can defend himself, he is called away by an emergency: a mine explosion at Coalville.\n\nTom enters the mine and joins Jim treating and rescuing miners. They get out before the chamber they were in collapses, but Jim is fatally injured and dies in the ambulance. Tom tells Helen he is quitting the clinic to work in Coalville. Helen tells him she cannot live there, so they reluctantly part. Tom arrives at his new office, to find Joan already at work.\n\nOTHER NOTES:-\nThe plot of the 1938 film, The Citadel, was reshuffled and simplified for Bad for Each Other. In The Citadel, Robert Donat plays a doctor who forgoes treating miners in Wales in order to become a highly paid society doctor in London. The mine-rescue sequence in Bad for Each Other is near-identical to the equivalent sequence in The Citadel.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 705 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 83 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:48a34bfa66b689821f8135b9c7ea7cbf601ade34","amp;dn":"Bad+For+Each+Other+%281953+%29+Xvid+1cd+-+Charlton+Heston%2C+Liz+Scott","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48a34bfa66b689821f8135b9c7ea7cbf601ade34","infoHashBuffer":{"type":"Buffer","data":[72,163,75,250,102,182,137,130,31,129,53,185,199,234,124,191,96,26,222,52]},"announce":[],"urlList":[]}}