{"title":"A-PDF Office to PDF 5.4.0 incl Key","uid":6660451,"size":27961321,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:490c7337db73d74bf5262de7ea279972612241a1&amp;dn=A-PDF+Office+to+PDF+5.4.0+incl+Key&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ArkLum","files":3,"time":1315495303,"description":"[center][img]http://shareimage.ro/images/os9hsz2uy8fhk0g74zc2.jpg[/img][/center]\nA-PDF Office to PDF supports watermark, security, page number, properties and viewer setting also. A-PDF Office to PDF does not need adobe acrobat. Easy to Use Converting Microsoft Office documents into PDF files couldnt be more easy.\n\nSimply Drag the DOC files to the file list which you want to convert into PDF file and click the Convert to PDF And Save as button, A-PDF Office to PDF quickly re-creates your DOC file as a fully formatted PDF files. Fast Get the job done in seconds or minutes, not hours or days.\n\nA-PDF Office to PDF eliminates the need to re-key and re-format PDF documents, saving you both time and money. Accurate You will be amazed at the results you get from Office to PDF Converter. It accurately retains the layout of the original Doc file.\n\nConverts text in over 100 languages and separates graphics from tables and text. Powerful. Now you can do more than view PDF files. Document Format (PDF) is the fact standard for the secure and reliable distribution and exchange of electronic documents and forms around the world, and now you can convert any MS office documents into professional-quality PDF file format only by one click\n\nHere are some key features of A-PDF Office to PDF:\n\nEasy to use\n\nConverting Microsoft Office Documents(.doc, .xls, .ppt, .rtf, .wri etc) into PDF files couldnt be easier.\n\nConvert One File: Right-click an Office file and select Convert to PDF from the pop-up menu.\n\nConvert a batch of Files: Simply drag the Office files you want to convert to the file list and click the Convert to PDF And Save as button. A-PDF Office to PDF quickly re-creates your .xls file as fully-formatted PDF files.\n\nAccurate\n\nYou will be amazed at the results you get from the Office to PDF Converter. It accurately retains the layout of the original .xls file. It converts text in over 100 languages, and separates graphics from tables and text.\n\nWork with Hot Directories\n\nYou can set up a monitored directory, where all MS Office files written to that directory will be converted to PDF as they are saved. All of the converting will be recorded in log files.\n\nSave Time\n\nHandles a batch of files at one time.\n\nGet the job done in seconds or minutes, not hours or days.\n\nSupports context-sensitive menu(right-click) to convert a word file in one step.\n\nAdds watermarks, properties, security and page number with one step.\n\nhomepage: http://www.a-pdf.com/","torrent":{"xt":"urn:btih:490c7337db73d74bf5262de7ea279972612241a1","amp;dn":"A-PDF+Office+to+PDF+5.4.0+incl+Key","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"490c7337db73d74bf5262de7ea279972612241a1","infoHashBuffer":{"type":"Buffer","data":[73,12,115,55,219,115,215,75,245,38,45,231,234,39,153,114,97,34,65,161]},"announce":[],"urlList":[]}}