{"title":"Bill Evans 24 Bit Vinyl Pack","uid":9345623,"size":16460347289,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4b9a102db0cf74cc4f29063c797f9e591b19f121&amp;dn=Bill+Evans+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":5,"uploader":"politux","files":-1,"time":1387036142,"description":"  Bill Evans 24 Bit Vinyl Pack\n\n  Genre: Jazz\n  Styles: Cool, Modal Music, Piano Jazz, Post-Bop\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate:  ~ 3,000 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  Undercurrent (two versions)\n  A Simple Matter of Conviction\n  The Bill Evans Album\n  Trio 64\n  You Must Believe in Spring \n  Intermodulation\n  The Unknown Sessions\n  At Town Hall Volume One\n  Waltz for Debby (two versions)\n  Everybody Digs Bill Evans\n  Explorations\n  New Jazz Conceptions\n  Interplay\n  At Shelly's Manne-Hole \n  How My Heart Sings\n  Moon Beams\n  Portrait in Jazz\n  Sunday at the Village Vanguard \n  Know What I Mean\n\n  With the passage of time, Bill Evans has become an entire school unto himself for pianists and a singular mood unto himself for listeners. There is no more influential jazz-oriented pianist -- only McCoy Tyner exerts nearly as much pull among younger players and journeymen -- and Evans has left his mark on such noted players as Herbie Hancock, Keith Jarrett, Chick Corea, Brad Mehldau. Borrowing heavily from the impressionism of Debussy and Ravel, Evans brought a new, introverted, relaxed, lyrical, European classical sensibility into jazz -- and that seems to have attracted a lot of young conservatory-trained pianists who follow his chord voicings to the letter in clubs and on stages everywhere. Indeed, classical pianists like Jean-Yves Thibaudet have recorded note-for-note transcriptions of Evans' performances, bringing out the direct lineage with classical composers. In interviews, Evans often stressed that pianists should thoroughly learn technique and harmony so that they can put their inspiration to maximum use. Since he already had those tools in hand, he worked very hard on his touch, getting the special, refined tone that he wanted out of a piano. He also tried to democratize the role of the bassist and drummer in his succession of piano trios, encouraging greater contrapuntal interplay.\n\n  Bespectacled, shy, soft-spoken, and vulnerable, Evans was not a good fit into the rough-and-tumble music business. In part to shield himself from the outside world, he turned to drugs -- first heroin, and later, cocaine -- which undoubtedly shortened his life. In interviews, though, he sounds thoroughly in control, completely aware of what he wanted from his art, and colleagues report that he displayed a wicked sense of humor. Nowadays, Evans seems to be immune from criticism, but there was a time when he was accused of not being able to swing, or pilloried for an &quot;effete&quot; approach to jazz that was alien to its African sources. However, there are plenty of Evans recordings which show that he could indeed flash the technique and swing as hard as anyone when he wanted to, especially early in his career. He simply chose a different path for himself, one entirely reflective of his inward personality -- and that's what seems to touch listeners inside and outside jazz the most. Indeed, the cult for Evans' recordings is big enough to justify the existence of six large, expensive boxed sets of his output: four from Fantasy's archives, one from Warner Bros., and the biggest one from Verve. A newcomer, though, would be better-advised to sample Evans in smaller doses. Since the bulk of his recordings were made with the same piano-bass-drums instrumentation, and his career was not marked by dramatic shifts in style, prolonged listening to hours upon hours of his trio recordings can lead to monotony (after all, you can even overdose on Bach, as great as he was).\n\n  Born and raised in New Jersey, Evans was recruited for Southeastern Louisiana University on a flute scholarship, where he received a thorough background in theory, played in the marching band, and also led his football team to a league championship as a quarterback. Graduating as a piano major in 1950, he started to tour with the Herbie Fields band, but the draft soon beckoned, and Evans was placed in the Fifth Army Band near Chicago. After three years in the service, he arrived in New York in 1954, playing in Tony Scott's quartet and undertaking postgraduate studies at Mannes College, where he encountered composer George Russell and his modal jazz theories. By 1956, he had already recorded his first album as a leader for Riverside, New Jazz Conceptions, still enthralled by the bop style of Bud Powell but also unveiling what was to become his best-known composition, &quot;Waltz for Debby,&quot; which he wrote while still in the Army.\n\n  In spring 1958, Evans began an eight-month gig with the Miles Davis Sextet, where he exerted a powerful influence upon the willful yet ever-searching leader. Though Evans left the band that autumn, exhausted by pressured expectations and anxious to form his own group, he was deeply involved in the planning and execution of Davis' epochal Kind of Blue album in 1959, contributing ideas about mood, structure, and modal improvisation, and collaborating on several of the compositions. Although the original release gave composition credit of &quot;Blue in Green&quot; to Davis, Evans claimed he wrote it entirely, based on two chords suggested by Davis (nowadays, they receive co-credit). In any case, Kind of Blue -- now the biggest-selling acoustic jazz album of all time -- contains perhaps the most moving performances of Evans' life.\n\n  Evans returned to the scene as a leader in December 1958 with the album Everybody Digs Bill Evans, which included the famous &quot;Peace Piece,&quot; a haunting vamp for solo piano that sounds like a long-lost Satie Gymnopedie. Evans' first working trio turned out to be his most celebrated, combining forces with the astounding young bassist Scott LaFaro and drummer Paul Motian in three-way telepathic trialogues. With this group, Evans became a star -- and there was even talk about a recording with Davis involving the entire trio. Sadly, only ten days after a landmark live session at the Village Vanguard in June 1961, LaFaro was killed in an auto accident -- and the shattered Evans went into seclusion for almost a year. He re-emerged the following spring with Chuck Israels as his bassist, and he would go on to record duets with guitarist Jim Hall and a swinging quintet session, Interplay, with Hall and trumpeter Freddie Hubbard.\n\n  Upon signing with Verve in 1962, Evans was encouraged by producer Creed Taylor to continue to record in more varied formats: with Gary McFarland's big band, the full-orchestra arrangements of Claus Ogerman, co-star Stan Getz, a reunion with Hall. The most remarkable of these experiments was Conversations With Myself, a session where Evans overdubbed second and third piano parts onto the first; this eventually led to two sequels in that fashion. In his only concession to the emerging jazz-rock scene, Evans dabbled with the Rhodes electric piano in the 1970s but eventually tired of it, even though inventor Harold Rhodes had tailored the instrument to Evans' specifications. Mostly, though, Evans would record a wealth of material with a series of trios. Through his working trios would pass such players as bassists LaFaro (1959-1961), Israels (1962-1965), Gary Peacock (1963), Teddy Kotick (1966), Eddie Gomez (1966-1977), and Marc Johnson (1978-1980); and drummers Motian (1959-1962), Larry Bunker (1962-1965), Arnie Wise (1966, 1968), Joe Hunt (1967), Philly Joe Jones (1967, 1977-1978), Jack DeJohnette (1968), John Dentz (1968), Marty Morell (1968-1975), Eliot Zigmund (1975-1977), and Joe La Barbera (1978-1980). After Verve, Evans would record for Columbia (1971-1972), Fantasy (1973-1977), and Warner Bros. (1977-1980). The final trio with Johnson and La Barbera has been considered the best since the LaFaro-Motian team -- Evans thought so himself -- and their brief time together has been exhaustively documented on CDs.\n\n  Though Evans' health was rapidly deteriorating, aggravated by cocaine addiction, the recordings from his last months display a renewed vitality. Even on The Last Waltz, recorded as late as a week before his death from a hemorrhaging ulcer and bronchial pneumonia, there is no audible hint of physical infirmity. After Evans' death, a flood of unreleased recordings from commercial and private sources has elevated interest in this pianist to an insatiable level.","torrent":{"xt":"urn:btih:4b9a102db0cf74cc4f29063c797f9e591b19f121","amp;dn":"Bill+Evans+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b9a102db0cf74cc4f29063c797f9e591b19f121","infoHashBuffer":{"type":"Buffer","data":[75,154,16,45,176,207,116,204,79,41,6,60,121,127,158,89,27,25,241,33]},"announce":[],"urlList":[]}}