{"title":"The Celestine Prophecy.mobi","uid":5776227,"size":3482288,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4bc87e1ce0c7a192a864ba67606bb59bb0eda8e7&amp;dn=The+Celestine+Prophecy.mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"pgnds","files":1,"time":1282275333,"description":"Redfield's debut is a fast-paced adventure in New Age territory that plays like a cross between Raiders of the Lost Ark and Moses's trek up Mt. Sinai. Originally self-published, the book sold phenomenally, sparked by word of mouth, and may be this year's The Bridges of Madison County --with which it shares some regrettable stylistic similarities. The saga begins when the unnamed middle-aged male narrator whimsically quits his nondescript life to track down an ancient Peruvian manuscript (pretentiously called the Manuscript) containing nine Insights that supposedly prophesy the modern emergence of New Age spirituality. South of the border, he encounters resistance from the Peruvian government and church authorities, who believe the document will undermine traditional family values. While dodging evil soldiers, paranoid priests and pseudoscientific researchers, our hero sequentially discovers all nine Insights during a series of chance encounters. Redfield has a real talent for page-turning action, and his lightweight quest employs auras, energy transfers and other psychic phenomena. But several of the Insights are incredibly vacuous and politically correct, and long stretches of dialogue are banal and cliched. The book ends with the protagonist poised to discover the 10th Insight in a promised sequel. 250,000 first printing; BOMC selection; author tour. ","torrent":{"xt":"urn:btih:4bc87e1ce0c7a192a864ba67606bb59bb0eda8e7","amp;dn":"The+Celestine+Prophecy.mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bc87e1ce0c7a192a864ba67606bb59bb0eda8e7","infoHashBuffer":{"type":"Buffer","data":[75,200,126,28,224,199,161,146,168,100,186,103,96,107,181,155,176,237,168,231]},"announce":[],"urlList":[]}}