{"title":"How Google Works(ePUB,Retail){32Skulls}","uid":11107136,"size":4329573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4bcf0b7196af0918b50857e1f51d42bbdcfbc699&amp;dn=How+Google+Works%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"32Skulls","files":-1,"time":1411740184,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\nGoogle Executive Chairman and ex-CEO Eric Schmidt and former SVP of Products Jonathan Rosenberg came to Google over a decade ago as proven technology executives. At the time, the company was already well-known for doing things differently, reflecting the visionary--and frequently contrarian--principles of founders Larry Page and Sergey Brin. If Eric and Jonathan were going to succeed, they realized they would have to relearn everything they thought they knew about management and business.\n\nToday, Google is a global icon that regularly pushes the boundaries of innovation in a variety of fields. HOW GOOGLE WORKS is an entertaining, page-turning primer containing lessons that Eric and Jonathan learned as they helped build the company. The authors explain how technology has shifted the balance of power from companies to consumers, and that the only way to succeed in this ever-changing landscape is to create superior products and attract a new breed of multifaceted employees whom Eric and Jonathan dub &quot;smart creatives.&quot; Covering topics including corporate culture, strategy, talent, decision-making, communication, innovation, and dealing with disruption, the authors illustrate management maxims (&quot;Consensus requires dissension,&quot; &quot;Exile knaves but fight for divas,&quot; &quot;Think 10X, not 10%&quot;) with numerous insider anecdotes from Google's history, many of which are shared here for the first time.\n\nIn an era when everything is speeding up, the best way for businesses to succeed is to attract smart-creative people and give them an environment where they can thrive at scale. HOW GOOGLE WORKS explains how to do just that.\n\n\nBy Eric Shmidt, Johnathan Rosenberg, Alan Eagle\nPublished by Grand Central Publishing, Hachette Book Group in 2014\nEPUB, Retail, 304 pages, English ","torrent":{"xt":"urn:btih:4bcf0b7196af0918b50857e1f51d42bbdcfbc699","amp;dn":"How+Google+Works%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bcf0b7196af0918b50857e1f51d42bbdcfbc699","infoHashBuffer":{"type":"Buffer","data":[75,207,11,113,150,175,9,24,181,8,87,225,245,29,66,187,220,251,198,153]},"announce":[],"urlList":[]}}