{"title":"Carbon Fibers and Their Composites - Peter Ernest Morgan","uid":12126278,"size":173582405,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4bf0d4b50db517fc6452350c6aa430c9c27b70f7&amp;dn=Carbon+Fibers+and+Their+Composites+-+Peter+Ernest+Morgan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1436929543,"description":"Carbon Fibers and Their Composites - Peter Ernest Morgan (CRC, 2005).pdf\n\nISBN 978-0-8247-0983-9\n\nMost literature pertaining to carbon fibers is of a theoretical nature. Carbon Fibers and their Composites offers a comprehensive look at the specific manufacturing of carbon fibers and graphite fibers into the growing surge of diverse applications that include flameproof materials, protective coatings, biomedical and prosthetics applications, textiles, batteries and fuel cells, automotive applications, construction, and even musical instruments.\nThis useful guide provides a hands-on approach to the fabrication of carbon fibers. The book begins with a blueprint of the international history and development of carbon fiber, clearly defined terminology for all forms of solid carbon products, and the properties for elemental carbon and its allotropic forms. It then elaborates upon precursor materials, relevant surface treatment, and sizing for each carbon fiber type available in the world market. Several chapters also examine the types of matrices, their properties, and fracture mechanics of thermoset and thermoplastic polymers, carbon, glass, metal, and ceramics matrices.\n\nCarbon Fibers and their Composites reveals straightforward guidelines for the day-to-day operations of a carbon fiber plant, such as safety testing, quality control, design of equipment, packaging, air flow/dust control, maintenance, and environmental policies. Based on over 30 years of experience in the field, the author offers insight and possible solutions to the problems associated with production and testing of carbon fibers and their related composites. He details the use of analytical chemistry techniques, instrumentation requirements, and statistics to evaluate the results.\n\nCarbon Fibers and their Composites offers an excellent clarification of how carbon fibers yield reinforced composites, their physical and chemical characteristics, the diverse manufacturing techniques for each type, and the advantages they offer to a variety of applications","torrent":{"xt":"urn:btih:4bf0d4b50db517fc6452350c6aa430c9c27b70f7","amp;dn":"Carbon+Fibers+and+Their+Composites+-+Peter+Ernest+Morgan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bf0d4b50db517fc6452350c6aa430c9c27b70f7","infoHashBuffer":{"type":"Buffer","data":[75,240,212,181,13,181,23,252,100,82,53,12,106,164,48,201,194,123,112,247]},"announce":[],"urlList":[]}}