{"title":"Majesty.2.Monster.Kingdom-SKIDROW","uid":6018891,"size":1392477355,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4ceed6b6915f00c9a0481500b2b60b8747f52267&amp;dn=Majesty.2.Monster.Kingdom-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rlf-rls","files":-1,"time":1291731025,"description":"S K i D R O W\n\nT H E  L E A D i N G  F O R C E \n\nproudly presents\n\nMajesty 2: Monster Kingdom / Paradox Interactive\n\nRELEASE DATE: 07-12-2010 PROTECTION: Nothing\nGAME TYPE: Strategy DISKS: 1 DVD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties\n\nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible\n\ntwice the fun \\/ double the trouble\n\n\nOn with the game release information:\n\nThe King would imagine that Ardania belongs to him alone, and\nhis advisor supports him in this ignorance, forgetting that\nthere are two sides to every coin. As mentioned in the ancient\nscriptures of Murphius: &quot;Try as you might to do something that\neverybody likes, there is always someone who does not.&quot; Soon\nthe hard truth of these words will reveal itself to the Great\nKing in full\n\nAnd what will he do, and where will he go, should everyone\nturn against him? Well, not his loyal Advisor, of course, but\nall those petty nobles and the Conclave. It will be a\ndifficult challenge to maintain the righteous command\nDetermination will be his greatest weapon, and sacrifices will\nhave to be made. But just how far is the King ready to go in\nthis dire situation?\n\nAnd the situation is dire indeed. The High Priests have stolen\nthe Crown of Ardania, to summon the Spirit of the Kings and\nproclaim it the righteous ruler. Your Majesty, you who so\nbravely defeated Barlog, have lost your throne, and must now\nfight to reclaim it. The Nobles support the Conclave, and your\nonly hope is to find new allies, those who no one, even you\nwould ever expect to be join you. Once again you must heed the\nwisdom of your Advisor, in hopes that with his guidance you\nmay bring peace back to Ardania\n\nNew &quot;Exiles of Fate&quot; campaign, which features 10 new missions\n\nNew monster race avaible in multiplayer mode\n\nMonster kingdom with a full set of new buildings, heroes and\ncitizens\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Play the game\n\nThis expansion require Majesty 2: The Fantasy Kingdom Sim\ninstalled to play!\n\nSupport the companies, which software you actually enjoy!\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS","torrent":{"xt":"urn:btih:4ceed6b6915f00c9a0481500b2b60b8747f52267","amp;dn":"Majesty.2.Monster.Kingdom-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ceed6b6915f00c9a0481500b2b60b8747f52267","infoHashBuffer":{"type":"Buffer","data":[76,238,214,182,145,95,0,201,160,72,21,0,178,182,11,135,71,245,34,103]},"announce":[],"urlList":[]}}