{"title":"Conviction (Law &amp; Order spin-off, 2006)","uid":10299480,"size":4772390912,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4cee831f03ac96cab939cf8821eeea23eb836369&amp;dn=Conviction+%28Law+%26amp%3B+Order+spin-off%2C+2006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"peri-lives","files":-1,"time":1401947939,"description":"Conviction is an American television drama on NBC that debuted as a mid-season replacement on Friday, March 3, 2006. The cast includes Stephanie March reprising her Law &amp; Order: Special Victims Unit role as Alexandra Cabot. In the series, Cabot returns to New York City and becomes a Bureau Chief ADA supervising a group of young but talented assistant district attorneys after a stint in the Witness Protection Program. Other cast members include Eric Balfour, Anson Mount, Jordan Bridges, Julianne Nicholson, Milena Govich, and J. August Richards.\n\nPrior to the show's debut, creator Dick Wolf remarked, &quot;Conviction will be a 'charactercedural', we will be dealing extensively with characters' back stories and personal lives. I am delighted with the extraordinary cast we have assembled, which will give the show depth and emotional intensity.&quot;\n\nConviction's premiere came precisely one year after the premiere of the short-lived Law &amp; Order: Trial by Jury, which was also created by Dick Wolf and also aired on NBC (in filming, Conviction used many of the Trial by Jury sets). On February 21, 2006, the pilot episode of Conviction was made available for free download through iTunes music store; the free download was available until March 3, the date of the NBC premiere.[ The pilot and all other aired episodes are now available for purchase.\n\nNBC announced the series would not be renewed for a second season on May 14, 2006, having been routinely beaten in the ratings by CBS's math police procedural Numb3rs.\n\nThe theme song to Conviction is &quot;Destiny&quot;, by the English electronic music group Syntax. It can be found on their 2004 album Meccano Mind.\n\n\nMain Cast:\n\nStephanie March as Alexandra Cabot\nAnson Mount as Jim Steele\nEric Balfour as Brian Peluso\nJ. August Richards as Billy Desmond\nMilena Govich as Jessica Rossi\nJulianne Nicholson as Christina Finn\nJordan Bridges as Nick Potter","torrent":{"xt":"urn:btih:4cee831f03ac96cab939cf8821eeea23eb836369","amp;dn":"Conviction+%28Law+%26amp%3B+Order+spin-off%2C+2006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cee831f03ac96cab939cf8821eeea23eb836369","infoHashBuffer":{"type":"Buffer","data":[76,238,131,31,3,172,150,202,185,57,207,136,33,238,234,35,235,131,99,105]},"announce":[],"urlList":[]}}