{"title":"Magnifico-HI2U","uid":11621706,"size":474318960,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4da5fe90f37d4a6805c3a88338c9d938ea43af33&amp;dn=Magnifico-HI2U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thenoobish","files":2,"time":1417566678,"description":"HI2U!\n\nMagnifico (c) Slitherine Ltd\n\nRelease Date: 02nd December, 2014\nProtection: Steam\nType: Casual, Strategy\nSize: 1 Disc\n\nDescription:\n\nAbout This Game Magnifico is a popular region-based board game where the\nultimate goal is to dominate 16th century Europe and is now available for PC!\n\nPlayers are faced with tough economic and military decisions as they earn\nVictory Points and attempt to outbid opponents at the auction and get their\nhands on Leonardo Da Vinci's most powerful war machines. Every Victory Point\nhas to be earned by careful placement of your troops, construction of\nfortifications, and invasion of bordering regions. Each new turn brings a\nchance to acquire Da Vinci's precious projects and get the upper hand over\nyour opponents\n\nCannons, flying machines, bombards, tanks and many more inventions will be\navailable as options at the auction table, but only with a perfect balance of\nrisk and caution will players make the most of them\n\nPlay hard or play clever, Europe's dominance is just one Victory Point away\n\nMain Features:\n\n* The only strategy game with Da Vinci's inventions and works of art! Build\nCastles, Tanks, Aircraft and much more!\n* Bid at the auction for Da Vinci's inventions\n* Upgrade your infantry, tanks and aircraft with new technologies to increase\nreliability and combat power\n* Fight battles with wondrous technologies but be careful as tanks can\nexplode!\n* Many special weapons including the Great Cannon, Submarines, Armoured\nShips, Paratroopers and more!\n* Compete for control of 16th century Europe on a region based map\n* Earn Victory points for most castles, territories, technologies, being\nMagnifico and other special actions\n* Single player mode against up to 3 AI players, selected from 10 AI\ncharacters with their own play styles\n* In depth in-game tutorial and detailed manual\n* Available in English, French, Spanish, Italian, German, Russian and\nChinese!\n* Based on the popular board game Da Vinci's Art of War - Magnifico created\nby Spartaco Alberatrelli\n\nInstall:\n\nUnrar, mount/burn, install the game, copy crack and play!","torrent":{"xt":"urn:btih:4da5fe90f37d4a6805c3a88338c9d938ea43af33","amp;dn":"Magnifico-HI2U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4da5fe90f37d4a6805c3a88338c9d938ea43af33","infoHashBuffer":{"type":"Buffer","data":[77,165,254,144,243,125,74,104,5,195,168,131,56,201,217,56,234,67,175,51]},"announce":[],"urlList":[]}}