{"title":"PrettyDirty - Brandi Love (Two Men, One Wife) NEW 07 October 201","uid":15977048,"size":564599007,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4db0d20c2275cd516b3dde1227ad8b4fceb33ba2&amp;dn=PrettyDirty+-+Brandi+Love+%28Two+Men%2C+One+Wife%29+NEW+07+October+201&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"xxxlavalxxx","files":2,"time":1475854486,"description":"Brandi Love sends her husband Chad White off to work in the morning, and just as he pulls out the driveway, she runs to the back door to let in her much better lover Mick Blue. However, Brandi is not expecting her husband to want to do something special for her today, to thank her for being so great and so devoted to building their life together. Brandi's pussy is swallowing Mick's huge dick when Chad walks by the window carrying a bouquet of fresh flowers. Luckily he doesn't see his cheating wife getting fucked from behind by Mick Blue. The copulating couple disengage and Mick hides in the bathroom. Brandi puts on a flimsy robe and greets her husband. She tells him she's dressed like that because she's thinking of ways of please him. She undresses him and proceeds to suck his dick. She tries to milk his cum out but he wants to keep his hard on for fucking her. She takes a bathroom break, and checks in on Mick. Even though her husband is in the next room, she sucks and fuck her lover, supremely excited by how bad they are being, taking such a risk of getting caught. Back and forth she goes sucking and fucking two men, one wife servicing them both. Mick fucks her till he blows his cum into her mouth, and finally Chad is ready to release, cumming a huge load all over her face. Crisis averted!\r\nCategories Blonde, Piercings, Big Tits, Hardcore, Threesome, 69, Tattoos, Pussy Licking, Pussy to mouth, Blowjob, Deepthroat, Open Mouth Facial, Big Dick, Ass, Tits Cumshots\r\n \nhttp://imgdone.com/viewer.php?file=19233778524470288400.jpg\r\n \nhttp://imgdone.com/viewer.php?file=86366863721351916423.jpg","torrent":{"xt":"urn:btih:4db0d20c2275cd516b3dde1227ad8b4fceb33ba2","amp;dn":"PrettyDirty+-+Brandi+Love+%28Two+Men%2C+One+Wife%29+NEW+07+October+201","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4db0d20c2275cd516b3dde1227ad8b4fceb33ba2","infoHashBuffer":{"type":"Buffer","data":[77,176,210,12,34,117,205,81,107,61,222,18,39,173,139,79,206,179,59,162]},"announce":[],"urlList":[]}}