{"title":"TTC - Analysis and Critique","uid":6582619,"size":174674055,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4f0c75727a0f73268c3d4360f8c28dff4fa3d3aa&amp;dn=TTC+-+Analysis+and+Critique&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"programa","files":25,"time":1312474993,"description":"TTC - Analysis and Critique: How to Engage and Write about Anything\n\nTaught By Professor Dorsey Armstrong, Ph.D., Duke University, Purdue University \n\n\nFormat: MP3\nBitrate: 32 Kbps\n\nFor thousands of years, writing has been a powerful way for us to communicate with one another, to share our distinct thoughts and ideas through the power of words. Even in today's technologically saturated 21st century, we still express ourselves in writing almost every single day. And oftentimes, we write to argue our viewpoints, persuade others that we're right, and share our unique experiences and perspectives.\n\nBut all writing-whether it's a powerful essay, a persuasive letter, a detailed business report, or an autobiographical story-is at its most effective and memorable when it's built on the fundamental critical and analytical skills that transform your words from ''good'' writing to ''great'' writing. Regardless of your subject, your goal, or your occasion, these skills are the heart and soul of engaging and effective writing. They include the ability to\n\n* organize your thoughts into a coherent piece that never leaves your reader behind;\n\n* make a persuasive argument rooted in solid facts;\n\n* draw on the styles and characteristics of various literary genres;\n\n* make responsible use of research materials and outside resources; and\n\n* avoid common grammar errors that could cost you your credibility.\n\nYou'll find the secrets to these and other concepts and methods for clear and strong writing in the 24 accessible and practical lectures of Analysis and Critique: How to Engage and Write about Anything. Delivered by Professor Dorsey Armstrong of Purdue University-whose work with students involves the art and craft of analytical and persuasive writing-this course immerses you in the elements of successful writing. With its engaging literary and everyday examples, inspirational prompts, and unforgettable insights, Analysis and Critique makes the perfect reference guide for both professional and casual writers.\n\n\n24 Lectures\n30 minutes / lecture\n\n1  How to Write about Anything \n2  How to Be an Effective Reader \n3  How Literature Can Help \n4  Shaping Your Voice \n5  Knowing Your Reader \n6  The Art of the Essay-How to Start \n7  How to Organize an Argument \n8  Supporting Your Argument \n9  Finishing Strong \n10 The Uses of Poetry \n11 Poetic Diction and Syntax \n12 Drama-Writing Out Loud \n13 What You Can Learn from Autobiography \n14 Writing and Leadership \n15 The Rules of Rhetoric \n16 Invention and Arrangement \n17 Ethos and Pathos \n18 Finding What You Need \n19 Using What You Find \n20 Getting Started-Writing First Drafts \n21 Editing-Finding What's Wrong \n22 Rewriting-Fixing What's Wrong \n23 Avoiding Common Errors in Grammar and Usage \n24 The Power of Words \n","torrent":{"xt":"urn:btih:4f0c75727a0f73268c3d4360f8c28dff4fa3d3aa","amp;dn":"TTC+-+Analysis+and+Critique","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f0c75727a0f73268c3d4360f8c28dff4fa3d3aa","infoHashBuffer":{"type":"Buffer","data":[79,12,117,114,122,15,115,38,140,61,67,96,248,194,141,255,79,163,211,170]},"announce":[],"urlList":[]}}