{"title":"Oxford.Handbook.of.Clinical.and.Laboratory.Investigation","uid":7967073,"size":13051970,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f4a08d0c2c05aa02163ef7f3891f03d54f11cec&amp;dn=Oxford.Handbook.of.Clinical.and.Laboratory.Investigation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"shafi3803","files":-1,"time":1356710406,"description":"Oxford Handbook of Clinical and Laboratory Investigation (Oxford Handbooks Series) \n\nGeneral Information\nPublication Date: 13 Oct 2005 \n ISBN-10: 0198566638\nISBN-13: 978-0198566632 \n Edition: 2\n\nDescription\nModern medicine is highly complex and investigations are a key part of the diagnostic process. With major advances in technology there are thousands of clinical and laboratory tests available. This book provides a patient-oriented approach to investigation (first part of book) where key symptoms and signs are described along with tests that may be of value in reaching a diagnosis. The remainder of the book is specialty-centred and provides a comprehensive review of all available tests within a given subject. The book emphasises which tests are of value, when tests are not likely to be helpful, along with pitfalls in the interpretation of results. The aim is of the book is to provide a more rational method of investigation and prevent over-investigation which is expensive for the hospital and unpleasant for the patient. The contributors are all active clinicians who are engaged in medical practice, so appreciate the problems faced by junior doctors. The book should also be of value to senior medical students who will be facing finals examinations, and who will soon be on the wards and responsible for ordering tests on their patients.","torrent":{"xt":"urn:btih:4f4a08d0c2c05aa02163ef7f3891f03d54f11cec","amp;dn":"Oxford.Handbook.of.Clinical.and.Laboratory.Investigation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f4a08d0c2c05aa02163ef7f3891f03d54f11cec","infoHashBuffer":{"type":"Buffer","data":[79,74,8,208,194,192,90,160,33,99,239,127,56,145,240,61,84,241,28,236]},"announce":[],"urlList":[]}}