{"title":"Dracula 3 Path Of The Dragon [English] [PC]","uid":4485695,"size":3075044020,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5052f64c7beca2a2b85ce347c0a41a641aa42073&amp;dn=Dracula+3+Path+Of+The+Dragon+%5BEnglish%5D+%5BPC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nawlinz","files":-1,"time":1225752135,"description":"\nSummary\n\nSeptember 1920, the Vatican appoints Father Arno Moriani, the &quot;Devil&amp;#039;s Advocate&quot;, to investigate a potential candidate for sainthood in Transylvania. But in the shadows of the disturbing ruins that were once Vlad the Impaler&amp;#039;s castle, his investigation takes an unexpected turn...\n\nThere is obviously no sch thing as vampires... at least according to the official line of the Catholic Church. But how can you be so sure, standing in the swirling mists of Transylvania ?\n\nCarry out your investigation amidst tales of bloody deeds and ancestral fears. Doubts start clouding your mind and doubt begets fear...\nMain features\n\n    * A nail-biting investigation on the dividing line between myth and reality, folklore and history, medecine and superstition.\n    * Thwart the shady schemes of the occult forces, using only your wits and logic. Compare, deduce, and solve the riddles barring your way and hindering your investigation or use the mouse to draw cursed symbols written in letters of fire!\n    * Compare and decipher mysterious papers, old tables, manuscripts, engravings, precious vases, rune stones, ancient prophecies dating back to the origins of mankind and get to grips whith the most modern encryption process known in 1920 : the famous Enigma machine!\n    * Interact and communicate whith the many colourful characters in the adventure, either face-to-face, by post or the era&amp;#039;s ultra-modern means of communication: the telephone.\n    * Set off on your adventure from Rome to Transylvania, Budapest to Turkey, venturing as far as the ancient cave prisons from which Vlad Tepes allegedly escaped.\n    * Mouth-watering graphics, cutscenes and special effects, guaranteeing a dark and engrossing gaming experience.\n\n","torrent":{"xt":"urn:btih:5052f64c7beca2a2b85ce347c0a41a641aa42073","amp;dn":"Dracula+3+Path+Of+The+Dragon+%5BEnglish%5D+%5BPC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5052f64c7beca2a2b85ce347c0a41a641aa42073","infoHashBuffer":{"type":"Buffer","data":[80,82,246,76,123,236,162,162,184,92,227,71,192,164,26,100,26,164,32,115]},"announce":[],"urlList":[]}}