{"title":"The Royal We - Heather Cocks, Jessica Morgan","uid":13041995,"size":522336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:508b0c6786d95f375bbcb3a7595db66ee218d726&amp;dn=The+Royal+We+-+Heather+Cocks%2C+Jessica+Morgan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1450541913,"description":"The Royal We - Heather Cocks, Jessica Morgan\r\n\r\n\r\nThe Washington Post and USA Today Bestseller\r\n\r\n&quot;I might be Cinderella today, but I dread who they'll think I am tomorrow. I guess it depends on what I do next.&quot;\r\n\r\nAmerican Rebecca Porter was never one for fairy tales. Her twin sister, Lacey, has always been the romantic who fantasized about glamour and royalty, fame and fortune. Yet it's Bex who seeks adventure at Oxford and finds herself living down the hall from Prince Nicholas, Great Britain's future king. And when Bex can't resist falling for Nick, the person behind the prince, it propels her into a world she did not expect to inhabit, under a spotlight she is not prepared to face.\r\n\r\nDating Nick immerses Bex in ritzy society, dazzling ski trips, and dinners at Kensington Palace with him and his charming, troublesome brother, Freddie. But the relationship also comes with unimaginable baggage: hysterical tabloids, Nick's sparkling and far more suitable ex-girlfriends, and a royal family whose private life is much thornier and more tragic than anyone on the outside knows. The pressures are almost too much to bear, as Bex struggles to reconcile the man she loves with the monarch he's fated to become.\r\n\r\nWhich is how she gets into trouble.\r\n\r\nNow, on the eve of the wedding of the century, Bex is faced with whether everything she's sacrificed for love-her career, her home, her family, maybe even herself-will have been for nothing.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:508b0c6786d95f375bbcb3a7595db66ee218d726","amp;dn":"The+Royal+We+-+Heather+Cocks%2C+Jessica+Morgan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"508b0c6786d95f375bbcb3a7595db66ee218d726","infoHashBuffer":{"type":"Buffer","data":[80,139,12,103,134,217,95,55,91,188,179,167,89,93,182,110,226,24,215,38]},"announce":[],"urlList":[]}}