{"title":"Pretenders - Pretenders [2 CD's][1979][2015][320 KBPS][DE]","uid":11857489,"size":400727247,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:50e6f7866060f779230231b2807ffa7e1c6329fb&amp;dn=Pretenders+-+Pretenders+%5B2+CD%27s%5D%5B1979%5D%5B2015%5D%5B320+KBPS%5D%5BDE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LameDuck69","files":52,"time":1430199955,"description":"Pretenders - Pretenders [2 CD's][1979][2015][DE]\n\n\n01. Precious  \n02. The Phone Call   \n03. Up The Neck   \n04. Tattooed Love Boys   \n05. Space Invader  \n06. The Wait   \n07. Stop Your Sobbing  \n08. Kid   \n09. Private Life  \n10. Brass In Pocket   \n11. Lovers Of Today   \n12. Mystery Achievement   \n13. Swinging London\n14. Nervous But Shy\n15. Cuban Slide\n16. Porcelain\n17. Precious (Live)\n18. Kid (1987 Extended Remix)\n\n\n\nDisc 2:\n-------\n\n01. The Phone Call (Late 1977)\n02. Brass In Pocket (February 1978)\n03. Precious (April 1978)\n04. The Wait (April 1978)\n05. Stop Your Sobbing (April 1978)\n06. I Can't Control Myself (April 1978)\n07. Tequila (April 1978)\n08. Kid (December 1978)\n09. Sabre Dance (The Marquee, April 1979)\n10. I Need Somebody (The Kid Jenson Show, July 1979)\n11. Mystery Achievement (The Kid Jenson Show, July 1979)\n12. Precious (The Paradise Theatre, March 1980)\n13. Tattooed Love Boys (The Paradise Theatre, March 1980)\n---------------------------------------------------------\n**320 KBPS CBR\n**Cover Art\n---------------------------------------------------------\nThe Pretenders are an English-American rock band formed in Hereford, England, in March 1978. The original band comprised initiator and main songwriter Chrissie Hynde (lead vocals, rhythm guitar), James Honeyman-Scott (lead guitar, backing vocals, keyboards), Pete Farndon (bass guitar, backing vocals), and Martin Chambers (drums, backing vocals, percussion). Following the drug-related deaths of Honeyman-Scott and Farndon, the band has experienced numerous subsequent personnel changes, with Hynde as the only consistent member, and Chambers returning after an absence of several years.\n--------------------------------------------------------------------------------\nPretenders is the debut studio album by the British-American band The Pretenders, released on 19 January 1980 under Real Records (Sire Records in the United States). A combination of rock, punk and pop music, this album made the band famous. The album features the singles &quot;Stop Your Sobbing&quot;, &quot;Kid&quot; and &quot;Brass in Pocket&quot;.\n\nPretenders debuted at number 1 on the UK Albums Chart in the week of its release and stayed there for four consecutive weeks. It also made the top 10 on the Billboard 200 and was certified Platinum during 1982 by the RIAA. Pretenders has been named one of the best albums of all time by VH1 (#52). In 2003, Rolling Stone magazine ranked the album number 155 on its list of the 500 greatest albums of all time, and, in 1989, ranked it the 20th best album of the 1980s. In 2012, Slant Magazine listed the album at #64 on its list, &quot;Best Albums of the 1980s&quot;.\n\nPretenders was remastered and re-released in 2006 and included a bonus disc of demos, B-sides and live cuts, many previously unreleased. &quot;Cuban Slide&quot; and &quot;Porcelain&quot; originally appeared as B-sides to &quot;Talk of the Town&quot; and &quot;Message of Love&quot;, while &quot;Swinging London&quot; and &quot;Nervous But Shy&quot; both appeared on the flip side of &quot;Brass in Pocket&quot;. The Regents Park Demo of &quot;Stop Your Sobbing&quot; was included initially as a flexi-single in the May 1981 edition of Flexipop magazine. The tracks &quot;Message of Love&quot;, &quot;Talk of the Town&quot;, &quot;Porcelain&quot; and &quot;Cuban Slide&quot; alongside a live version of the album's opening track, &quot;Precious&quot;, were released on a follow-up EP entitled Extended Play soon after.\n\nPretenders was also reissued in 2009 by Audio Fidelity as a limited edition, audiophile gold CD using the original master tapes. However, this remaster suffered from limiting supposedly applied after engineer Steve Hoffman's digital master was created and approved. The song &quot;The Phone Call&quot; is missing some of the sound effects on this release because they were flown in after the master was completed for the song and, as a result, weren't on the original master tape. There were no bonus tracks included.\n\nA shortened version of &quot;Tequila&quot; would be performed nearly fifteen years later on the Last of the Independents. &quot;Sabre Dance&quot; features Chrissie Hynde singing portions of &quot;Stop Your Sobbing&quot; over lengthy solos by James Honeyman-Scott and Martin Chambers' insistent drumming, making it a truly unique version.\n\nA cover version of &quot;Brass in Pocket&quot; and the master version of &quot;Precious&quot; are available as downloadable content for Rock Band.\n--------------------------------------------------------------------------------\n\nThe Pretenders:\n\nMartin Chambers: drums, backing vocals\nPete Farndon: bass guitar, backing vocals\nJames Honeyman-Scott: lead guitar, keyboards, backing vocals\nChrissie Hynde: rhythm guitar, lead vocals\n\n\nAdditional Musicians:\n\nFred Berk: bass guitar on CD2, track 3\nGeoff Bryant: horn\nHenry Lowther: trumpet\nGerry Mackelduff: drums on CD1, track 7 and CD2, tracks 4, 5, 7, 9, 10\nChris Mercer: saxophone\nNigel Pegrum: drums on CD2, track 3\nChris Thomas: keyboards, sound effects, production\nJim Wilson: trumpet","torrent":{"xt":"urn:btih:50e6f7866060f779230231b2807ffa7e1c6329fb","amp;dn":"Pretenders+-+Pretenders+%5B2+CD%27s%5D%5B1979%5D%5B2015%5D%5B320+KBPS%5D%5BDE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50e6f7866060f779230231b2807ffa7e1c6329fb","infoHashBuffer":{"type":"Buffer","data":[80,230,247,134,96,96,247,121,35,2,49,178,128,127,250,126,28,99,41,251]},"announce":[],"urlList":[]}}