{"title":"Rihanna - Rehab  (Xvid-2nafish)","uid":5197893,"size":77462132,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:50eb00d67af08598c3b35d298b400c681a4b972d&amp;dn=Rihanna+-+Rehab++%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1260011196,"description":"Source: TV\n\nFile Info:\n\nValid : Yes [AVI]\nDuration : 00:04:35\n\n[Video]\nResolution : 720x540\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 717 Kbps\nQuality Factor : 0.06 b/px\n\n[Audio]\nCodec : Microsoft PCM Format\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 1536 Kbps\n\n\n\nThis video has no logo.\n\n&quot;Rehab&quot; is the eighth and final single taken from Rihanna's third studio album, Good Girl Gone Bad (2007) in the US and the UK. It was written by Justin Timberlake, Timbaland and Hannon Lane, with Timberlake and Timbaland contributing backing vocals in its bridge.\n\nRihanna and Justin Timberlake filmed a music video directed by Anthony Mandler for the song &quot;Rehab&quot; at Vasquez Rocks Park outside of Los Angeles on October 21, 2008. The video premiered November 17, 2008 on MTV.com and uses the radio edit of the song.\n\nThe video starts with Rihanna on the hood of a car in the desert with a trailer near by and Timberlake speeding towards her on a motorcycle. It proceeds to show Rihanna and Timberlake in several scenes together in the desert and inside the trailer. There are day and night scenes in the video, and different lighting and lens effects are used throughout, such as green and pink tints and black and white scenes. The scenes with Timberlake and Rihanna are often conveyed as though Rihanna is seeing her ex-boyfriend (Timberlake) everywhere and all the time.\n\n&quot;Rehab&quot; made its first impact on the charts on Billboard's Pop 100, entering at number 73 the chart week of October 18, 2008, and has risen to #19 so far. The song charted for five weeks on the Bubbling Under R&amp;B/Hip-Hop Singles in September 2007 and peaked at #8. On the issue of the November 8, the single debuted at #20 on the Bubbling Under Hot 100 Singles and rose to number 10 on this chart.[9] It officially debuted on the Billboard Hot 100 at #91, moving to a peak of 18 for the issue dated January 03, 2009, making it the 7th single to reach the Top 20 on the 'Billboard Hot 100' from Good Girl Gone Bad, and also making it her 14th overall Top 40 hit. Also on the Hot R&amp;B/Hip-Hop Songs it debuted at #89 and has since moved up to #52. It is the eighth single from Good Girl Gone Bad to enter that chart, selling 700,000 downloads.\n\n&quot;Rehab&quot; debuted at #24 on the New Zealand RIANZ chart and moved to #19 the following week, giving Rihanna her seventh consecutive top twenty hit there from Good Girl Gone Bad. It has since peaked at #12 and was certified Gold after twelve weeks selling over 7,500 copies. In Australia, &quot;Rehab&quot; debuted at #62 on the ARIA Singles Chart based on downloads and since risen to #26.\n\nDespite there being no confirmed physical release, on November 23, 2008, the song entered the UK Singles Chart at #51 on downloads alone and rose to a peak of #16. Despite it being Rihanna's second lowest (the lowest from Good Girl Gone Bad) charting single in the UK, it marked her 12th consecutive top twenty single in the country. It spent sixteen weeks inside the top 100 of the UK Singles Chart before dropping out.\n\nIn Canada it debuted #56 on the Canadian Hot 100 based on downloads and moved up to #37 the following week. It peaked at #19.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:50eb00d67af08598c3b35d298b400c681a4b972d","amp;dn":"Rihanna+-+Rehab++%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50eb00d67af08598c3b35d298b400c681a4b972d","infoHashBuffer":{"type":"Buffer","data":[80,235,0,214,122,240,133,152,195,179,93,41,139,64,12,104,26,75,151,45]},"announce":[],"urlList":[]}}