{"title":"Gray Hat Hacking - The Ethical Hackers Handbook, 3rd Edition [Ne","uid":7549792,"size":9939917,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50ee2602d7d3a07a83c07205ebcf85fbf277d215&amp;dn=Gray+Hat+Hacking+-+The+Ethical+Hackers+Handbook%2C+3rd+Edition+%5BNe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NepsterJay","files":1,"time":1345452194,"description":"THE LATEST STRATEGIES FOR UNCOVERING TODAY'S MOST DEVASTATING ATTACKS\n\nThwart malicious network intrusion by using cutting-edge techniques for finding and fixing security flaws. Fully updated and expanded with nine new chapters, Gray Hat Hacking: The Ethical Hacker's Handbook, Third Edition details the most recent vulnerabilities and remedies along with legal disclosure methods. Learn from the experts how hackers target systems, defeat production schemes, write malicious code, and exploit flaws in Windows and Linux systems. Malware analysis, penetration testing, SCADA, VoIP, and Web security are also covered in this comprehensive resource.\n\n* Develop and launch exploits using BackTrack and Metasploit\n* Employ physical, social engineering, and insider attack techniques\n* Build Perl, Python, and Ruby scripts that initiate stack buffer overflows\n* Understand and prevent malicious content in Adobe, Office, and multimedia files\n* Detect and block client-side, Web server, VoIP, and SCADA attacks\n* Reverse engineer, fuzz, and decompile Windows and Linux software\n* Develop SQL injection, cross-site scripting, and forgery exploits\n* Trap malware and rootkits using honeypots and SandBoxes","torrent":{"xt":"urn:btih:50ee2602d7d3a07a83c07205ebcf85fbf277d215","amp;dn":"Gray+Hat+Hacking+-+The+Ethical+Hackers+Handbook%2C+3rd+Edition+%5BNe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50ee2602d7d3a07a83c07205ebcf85fbf277d215","infoHashBuffer":{"type":"Buffer","data":[80,238,38,2,215,211,160,122,131,192,114,5,235,207,133,251,242,119,210,21]},"announce":[],"urlList":[]}}