{"title":"The Marx Brothers in a Nutshell (TV) [1982] Robert B. Weide","uid":6857798,"size":1036332907,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:510c82553dbf01e80dfbdd4ee0562ce73bce47d4&amp;dn=The+Marx+Brothers+in+a+Nutshell+%28TV%29+%5B1982%5D+Robert+B.+Weide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1322765686,"description":" &lt;a href=&quot;http://bayimg.com/palEKAadc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/palEKAadc&lt;/a&gt;\n\nThe Marx Brothers in a Nutshell (TV 1982) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0251231/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0251231/&lt;/a&gt;\n\nLOW QUALITY MPG\n\nCowritten by dutiful Marx Brothers scholar Joe Adamson and Robert B. Weide, directed by Richard Patterson and narrated by Gene Kelly, the two-hour film traces the history of the Marxes from the days of vaudeville (when Gummo and Zeppo were part of the act) on through their Broadway career, films and Groucho's television show &quot;You Bet Your Life.&quot; \n\nMost of the clips one would expect to be shown are, including cherished outrages from Cocoanuts, Animal Crackers, Horse Feathers, Duck Soup and the MGM classics A Night at the Opera and A Day at the Races (Room Service seems to be missing, but it's negligible). Groucho sings &quot;Hello, I Must Be Going,&quot; Chico plays the piano and says, to Louis Calhern, &quot;attsa some joke, eh boss?&quot; and Harpo pulls everything but the kitchen sink out from his huge coat, and at one point goes three rounds with the majestically unflappable Margaret Dumont. \n\nThere is rare footage, too--of the boys in a hot-rod race with child star Jackie Cooper; of Chico, in a beret, soliciting autographs (and phone numbers) from chorus girls with W.C. Fields; and of a Paramount publicity film that preserves a scene from the 1924 Marx stage hit I'll Say She Is, including hilariously inadequate Maurice Chevalier imitations the lads later reprised in Monkey Business. \n\nIn interviews, those who knew and worked with the Marx Brothers recall them glowingly, though one can see how they might have gotten on people's nerves at the time. When touring with the brothers in a stage show, Margaret Dumont threatened to quit every single night, according to actress Margaret Irving, thinking she'd had enough. Arthur Marx, Groucho's son, says, &quot;My mother had no sense of humor about anything, especially my father&quot;; Groucho had two other wives, later. \n\nChico, says his daughter Maxine, was &quot;the most seductive human being . . . If he wanted you to love him, you loved him&quot;; and a crony recalls him as &quot;the best pinochle player in the world.&quot; A brief clip is shown of Harpo's appearance with Edward R. Murrow on &quot;Person to Person&quot; (no, he didn't speak, not even there), and it is remembered of him that he wanted to adopt enough children to have one in each window of his big Palm Springs house. \n\nIt is all but impossible to love the Marx Brothers and not enjoy this show. It is all but impossible to enjoy this show and not come away from it loving the Marx Brothers even more than one already did. Anarchists don't have all the answers; they just know there aren't any answers, and the Marx Brothers contributed to human sanity perhaps the most jubilant and inspired comic anarchy the world has ever known.\n\n","torrent":{"xt":"urn:btih:510c82553dbf01e80dfbdd4ee0562ce73bce47d4","amp;dn":"The+Marx+Brothers+in+a+Nutshell+%28TV%29+%5B1982%5D+Robert+B.+Weide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"510c82553dbf01e80dfbdd4ee0562ce73bce47d4","infoHashBuffer":{"type":"Buffer","data":[81,12,130,85,61,191,1,232,13,251,221,78,224,86,44,231,59,206,71,212]},"announce":[],"urlList":[]}}