{"title":"The Fabric of The Cosmos - Brian Greene (High Quality)","uid":4823132,"size":368084965,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:51a57be92de3ade00e7de77c3d5f61bede0c71c9&amp;dn=The+Fabric+of+The+Cosmos+-+Brian+Greene+%28High+Quality%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"yitzhak4271","files":-1,"time":1238845429,"description":"By Brian Greene (Author)\n&amp; Erik Davies (Narrator)\nRipped in high quality. 128kb, 16 bit Stereo.\nIncludes Retail and Hi-contrast Cover Art.\nPlaylist included.Tags complete.\n\n\n\nSpace and time form the very fabric of the cosmos. Yet they remain among the most mysterious of concepts. Is space an entity? Why does time have a direction? Could the universe exist without space and time? Can we travel to the past? Greene uses these questions to guide us toward modern science's new and deeper understanding of the universe. He reveals our world to be very different from what common experience leads us to believe. In language anyone can uderstand, he explains:\n \n * Newton's unchanging realm in which space and time are absolute\n * Einstein's fluid conception of space-time\n * The entangled arena of Quantum Mechanics. Vastly distant objects can instantaneously coordinate their behavior or even undergo teleportation\n\nFocusing on the enigma of Time, Greene establishes that:\n * Nothing in the laws of physics insists that it run in any particular direction\n * Time's arrow is a relic of the universe's condition at the moment of the Big Bang. \n\nIn explaining the Big Bang itself, Greene shows how recent cutting-edge developments in superstring and M-theory may reconcile the behavior of everything from the smallest particle to the largest black hole.\n\nThis startling vision culminates in a vibrant eleven-dimensional multiverse, pulsating with ever-changing textures, where space and time themselves may dissolve into subtler, more fundamental entities. He explains it all with the trademark wit, humor, and brilliant use of analogy that have made The Elegant Universe a modern classic. Dr. Greene takes us, regardless of our education, on an irresistible and revelatory journey to layers of reality that modern physics has discovered lying just beneath the surface.","torrent":{"xt":"urn:btih:51a57be92de3ade00e7de77c3d5f61bede0c71c9","amp;dn":"The+Fabric+of+The+Cosmos+-+Brian+Greene+%28High+Quality%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51a57be92de3ade00e7de77c3d5f61bede0c71c9","infoHashBuffer":{"type":"Buffer","data":[81,165,123,233,45,227,173,224,14,125,231,124,61,95,97,190,222,12,113,201]},"announce":[],"urlList":[]}}