{"title":"Beth Orton - Sugaring Season [2012] flac","uid":8359236,"size":227997658,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:51a8bcb6faa1800e1ad546245801581f3b1355bb&amp;dn=Beth+Orton+-+Sugaring+Season+%5B2012%5D+flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1365571247,"description":"---------------------------------------------------------------------\n                    Beth Orton - Sugaring Season\n---------------------------------------------------------------------\n\nArtist...............: Beth Orton\nAlbum................: Sugaring Season\nGenre................: Folk, World, &amp; Country\nSource...............: NMR\nYear.................: 2012\nRipper...............: NMR\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 57 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nTags.................: VorbisComment\nInformation..........: http://www.allmusic.com/album/sugaring-season-mw0002410239\n\nLabel Anti- ?7118-2\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. Beth Orton - Candles                                    [04:32]\n   2. Beth Orton - Dawn Chorus                                [03:23]\n   3. Beth Orton - Something more Beautiful                   [03:45]\n   4. Beth Orton - Magpie                                     [03:27]\n   5. Beth Orton - Poison Tree                                [03:52]\n   6. Beth Orton - Call me the Breeze                         [04:05]\n   7. Beth Orton - See through Blue                           [01:54]\n   8. Beth Orton - State of Grace                             [04:00]\n   9. Beth Orton - Last Leaves of Autumn                      [04:14]\n  10. Beth Orton - Mystery                                    [04:07]\n\nPlaying Time.........: 37:24\nTotal Size...........: 217.39 MB\n\n---------------------------------------------------------------------\n\nSugaring Season is Beth Orton's first album in six years. Reportedly, she almost gave up music in the interim. Recorded in Portland, Oregon with producer Tucker Martine, the album finds her accompanied by a stellar backing band -- keyboardist Rob Burger, bassist Sebastian Steinberg, and jazz drummer Brian Blade -- as well as a sterling array of guests including guitarist Marc Ribot, violinist Eyvind Kang, and her husband, songwriter and guitarist Sam Amidon, to name a few. The title refers to the time of year when maple trees are &quot;tapped&quot;; gallons of sap are collected, then boiled down to remove their bitterness; the slight remainder is used for maple syrup. It's a metaphor for these ten songs. While Orton's lyrics are as mercurial as ever, there is a sense of a life cycle here. She semi-details travails during a period of waiting and confusion with no clear direction in &quot;Magpie.&quot; Its last line offers a darkly tinged surrender: &quot;Silence me and I won't be here anymore.&quot; The drama in the tune is picked up by Kang's viola, Blade's insistent, syncopated shuffle, and the interplay between Ribot's electric guitar and Amidon's high-tuned acoustic and her own. Orton took regular lessons with the late Bert Jansch toward the end of his life, and it shows here. Her playing shines throughout. Her singing voice, which has been her trademark since &quot;Central Reservation,&quot; is richer, fuller, more assertive here than ever before. &quot;Candles&quot; features her live vocal atop a rehearsal take -- her band didn't know she was taping. The deep register of cello, Burger's slippery electric piano, and Blade's brushwork capture the moment of creation perfectly, while her voice is unrestrained in its response. &quot;See Through Blue,&quot; with its old-timey waltz arrangement, is a song written for her daughter. This might have been a maudlin moment on the album; it's not. Instead, it is sprightly and mellifluous, as Nico Muhly's string arrangement meets Burger's clipped upright piano, with a strolling bassline and her voice shifting gears through her register, from smoky contralto to falsetto. Closer &quot;Mystery&quot; is among the most beautiful songs Orton's ever written. It's elliptical, open-ended, and free of the world-weariness that has often reigned in her singing voice. The song is an offer of solace and comfort. It offers respite as it whispers to a close. Sugaring Season is sophisticated, mature, and rife with quiet passion. Its songs are informed by the struggles inherent in everyday life, but also account for dreams, small triumphs, and the redemptive power of love. It is a most welcome return from exile.","torrent":{"xt":"urn:btih:51a8bcb6faa1800e1ad546245801581f3b1355bb","amp;dn":"Beth+Orton+-+Sugaring+Season+%5B2012%5D+flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51a8bcb6faa1800e1ad546245801581f3b1355bb","infoHashBuffer":{"type":"Buffer","data":[81,168,188,182,250,161,128,14,26,213,70,36,88,1,88,31,59,19,85,187]},"announce":[],"urlList":[]}}