{"title":"Cabelas.Big.Game.Hunter.Pro.Hunts.PS3-GCP","uid":9893958,"size":3006128088,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:524ba28fab454be412c6cfbfa87f72e08b07a344&amp;dn=Cabelas.Big.Game.Hunter.Pro.Hunts.PS3-GCP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Thhaque","files":211,"time":1396675695,"description":"More Exclusive:\n &lt;a href=&quot;\nhttp://www.celeritygames.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.celeritygames.com/&lt;/a&gt;\n\nRelease: 2014\n\nName: Cabelas Big Game Hunter Pro Hunts \nGame Release date: 2014.03 \nPlatform: XBOX360, PS3 \n\nGenre: Sport Hunt \nDeveloper: Cauldron \nPublisher: Activision \nRegion: USA \nWhen the disc: BLUS31274 \nInterface Language: Englisch \nSysytem Software: 4.46\n\n\nCabela's Big Game Hunter Pro Hunts latest version of the series game hunting animals that have been released by a company Activision for PS3 console. The game puts players in the role of professional hunters. 4 killed as player characters do appear to include Wade Middleton, Jim Shockey, Ralph and Vicki Cianciarulo. America has played in four different areas of each region cycle dynamics, detail and has its own unique wildlife. The MAC in the southwest America, Eastern and Pacific Northwest forests are all made ??with the good.\nCabelas Big Game Hunter Pro Hunts Screenshot 1 Cabelas Big Game Hunter Pro Hunts Screenshot 2 Cabelas Big Game Hunter Pro Hunts Screenshot 3 Cabelas Big Game Hunter Pro Hunts Screenshot 4 Cabelas Big Game Hunter Pro Hunts Screenshot 5\nCabela's Big Game Hunter: Pro Hunts takes players on a single-player campaign with four field-proven experts from the competitive world of big game hunting.\nAll four renowned hunters will impart their unique hunting skills to players through an exciting series of pro-guided hunts against North America's most cunning and sought-after trophy animals. Additionally, fans will find a richer, more engaging, first-person action experience, including improved ballistic physics, more realistic, thoughtful animal AI and four diversely populated, sweepingly beautiful environments across the continent.\nFeatures: \n- Smarter and Deadlier Predators: \n- The new Prowler animal AI engine simulates pack social hierarchies, coordinates complex group tactics and takes advantage of the surroundings to set up deadly ambushes. \n- New Maneater Co-op Mode: Two players can join together to take on wave after wave of increasingly deadly beasts in the all-new split screen Maneater mode.\nMore info (open / close)\nSpecifications","torrent":{"xt":"urn:btih:524ba28fab454be412c6cfbfa87f72e08b07a344","amp;dn":"Cabelas.Big.Game.Hunter.Pro.Hunts.PS3-GCP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"524ba28fab454be412c6cfbfa87f72e08b07a344","infoHashBuffer":{"type":"Buffer","data":[82,75,162,143,171,69,75,228,18,198,207,191,168,127,114,224,139,7,163,68]},"announce":[],"urlList":[]}}