{"title":"Lesley Garrett - Amazing Grace (2008)","uid":6222925,"size":120977694,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:52b408b61488ac8271d4d206dd15ee88f4421824&amp;dn=Lesley+Garrett+-+Amazing+Grace+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"piratetorrent1989","files":-1,"time":1299408370,"description":"Lesley Garrett CBE (born 10 April 1955) is an English musician, broadcaster and media personality.\n\nGarrett has had an extensive music career. A graduate of the Royal Academy of Music, she won the Decca Prize of the Kathleen Ferrier Award in 1979, thereby launching her career. During her time as principal soprano at English National Opera, she became well-known for her performances in productions of the operas Serse, Le Nozze di Figaro, CosÃƒÂ¬ fan tutte and Die Fledermaus.\n\nGarrett has performed across the world, in countries throughout Europe, and also the United States, Australia, Russia, Brazil, Japan, Malaysia, Taiwan and South Korea. She has also sung opera and pop classics with Bryan Ferry, The Eurythmics and Mick Hucknall to celebrate the arrival of the new century on Millennium Eve, in the grounds at the Royal Observatory and National Maritime Museum.\n\nShe played the lead role of Hanna Glawari in the Welsh National Opera's production of The Merry Widow, which toured the United Kingdom in 2005. As of November 2006, for six months she is performing as Mother Abbess in Andrew Lloyd Webber's revival of The Sound of Music. In 2008, she joined the cast of Carousel as Nettie Fowler. The production toured the UK and then transferred to the West End's Savoy Theatre.\n\nGarrett created the role of Cathy in the London studio recording of Bernard J. Taylor's operatic version of Wuthering Heights, which also featured Dave Willetts, Bonnie Langford and other leading singers from the British musical stage. Her rendition of &quot;I Belong to The Earth&quot; was included on two of her solo albums.\n\nAs a recording artist, Garrett has released eleven solo albums. Many of them have been successful, receiving gold and silver status. Soprano in Red received the Gramophone Award for &quot;Best-selling Classical Artist of the Year&quot;. Garrett was also a featured artist on the platinum selling &quot;Perfect Day&quot; single released by the BBC in aid of Children in Need.\n\nGarrett is a member of the board of the English National Opera. In 2002, she was awarded the CBE for her services to music. She performed at the FA Cup Final final at the new Wembley Stadium alongside Sarah Brightman in 2007, before the match between Manchester United and Chelsea, and in 2008 alongside Katherine Jenkins before the match between Cardiff City and Portsmouth.","torrent":{"xt":"urn:btih:52b408b61488ac8271d4d206dd15ee88f4421824","amp;dn":"Lesley+Garrett+-+Amazing+Grace+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52b408b61488ac8271d4d206dd15ee88f4421824","infoHashBuffer":{"type":"Buffer","data":[82,180,8,182,20,136,172,130,113,212,210,6,221,21,238,136,244,66,24,36]},"announce":[],"urlList":[]}}