{"title":"EllaKross---Tormenting My Slave with multiple Ruined Orgasms","uid":11411020,"size":721946231,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:52eb13220ba56989c18def9d44dacfcd41635e09&amp;dn=EllaKross%5C---Tormenting+My+Slave+with+multiple+Ruined+Orgasms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1415533783,"description":"EllaKross  Tormenting My Slave with multiple Ruined Orgasms\n\n\nType: WMV \nDuration: 00:13:25 \nResolution: 1920x1080 \nFile Size: 688 MB \n\n Even though my slave's pissed me off today I decide that I've tortured him for it enough and will finally let him cum. As he stands naked before me I lube up my hand and begin jerking his hard cock. I let him know that there will be a surprise ending but refuse to tell him just what it will be. &quot;You're going to cum in my hands and I'm going to have a surprise for you, but not right now,&quot; I say as I continue stroking his big dick. His hips thrust back and forth as he fucks my lubricated hand and I play with his balls as he moans softly in pleasure. &quot;Give it to me!&quot; I demand as I finally let him cum. Mere seconds before he begins spraying his warm load I cruelly stop stroking his cock and ruin his orgasm completely. His cum shoots all over the floor as I watch, refusing to touch his cock. He's barely finished cumming when I reveal the big surprise: he's going to cum a second time, whether he likes it or not! Without giving him a break I immediately begin tugging on his tired, sore cock again as he cries out in protest. &quot;I want to see it one more time!&quot; I bark as I jerk his raw, tender dick hard and fast. &quot;No, Mistress, ow!&quot; he screams as I stroke him until he cums a second time. I ruin that orgasm for him as well by playing the same evil trick that I did before: refusing to touch his dick as he cums. Once he's finished, I waste no time jerking his shaft hard and fast once again. &quot;Please stop, I can't anymore!&quot; he cries out yet I refuse to \n\n\nScreens                         \n               &lt;a href=&quot;\nhttp://image.bayimg.com/9b56c50e2c4f8556b2906a5fe6b2766b5b391803.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/9b56c50e2c4f8556b2906a5fe6b2766b5b391803.jpg&lt;/a&gt;\n\n\n16 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\n\nAny Questions ?? Read our FAQ!!\n                                                    &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:52eb13220ba56989c18def9d44dacfcd41635e09","amp;dn":"EllaKross%5C---Tormenting+My+Slave+with+multiple+Ruined+Orgasms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52eb13220ba56989c18def9d44dacfcd41635e09","infoHashBuffer":{"type":"Buffer","data":[82,235,19,34,11,165,105,137,193,141,239,157,68,218,207,205,65,99,94,9]},"announce":[],"urlList":[]}}