{"title":"Holy Fuck - 2007 - LP","uid":4133698,"size":73493665,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:530bd54f8ca5510ee690c8abd4d214192b5c0ab4&amp;dn=Holy+Fuck+-+2007+-+LP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"amowgli","files":11,"time":1208165791,"description":"Holy Fuck - 2007 - LP\n---------------------\n\n01. Super Inuit (Live) 3:34\n02. Milk Shake 3:29\n03. Frenchy&amp;#039;s 2:54\n04. Lovely Allen 4:31\n05. The Pulse 5:56\n06. Royal Gregory 3:51\n07. Echo Sam 4:18\n08. Safari 4:24\n09. Choppers 4:16\n\nHoly Fuck have started a legacy based on near stupidity. It started with a simple concept, to mimic modern electronic music without using modern fail safes like laptops and programmed backing tracks. They wanted to make music breathe new life with every new performance, take daring risks on high wire, and threaten always to collapse around the bewildered audience. So they armed themselves with a drum set, a bass guitar, a myriad of toy keyboards, guitar peddles, mixers, and even a 35 mm film synchronizer. They hit the stage at last year&amp;#039;s NXNE festival, without even rehearsing. Luckily they remembered to bring extra batteries.\n\nSure what they came up with sounded more like German kraut rock, or a noisy, hypnotic Suicide. But it was the audience&amp;#039;s reaction that was totally unpredicted; they danced, smashed stuff, freaked out... one girl even cried. Now just over a year\nlater they have played super-festivals like Coachella, CMJ, SXSW, POP Montreal, Montreal Jazz, and have even been invited to All Tomorrow&amp;#039;s Parties in London and Vegoose in Las Vegas.\nThey have hooked up and collaborated frequently with Anti Pop MC Beans. They still do it with the same duct taped keyboards, film editing gear, still without rehearsing. The line up continues to mutate but maintains its core: Brian Borcherdt,\nGraham Walsh, Kevin Lynn, and drummers Glenn Milchem and Loel Campbell.\n\nSpin magazine recently described Holy Fuck as &quot;blip-hoppers&quot;. Other amusing descriptions are &quot;a shabbily dressed Kraftwerk&quot; and even &quot;Toronto&amp;#039;s evil super group&quot;. While it is difficult to describe the sounds made by mashed up Casio beats, layered with pounding drums and scratched up film tape, the one comment that is on everyone&amp;#039;s lips is... well, &quot;Holy Fuck&quot;!","torrent":{"xt":"urn:btih:530bd54f8ca5510ee690c8abd4d214192b5c0ab4","amp;dn":"Holy+Fuck+-+2007+-+LP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"530bd54f8ca5510ee690c8abd4d214192b5c0ab4","infoHashBuffer":{"type":"Buffer","data":[83,11,213,79,140,165,81,14,230,144,200,171,212,210,20,25,43,92,10,180]},"announce":[],"urlList":[]}}