{"title":"Emergency.2014.Upgrade.Pack-RELOADED","uid":9200213,"size":4798914243,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:53519238a0467c865c2f1c12aaf8821b2bdb1092&amp;dn=Emergency.2014.Upgrade.Pack-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1384577450,"description":"\n                                      nERv\n\n\n             Emergency 2014 Upgrade Pack (c) Quadriga Games\n\n      11/2013 :..... RELEASE.DATE .. PROTECTION .......: PCD\n            1 :.......... DISC(S) .. GAME.TYPE ........: Simulation\n\n\nYou have command of paramedics, fire brigades, police and disaster relief.\nSend your teams out on tense real-time missions to deal with disasters in\nEuropes major centres. In the series most absorbing game yet, you will\nextinguish major fires, track down buried victims and save whole cities with\ntheir populations and landmarks.\nDevelop your own strategy and remain in control of the situation at all times\non sandbox maps.\n\nThere are four new single player missions where meteorite strikes threaten\nthe population.\n\nIt is 1890. Asteroid Caligula passes the Earths orbit, coming so close to\nthe planet that fragments breaking off it (meteorites) impact the Earth. A\nfarmstead is struck and destroyed by a meteorite in the Rhine province of the\nGerman Empire. The conflagration threatens to spread to nearby towns. In this\nunique historical mission, the player takes charge of historical units (a\npumper and firefighters) to get the situation back under control.\n\nAbout 100 years later, Caligula is approaching the Earth again. Only this\ntime, it is on a direct collision course with our blue planet. Once again,\nits coming is heralded by meteorite impacts. The player with his forces and\nvehicles attempts to contain the local disasters and protect the civilians at\nthree different locations, including the city of Pisa, in which the famous\nleaning tower is destroyed in a spectacular meteorite strike.\n\nEmergency 2014 includes the entire content of Emergency 2013 and Emergency\n2012 DELUXE, and adds countless eventful hours of gameplay, new spectacular\nvideos and new units such as fire helicopters and the historical horse-drawn\npumper to the popular series.\n\nProtect! Rescue! Salvage!  Be where you are needed most!\n\nKey Features\n* The ultimate collection of the popular simulation series, including new\ncontent for additional hours of fun!\n* Includes the entire content of Emergency 2013 and Emergency 2012 DELUXE,\nand adds new units such as fire helicopters to the popular series\n* 4 new missions where Earth is threatened by meteorite strikes, including\nPisa and a historical bonus mission with horse-drawn pumper\n* More than 20 missions and additional sandbox maps as well as unpredictable\nevents\n\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install this addon. Emergency 2013 is required to install this upgrade\n   pack. We have tested it with Emergency.2013-RELOADED.\n4. Copy over the cracked content from the /Crack directory on the image to\n   your game install directory.\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!\n","torrent":{"xt":"urn:btih:53519238a0467c865c2f1c12aaf8821b2bdb1092","amp;dn":"Emergency.2014.Upgrade.Pack-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53519238a0467c865c2f1c12aaf8821b2bdb1092","infoHashBuffer":{"type":"Buffer","data":[83,81,146,56,160,70,124,134,92,47,28,18,170,248,130,27,43,219,16,146]},"announce":[],"urlList":[]}}