{"title":"Surfactants from Renewable Resources","uid":12013402,"size":2756774,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5387582e6de387309e86bec388d2ca297c486f1e&amp;dn=Surfactants+from+Renewable+Resources&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1434262302,"description":"ISBN 9780470760413\n\nMost modern surfactants are readily biodegradable and exhibit low toxicity in the aquatic environment, the two criteria for green surfactants. However the majority are synthesised from petroleum, so over the past decade the detergent industry has turned its attention to developing greener routes to create these surfactants via renewable building blocks.\nSurfactants from Renewable Resources presents the latest research and commercial applications in the emerging field of sustainable surfactant chemistry, with emphasis on production technology, surface chemical properties, biodegradability, ecotoxicity, market trends, economic viability and life-cycle analysis.\n\nReviewing traditional sources for renewable surfactants as well as recent advances, this text focuses on techniques with potential for large scale application.\n\nTopics covered include:\n\nRenewable hydrophobes from natural fatty acids and forest industry by-products\nRenewable hydrophiles from carbohydrates, amino acids and lactic acid\nNew ways of making renewable building blocks; ethylene from renewable resources and complex mixtures from waste biomass\nBiosurfactants\nSurface active polymers\nThis book is a valuable resource for industrial researchers in companies that produce and use surfactants, as well as academic researchers in surface and polymer chemistry, sustainable chemistry and chemical engineering","torrent":{"xt":"urn:btih:5387582e6de387309e86bec388d2ca297c486f1e","amp;dn":"Surfactants+from+Renewable+Resources","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5387582e6de387309e86bec388d2ca297c486f1e","infoHashBuffer":{"type":"Buffer","data":[83,135,88,46,109,227,135,48,158,134,190,195,136,210,202,41,124,72,111,30]},"announce":[],"urlList":[]}}