{"title":"100 Months by John Hicklenton","uid":10844764,"size":307495037,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:53bab92aa285e7e88dd3d16a71d115ff5b1d98e9&amp;dn=100+Months+by+John+Hicklenton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"YetuAsili","files":-1,"time":1408765190,"description":"100 Months by John Hicklenton\n\nThe final work of a comics visionary, this intense, hallucinatory story with artwork of breathtaking intensity is a true graphic novel, engaging ultimate themes of life, death, and salvation\n \nThe late John Hicklenton was one of Britain's leading comic book artists, famous for the brutal, visceral draughtsmanship he brought to the 2000AD/Judge Dredd titles and Nemesis the Warlock. His final graphic novel is a parable of environmental devastation, depicting the quest of Mara, Warrior and Earth Goddess, as she seeks revenge against the Longpig: a Satanic personification of capitalism, red in tooth and claw, whose followers, a legion of the damned, look quite a lot like us. The world of the Longpig is rich in killing fields and scenes of mass crucifixion that recall Goya, Blake, and Bacon, and represents a true crossover of the graphic novel form with fine art. John took his own life with the help of an assisted dying group, following a heroic struggle with multiple sclerosis. This book was drawn and written in foreknowledge of his imminent death, and its insight into universal themes of life, death, salvation, and damnation seems to come from a place between worlds. Its words those of a prophet, its artwork transcending the comic book form, 100 Months will redefine the adult graphic novel.\n\nProvided in high and low resolution versions. \n","torrent":{"xt":"urn:btih:53bab92aa285e7e88dd3d16a71d115ff5b1d98e9","amp;dn":"100+Months+by+John+Hicklenton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53bab92aa285e7e88dd3d16a71d115ff5b1d98e9","infoHashBuffer":{"type":"Buffer","data":[83,186,185,42,162,133,231,232,141,211,209,106,113,209,21,255,91,29,152,233]},"announce":[],"urlList":[]}}