{"title":"The Bibliophile Mystery series - Kate Carlisle - 1, 2, 3,Epub, M","uid":7159371,"size":3413598,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53c9e2fb4bad81fe74320c94349c22f2cadcf741&amp;dn=The+Bibliophile+Mystery+series+-+Kate+Carlisle+-+1%2C+2%2C+3%2CEpub%2C+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"karaokeking123","files":-1,"time":1333560493,"description":"The Bibliophile Mystery series by Kate Carlisle - books 1, 2 &amp; 3\n\nRequirements: Mobipocket, Sony, MS Reader, 1390 KB \nOverview: Golden Heart and Daphne du Maurier Award winning author Kate Carlisle spent over twenty years working in television production as an Associate Director for game and variety shows, including The Midnight Special, Solid Gold and The Gong Show. She traveled the world as a Dating Game chaperone and performed strange acts of silliness on The Gong Show. She also studied acting and singing, toiled in vineyards, collected books, joined a commune, sold fried chicken, modeled spring fashions and worked for a cruise ship line, but it was the year she spent in law school that finally drove her to begin writing fiction. It seemed the safest way to kill off her professors. Those professors are breathing easier now that Kate spends most of her time writing near the beach in Southern California where she lives with her husband\n\nHomicide in Hardcover - book 1\nmurder is always a bestseller...\nfirst in the new bibliophile mystery series!\nThe streets of San Francisco would be lined with hardcovers if rare book expert Brooklyn Wainwright had her way. And her mentor wouldn't be lying in a pool of his own blood on the eve of a celebration for his latest book restoration.\nWith his final breath he leaves Brooklyn a cryptic message, and gives her a priceless - and supposedly cursed - copy of Goethe's Faust for safekeeping.\nBrooklyn suddenly finds herself accused of murder and theft, thanks to the humorless - but attractive - British security officer who finds her kneeling over the body. Now she has to read the clues left behind by her mentor if she is going to restore justice.\n\nIf Books Could Kill - book 2\nMurder is easy-on paper.\nBook restoration expert Brooklyn Wainwright is attending the world- renowned Book Fair when her ex Kyle shows up with a bombshell. He has an original copy of a scandalous text that could change history-and humiliate the beloved British monarchy.\nWhen Kyle turns up dead, the police are convinced Brooklyn's the culprit. But with an entire convention of suspects, Brooklyn's conducting her own investigation to find out if the motive for murder was a 200-year-old secret-or something much more personal.\n\nThe Lies That Bind - book 3\nBook restoration expert Brooklyn Wainwright returns home to San Francisco to teach a bookbinding class. Unfortunately, the program director Layla Fontaine is a horrendous host who pitches fits and lords over her subordinates. But when Layla is found shot dead, Brooklyn is bound and determined to investigate-even as the killer tries to close the book on her for good.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:53c9e2fb4bad81fe74320c94349c22f2cadcf741","amp;dn":"The+Bibliophile+Mystery+series+-+Kate+Carlisle+-+1%2C+2%2C+3%2CEpub%2C+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53c9e2fb4bad81fe74320c94349c22f2cadcf741","infoHashBuffer":{"type":"Buffer","data":[83,201,226,251,75,173,129,254,116,50,12,148,52,156,34,242,202,220,247,65]},"announce":[],"urlList":[]}}