{"title":"Glauber Rocha - Barravento - Turning Wind (1962)","uid":5052001,"size":957631326,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:544dd48712a8607cd812b856b8fd4165e61fbad3&amp;dn=Glauber+Rocha+-+Barravento+-+Turning+Wind+%281962%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"kerouac_rj","files":4,"time":1250209431,"description":"Glauber Rocha - Barravento - Turning Wind (1962)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0055776/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0055776/&lt;/a&gt;\n\nReview from NY Times\nLEAD: ''BARRAVENTO'' (''The Turning Wind''), opening today at the Public Theater, is the first feature by the highly regarded Brazilian director Glauber Rocha, who died at the age of 42 in 1981. The film, made in 1961, is about the efforts of Firmino, part revolutionary, part devil, to free the fishermen in his native\n\n''BARRAVENTO'' (''The Turning Wind''), opening today at the Public Theater, is the first feature by the highly regarded Brazilian director Glauber Rocha, who died at the age of 42 in 1981. The film, made in 1961, is about the efforts of Firmino, part revolutionary, part devil, to free the fishermen in his native Bahian village from capitalist exploitation and the religious superstition that prevents social \nchange.\n\n''Barravento'' is an exceptionally beautiful work, shot in the dramatically filtered, black-and-white photography associated with Eisenstein's ''Que Viva Mexico!'' and Flaherty's ''Moana.'' In its use of dance and song within - and as comment on - the narrative, it parallels a number of films by Rocha's associates in Brazil's CinemaMNovo movement. Even the fights are choreographed as if they were ballets.\n\nIt's also a far more tidy, far less flamboyant work than Rocha's later films, including ''Antonio das Mortes'' (1968). These are so lavish in their use of legend, left-wing politics and obscure mysticism that they tend to be more popular at film festivals than with ordinary audiences.\n\nThere's nothing obscure about ''Barravento.'' It's poetic but also completely straightforward in its revolutionary concerns. Antonio Sampaio cuts a striking, sinuous figure as the comparatively sophisticated Firmino, who moves through the film as if he were a politically committed Sportin' Life. Nelson Pereira dos Santos, another notable Cinema Novo director (''Vidas Secas,'' ''Amulet of Ogum''), acted as film editor for Rocha on ''Barravento.'' POETIC POLITICS BARRAVENTO, directed by Glauber Rocha; script (Portuguese with English subtitles) by Rocha, Luis Paulino dos Santos and Jose Telles de Magalhaes; photography by Toni Rabattoni and Valdemar Lima; edited by Nelson Pereira dos Santos; produced by Braga Neto and Rex Schindler; production company, Iglu Films. At Public Theater, 425 Lafayette Street. Running time: 76 minutes. This film has no rating.\n\n\nFile Name .........................................: BARRAVENTO_D1.avi\nFile Size (in bytes) ............................: 955,811,840 bytes\nRuntime ............................................: 1:17:15\n\nVideo Codec ...................................: XviD 1.1.0 Beta 2\nFrame Size ......................................: 512x384 (AR: 1.333)\nFPS .................................................: 23.976\nVideo Bitrate ...................................: 1465 kb/s\nBits per Pixel ...................................: 0.311 bpp\nB-VOP, N-VOP, QPel, GMC.............: [B-VOP], [], [], []\n\nAudio Codec ...................................: 0x0055 MPEG-1 Layer 3\nSample Rate ...................................: 48000 Hz\nAudio Bitrate ...................................: 172 kb/s [2 channel(s)] VBR\nNo. of audio streams .......................: 1\n\n\n\n\nEnglish, Spanish, French, Portuguese .idx subtitles\n\nThanks pedroauad for the rip.\n\n\n\n\n*********************************** FREAKYFLICKS *******************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE","torrent":{"xt":"urn:btih:544dd48712a8607cd812b856b8fd4165e61fbad3","amp;dn":"Glauber+Rocha+-+Barravento+-+Turning+Wind+%281962%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"544dd48712a8607cd812b856b8fd4165e61fbad3","infoHashBuffer":{"type":"Buffer","data":[84,77,212,135,18,168,96,124,216,18,184,86,184,253,65,101,230,31,186,211]},"announce":[],"urlList":[]}}