{"title":"Coast to Coast AM June 17, 2013 - Bigfoot &amp; Cryptozoology","uid":8620378,"size":56166072,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:547e17fa8bbb10a5fd1f2a285b488d555879558b&amp;dn=Coast+to+Coast+AM+June+17%2C+2013+-+Bigfoot+%26amp%3B+Cryptozoology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pyramid91","files":5,"time":1372353901,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-17-13\nHost:\nGeorge Noory\nGuests:\nAlex  Hearn,             Katherine  Albrecht,                   Joshua P.  Warren\nAppearing for 90 minutes, paranormal investigator and cryptozoology expert Alex Hearn discussed his Bigfoot sightings, and involvement in the Melba Ketchum Bigfoot DNA study, as well as his work investigating Chupacabras, Thunderbirds, jaguars and black cats. In describing one of his Bigfoot sightings, he said &quot;I was looking at the profile of something that didn't seem much taller than me, but it was massive,&quot; adding that it had a huge brow, and was lifting up some branches. He was only 15-20 feet away on a two-lane road, and observed the creature's face which seemed more human than ape. His face had a demonic appearance which he said reminded him of Bernie Casey in the movie Gargoyles. \nHearn reported that he contributed a Bigfoot sample (a toenail) to Melba Ketchum's study, and the DNA analysis came back as human for the mitochondrial DNA. Her study points to the idea that Bigfoot is a type of hybrid that originated around 15,000 years ago from human stock, he said. What do you think Bigfoot is? Take the C2C Insta-Poll. Hearn also recounted his sighting of a 'Thunderbird,' in the Bridgewater swamp area. The bird had a 12-13 ft. wingspan, and he could hear the sound of its wings flapping. A couple rabbits unleashed death cries as they were swooped up as its prey. \n-----------------------------------------\nIn the last 90 minutes, paranormal investigator Joshua P. Warren spoke live from Puerto Rico, where he's investigating various anomalous activities and creatures such as the chupacabras. Sightings of the chupacabras on the island actually date back to the 1920s, where there was a rash of livestock attacks. Villagers were said to set up a trap with a small goat in it. When they heard the trap go off, they rushed in to find the goat drained of blood, but its attacker gone. &quot;It was as if this thing was literally able to teleport itself outside of the box,&quot; Warren commented, adding that this suggests an alien/interdimensional interpretation, rather than the type of mangy coyotes seen in the American Southwest that have been called chupacabras. \nA chupacabras-type creature was recently sighted by a couple in Puerto Rico who'd gone hiking in the dry forest area, Warren detailed. At first they thought they were looking at a cactus, but as they got closer, they realized it was a greenish predatory creature with spikes and spines all over it. The couple were paralyzed in terror, until the man remembered being told that when encountering such a creature, one should hum a peaceful song or lullaby and slowly back away, which they did. Warren also touched on monkey experiments conducted on the island, as well as the practice of Santeria.  \nNSA Spying &amp; Privacy\nFirst hour guest, privacy advocate Katherine Albrecht commented on the NSA spying revelations, and related events. She believes the Edward Snowden leak of information has finally awakened people to privacy issues, something that she's been calling attention to for the last 14 years. The US government isn't spying on its citizens because of al Qaeda; they're doing it because they're afraid Americans are aware there's a whole lot of corruption in high places, and are politically agitating to do something about it, she said. Further, the people in government are public servants, &quot;and they're supposed to be doing our bidding-- they're not our parents; they should not be taking over,&quot; she added. \nNews segment guests: Steve Kates 'Dr. Sky' , Mish Shedlock\nWebsite(s):\n azcro.net\n examiner.com\n livestream.com/azcronews\n katherinealbrecht.com\n startpage.com\n joshuapwarren.com\nBook(s):\n Spychips\n Pet Ghosts: Animal Encounters from Beyond the Grave\n","torrent":{"xt":"urn:btih:547e17fa8bbb10a5fd1f2a285b488d555879558b","amp;dn":"Coast+to+Coast+AM+June+17%2C+2013+-+Bigfoot+%26amp%3B+Cryptozoology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"547e17fa8bbb10a5fd1f2a285b488d555879558b","infoHashBuffer":{"type":"Buffer","data":[84,126,23,250,139,187,16,165,253,31,42,40,91,72,141,85,88,121,85,139]},"announce":[],"urlList":[]}}