{"title":"The Sex Industrial Complex: Big Sexology, Big Pornography...","uid":4975966,"size":1950620,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54bc98bf93a0c8b6e0750bd9518206ffa5579d6b&amp;dn=The+Sex+Industrial+Complex%3A+Big+Sexology%2C+Big+Pornography...&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CuriousGeorge","files":-1,"time":1246002998,"description":"The Sex Industrial Complex Big Sexology, Big Pornography,&amp; Big Pharmacology\nJudith A. Reisman, Ph.D.\nThe Institute for Media Education\nAuthor, Kinsey, Crimes &amp; Consequences (2003)\nPDF \n77 pages &lt;a href=&quot;\nhttp://drjudithreisman.com/articles.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://drjudithreisman.com/articles.html&lt;/a&gt;\n\nPlayboy's Historical Hate Rape\nBy Judith Reisman\n6-25-9\n \n\nPlayboy's recent online &quot;So Right, It's Wrong&quot; campaign to &quot;hate rape&quot; ten conservative women, providing a gallery with their names, photos and videos has received some rightful condemnation. However, few people realize that &quot;hate rape&quot; mirth is in keeping with Playboy's long history of marketing the sexual assault of women and children.\n \nMany liberals and conservatives were stunned both by Playboy's call to rape the ten ladies in its online issue and by AOL's loyal censorship of those who criticized its 'rape your enemy treatise.'\n \nAfter Playboy dumped its cowardly tract, inevitably, thousands of Playboy-trained users defended its rape campaign as &quot;edgy&quot; &quot;speech.&quot;\n \nIn fact, Playboy's website brags that such 'edgy' erototoxins are busily arousing 10 million Americans plus &quot;partners in more than 50 countries throughout Europe, Latin America and Asia.in 200 countries and territories,&quot; thus growing the demand side of the global sex traffic.\n \nPlayboy is statically documented as long supporting the sex traffic and the rape of women and children as a class -- albeit usually absent specific names.\n \nFor example, the November 1971 Playboy (redacted) image of a naked sleeping child urged dads to do what? &quot;BABY DOLL: It's easy to feel paternalistic to the cuddly type above. Naturally, she digs forceful father figures, so come on strong, Big Daddy!&quot;\n \nHistorically all females, liberal or conservative, are treated with the mandarin slavery mentality of contempt and sexual violence by Playboy and its erototoxic satellites.\n \nScientific research commonly finds sex and drugs co-morbid addictions. As principal investigator for the U.S. Department of Justice, Juvenile Justice and Delinquency Prevention study, Images of Children, Crime &amp; Violence in Playboy, Penthouse and Hustler (Grant No. 84-JN-AX-K007, 1989), my research team documented Playboy's strategic seduction of vulnerable consumers into both addictions.\n \nIn 1987, psychiatrist Dr. Linnea Smith and I reported on &quot;Sports, Children, Drugs, Crime and Violence in Playboy Magazine&quot; to the National Collegiate Athletic Association (NCAA).\n \nYoungsters trust publications that profile sports heroes. Collegiate football players appear in the '50s and college basketball players since November 1977 in Playboy's &quot;All-American Team.&quot;\n \nPlayboy merged sports, sex, and mirthful rape since 1954, adding illicit drugs in 1968. In the late '60s, visual drug scenes appeared, with 28% involving juveniles as glamorous and harmless.\n \nIn 1970, the Playboy Foundation bankrolled NORML, the National Organization for the Repeal of Marijuana Laws (later &quot;Reform&quot;), and lobbied for legalization of cocaine.\n \nIn 1975, market researchers found over 6 million children raised in Playboy homes, many of those who today can laugh at the hate rape crusade. (How many of these are parents whose daughters send naked photos of themselves across the Internet?)\n \nWith Playboy marketing prostitution, selling the Phototron (commonly used to grow marijuana indoors) was a logical extension of its interests.\n \nIn 1979 psychologist, Aaron Hass (Teenage Sexuality) said almost all children trusted Playboy for reliable sex advice, values, and mores. Our early studies found just over 30% of Playboy images were &quot;child magnets.&quot; These were commonly sexualized cartoons and illustrations with special child appeal, (i.e., Santa Claus, Cowboys and Indians, coloring books) like the colorful &quot;Feds 'N Heads&quot; (May 1971) druggie board game.\n \nPlayboy's August 1984 &quot;Official Boy Scout Handbook&quot; awarded a &quot;Water Safety&quot; badge for scouts who had Johnnie Walker straight. Cocaine smoking scouts got a &quot;Free-Basing&quot; badge.\n \nIn our study of 373 Playboy issues, there were 3,045 child images (children under age 18), an average of 8.2 images per issue, 158 (5%) linked to drugs or alcohol; 52% of these were drug and 48% alcohol related.\n \nThis is a quick contextual sketch of Playboy's recent &quot;hate rape&quot; movement as based on a systematic use of cartoons to condition the viewer, to see the mirth in sexualized children, even raped children in photographs.\n \nPlayboy falsely states that they never portrayed children in sex scenes with adults. Fully 415 (14%) of our 3,045 Playboy child images found children in a happy or neutral sex scene with adults. For example, an officer lethargically observes Dorothy's three friends skip off after apparently having raped her. &quot;That's them officer!&quot; (March 1978, p. 231). This was typical of 21% (646) images linking children with nudity and 14% (424) with genital acts.\n \nNo Playboy child sex abuse scene ever showed the child as harmed. Playboy displayed adult-child sex via its fold out biography and in &quot;Sex in Cinema&quot; featuring oral and incestuous activity.\n \nIn sum, Playboy's drugs and child sex rapes are part of a larger context of prostitution propaganda, often in a sadomasochistic or ritual, virgin sacrifice context. Playboy laughs at gang rape, incestuous abuse, juvenile prostitution, necrophilia, and sadomasochism.\n \nHence, Playboy commonly depicts men and boys as impotent, as &quot;too small,&quot; and as rapists. Most children were between six and eleven years of age -- the most common age group for actual incestuous abuse and general child maltreatment. Based on case histories, sex offender and survivor testimonies, child pornography, child prostitution, and sex rings research, and onsite crime evidence, Playboy has long been used to sexually entrap children.\n \nTo do this, Playboy, like all erototoxins, is at war with real men. Liberal Playboy icon Dr. Bernie Zilbergeld wonders why Playboy sexually ridicules men in their cartoons.\n \n&quot;Humor is the basic source of education ... and sexual humor boasts all the old crap and all the old fears. It counts. Sex is loaded with anxiety, even for ten-year-olds. Cartoons that poke fun at impotence or other male inadequacies would outweigh any supportive things said in the advice column&quot; (Thomas Weyr, Reaching For Paradise, 1978, p. 218).\n \nAs in the Playboy &quot;mirthful&quot; cartoon above of a man who sexually assaults a woman in the elevator, men who are ridiculed as impotent, too small, or deformed are at high risk of proving their virility by finding mirth in what they will call &quot;edgy.hate rape&quot; speech and actions.\n \nCowards are historically dangerous to the weak and vulnerable.\n \n \nDr. Reisman, president of the Institute for Media Education, has written frequently for HUMAN EVENTS on Alfred Kinsey. She is the author of Kinsey: Crimes and Consequences The Red Queen and the Grand Scheme and the soon to be released Kinsey's Attic: How One Man's Sexual Pathology Changed the World.\n \nCopyright Ã‚Â© 2009 HUMAN EVENTS. All Rights Reserved.\n\nReleated:\n\nMedia Sexploitation - The Hidden Implants in America's Mass Media (subliminal programming) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4893624/Media_Sexploitation_-_The_Hidden_Implants_in_America_s_Media&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4893624/Media_Sexploitation_-_The_Hidden_Implants_in_America_s_Media&lt;/a&gt;\n\n----------------------------------------------------------------------------------\n\nMy public URL: &lt;a href=&quot;\nhttp://thepiratebay.se/user/TalmudTimmy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/TalmudTimmy&lt;/a&gt;\n\nMy RSS feed: &lt;a href=&quot;\nhttp://rss.thepiratebay.se/user/97bdef327d0ba834f331abb3d0fe47a2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://rss.thepiratebay.se/user/97bdef327d0ba834f331abb3d0fe47a2&lt;/a&gt;","torrent":{"xt":"urn:btih:54bc98bf93a0c8b6e0750bd9518206ffa5579d6b","amp;dn":"The+Sex+Industrial+Complex%3A+Big+Sexology%2C+Big+Pornography...","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54bc98bf93a0c8b6e0750bd9518206ffa5579d6b","infoHashBuffer":{"type":"Buffer","data":[84,188,152,191,147,160,200,182,224,117,11,217,81,130,6,255,165,87,157,107]},"announce":[],"urlList":[]}}