{"title":"Handbook of Paper and Paperboard Packaging Technology 2nd ed","uid":14620230,"size":4166166,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54cbc9b3b1111490cf38375a78ca9a60e040240e&amp;dn=Handbook+of+Paper+and+Paperboard+Packaging+Technology+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1463263959,"description":"Handbook of Paper and Paperboard Packaging Technology 2nd ed - Mark J. Kirwan (Wiley-Blackwell, 2013).pdf\r\n\r\nISBN 978-0-470-67066-8\r\n\r\nThe definitive industry reference on the paper and paperboard packaging sector.\r\n\r\nNow in a fully revised and updated second edition, this book discusses all the main types of packaging based on paper and paperboard. It considers the raw materials, the manufacture of paper and paperboard, and the basic properties and features on which packaging made from these materials depends for its appearance and performance. The manufacture of twelve types of paper- and paperboard-based packaging is described, together with their end-use applications and the packaging machinery involved. The importance of pack design is stressed, as well as how these materials offer packaging designers opportunities for imaginative and innovative design solutions. Environmental factors, including resource sustainability, societal and waste management issues are addressed in a dedicated chapter.\r\n\r\nThe book is directed at readers based in companies which manufacture packaging grades of paper and paperboard, companies involved in the design, printing and production of packaging, and companies which manufacture inks, coatings, adhesives and packaging machinery. It will be essential reading for students of packaging technology and technologists working in food manufacturing who are users of paper and paperboard packaging products.\r\n\r\nPraise for the First Edition\r\n\r\n‘This book is a valuable addition to the library of any forward-looking company by providing in-depth coverage of all aspects of packaging which involve the most ecologically acceptable material, namely paper and paperboard.’—International Journal of Dairy Technology\r\n\r\n‘...a welcome contribution to a field where coverage was previously limited","torrent":{"xt":"urn:btih:54cbc9b3b1111490cf38375a78ca9a60e040240e","amp;dn":"Handbook+of+Paper+and+Paperboard+Packaging+Technology+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54cbc9b3b1111490cf38375a78ca9a60e040240e","infoHashBuffer":{"type":"Buffer","data":[84,203,201,179,177,17,20,144,207,56,55,90,120,202,154,96,224,64,36,14]},"announce":[],"urlList":[]}}