{"title":"Mark Cunningham - The New Curriculum","uid":9807448,"size":8682427471,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:54dfdb38b15eaba60c09f2b1f22fee1714db276c&amp;dn=Mark+Cunningham+-+The+New+Curriculum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":21,"time":1395465677,"description":"Presented for your learning pleasure, study and enjoy! And of course if you like it, buy the real thing from his website, the man is a legend and does so much good.\n\nFormed last year, the Society of Applied Hypnosis is the only professional organization that is dedicated to the competence training, testing and certification of working hypnotists in the world today. Unique in its emphasis that its members must be publicly tested in both their knowledge and skills prior to certification, the Society is pioneering the efforts to move hypnosis from the &quot;alternative&quot; world into the mainstream.\n\nThe course I am presenting worldwide this year as The New Curriculum is designed to be a complete modernization of hypnosis training. As a requirement for membership in the Society for Applied Hypnosis, this experience provides the most comprehensive preparation for professional practice available today. \n\nWhat are the attendees saying? \n\nI must report that this &quot;Intro&quot; course was the best training I've had the\npleasure of attending. The only downside was that with jam packed days of\ntraining there was hardly time to take advantage of Las Vegas which was awesome.\n\nThere isn't a better training, and there probably won't be a better one in\nthe near future, than the one provided by Mark under the Society of Applied\nHypnosis. If you are serious about improving your skills, and also improving\nyour life, this is the only training you should consider. The practice part of the course was set up so that we could practice techniques on each other, so that we would improve our lives for the better. The level of expertise in the attendees was extremely high for an &quot;Intro&quot; course. Probably over half of the attendees had hypnosis certifications, and hypnosis businesses already.\n\nAnd with the level of training available by the S.A.H. I believe the subsequent trainings will attract similarly trained students. So get ready for the training in your area. There is nothing that comes close. You will definitely not be the same person when you come out.\n\n- Marc Carlin, Consulting Hypnotist\n\n\nThe New Curriculum is an explanation of modern theory and practice, incorporating both the latest research and incorporating tools and methods from a wide variety of sources. Included in the latter are techniques I have personally proven in over 15,000 hours of professional clinical practice! There are multiple emphasis within the coursework: emphasis on clients experiencing profound hypnotic effect, emphasis on hypnotist working without patter or props - &quot;out-of-chair experiences&quot; --, extensive use of hypnotic constructs and trance phenomena, and emphasis on teaching and motivating clients to Do for themselves. The processes taught to TNC students embeds exercises and tasks that self-train clients not only to address and solve their reporting problems, but also to be fully capable of solving any subsequent problems themselves!\n\nHistorical matters are called out only as reading assignments. Why waste precious training time droning on about things that you can look up outside of class? Instead, the seminar is taught in a challenging sequence of lecture, demonstration and frequent exercises. Each student must be both hypnotist and subject in each exercise - certificates will be awarded only to those who, in the opinion of the teaching team, have performed adequately in BOTH roles. As an added plus, the content of exercises is user-determined, allowing each student to work through their own challenges within the seminar - a dramatic example of hypnotic effect that is used as convincer for the hypnotist themselves. After all, how better to convince a professional of the efficacy of our techniques than to have the student experience the power of permanent, positive change themselves? \n\nThe output of our training is a competent, confident change artist, far more knowledgeable and competent than the average practitioner. Each newly-certified student is immediately qualified to enter into a professional/clinical internship (such as the one recommended by the SAH).\n\nAnd the best part is that we at the SAH are sitting out the dogma wars. It doesn't matter what modality you prefer, where or how you were first trained, what organizations you belong to -- we're neutral. Our pursuit of efficacy means that we will allow and incorporate ANYTHING that works to the client's benefit, provided it meets a few simple tests: The techniques must be easily taught, their positive effects must be something that any trained hypnotist can replicate, the hypnotic operators must be clearly exposed (as opposed to the dogma-specific parts), and they must not require a change of belief system or lifestyle on the part of the hypnotist.\n\nHaving said that, there ARE a core set of beliefs that power the astonishing effectiveness of the The New Curriculum's techniques. The course covers these in a discussion of the following:\n\n\nSystem of Belief\nWhat is the practice of Hypnosis?\nTerms Defined\nDispelling Misconceptions\nDangers to the Client or Hypnotist\nThree Models of the Mind\nTrance &quot;States&quot; and their characteristics\nUtilization\n\nAbreactions\nRules of the Mind\nA Working Model of Memory\nThe Structure of Beliefs\nEliminating Self-Sabotage\nWell-Formed Outcomes\nUncovering Techniques\nA Malleable Concept of Time\n\nForm that solid base we teach (and test!) a core set of basic techniques suitable for any and all hypnosis clients:\nBasic Techniques:\n\n\nRelaxation on Command\nSetting Positive Resource Anchors\nMicrocosmic Orbit\nUtilizing &quot;Energy&quot; as a Transport Mechanism for Change\nAnchoring &quot;Change&quot; to Autonomic Nervous System\nStructuring Suggestions\nGiving Suggestions/Compounding\nSuggestibility Testing\nElements of Inductions - Hypnotic Operators\nInductions and Emergence\nCreating Inductions\nDeepeners\n\nUse of Hallucinations as Constructs\nConvincers\nEmpowering Your Clients\nSelf-Hypnosis\nWaking Hypnosis\nTrance Within Trance\nRegression\nRecalling Lost/Misapplied Resources\nPropulsion Systems\nInfinite Rehearsal\nIdentify Your True Belief System\nStructure of an Effective Session\n\nIn line with our belief that it's better to clear out the garbage BEFORE renovating the structure, we teach a powerful set of techniques that actually relieve most client's problems even before the direct action begins.\n\nNegativity-Clearing Blind Techniques:\n\n\nResource Organizer\nMemory Librarian\n\nCrystal Bottle\nCottage of Memories\n\nIn my 15,000+ hours of clinical sessions, I have developed an incredibly powerful set of techniques that have been repeatedly proven to work with typical clinical clients the world over. The intelligent application of these techniques will result in your clients going from &quot;hoping&quot; for positive change to confidently expecting the changes they themselves desire.\n\nDirected Outcome Techniques:\n\n\nMaking Rocks Grow\nPolarity Exercise\nGood Decision/Bad Decision\nFinding A Single Outcome\n\nResource Fusion\nConditioning With Pleasure\nTraining Your Client to Recognize and Own Success\nBecoming a Master Hypnotist\n\n\nWe feel that it's not enough to simply address a client's reporting problem - we go on to teach client's the attitudes and techniques required to experience and internalize the process of change itself, so that with luck they will never be forced to rely on professional help ever again. This body of technique specifically addresses the process of Generative Change:\n\nGenerative Change Techniques:\n\n\nThree Instant Alternatives\nAlphabet of Desire\n&quot;Hallucid&quot; Dreaming\n\nJournaling\nFuture Memory\n\n\n\n\n\nAnd in the U.S. only, we also teach a simple, proven business model that will allow a competent practitioner to achieve a comfortable, six-figure income while staying well within accepted standards and practices. We're interested in training hypnotists who are more than just members of the &quot;helping professions&quot; - we're DONE with the model of the starving hypnotist! This section is for those who are interested in Doing Well while Doing Good!\n\nBusiness Model:\n\nThe Only Business Model That Works\nThree Income Streams for Professionals\nStructuring Your Practice\nProfessional Marketing Successful Advertising\nManagement Metrics\nInternships and Mentoring\n\n\nThe New Curriculum is structured as a 5-day, 60 hour course of intensive training. And this year we are holding the cost down to $1,125! If you are truly interested in entering one of the most exciting professions today, or if you are a working professional who wants to learn how to maximize your positive impact on your clients, this course is the only choice for you. I SUGGEST you join us at the live event in Chicago , February 20 - 24!\n\nSee you there!\n\nMark Cunningham\nMaster Hypnotist and Trainer, Trucor Inc.","torrent":{"xt":"urn:btih:54dfdb38b15eaba60c09f2b1f22fee1714db276c","amp;dn":"Mark+Cunningham+-+The+New+Curriculum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54dfdb38b15eaba60c09f2b1f22fee1714db276c","infoHashBuffer":{"type":"Buffer","data":[84,223,219,56,177,94,171,166,12,9,242,177,242,47,238,23,20,219,39,108]},"announce":[],"urlList":[]}}