{"title":"Final.Fantasy.XIII-2.NTSC.XBOX360-SWAG","uid":9480773,"size":8292192132,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:558bd396c594a9d08462c72a30f0cdb01a9624ce&amp;dn=Final.Fantasy.XIII-2.NTSC.XBOX360-SWAG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"ffm58","files":86,"time":1389793091,"description":"FINAL FANTASY XIII-2 is the follow-up to the 2010 hit title FINAL FANTASY XIII, and the latest installment in the world-renowned FINAL FANTASY series, which has shipped over 100 million units worldwide. The all-star production staff returns to create a true sequel that offers a more immersive experience than its predecessor, with extraordinary level design that encourages exploration, a more strategic paradigm-based Active Time Battle system, the ability to tame monsters and have them fight in your party, and a multi-path, player-driven experience that offers significant replay value. \n\nFINAL FANTASY XIII-2 game logo Story \nThree years after Lightning and the others saved Cocoon, some survivors decided to start over by rebuilding on Gran Pulse. Lightning, however, is nowhere to be found and thought dead by many, but Serah believes otherwise. When her town is suddenly overrun by monsters, a mysterious man named Noel appears to save her. Together, the two set off on a journey that transcends time and space, hoping to find Lightning. \n\nKey Features \n\n    Player-driven scenario with freedom over story progression \n    Multiple endings offer extensive replay value \n    Tame and develop over 150 different monsters as party members, including iconic monsters like cactuars, tonberries, and behemoths \n    Newly added &quot;tuning&quot; feature allows for greater strategic control over paradigms \n    Cinematic Action sequences blur the line between battles and cutscenes \n    Diverse in-game environments rife with NPCs offer an abundance of exploration opportunities and side missions ","torrent":{"xt":"urn:btih:558bd396c594a9d08462c72a30f0cdb01a9624ce","amp;dn":"Final.Fantasy.XIII-2.NTSC.XBOX360-SWAG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"558bd396c594a9d08462c72a30f0cdb01a9624ce","infoHashBuffer":{"type":"Buffer","data":[85,139,211,150,197,148,169,208,132,98,199,42,48,240,205,176,26,150,36,206]},"announce":[],"urlList":[]}}