{"title":"Love &amp; Pop (Hideaki Anno,1998)","uid":3500636,"size":725589333,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:55922f5775191ee83f686e9713c8bca558bc2c87&amp;dn=Love+%26+Pop+%28Hideaki+Anno%2C1998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"krazer","files":3,"time":1151970953,"description":"Pretty Tokyo teen Hiromi Yoshii (Asumi Miwa) and her girlfriends struggle with rivalries, clothes and boyfriends, just like any other high school clique. But out for kicks and blind to the consequences, the girls of Love &amp; Pop hide a dirty little secret. From phone booths and street corners, in department stores and restaurants, the girls practice enjo-kosai or \\&quot;compensated dating\\&quot; -- arranging liaisons with older men drawn to their evident nubile charms and schoolgirl uniform innocence. \n\nIgnored at home, bored at school and mindful of the dwindling possibilities facing them upon graduation, Hiromi and her three classmates are willingly drawn into a forbidden subculture of lascivious businessmen and clandestine rendezvous. But the lure of easy money and the strength of their friendship are no match for the pressures and risks the girls discover in Tokyo\\&amp;#039;s sexual underworld. As Hiromi\\&amp;#039;s greed gets the better of her indifference, Love &amp; Pop goes from a cheerful badgirl romp to an increasingly sinister cautionary tale detailing the waste and loss that life in a plaid skirt-knee socks fastlane guarantees. \n\nIn his live-action film debut, legendary anime cult director Hideaki Anno (Neon Genesis Evangelion) pulls out all the stops, transforming Ryu Muramaki\\&amp;#039;s (Tokyo Decadence) scandalous novel into a sleek, state-of-the-art digital filmmaking bonanza overflowing with bold visuals. Shot with multiple Sony Handycams, Love &amp; Pop is a primer in vanguard digital filmmaking technique. Anno\\&amp;#039;s cameras probe every corner and scour every face within a glossy but sordid world hidden amongst the shopping malls and coffee bars of Tokyo.","torrent":{"xt":"urn:btih:55922f5775191ee83f686e9713c8bca558bc2c87","amp;dn":"Love+%26+Pop+%28Hideaki+Anno%2C1998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55922f5775191ee83f686e9713c8bca558bc2c87","infoHashBuffer":{"type":"Buffer","data":[85,146,47,87,117,25,30,232,63,104,110,151,19,200,188,165,88,188,44,135]},"announce":[],"urlList":[]}}