{"title":"Thomas Reeves - Fulton Sheen Biography","uid":8650576,"size":4970560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:561e0214f6266f9e7de1e729c9631de639e30d4b&amp;dn=Thomas+Reeves+-+Fulton+Sheen+Biography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373086863,"description":"**by request**\n\n\nThomas C. Reeves - America's Bishop: The Life and Times of Fulton J. Sheen (Encounter Books, 2001). 479 pages.\n\nSemi-retail source; good quality pdf.\n\ndescription:\n\nAmong Fulton J. Sheen's thousands of converts were celebrities such as Clare Booth Luce and Henry Ford II, and former communists Louis Budenz and Elizabeth Bentley. Reeves discusses these conversions and Sheen's close friendship with J. Edgar Hoover, and details for the first time the struggle between Sheen and his chief rival, Francis Cardinal Spellman, a battle of ecclesiastical titans that led all the way to the Pope and to Sheen's final humiliation and exile.\n\nReview\n\nIt is hard to believe that this is the first and only full biography of Fulton J. Sheen, perhaps the most important American priest of the 20th century. Sheen was an enormously popular figure in his day, hosting radio and television programs that introduced and explained his faith to millions of listeners and viewers. (He even won an Emmy Award, and the actor Martin Sheen took his stage name from the man.) Thomas C. Reeves, author of the JFK biography A Question of Character, offers an absorbing account of Sheen's life and times. He uncovers fascinating details, including a phony academic degree and the particulars of a bitter dogfight with Francis Cardinal Spellman. Although this is not a hagiographic account, it is an admiring one: Sheen comes across as an astoundingly smart, charismatic, and generous man. No wonder he was such a successful evangelizer: he converted thousands, including Henry Ford II and Claire Booth Luce. He gained some notoriety for his strong anticommunism; reading America's Bishop, in fact, provides a concise history of Catholic anticommunism in the United States. It is an outstanding book that will appeal to fans of George Weigel's Witness to Hope: The Biography of Pope John Paul II and anybody else attracted to this fascinating figure. --John Miller\n\n------------------------------\n\nAlso includes Fulton Sheen's Life Is Worth Living (Saint Andrew's Press, 2001). 383 pages.\n\nGood quality pdf","torrent":{"xt":"urn:btih:561e0214f6266f9e7de1e729c9631de639e30d4b","amp;dn":"Thomas+Reeves+-+Fulton+Sheen+Biography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"561e0214f6266f9e7de1e729c9631de639e30d4b","infoHashBuffer":{"type":"Buffer","data":[86,30,2,20,246,38,111,158,125,225,231,41,201,99,29,230,57,227,13,75]},"announce":[],"urlList":[]}}