{"title":"Catalysis and Zeolites - Fundamentals and Applications","uid":12074316,"size":36185060,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5692762631bcf2fa59bf03aa3fbf5f40ab0324b0&amp;dn=Catalysis+and+Zeolites+-+Fundamentals+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1435596608,"description":"Catalysis and Zeolites - Fundamentals and Applications - J. Weitkamp, L. Puppe (Springer, 1999).pdf\n\nISBN 978-3-642-08347-1\n\nZeolites occur in nature and have been known for almost 250 years as alumino silicate minerals. Examples are clinoptilolite, mordenite, offretite, ferrierite, erionite and chabazite. Today, most of these and many other zeolites are of great interest in heterogeneous catalysis, yet their naturally occurring forms are of limited value as catalysts because nature has not optimized their properties for catalytic applications and the naturally occurring zeolites almost always contain undesired impurity phases. It was only with the advent of synthetic zeolites in the period from about 1948 to 1959 (thanks to the pioneering work of R. M. Barrer and R. M. Milton) that this class of porous materials began to playa role in catalysis. A landmark event was the introduction of synthetic faujasites (zeolite X at first, zeolite Y slightly later) as catalysts in fluid catalytic cracking (FCC) of heavy petroleum distillates in 1962, one of the most important chemical processes with a worldwide capacity of the order of 500 million t/a. Compared to the previously used amorphous silica-alumina catalysts, the zeolites were not only orders of magnitude more active, which enabled drastic process engineering improvements to be made, but they also brought about a significant increase in the yield of the target product, viz. motor gasoline. With the huge FCC capacity worldwide, the added value of this yield enhancement is of the order of 10 billion US $ per year","torrent":{"xt":"urn:btih:5692762631bcf2fa59bf03aa3fbf5f40ab0324b0","amp;dn":"Catalysis+and+Zeolites+-+Fundamentals+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5692762631bcf2fa59bf03aa3fbf5f40ab0324b0","infoHashBuffer":{"type":"Buffer","data":[86,146,118,38,49,188,242,250,89,191,3,170,63,191,95,64,171,3,36,176]},"announce":[],"urlList":[]}}