{"title":"NEOScavenger 0.987b","uid":9996356,"size":49540324,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:56cab7beb13a11fe095fa6264759ff12b3499127&amp;dn=NEOScavenger+0.987b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AppRipper","files":-1,"time":1397927512,"description":"NEO Scavenger\n(c) Blue Bottle Games\n\nRelease date: 9/13/2013 \nProtection: DRM-Free\nLanguage: English\nVersion: 0.987b\n\n\nNEO Scavenger is a turn-based, rogue-like RPG where you must\nsurvive in the wasteland long enough to figure out who you are\nEach turn you must decide where to go, how to scavenge for\nsupplies, and how to deal with anything and anyone you encounter\nAnd with each passing minute, the pit in your stomach grows, your\ndehydration worsens, your muscles tire, and your body temperature\ndrops in the cold autumn air. Choose your starting abilities\ncarefully, because they and your wit are the only tools you have in\nthe apocalypse!\n     &lt;a href=&quot;\nhttp://bluebottlegames.com/main/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bluebottlegames.com/main/&lt;/a&gt;\n\nInstructions:\n1) Unzip\n2) Enjoy!\n\nIt's DRM-Free as far as I know, however I would block it on your firewall anyway.\n\nHope you all enjoy this game! Buy it and support the developer! He really deserves it!\n\n-AppRipper &quot;Happy Hacking!&quot;\n\n*** CHANGELOG ****\n\nModding!\nSeriously, this is as much a surprise to me as it may be to you. I've been exploring different ways to bypass Flash's security limitations, but haven't had much luck. However, in the past week or two, I found a way to make the downloadable versions load external data from the file system.\n\nIt turns out that Flash's projector format will allow limited loading of local files. It has to be packaged a certain way, and I had to do some voodoo to make it work across all three platforms. However, the game now loads data from an XML text file, and images from a folder. No more flaky editing of EXE files!\n\n&quot;Now what?&quot; you ask? Well, I'll have to write some documentation to help intrepid modders understand the data format. For now, though, just poke around. Some of it should be pretty intuitive.\n\nIn addition to the above:\n\nAdded code and condition to hide clothes/item sprites on certain creatures.\nChanged terrain resources to drop their resources directly onto ground isntead of inside the river/marsh/etc.\nChanged dodge/parry language to say &quot;move&quot; instead of &quot;attack,&quot; since that was confusing if player didn't attack.\nChanged sleep button to hide &quot;unconscious&quot; and &quot;fallen&quot; messages when clicked, since they confused some players.\nFixed pixel overlap on backpack and backpack slot graphics.\nFixed water appearing in Looter convo marsh option.\nFixed stacking bug when destination stack is in locked slot.\nFixed a bug that broke conversation with looter after mentioning cryo.\nFixed a bug that caused null pointer when encounter removes an item that degrades when used.\nFixed a bug that caused conditions to stick when emtpying batteries from &quot;on&quot; devices.\nFixed a bug that caused repeated warning encounters when player and opponents are both unconscious in battle.\nFixed typo in cryo encounter.\nFixed broken spy button.\nFixed weather icon showing moon at dusk instead of night.\nFixed GUI Craft Cap BG image being too zoomed in while using big layout.\nFixed a bug that caused prev/next crafting ingredient buttons to show tooltips when invisible.\nFixed DMC exile condition to expire after 1 year.","torrent":{"xt":"urn:btih:56cab7beb13a11fe095fa6264759ff12b3499127","amp;dn":"NEOScavenger+0.987b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56cab7beb13a11fe095fa6264759ff12b3499127","infoHashBuffer":{"type":"Buffer","data":[86,202,183,190,177,58,17,254,9,95,166,38,71,89,255,18,179,73,145,39]},"announce":[],"urlList":[]}}