{"title":"Opie and Anthony 2010-06-15-O&amp;A-CF64K","uid":5629758,"size":107564591,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:578d578af3c558a10c03e4c3bad09a75a4e9d712&amp;dn=Opie+and+Anthony+2010-06-15-O%26A-CF64K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"shuazien","files":-1,"time":1276625926,"description":"Opie and Anthony 2010-06-15-O&amp;A-CF64K\nSirius XM Satellite Radio show \nEnglish, MP3\nSpread the Virus!!\n\nThings on today's show:\n\nTired of the vuvuzela? Out of luck, World Cup talk, A monkey and a frog, Baseball game earthquake, Gary Coleman 911 call, Return of Falcon the racist intern, Politician shoves a reporter, Falcon gets a lie detector test, Includes the lying Intern Brian best-of bit at the end\n\n\nThank you Inflammo.\nAll I did was copy/paste... (Blind cc, Blind cc) Inflammo did all the work, I deserve none of the thanks.(OK, maybe just a little)\n\n\n\nThanks to Opie, Anthony, Jim Norton, Tippy Tom, Sam Roberts, Danny, &quot;Uncle&quot; Paul Hauguss, &quot;Fat&quot; Bob Kelly, Loius CK, Travis, Club Soda Kenny, Awesome &quot;Stinky&quot; Garret, E-Rock, Francine, Lyle &quot;Chip&quot; Chiperson, Steven S, Jim Jeffries, Theodoor Scheckler, Bill Burr, Bob Levy, Jim Florentine, Jay Moyre, Ian &quot;Google it!!&quot; Halperin, Mike Tyson, Turk February, Steve C, Otto, George, Pat from Moonaki, Frenchie, Brother Wease, Andrew Dice Clay, Bill the WOW sticker guy, Mothergoose56, kurt, helium045, Inflammo, Lemmata, beerpressure, jonnychadootz, Leeham, frrrrruuunkis, VastLite, Supertank66, shocxxx, willgates, noonehere1, buzzard8, apemeat, a1958wil, adhdkid91, monobrowj, Joozeppy, junkygood, Metal_Is_4_Eva, tnvkenyon, ratnut12, blackirishlad, djskittles, moneys2, in2fitness, corduroy32, AceChev, go_yukuri, Luminol18, nester024 , TokenWGuy, wiretapstudios, SeeSirInn, kalinmlin , Ted_Sheckler, celticfc735, Sticky79, DEDWINHEDON, Ob5oLeTe, Nomoriko, uprock537, loveyafez, CJ, Unkelerb, parabolix, asok75, SissyCuckboy, grey151, wozardking, polyonymous, theolin, MajorLeeStoned, PsychicStoner, all the stoners, TrAnCeRx, djsickgravity, djnigelharkness, bigthom77769, jakepwright, willie838, minder125, phrosen, bloodyNP, nullified, unclevictim, illeffeqt, ShinSolidus, PatrickB, MIKED860, Mmmmike!!, jmorland1, GutesChicken, lou, bjornkeizers, cpnthrfan, boshine9, Morter, lambpit, xloosefusion, eminem04082, tsniper11, Sticky79, bosoxfan226, redrum. DEDWINHEDON, capnmorg1, MoeSzyslak, VoodoBlade, kost0130, OandApartyrocks22, atheos101, dommafia, Hobo_jim, intotheknife, clauge, MaXFail, bloodyjimbonne, schwoogie, Fred, George, Bill, S****E*** , Schwigger, Me, RAAAAAAMOOOONE!!!, ect.\n\n\nDon't forget the high quality Rips that Mothergoose56 does later in the day. That's the good stuff, man.\n\nOther places to get today's show:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/shuazien/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/shuazien/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.kickasstorrents.com/user/shuazien/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kickasstorrents.com/user/shuazien/&lt;/a&gt;\n\nh t t p : / / w w w . d e m o n o i d . c o m / f i l e s / ? u i d = 3 1 9 4 9 7 2 &amp; s e e d e d = 2\n\n(Remove the spaces.)","torrent":{"xt":"urn:btih:578d578af3c558a10c03e4c3bad09a75a4e9d712","amp;dn":"Opie+and+Anthony+2010-06-15-O%26A-CF64K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"578d578af3c558a10c03e4c3bad09a75a4e9d712","infoHashBuffer":{"type":"Buffer","data":[87,141,87,138,243,197,88,161,12,3,228,195,186,208,154,117,164,233,215,18]},"announce":[],"urlList":[]}}