{"title":"Sissi, L'Imperatrice Rebelle","uid":5206366,"size":732858368,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:57960b0b7ad80084e0436e9ad723d5658a526147&amp;dn=Sissi%2C+L%5C%27Imperatrice+Rebelle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Rfan","files":1,"time":1260390233,"description":"Days before her assassination Empress Elisabeth visits doctor Mayer and tells him the story of her life. She tells him about her early marriage, her strugle for her children and the relationship with her husband and mother-in-law. She tells him about her fight for Hungary and her love of traveling; but she also tells about the tragedy in her life. She talks about her cousin Ludwig, her brother-in-law Maximilian, her sister Sophie and about her son Rudolf and his end with Mary Vetsera. We also see Elisabeth in her final days untill she is chosen by fate to die at the hands of Luigi Lucheni.\n\nThis movie has several little mistakes, but overall it is historically good. Yet there is a big dramatisation in this(for instance Elisabeth finds Rudolf and Mary at Mayerling), the actors did not resemble their characters and they did not film at the actual locations. The whole movie was shot in Russia. It is wonderfully filmed though and has wonderful costumes.\n\nThe movie is in French, without subtitle.\nIf anyone is willing to make them, feel free.","torrent":{"xt":"urn:btih:57960b0b7ad80084e0436e9ad723d5658a526147","amp;dn":"Sissi%2C+L%5C%27Imperatrice+Rebelle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57960b0b7ad80084e0436e9ad723d5658a526147","infoHashBuffer":{"type":"Buffer","data":[87,150,11,11,122,216,0,132,224,67,110,154,215,35,213,101,138,82,97,71]},"announce":[],"urlList":[]}}