{"title":"[2005] Employment - Kaiser Chiefs - 307mb @ FLAC [only1joe]","uid":5607012,"size":322250756,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:579693a0e57f53d1a2a464765eaa0d1906920916&amp;dn=%5B2005%5D+Employment+-+Kaiser+Chiefs+-+307mb+%40+FLAC+%5Bonly1joe%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"only1joe","files":-1,"time":1275647311,"description":"Employment - Kaiser Chiefs [2005] &lt;a href=&quot;\nhttp://img704.imageshack.us/img704/5278/employmentkaiserchiefsf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img704.imageshack.us/img704/5278/employmentkaiserchiefsf.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/hABieAADh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/hABieAADh&lt;/a&gt;\n\nWikipedia - Employment is the debut album by English alternative rock band Kaiser Chiefs, released in March 2005 on B-Unique Records. Employment takes its inspirations from the Britpop and New Wave movements, as well as 70s'-era punk rock, and Beach Boys-esque West Coast music. Originally the album charted at number three in the UK Albums Chart on 13 March 2005, but charted one place higher at number two almost a year after its release, due to the band's success at the Brit Awards. Employment went on to becoming the fourth best-selling album in the United Kingdom that year.\n\nAmazon.co.uk Review By Louis Pattison - On Employment, raffish, trilby-clad young Leeds quintet Kaiser Chiefs prove themselves the logical heirs to the Britpop throne previously warmed by the likes of Blur and Supergrass, twinning expectant verses with rollicking choruses and generally acting very much like indie-rock's latest swaggering young Jack the Lads. \nThere's no doubt, the Kaisers know their rock history: &quot;Oh My God&quot; and &quot;Every Day I Love You Less and Less&quot; barrel along with something of Madness' playful charm, while &quot;You Can Have It All&quot; and the lush &quot;Caroline, Yes&quot; appear to be conscious nods to the sleepy, harmony-laden Californian pop vision of Brian Wilson. The lyrics of frontman Ricky Wilson, however, are rooted in a very English sensibility--one often traditional and occasionally, bizarrely archaic: &quot;Walking through town is quite scary/ It's not very pretty, I tell thee,&quot; he gasps on adrenaline-fuelled urban nightmare &quot;I Predict A Riot&quot;. It's the sort of pleasingly unusual idiosyncrasy that sees Employment stand out from the fashionable indie pack, and assuming the Chiefs can continue to keep their foibles the right side of irksome, any attitude is thoroughly justified.\n\nBill Pearis, Barnes &amp; Noble - Not all up-and-coming U.K. bands are jumping on the dance-punk bandwagon. Hailing from Leeds, the Kaiser Chiefs are the latest in a long tradition of bands -- others include the Kinks, Madness, and Blur -- whose very Britishness is among their strongest, most endearing qualities. Their debut, Employment, is a perfect record to put on when getting ready for a big night out, full of bouncy rhythms, anthemic choruses, and melodic hooks the size of Big Ben. And with their fondness for &quot;ahhs,&quot; &quot;la las,&quot; and &quot;wah-oohs&quot; (there's even a song called &quot;Na Na Na Na Naa&quot;), you don't even have to know the words to sing along in the shower. U.K. hits &quot;I Predict a Riot&quot; and &quot;Oh My God&quot; are a fine introduction to the album, but nearly every song here could be a potential single: the aforementioned &quot;Na Na Na Na Naa,&quot; the shouty &quot;Saturday Night,&quot; and the Beach Boys homage &quot;Caroline Yes&quot; being the most immediate. And though Kaiser Chiefs reek of their British roots right down to their tweed jackets, you needn't be a devout Anglophile to get it. Great pop like this knows no nationality and needs no translation. \n\nTrack Listings\n\n[01] Everyday I Love You Less And Less\n[02] I Predict A Riot\n[03] Modern Way\n[04] Na Na Na Na Naa\n[05] You Can Have It All\n[06] Oh My God\n[07] Born To Be A Dancer\n[08] Saturday Night\n[09] What Did I Ever Give You?\n[10] Time Honoured Tradition\n[11] Caroline, Yes\n\nTotal Play Time\t&gt; 00h:40m:46s\nTotal File Size\t&gt; 307mb (Including FLAC, Art Covers &amp; File)\nMusic File Type\t&gt; Exact Audio Copy FLAC Level 8\nScanned Artwork\t&gt; Yes @ 300dpi\nOriginal CD Rip\t&gt; Yes - only1joe\nUploader\t&gt; Yes - only1joe \nUpload Speed\t&gt; 33-35KB/s\nMusic Genre\t&gt; Pop Rock\nRelease Date\t&gt; 07 March 2005\nRecord Company\t&gt; Polydor\nArtists WebSite\t&gt;\n\n&gt; http://www.kaiserchiefs.co.uk\n&gt; http://en.wikipedia.org/wiki/Kaiser_Chiefs \n&gt; http://www.azlyrics.com/k/kaiserchiefs.html \n&gt; http://www.bebo.com/kaiserchiefs  \n&gt; http://www.muzu.tv/kaiserchiefs \n\n* * * Please Seed To A Ratio Of 1:1 Or Greater * * *\n* * * I Will Only Re-Seed If There Is More Than 10 Peers Waiting * * *\n* * * Any Problems - Leave Comments On My Most Recent Torrents * * *\n* * * This Is A Multi-Tracker Torrent Check Your Bit Torrent Client For A True Number Of Seeds * * *\n","torrent":{"xt":"urn:btih:579693a0e57f53d1a2a464765eaa0d1906920916","amp;dn":"%5B2005%5D+Employment+-+Kaiser+Chiefs+-+307mb+%40+FLAC+%5Bonly1joe%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"579693a0e57f53d1a2a464765eaa0d1906920916","infoHashBuffer":{"type":"Buffer","data":[87,150,147,160,229,127,83,209,162,164,100,118,94,170,13,25,6,146,9,22]},"announce":[],"urlList":[]}}