{"title":"FakeHospital - Ani BlackFox 720p ** NEW 14 Aug 2015 ** mp4","uid":12233283,"size":1234497283,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:579b6e02c1ea1fb04a3faef987738f89f0d65afc&amp;dn=FakeHospital+-+Ani+BlackFox+720p+%2A%2A+NEW+14+Aug+2015+%2A%2A+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"TKTh3K1ng","files":1,"time":1439621250,"description":"Screenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/8xK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/8xK&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgsking.com/image/8xC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/8xC&lt;/a&gt;\n\n I had A Patient Come in Today with an unusual problem. It was not something that was affecting her physically, she was worried about something in her personal life. At first I was a little apprehensive because I am first and foremost a doctor that deals predominantly with problems in direct relation to physical health. But anyway, I allowed her to tell me. It turns out her husband has recently told her that he is gay. I was taken aback, it seems an odd problem to bring along to your doctor. She seemed to think there was some kind of pill that could change his sexual orientation. Of course I told her there is no such thing, a person does not choose what sexual orientation they are. When she realised this, her mood changed. She started coming on to me, telling me about how she has not had sex for so long. I went over to her side of the desk and she started rubbing my leg and then slowly moved up to my cock. I told her to stop. I checked to see if any patients were waiting and they were not. So I came back in let her do what she wanted. She pulled my trousers down and started sucking my now hard cock! This babe just needed a good fucking! I got her up, bent her over the desk, pulled down her panties and started fucking her slowly before drilling my cock deep inside her shaved pussy! I got the rest of her clothes off and pulled her over to the bed. Now she was naked, I could gaze in to perfect tits as they bounced around as I fucked her harder and harder. We did it in an array of different positions before I finished by emptying my load all over her chest!","torrent":{"xt":"urn:btih:579b6e02c1ea1fb04a3faef987738f89f0d65afc","amp;dn":"FakeHospital+-+Ani+BlackFox+720p+%2A%2A+NEW+14+Aug+2015+%2A%2A+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"579b6e02c1ea1fb04a3faef987738f89f0d65afc","infoHashBuffer":{"type":"Buffer","data":[87,155,110,2,193,234,31,176,74,63,174,249,135,115,143,137,240,214,90,252]},"announce":[],"urlList":[]}}