{"title":"Dr. Lloyd Glauberman HPP Hypnosis (13 Programs)","uid":13680990,"size":2026937644,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:57d1716e2b7c239e999e392678cdbcfdd93a6665&amp;dn=Dr.+Lloyd+Glauberman+HPP+Hypnosis+%2813+Programs%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Niocan","files":49,"time":1456464032,"description":"Hypno-Peripheral Processing (HPP) is a series of downloadable audio programs that guide users into the twilight state between waking and sleeping. HPP uses specially recorded voices to weave an experience that gently overloads your conscious mind and guides you into a relaxed state to receive positive suggestions for changing thoughts, feelings and behaviors.\r\n\r\nHPP products are built on decades of knowledge, combining elements of Neuro-Linguistic Programming (NLP) and Ericksonian hypnotherapy. Users report that HPP CDs are more effective than traditional self-help products, producing results after just a few sessions. This happens for 4 reasons:\r\n\r\n1) Dual Induction Sensory Overload\r\n\r\nUsing a process that is exclusive to HPP, each 30-minute program has two parable-like stories that play simultaneously, one in each ear. Therapeutic metaphors are one of the most powerful learning devices and are the basis for HPP's effectiveness.\r\n\r\nInitially, you will try to listen to both stories simultaneously or try to focus on one story entirely. But, after a few minutes you will find yourself drifting off and not focusing on either story. This is known as dual induction, and it shuts down the logical part of the mind-the &quot;chatter box&quot; that accompanies our waking state.\r\n\r\nThe result of this gentle overload is a deep state of relaxation-ideal for the absorption of the positive suggestions conveyed in each program.\r\n\r\n2) Deep Relaxation Techniques\r\n\r\nWearing headphones, you hear calm voices against a background of music, gently guiding you very quickly into a relaxed state.\r\n\r\nThis deeply relaxed state allows you to become more receptive to the positive messages contained in the audio program.\r\n\r\n3. Powerful and Positive Messages\r\n\r\nAt strategic points on each CD, the stories interface to give your subconscious a clear powerful, positive message.\r\n\r\nUsing techniques gleaned from Eriksonian hypnotherapy, the power of storytelling metaphors creates change at the unconscious level. The unconscious mind is constantly influencing conscious thought and action - The overlapping stories and metaphors cause both brain hemispheres to work together, creating positive resolutions to whatever goal you are working on\r\n\r\n4. Easy and Effortless Results\r\n\r\nHPP has very few material or time requirements. All you need is a CD player, headphones and 30 minutes of uninterrupted time. The audio program and your unconscious does the rest.\r\n\r\nAfter just a few sessions, you may begin to notice a positive, cumulative effect on your overall emotional state. Suddenly, you are calmer. You have better self-control. Positive changes have begun to occur without conscious thought.\r\n\r\nThis is the beauty of HPP: easy results, which are faster, less expensive, and more effective than traditional self-help products.\r\n\r\nPrograms included:\r\n\r\nChanging Emotions\r\nHidden Wisdom - Overcoming Creative Blocks\r\nMeditative Relaxation - Find Inner Fulfillment and Strength\r\nMoney Wealth and Prosperity\r\nPeak Experience\r\nPersonal Ecology\r\nPersonal Power\r\nPower Communication\r\nProcrastination - A Rythmic Approach\r\nQuest for Excellence\r\nResilience\r\nSales Mastery\r\nTick-Tock Creative Time Management\r\n\r\nAll fully tagged and organized MP3's. Please SEED :)\r\nThese are all the programs I've been able to scour from the 'net. Please leave a comment if you have programs that aren't included in this!","torrent":{"xt":"urn:btih:57d1716e2b7c239e999e392678cdbcfdd93a6665","amp;dn":"Dr.+Lloyd+Glauberman+HPP+Hypnosis+%2813+Programs%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57d1716e2b7c239e999e392678cdbcfdd93a6665","infoHashBuffer":{"type":"Buffer","data":[87,209,113,110,43,124,35,158,153,158,57,38,120,205,188,253,217,58,102,101]},"announce":[],"urlList":[]}}