{"title":"Blacks On Blondes - Mae Meyers  - Interracial at Blacks On Blond","uid":6483291,"size":395260759,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5834b987b2cc342b4d95fc643f4dc8b0e7f47495&amp;dn=Blacks+On+Blondes+-+Mae+Meyers++-+Interracial+at+Blacks+On+Blond&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"beta2008x","files":1,"time":1308611356,"description":" &lt;a href=&quot;http://www.dumppix.com/viewer.php?file=gq9dk_Mae_Meyers_1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.dumppix.com/viewer.php?file=gq9dk_Mae_Meyers_1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=mobo7_Mae_Meyers_Interraci.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=mobo7_Mae_Meyers_Interraci.jpg&lt;/a&gt;\n\nBlacks On Blondes - Mae Meyers  - Interracial at Blacks On Blondes\n\nReleased : June 20, 2011\n\nFlash Brown isn't one to allow Mae Meyers to walk home alone after the big game. Even though Mae is a cheerleader for the rival team she has a secret infatuation for Flash Brown. Mae and Flash are shooting the breeze when the topic of his sexual conquests comes into play. Mae's girlfriends have talked her ear off about Flash' massive black cock and how he uses it to violate all their holes. Mae has never dabbled in interracial sex merely because her daddy has warned her about black men in general. However, Mae marches to the beat of her own drum and she soon finds herself face-to-face with 12 inches of chocolate beef. Mae's father would go into cardiac arrest if he knew his family's sofa was where Flash was sliding his mammoth black cock into his little angel's throat. Mae's eyes water as each inch of Flash' big black cock invades her windpipe. The pigtails on Mae keep the hair from her face so we get a clear view of a black cock slut who's enjoying the task at hand. Mae Meyers gives her jaw a break and uses her ten little piggies to stroke the black anaconda that Flash carries around on a daily basis. We get treated to Mae Meyer's lowering herself onto a black cock that stretches her out as well as preparing her for child birth. Mae risks losing her palm-palms when she bends over and Flash drills her pussy from behind as her pussy's death grip around his cock slowly loosens up. Flash does an excellent job of burying his big,black cock so deep into Mae that her rib cage must be getting tickled by all that stiff meat. The game winning shot comes when Mae;s hands and mouth get that much needed nut sauce that Flash happily parts with.\nClick Here To Join Blacks On Blondes\n\n\n\n\n\n","torrent":{"xt":"urn:btih:5834b987b2cc342b4d95fc643f4dc8b0e7f47495","amp;dn":"Blacks+On+Blondes+-+Mae+Meyers++-+Interracial+at+Blacks+On+Blond","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5834b987b2cc342b4d95fc643f4dc8b0e7f47495","infoHashBuffer":{"type":"Buffer","data":[88,52,185,135,178,204,52,43,77,149,252,100,63,77,200,176,231,244,116,149]},"announce":[],"urlList":[]}}