{"title":"EXPLOITED COLLEGE GIRLS - Layla - Her First Hard Fuck 720p *NEW*","uid":10633033,"size":2310042707,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:587ed184d40f0dbfa3c7cffffa64a5231ae8b34c&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Layla+-+Her+First+Hard+Fuck+720p+%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"beta2008x","files":1,"time":1406346074,"description":"  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=wy12x_lya.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=wy12x_lya.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=xjjf4_ecg_14_07_24_layla_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=xjjf4_ecg_14_07_24_layla_s.jpg&lt;/a&gt;\n\n\n\nThis week we've found another tall, lean nympho for your viewing pleasure so fans of short, chubby prudes should look elsewhere. Unlike previous tall, skinny girls Layla has got some curves going on including a very perky set of 34 C boobies and a great, tight little ass.\n\nJay starts off with some behind the scenes conversation and learns a few things about Layla including the fact that she has a boyfriend but he's openminded enough not to care that his girl is about to get impaled by a stranger and that Layla masturbates daily when she gets bored. Even as they are talking during her make up session she can't help fingering herself. All very positive signs for a budding Ex Co Gi star.\n\nAfter Layla gets situated on the bed, she still can't keep her hands out from between her legs so Jay cuts the small talk and gets down to business with the Rabbit. It doesn't take long for him to focus in on her clit with the tip of the Rabbit and bring her to a quick, vocal orgasm and then a second one a few moments later. After letting her catch her breath, Jay has her get to her knees for a little face fucking. It seems like he's dying to get back at that wet pussy and he switches to some proper p in v fucking with Layla on her back and her legs in the air which gets her to a third orgasm.\n\nAfter getting pounded to several orgasms in doggy and reverse cowgirl, Layla drops to her knees to help with the big finish where she shows off a move we've dubbed 'The Suicide'. It's where a girl sucks and jacks Jay off until she shoots herself in the face with a huge load. We were going to call it the Hemmingway, but we firmly believe porn shouldn't be too damn literate or self aware.\n\t\t","torrent":{"xt":"urn:btih:587ed184d40f0dbfa3c7cffffa64a5231ae8b34c","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Layla+-+Her+First+Hard+Fuck+720p+%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"587ed184d40f0dbfa3c7cffffa64a5231ae8b34c","infoHashBuffer":{"type":"Buffer","data":[88,126,209,132,212,15,13,191,163,199,207,255,250,100,165,35,26,232,179,76]},"announce":[],"urlList":[]}}