{"title":"The Sound of Music (DivX from HD) 1.4GB - moviesbyrizzo","uid":5946967,"size":1478651262,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:58b42db17dcf35771904277c5dc59b6ef493bcb9&amp;dn=The+Sound+of+Music+%28DivX+from+HD%29+1.4GB+-+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1289403121,"description":"Please see note on audio sync correction here. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5979042&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5979042&lt;/a&gt;\n\n(There is a moment in Max's speech towards the end when sync does slip for a moment - fix is available as indicated and if desired as it isnt as serious on this movie file as it unfortunately was on the previous 1GB version). I do\napologize - we hope you'll live with this while our new &quot;perfect&quot; as promised \n3.8GB version waits to launch. We are testing on different sized screens for good \nmeasure right now. While we aim for 2GB as the standard for now on all HD \nofferings, The sound of Muisc is a long movie in length and is certainly fair\nto consider &quot;The Greatest movie ever made&quot;. We therefore will aim for\nsupport around the closer to 4GB version instead and soon/\n\n\nWe have found in our conversions from HD/bluray using the industry standard\nDivX converter plus that sometimes we produce the file that fails audio sync\nintegrity. Because we dont wish to give up on the greatest quality of picture\nthat is produced by using this program that is provided by the DivX corporation\nthat owns the standard, we have added a second program that prodcues the audio\ntrack from the original file into the finished product using utilities from\nDivX labs in fact. So its all in all a finest DivX showing in any event.\n\n\nThis is a 1.25GB movie file, 720 x 328 video conversion from \n1280 X 720p bluray version.\n\nThis is a nice enough bluray convert offered in the best spirit.\nWe offer such versions for those who dont wish to download our better HD \nversions instead (perhaps your disc player doesnt suppport HD at the present\ntime - although soon, all will for sure!)\n\n\nThis movie was apparently allowed to rake in a billion dollars (adjusted for\ninflation) since it was released almost half a century ago.\n\nWhat a shameful fact for our kids who still have to have parents wealthy enough to \nafford the often $30 price tag for the ordinary DVD in this town. Although\nColumbia House DVD club  presently is offering the movie free to new members - \nso there! (We have ordered more DVD copies for our Library donations campaign).\n\nThe Sound of music is the most beautiful motion picture ever produced to instill a \nrespect for great spirit and intellect - that is the stuff of the best of rearing, certainly! \n\nNone of our fine children should do without this movie - and we've paid enough to \nown it. It has been profiteered on long enough and needs some sanity and sense of \nreasoned approach to what is a reasonable concern to public fairness and decency\nin how his business is approached.\n\nThis movie version belongs in the &quot;public domain&quot; Amen! our previous 1GB version\nwill soon be dropped. with thanks to all!\n\n\nWe have included extras which consist of the soundtrack and karaoke files for the\nentire family to enjoy!\n\nMichael Rizzo Chessman\n\n","torrent":{"xt":"urn:btih:58b42db17dcf35771904277c5dc59b6ef493bcb9","amp;dn":"The+Sound+of+Music+%28DivX+from+HD%29+1.4GB+-+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58b42db17dcf35771904277c5dc59b6ef493bcb9","infoHashBuffer":{"type":"Buffer","data":[88,180,45,177,125,207,53,119,25,4,39,124,93,197,155,110,244,147,188,185]},"announce":[],"urlList":[]}}