{"title":"Herman's Hermits - Retrospective [Remastered] (2004)","uid":8624715,"size":260771266,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:58f5d452a6efbac70dd405236761ab548b642798&amp;dn=Herman%27s+Hermits+-+Retrospective+%5BRemastered%5D+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":52,"time":1372468296,"description":"This is the same torrent that was uploaded to Demonoid in October 2008.\n\n\nHerman's Hermits - Retrospective [Remastered] (2004)\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/bd/b8/4539e893e7a06e8097c8f010._AA240_.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/bd/b8/4539e893e7a06e8097c8f010._AA240_.L.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 19 page booklet.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nHerman's Hermits were one of those odd 1960's groups that accumulated millions of fans, but precious little respect. Indeed, their status is remarkably similar to that of the Monkees and it's not a coincidence that both groups' music was intended to appeal to younger teenagers. The difference is that as early as 1976, the Monkees began to be considered cool by people who really knew music; it has taken 35 years for Herman's Hermits to begin receiving higher regard for their work. Of course, that lack of respect had no relevance to their success: 20 singles lofted into the Top 40 in England and America between 1964 and 1970, 16 of them in the Top 20, and most of those Top Ten as well. Artistically, they were rated far lower than the Hollies, the Searchers, or Gerry &amp; the Pacemakers, but commercially, the Hermits were only a couple of rungs below the Beatles and the Rolling Stones. ...\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:kifuxqe5ld0e~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:kifuxqe5ld0e~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nHerman's Hermits are widely seen as a lightweight, novelty cousin to the Beatles, fronted by a lovably dorky moppet and musically negligible. Sure, they are lightweight at times, Peter Noone is a lovable moppet, and their popularity would never have been possible without the Beatles, but one listen to Retrospective proves that they were not lacking in the musical department. Setting aside &quot;I'm Henry the VIII, I Am&quot; (which proves everything the critics say about the band), the group, and producer Mickie Most, had a surefooted straight-ahead approach that let the songs' hooks sink in deeply. Noone's pleasant voice and the band's sympathetic but never boring backing always goes down easy, and when they get excited -- like on &quot;Hold On&quot; or &quot;A Must to Avoid&quot; -- they almost rock. Thanks to the generous outlay of tracks and the improved sound, Retrospective takes over as the definitive collection of the Hermits' work. It leaves off their final two singles recorded for RAK in 1970, but otherwise the 26 songs here include 23 that made the Top 40 in the U.K. or the U.S. Many of the tracks are among the best the British Invasion had to offer, including &quot;A Must to Avoid,&quot; &quot;I'm into Something Good,&quot; &quot;There's a Kind of Hush,&quot; and &quot;Listen People.&quot; It also shows the band's range with the lovely Baroque pop of &quot;East West,&quot; the laid-back R&amp;B of &quot;(What A) Wonderful World,&quot; the folk-rock with strings of &quot;Don't Go Out in the Rain,&quot; the British psychedelia of &quot;Museum,&quot; and the Bee Gees-styled orchestrated pop of &quot;Here Comes the Star.&quot; The band was really much more versatile then given credit for and not as lightweight, either, as melancholy tracks like &quot;No Milk Today&quot; and &quot;My Sentimental Friend&quot; prove. Another thing Retrospective makes clear is that, much like another underrated '60s group, they were able to maintain a high-quality output even as the hits were smaller and farther between; 1968's &quot;Sunshine Girl,&quot; 1967's &quot;I Can Take or Leave Your Loving,&quot; and 1968's &quot;Something's Happening&quot; are just as hooky and memorable as their early work, and may even be better songs as they are the work of a more mature and assured group. They just weren't able to make as big an impact due to the times they were released. If you have even a passing interest in the band you should pick this disc up; it will win you over and soon you will join the proud ranks of Hermit boosters. [Retrospective is playable as a regular CD and as a SACD.]\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:0jfpxq8aldje&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:0jfpxq8aldje&lt;/a&gt;\n\nReviews, samples and for sale here: &lt;a href=&quot; http://www.amazon.com/dp/B0002IQAC2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B0002IQAC2&lt;/a&gt;\n\nTrack List:\n\n01. I'm Into Something Good\n02. Can't You Hear My Heartbeat\n03. Silhouettes\n04. Mrs Brown, You've Got A Lovely Daughter\n05. (What A) Wonderful World\n06. Hold On\n07. I'm Henry The VIII, I Am\n08. Just A Little Bit Better\n09. A Must To Avoid\n10. Leaning On A Lamp Post\n11. End Of The World\n12. Listen People\n13. There's A Kind Of Hush\n14. East West\n15. No Milk Today\n16. It's Nice To Be Out In The Morning\n17. This Door Swings Both Ways\n18. Dandy\n19. Sleepy Joe\n20. Don't Go Out Into The Rain\n21. Sunshine Girl\n22. Museum\n23. I Can Take Or Leave Your Loving\n24. Something's Happening\n25. My Sentimental Friend\n26. Here Comes The Star\n","torrent":{"xt":"urn:btih:58f5d452a6efbac70dd405236761ab548b642798","amp;dn":"Herman%27s+Hermits+-+Retrospective+%5BRemastered%5D+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58f5d452a6efbac70dd405236761ab548b642798","infoHashBuffer":{"type":"Buffer","data":[88,245,212,82,166,239,186,199,13,212,5,35,103,97,171,84,139,100,39,152]},"announce":[],"urlList":[]}}