{"title":"Arturia Single Pack The One + Waldorf Largo (Mac - Pc)","uid":6722893,"size":2706394510,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:58fea6f93bb6fe89c04421d7d2cbd5809f35cbd8&amp;dn=Arturia+Single+Pack+The+One+%2B+Waldorf+Largo+%28Mac+-+Pc%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pars18","files":1739,"time":1317844789,"description":"The ONE is a simple, new way to discover Arturia Products. The ONE is a DVD containing 8 of our software products and their manuals. Install 8 of our best virtual products (Analog Factory 2.5, Minimoog V Moog Modular V ARP2600V CS-80V Prophet V Jupiter-8V Brass 2).\n\nIN THIS PACKAGE:\nAnalog Factory v2.5.1\nArp 2600 v2.0.2\nBrass v2.0.5\ncs80 v2.0\nJupityer 8 v2.0.2\nMinimoog v 2.0.2\nMoog Modular v2.5\nProphet 5 v 2.0\nBonus: Waldorf Largo v1.5.0\n\nMAIN FEATURES:\n* 8 Virtual instruments :\n- 7 accurate emulations of legendary analog synthesizers that have defined the sound of modern music,\n- 1 Virual acoustic instrument : Brass, an extremely powerful physical modeling software that allows you to accurately emulate a trumpet, trombone or saxophone.\n* All synthesizers in the pack come with more then 400 carefully selected presets\n* Smart Preset Managers to organize the presets: view by Name, Instrument, Type and Project.\n* Photo realistic interfaces that perfectly resemble their predecessors on screen.\n* Addition of new modulation possibilities, effects, arpeggiators and polyphony.\n* Functions as VST, AU, RTAS or Stand Alone.\n\n-----------------------------------\n\nMORE INFO:\n\nAnalog Factory\nAnalog Factory is a powerful, yet extremely easy to use virtual instrument. Loaded with 3500 legendary sounds (instead of 2000 in the first version) carefully selected from the Arturia Classic Synths, Analog Factory provides the contemporary musician with a broad, versatile and instantly striking sonic palette. It is also a very versatile instrument: all sounds are dramatically modifiable, which makes this software stand apart from any sample-based collection of sounds.\n\nARP2600V\nThe ARP 2600 is one of the finest analog synthesizers ever made. Celebrated by the most respected musicians over the last thirty years, it is capable of creating amazing sounds, heard in numerous popular tunes from Herbie Hancock to Stevie Wonder. With its sound palette varying from heavy drum n' bass stabs to angular arpeggiated electro bass lines, whatever your chosen genre, the 2600 is a truly versatile sound creation tool, which still finds a good place in today's music.\n\nCS-80V\nThe CS-80V is the reproduction of the legendary Yamaha(R) CS-80, which was considered by many as the &quot;ultimate polyphonic synthesizer&quot;, back in the late 70's.\n\nIt has been popularized by artists and groups like Toto, Jean-Michel Jarre, Keith Emerson, Stevie Wonder, Vangelis, Ultravox, Peter Gabriel... to name a few, and they all helped to turn this synthesizer into a real myth.\nMore than twenty five years after its release, the time has come to rediscover a sound that has extensively contributed to the history of music...\n\nJupiter8V\nThe Jupiter-8V is the newest addition to the family Arturia's analog synthesizer recreations. Offering the unique sound palette of the Roland Jupiter 8, this virtual version is a sound designer's dream.\n\nBased on the latest version of TAE, the Jupiter-8V also offers a host of modern features: an advanced step sequencer, a new line of dynamic effects, a module combining LFO's (called Galaxy), and lots more...\n\nMiniMoogV\nFrom the starship funk lead lines of the 70's, to the gangster whine of mid 90's hip-hop, the ever present minimoog has been making its phat presence felt for over 3 decades. In partnership with Bob Moog, we decided to reproduce the legendary interface with the same look and feel than the original because of its particular &quot;mood&quot;, and because many musicians wish to use the same interface they used in the past. But the reproduction of this synthesizer does not stop to the look and feel, we also recreated its inside characteristics...\n\nMoogModularV\nArturia, in partnership with Bob Moog, has made a faithful reproduction of one of the most famous series of synthesizers: Moog Modular. Whether recreating the abstract tonal qualities of the classic electronic soundtracks, or pushing forward the sonic boundaries of today, the Moog Modular V is the synthesizer of choice for sound exploration, anywhere, anytime. It has all the vibe and the fat sound of the original, cleverly combined with important contemporary features like polyphony, MIDI control, loading and saving of patches...\n\nProphet V\nWe have taken the FIRST and the LAST synthesizers created by Sequential Circuits(TM) and brought them to you in an easy to use software instrument format. As with all other soft synths created by Arturia, we bring you replicas of the Prophet-5 and Prophet VS both visually and sonically. Using the PROPHET V will be second nature for the connoisseurs. And if you are new to these synths, the only thing you will miss by not having the hardware versions is the workout from transporting them to the studio. Finally, since the PROPHET V is designed with Arturia's TAE(R) technology, you can be sure you will not give up sound quality.\n\nBrass\nBRASS 2.0 is a new kind of virtual instrument based on a physical modeling technology. It emulates a Trumpet, a Trombone and a Saxophone. All the characteristics of the real instruments have been analyzed and modeled through extensive research at world-renowned IRCAM institute. Arturia has partnered with this highly skilled team of researchers to bring this groundbreaking technology to the musician, in the form of a software instrument. BRASS is an extremely expressive, flexible and controllable instrument, and thus a fantastic alternative to loops or\n-----------------------------------\n\nINSTALLATION:\n* Must delete the old versions, dont overwrite.\n* Read guides (ReadMe, Note) in this package carefully before installing. Follow steps by steps and dont let Arturia block your license. Tested and working 100%. Enjoy","torrent":{"xt":"urn:btih:58fea6f93bb6fe89c04421d7d2cbd5809f35cbd8","amp;dn":"Arturia+Single+Pack+The+One+%2B+Waldorf+Largo+%28Mac+-+Pc%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58fea6f93bb6fe89c04421d7d2cbd5809f35cbd8","infoHashBuffer":{"type":"Buffer","data":[88,254,166,249,59,182,254,137,192,68,33,215,210,203,213,128,159,53,203,216]},"announce":[],"urlList":[]}}