{"title":"AUSTRALIAN TV MOVIE - An Accidental Soldier (2013)","uid":10622529,"size":330194504,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:59168761ab25ef52a8afd6428e12e065f0485c6e&amp;dn=AUSTRALIAN+TV+MOVIE+-+An+Accidental+Soldier+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"AussieGirl21","files":1,"time":1406183874,"description":"An Accidental Soldier (2013)    TV Movie\n\nBased on the novel, Silent Parts, by John Charalambous, An Accidental Soldier is about an Australian soldier who flees the carnage of the Western Front and finds refuge with a French woman in a remote farmhouse. Harry Lambert is a shy, thirty five year old Australian soldier, working as a baker behind the lines. He is a gentle man, a reluctant soldier, but a man like many who has been shamed by his local community into joining up. But when he is called into the front line Harry decides to run, finding refuge in a farmhouse owned by Colombe Jacotot, a Frenchwoman in her forties whose husband has abandoned her and whose son has recently been killed. Forced to work in an ammunitions factory, Colombe too is trenchant about the war. Through her Harry will learn true courage. Through him Colombe will learn beauty. Together they will discover a love so strong that each is willing to give their life for it. An accidental soldier is a tender, at times gripping love story between two people who find passion, in all its joy and hurt, at an age when they thought love has passed them by. It is a story of unexpected bravery of countless men and women who would not give up their lives for abstracts like glory, or country. Those who wanted to live for love and life. Director:Rachel Ward. Stars: Marie Bunel, Dan Spielman, Julia Zemiro, Bryan Brown\n\nFrom Australia, in English and French\n\nHardcoded English subtitles for French dialogue by ABC TV\n\nPlease seed","torrent":{"xt":"urn:btih:59168761ab25ef52a8afd6428e12e065f0485c6e","amp;dn":"AUSTRALIAN+TV+MOVIE+-+An+Accidental+Soldier+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59168761ab25ef52a8afd6428e12e065f0485c6e","infoHashBuffer":{"type":"Buffer","data":[89,22,135,97,171,37,239,82,168,175,214,66,142,18,224,101,240,72,92,110]},"announce":[],"urlList":[]}}