{"title":"1Password.v4.0.5.Multilingual.MacOSX.Cracked-CORE","uid":9176413,"size":31375496,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:597afaa8b932dfe0980f6f301d40057825361a4e&amp;dn=1Password.v4.0.5.Multilingual.MacOSX.Cracked-CORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"failzone","files":1,"time":1384158388,"description":"1Password is your password and identity companion. It leaps past simple password storage because 1Password works directly with your browser, saves your user names and passwords, and effortlessly creates strong, unique passwords for each site.\n1Password is a password manager that uniquely brings you both security and convenience. It is the only program that provides anti-phishing protection and goes beyond password management by adding web form filling and automatic strong password generation. Your confidential information, including passwords, identities, and credit cards, is kept secure using strong encryption.\n\n1Password fully supports major web browsers, including Safari, Firefox, and Chrome. All browser extensions share the data stored in the keychain which means you never need to manually copy your passwords between browsers or from the password manager to a browser ever again!\n\n1Password has received numerous awards, including 4.5 mice from Macworld magazine, MacLife Editors pick, and was the Pick of Week on MacBreak Weekly by both Leo Laporte and Merlin Mann.\n\n1Password also has a companion iPhone/iPod touch application available in iTunes App Store.\n\nWhat's New Version 3.8.20:\n* Added support for those gorgeous new High Resolution Retina Displays.\n* Update 1Password Helper application to support the 1Password extension downloaded from the Chrome Web Store (not yet available).\n* Improved Diagnostics Report's handling of data file location.\n\nVersion 3.8.21:\nAdded support for the Chrome Web Store version of the 1Password extension.\nNow using the new and improved Diagnostics Tool from the Help &gt; Troubleshooting &gt; Diagnostics Report menu.\nIncreased the minimum number of PBKDF2 iterations when creating a new keychain and changing your Master Password.\n\nWhat's New in Version 4.0\n- 1Password 4 has been rewritten from bit to pixel to delight you in every way. When upgrading from 1Password 3 a setup screen will help you import your existing data.\n\nWhats New in Version 4.0.2\n- several important bug fixes.\n\nWhat's New in Version 4.0.3\n-\n\nWhat's New in Version 4.0.5\n\nImprovements\n* Improved Welcome screen to make it easier to see that 'click here' is clickable when multiple 1Password 3 files are found.\n* If multiple files found when upgrading from 1Password 3, the file with most items will be selected by default.\n* When attempting to fill in an unverified web browser 1Password mini will show an error message along with debugging information.\n* Improved browser validation to cover certain edge cases.\n* Added Help &gt; Release Notes menu.\n* Improved logging in 1Password mini to better troubleshoot browser extension validation issues.\n* Updated translations.\n* Improved sandboxed file access code.\n* Improving clipboard interoperability with Carbon apps including BBEdit. Big thanks to Rich Siegel for helping us to find the solution.\n* Improved import feature. Now can display import log.\n* Changed the alert's text where there are no redundant generated passwords.\n* Modal sync settings sheet is now dismissed when the app locks.\n* Improved add (+) button to show the currently selected item category at the top of the list.\n* Now using absolute timestamps in Previous Used Passwords view.\n* Items are now sorted within folders in 1Password mini.\n* Enabled hover-copy for Software License text field.\n* 1Password will now show a message if it is locked and trying to quit with unsaved changes.\n* When trying to import a new vault, 1Password will now wait until the app is unlocked instead of ignoring the import request.\n* Added New Folder context menu to folder section header.\n* 1Password will now automatically add new Software License item when it is registered.\n\nFixes\n* Fixed crash in search when previously used password value of the item was interpreted as a number, not a string.\n* Fixed problem where import from LastPass would create a exponentially large number of items.\n* Fixed problem when trying to start editing an item from 1Password mini would crash the main app in some cases.\n* Fixed problem with search fields not scrolling when long search strings are entered.\n* Fixing the most popular crash in 1Password mini when downloading rich item icons.\n* Fixed crash when generating passwords in 1Password mini.\n* Fixed spelling of Quicksilver in the Preferences window.\n* Fixed problem with folder syncing in Wi-Fi sync.\n* Fixed problem where adding a new item sometimes would edit the first item in the list instead.\n* Fixed problem where it was possible to attempt to create a new vault when the primary vault was locked.\n* Fixed problem where attachments cache was not cleared when 1Password was locked and was only cleared on the next app launch.\n* Fixed problem where changes made in Dropbox might not be detected immediately in the Mac App Store version of 1Password.\n* Fixed problem where changes in the master password did not sync to Dropbox or Folder in the Mac App Store version of 1Password.","torrent":{"xt":"urn:btih:597afaa8b932dfe0980f6f301d40057825361a4e","amp;dn":"1Password.v4.0.5.Multilingual.MacOSX.Cracked-CORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"597afaa8b932dfe0980f6f301d40057825361a4e","infoHashBuffer":{"type":"Buffer","data":[89,122,250,168,185,50,223,224,152,15,111,48,29,64,5,120,37,54,26,78]},"announce":[],"urlList":[]}}