{"title":"Celtic Key Patterns - Iain Bain - [html,png]","uid":5168995,"size":22318403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59fdbd6fe014bfc8e1098148d1859e5026ca72a6&amp;dn=Celtic+Key+Patterns+-+Iain+Bain+-+%5Bhtml%2Cpng%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"number-g","files":1,"time":1258577403,"description":"ISBN: 0-09-471820-2\n\n---\n\nFrom the back of the book:\n\nThe Celts developed four principal forms of ornament: knotwork, spirals, key patterns and interlacing figures. Most surviving designs are on monumental stones or on illuminated manuscripts. Key patterns take the form of angular paths which separate and rejoin systematically.  \n\nCeltic key patterns is a sequel to Mr. Bain's 'Celtic Knotwork' (1986), and this new book is packed with examples. 'Supernatural', says the author is the only word to describe the minuteness of detail achieved by the ancient scribes. The author has also included colour plates of the Book of Kells and the Lindisfarne Gospels to show Celtic design at its most intricate and beautiful.\n\nMany people are now developing art and craft skills. The construction methods for key patterns and related forms of ornament offer them access to the artistic methods of the ancient Celts. At first sight some may be daunted by the apparent complexity of the designs. But Mr. Bain proves that the simple disciplines of these construction methods will surprise people into an awareness of their own artistic ability.\n\nIain Bain's previous book 'Celtic knotwork' has been admired throughout the English speaking world. His father's book 'Celtic art' is the standard work on the subject. Both are published by Constable.\n\n---\n\ni also have both of the books mentioned above; if enough people are interested then i will scan those too, send a message if so.","torrent":{"xt":"urn:btih:59fdbd6fe014bfc8e1098148d1859e5026ca72a6","amp;dn":"Celtic+Key+Patterns+-+Iain+Bain+-+%5Bhtml%2Cpng%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59fdbd6fe014bfc8e1098148d1859e5026ca72a6","infoHashBuffer":{"type":"Buffer","data":[89,253,189,111,224,20,191,200,225,9,129,72,209,133,158,80,38,202,114,166]},"announce":[],"urlList":[]}}