{"title":"The Late Great State Of Israel - Aaron Klein","uid":11729729,"size":2230946,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a77fc1279f58363cd20c5a0ca9cb0eeabf5a626&amp;dn=The+Late+Great+State+Of+Israel+-+Aaron+Klein&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1425243953,"description":"\n In The Late Great State of Israel, Aaron Klein, author of the critically acclaimed Schmoozing with Terrorists, draws upon years of experience living and working as a journalist based in Israel. His book is an urgent, clarion call to supporters of Israel around the world: The great Mideast democracy faces catastrophe.   Klein shows how Israel is often its own worst enemy, and how Hamas, Hezbollah, Iran, and a variety of Palestinian terrorists threaten to end the Zionist dream once and for all. He also exposes the important role that America and the news media have played in putting the Jewish nation in such a dangerous position. Israel is in the fight of its life, facing perils from inside and outside its borders. Unless these perils are countered soon, warns Klein, the only remnant of the Jewish nation may be an epitaph: The Late Great State of Israel.\n\n\nAbout the author:\n Aaron Klein is an investigative journalist and Jerusalem bureau chief for WorldNetDaily.com. He is a regular on top American radio shows and appears frequently on Fox News Channel and Al Jazeera. He is the author of Schmoozing with Terrorists and The Late Great State of Israel, as well as the host of Aaron Klein Investigative Radio for New York's WABC, the largest radio talk station in the United States","torrent":{"xt":"urn:btih:5a77fc1279f58363cd20c5a0ca9cb0eeabf5a626","amp;dn":"The+Late+Great+State+Of+Israel+-+Aaron+Klein","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a77fc1279f58363cd20c5a0ca9cb0eeabf5a626","infoHashBuffer":{"type":"Buffer","data":[90,119,252,18,121,245,131,99,205,32,197,160,202,156,176,238,171,245,166,38]},"announce":[],"urlList":[]}}