{"title":"Cristobal Colon alias Christopher Columbus was a Spanish Jew ","uid":4293208,"size":241255,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a97247704fc266e3607022579b5182c31065d66&amp;dn=Cristobal+Colon+alias+Christopher+Columbus+was+a+Spanish+Jew+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CuriousGeorge","files":1,"time":1215983949,"description":"Nectario - Juan Colon alias Cristobal Colon alias Christopher Columbus was a Spanish Jew (1971)\n\nThis is M. Nectario&amp;#039;s astonishing booklet Juan Colon alias Cristobal Colon alias Christopher Columbus was a Spanish Jew (1971) which sets out to prove that the famous discoverer of America Christopher Columbus wasn&amp;#039;t of italian origin but rather came from a jewish ghetto in Spain. Brother Nectario, a catholic friar, attempts to demonstrate that the man who is credited with &quot;discovering America&quot; was a Spanish-born man named &quot;Juan Colon&quot; who took the name of Italian-born Christopher Columbus. It also shows that a man named Juan Colon (or Colom) was active at that time in various seafaring adventures, including a tenure as a pirate. The reason given for why he concealed his birth name is that he was a jewish man trying to avert the Inquisition as were many Jews at that time. Some as a consequence converted to catholic faith but secretly kept their own beliefs, they were called Marranos or converts. From reading this fascinating booklet one wonders who exactly was this Columbus and if there isn&amp;#039;t a concealed identity at play not only for this individual but for some plan as a whole. Find out how someone wanted you to think that the famous voyage to America was some sort of a catholic holy trip but was instead a clever thought jewish conspiracy to reach and occupy the new world before anyone else would. 30 pages. A must read for everyone.","torrent":{"xt":"urn:btih:5a97247704fc266e3607022579b5182c31065d66","amp;dn":"Cristobal+Colon+alias+Christopher+Columbus+was+a+Spanish+Jew+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a97247704fc266e3607022579b5182c31065d66","infoHashBuffer":{"type":"Buffer","data":[90,151,36,119,4,252,38,110,54,7,2,37,121,181,24,44,49,6,93,102]},"announce":[],"urlList":[]}}