{"title":"PetiteBallerinasFucked - Elsa Jean (Sweet Moves) NEW 20 August 2","uid":15605055,"size":212339764,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5a9bd4f1695531cfd0477c7dd1bf46a4e8f1d19e&amp;dn=PetiteBallerinasFucked+-+Elsa+Jean+%28Sweet+Moves%29+NEW+20+August+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1471711482,"description":"Elsa Jean and her ballet partner Isiah Maxwell are working on their routine, but the chemistry between them cannot be denied. When Elsa feels Isiah's stiffie through his pants, she decides to help him out by dropping to her knees and giving him a lusty blowjob. When Elsa gets back on her feet, Isiah helps her balance on the barre while pulling aside her leotard bottom to push his dick deep into her tight petite twat.Once he has worked Elsa out of her whole outfit, Isiah gets on the ground so that the tiny blonde can go to town riding his stiffie. Her bald fuck hole pulses with need as she puts her hips to work, grinding and bouncing for both of their pleasure. Falling to her side, she spoons with Isiah while he takes over the workload doing whatever it takes to get Elsa off.The blonde spinner is soon overcome by ecstasy as Isiah continues to work tirelessly for her needs. Her pulsing pussy walls are just the cue that Isiah needs to pull out so that Elsa can reach down to use a handjob to bring him the rest of the way to his own cum explosion. Covering Elsa's belly with jizz, Isiah leaves them both sated and ready to resume practice.\r\nCategories: Small Boobs Shaved Pussy Short Girls Blonde Long hair Hardcore Petite Girl-Boy Blowjob Deep Throat Pussy Licking Ballerina\r\n \nhttp://imgdone.com/viewer.php?file=63238994966364015196.jpg\r\n \nhttp://imgdone.com/viewer.php?file=91644120898876659210.jpg","torrent":{"xt":"urn:btih:5a9bd4f1695531cfd0477c7dd1bf46a4e8f1d19e","amp;dn":"PetiteBallerinasFucked+-+Elsa+Jean+%28Sweet+Moves%29+NEW+20+August+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a9bd4f1695531cfd0477c7dd1bf46a4e8f1d19e","infoHashBuffer":{"type":"Buffer","data":[90,155,212,241,105,85,49,207,208,71,124,125,209,191,70,164,232,241,209,158]},"announce":[],"urlList":[]}}