{"title":"Paris Changing - Revisiting Eugene Atget's Paris by Christopher ","uid":9665122,"size":129388198,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5acd9ebdd08b2014efa1030cb3c9a99da161f8aa&amp;dn=Paris+Changing+-+Revisiting+Eugene+Atget%27s+Paris+by+Christopher+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"STBGD","files":-1,"time":1393364879,"description":"Paris Changing: Revisiting Eugene Atget's Paris by Christopher Rauschenberg\nPrinceton Architectural Press | 2007 | ISBN: 1568986807 | English | 192 pages | PDF | 123.40 MB\n\nBetween 1888 and 1927 Eugne Atget meticulously photographed Paris and its environs, capturing in thousands of photographs the city's parks, streets, and buildings as well as its diverse inhabitants. His images preserved the vanishing architecture of the ancien rgime as Paris grew into a modern capital and established Atget as one of the twentieth century's greatest and most revered photographers.\n\nChristopher Rauschenberg spent a year in the late '90s revisiting and rephotographing many of Atget's same locations. Paris Changing features seventy-four pairs of images beautifully reproduced in duotone. By meticulously replicating the emotional as well as aesthetic qualities of Atget's images, Rauschenberg vividly captures both the changes the city has undergone and its enduring beauty. His work is both an homage to his predecessor and an artistic study of Paris in its own right. Each site is indicated on a map of the city, inviting readers to follow in the steps of Atget and Rauschenberg themselves. Essays by Clark Worswick and Alison Nordstrom give insight into Atget's life and situate Rauschenberg's work in the context of other rephotography projects. The book concludes with an epilogue by Rosamond Bernier as well as a portfolioof other images of contemporary Paris by Rauschenberg. If a trip to the city of lights is not in your immediate future, this luscious portrait of Paris then and now is definitely the next best thing.","torrent":{"xt":"urn:btih:5acd9ebdd08b2014efa1030cb3c9a99da161f8aa","amp;dn":"Paris+Changing+-+Revisiting+Eugene+Atget%27s+Paris+by+Christopher+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5acd9ebdd08b2014efa1030cb3c9a99da161f8aa","infoHashBuffer":{"type":"Buffer","data":[90,205,158,189,208,139,32,20,239,161,3,12,179,201,169,157,161,97,248,170]},"announce":[],"urlList":[]}}