{"title":"The Marquis - Inferno - By Guy Davis","uid":8862799,"size":691234397,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5b18baa02e2cfd96060f2ec79ba3d057765f22ee&amp;dn=The+Marquis+-+Inferno+-+By+Guy+Davis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dudezillasf","files":-1,"time":1377818952,"description":"The Marquis by Guy Davis takes place in Venisalle, a fictional land resembling France during the mid-18th century, complete with stratified society and Church dominance of everyday affairs. The story revolves around Vol de Galle, a former Inquisitor of The Faith who has the ability to see demons, many of which have infiltrated society disguised in human form. De Galle combats these entities with his sabre and a pair of specially built, anachronistic machine guns.\n\nThe Marquis was originally published by Caliber Comics where the Les Preludes issue appeared in 1997, followed by the rest of the Danse Macabre series from Oni Comics in 2000. This was followed by a one-shot and a two-issue miniseries in 2002-2003. Davis will be finishing the story he started at Dark Horse Comics, where he was working on B.P.R.D. from 2003 to 2011. He said: &quot;When they expressed interest in The Marquis, I immediately knew Dark Horse was a perfect fit with the types of books they publish. They have a great horror lineup and I couldn't be happier with having the series completed with them.&quot;\n\nThe ultimate plan is to make The Marquis a five-volume series. The first volume, Inferno collects the trade paperbacks Danse Macabre and Intermezzo. Davis plans to release the rest as graphic novels, starting with The Marquis and the Midwife and then two more that finish the Marquis' story, followed by a final prequel volume.\n\n","torrent":{"xt":"urn:btih:5b18baa02e2cfd96060f2ec79ba3d057765f22ee","amp;dn":"The+Marquis+-+Inferno+-+By+Guy+Davis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b18baa02e2cfd96060f2ec79ba3d057765f22ee","infoHashBuffer":{"type":"Buffer","data":[91,24,186,160,46,44,253,150,6,15,46,199,155,163,208,87,118,95,34,238]},"announce":[],"urlList":[]}}