{"title":"Fumbling The Future - How Xerox Invented, &amp; Ignored the firs","uid":7875651,"size":28666325,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b2c24db3f38bae8ecd53923ff7e4f18e805938e&amp;dn=Fumbling+The+Future+-+How+Xerox+Invented%2C+%26amp%3B+Ignored+the+firs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KatQwerty","files":3,"time":1354333072,"description":"Ask consumers and users what names they associate with the multibillion dollar personal computer market, and they will answer IBM, Apple, Tandy, or Lotus. The more knowledgable of them will add the likes of Microsoft, Ashton-Tate, Compaq, and Borland. But no one will say Xerox. Fifteen years after it invented personal computing, Xerox still means &quot;copy.&quot;\n\nFumbling the Future tells how one of America's leading corporations invented the technology for one of the fastest-growing products of recent times, then miscalculated and mishandled the opportunity to fully exploit it. It is a classic story of how innovation can fare within large corporate structures, the real-life odyssey of what can happen to an idea as it travels from inspiration to implementation.\n\nMore than anything, Fumbling the Future is a tale of human beings whose talents, hopes, fears, habits, and prejudices determine the fate of our largest organizations and of our best ideas. In an era in which technological creativity and economic change are so critical to the competitiveness of the American economy, Fumbling the Future is a parable for our times.","torrent":{"xt":"urn:btih:5b2c24db3f38bae8ecd53923ff7e4f18e805938e","amp;dn":"Fumbling+The+Future+-+How+Xerox+Invented%2C+%26amp%3B+Ignored+the+firs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b2c24db3f38bae8ecd53923ff7e4f18e805938e","infoHashBuffer":{"type":"Buffer","data":[91,44,36,219,63,56,186,232,236,213,57,35,255,126,79,24,232,5,147,142]},"announce":[],"urlList":[]}}