{"title":"Everness #1-3 (2011-14) Ian McDonald (multi)","uid":9540434,"size":8860680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b6aa449a8299b8fc107cb7e44b2387f4cdd0187&amp;dn=Everness+%231-3+%282011-14%29+Ian+McDonald+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1391032534,"description":"Everness #1-3 by Ian McDonald\n\n\nFormat: mobi/epub/azw3\nLength: 274/280/290 pages\nGenre: Sci-Fi/Steampunk\nDate: 6 December 2011/4 September 2012/7 January 2014\n\nPlanesrunner (#1)\n\nThere is not one you. There are many yous. There is not one world. There are many worlds. Ours is one among billions of parallel earths.\n\nWhen Everett Singh's scientist father is kidnapped from the streets of London, he leaves young Everett a mysterious app on his computer. Suddenly, this teenager has become the owner of the most valuable object in the multiverse--the Infundibulum--the map of all the parallel earths, and there are dark forces in the Ten Known Worlds who will stop at nothing to get it. They've got power, authority, the might of ten planets--some of them more technologically advanced than our Earth--at their fingertips. He's got wits, intelligence, and a knack for Indian cooking.\n\nTo keep the Infundibulum safe, Everett must trick his way through the Heisenberg Gate that his dad helped build and go on the run in a parallel Earth. But to rescue his dad from Charlotte Villiers and the sinister Order, this Planesrunner's going to need friends. Friends like Captain Anastasia Sixsmyth, her adopted daughter, Sen, and the crew of the airship Everness.\n\nCan they rescue Everett's father and get the Infundibulum to safety? The game is afoot!\n\nBe My Enemy (#2)\nEmpress of the Sun (#3)\n\nAuthor:\n\nIan McDonald is the author of Planesrunner and Be My Enemy, the first two books of the Everness series. He has written thirteen science fiction novels--including the 2011 John W. Campbell Memorial Award winner for Best Novel, The Dervish House--and has lost count of the number of stories. He's been nominated for every major science fiction award, and even won some. He lives in Northern Ireland, just outside Belfast. ","torrent":{"xt":"urn:btih:5b6aa449a8299b8fc107cb7e44b2387f4cdd0187","amp;dn":"Everness+%231-3+%282011-14%29+Ian+McDonald+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b6aa449a8299b8fc107cb7e44b2387f4cdd0187","infoHashBuffer":{"type":"Buffer","data":[91,106,164,73,168,41,155,143,193,7,203,126,68,178,56,127,76,221,1,135]},"announce":[],"urlList":[]}}