{"title":"The Siege of Jerusalem:Crusade and Conquest in 1099 {BBS}","uid":6913365,"size":1358818,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c3de7f830a9287d8b318c7b545a8b9c8a2311a1&amp;dn=The+Siege+of+Jerusalem%3ACrusade+and+Conquest+in+1099+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1324933207,"description":"The story of the final battle of the First Crusade\n\nThe most extraordinary siege in medieval history began with the arrival of a Christian army at Jerusalem on the dawn of Tuesday, 6 June, 1099. Other sieges may have lasted longer, involved greater numbers of troops, and deployed more siege engines but nothing else in the entire medieval period compares to the extraordinary journey that the besiegers had made to get to their goal and the heady religious enthusiasm among the troops.\n\nThis was the culmination of the First crusade, a military pilgrimage that had seen hundreds of thousands of men, women, and children leave their homes in Western Europe, march for three years over thousands of miles, and undergo tremendous hardship to reach their longed-for goal: Jerusalem. No other medieval army had made such a journey and no other army had such a peculiar makeup. There were hundreds of unattached poor women, gathered from the margins of Northern French towns by the charity of the charismatic preacher, Peter the hermit, and given a new direction in their lives through the expedition to Jerusalem. There were farmers who had sold their land and homes, put all their belongings in two-wheeled carts, and marched alongside their oxen. Bards came and earned their keep by composing songs about the events they were witnessing, from songs about the heroic charges of the nobles to bawdy satires on the lax behavior of some of the senior clergy. Naturally, knights and foot soldiers were at the heart of the fighting forces, but even here there was a strange fluidity to the army, with the status of a warrior rising or falling depending on his ability to keep his horse alive and his armor in good order.\nThe Siege of Jerusalem offers a vivid and engaging account of the events of that siege; the key figures, the turning points, the spiritual beliefs of the participants, the deep political rivalries, and the massacre of the inhabitants, which left such a deep scar in the horrified imagination of those who learned about it, that it still evokes passionate feelings nearly a thousand \n\n\n# Paperback: 232 pages\n# Publisher: Continuum (November 3, 2011)\n# Language: English\n# ISBN-10: 1441138285\n# ISBN-13: 978-1441138286","torrent":{"xt":"urn:btih:5c3de7f830a9287d8b318c7b545a8b9c8a2311a1","amp;dn":"The+Siege+of+Jerusalem%3ACrusade+and+Conquest+in+1099+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c3de7f830a9287d8b318c7b545a8b9c8a2311a1","infoHashBuffer":{"type":"Buffer","data":[92,61,231,248,48,169,40,125,139,49,140,123,84,90,139,156,138,35,17,161]},"announce":[],"urlList":[]}}