{"title":"Foods of Kenya (A Taste of Culture)","uid":6764126,"size":3273979,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c4d0a1512d55fbfe986c2d2a644d68033005d3e&amp;dn=Foods+of+Kenya+%28A+Taste+of+Culture%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1319306126,"description":"Foods of Kenya (A Taste of Culture)\nBarbara Sheen (Author)\n\nReading level: Ages 9-12\nLibrary Binding: 64 pages\nPublisher: KidHaven Press (June 2010)\nLanguage: English\nISBN-10: 0737748133\nISBN-13: 978-0737748130\n\nDescribes the regional cuisine of Kenya, including information on traditional dishes, and provides recipes for such famous Kenyan meals as groundnut stew, maandazi, and irio.\n\nStudying world cultures has never tasted so good! A delectable blend of geography, history, health, daily life, celebrations and customs, A Taste of Culture offers a rich array of culinary and cultural elements. Specifically prepared for upper-elementary and lower-middle school students, each volume in this series introduces a country and its culture by way of its foods, cooking traditions, customs, eating habits and food sources. Each volume is heaping with discussion of: Effects on health Favorite dishes Ingredients that form the staples of the country's cooking Preparations, traditions and celebrations associated with certain foods Snacks and sweets Specialty foods Traditional holiday meals and more.\n\nOne of the best ways to learn about other nations and other cultures is through their food. Each book in the A Taste of Culture series explores the foods, cooking traditions, customs, eating habits, and food sources of a different country---all presented through a delectable blend of geography, daily life, culture, and history. All volumes discuss ingredients that form the staples of cooking in a given country, the favorite dishes, the snacks and sweets, the traditional holiday meals, and the preparations and traditions associated with these foods. Full-color photographs, easy-to-follow recipes, fascinating facts, maps, a glossary, bibliography, and index enhance each book.","torrent":{"xt":"urn:btih:5c4d0a1512d55fbfe986c2d2a644d68033005d3e","amp;dn":"Foods+of+Kenya+%28A+Taste+of+Culture%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c4d0a1512d55fbfe986c2d2a644d68033005d3e","infoHashBuffer":{"type":"Buffer","data":[92,77,10,21,18,213,95,191,233,134,194,210,166,68,214,128,51,0,93,62]},"announce":[],"urlList":[]}}