{"title":"Storm of Spears, A: Understanding the Greek Hoplite in Action","uid":10451528,"size":6198227,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5cbb3254aa7e64ce483d794fc778262a0bba35d3&amp;dn=Storm+of+Spears%2C+A%3A+Understanding+the+Greek+Hoplite+in+Action&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1404030769,"description":"Storm of Spears, A: Understanding the Greek Hoplite in Action\nby Christopher Matthew \n\nDESCRIPTION:\n\nThe backbone of classical Greek armies was the phalanx of heavily armoured spearmen, or hoplites. These were the soldiers that defied the might of Persia at Marathon, Thermopylae and Plataea and, more often, fought each other in the countless battles of the Greek city-states. For around two centuries they were the dominant soldiers of the Classical world, in great demand as mercenaries throughout the Mediterranean and Middle East. Yet, despite the battle descriptions of Herodotus, Thucydides, Xenophon etc, and copious evidence of Greek art and archaeology, there are still many aspects of hoplite warfare that are little understood or the subject of fierce academic debate.Christopher Matthew's groundbreaking reassessment combines rigorous analysis of the literary and archaeological evidence with the new disciplines of reconstructive archaeology, re-enactment and ballistic science. He focuses meticulously on the details of the equipment, tactics and capabilities of the individual hoplites. In so doing he challenges some long-established assumptions. For example, despite a couple of centuries of study of the hoplites portrayed in Greek vase paintings, Matthew manages to glean from them some startlingly fresh insights into how hoplites wielded their spears. These findings are supported by practical testing with his own replica hoplite panoply and the experiences of a group of dedicated re-enactors. He also tackles such questions as the protective properties of hoplite shields and armour and the much-vexed debate on the exact nature of the 'othismos' , the climax of phalanx-on-phalanx clashes.This is an innovative and refreshing reassessment of one of the most important kinds of troops in ancient warfare, sure to make a genuine contribution to the state of knowledge.","torrent":{"xt":"urn:btih:5cbb3254aa7e64ce483d794fc778262a0bba35d3","amp;dn":"Storm+of+Spears%2C+A%3A+Understanding+the+Greek+Hoplite+in+Action","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cbb3254aa7e64ce483d794fc778262a0bba35d3","infoHashBuffer":{"type":"Buffer","data":[92,187,50,84,170,126,100,206,72,61,121,79,199,120,38,42,11,186,53,211]},"announce":[],"urlList":[]}}