{"title":"Fifteen Thousand Useful Phrases by Grenville Kleiser [republicV]","uid":7785564,"size":1517346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d01857b726c2a13414afa8ebfaa709630e9c4a9&amp;dn=Fifteen+Thousand+Useful+Phrases+by+Grenville+Kleiser+%5BrepublicV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"republicV","files":-1,"time":1351882935,"description":"Fifteen Thousand Useful Phrases - A Practical Handbook Of Pertinent Expressions, Striking Similes, Literary, Commercial, Conversational, And Oratorical Terms, For The Embellishment Of Speech And Literature, And The Improvement Of The Vocabulary Of Those Persons Who Read, Write, And Speak English is presented here in a high quality paperback edition. This popular classic work by Grenville Kleiser is in the English language. If you enjoy the works of Grenville Kleiser then we highly recommend this publication for your book collection.\n\nAbout the Author\n\nAmerican writer, Grenville Kleiser (1868-1953), is best known for his writings on humor, inspiration and positive thinking. Besides Fifteen Thousand Useful Phrases, he authored Model Speeches for Practice, Successful Methods of Public Speaking, The Training of a Public Speaker, and others. Kleiser is quoted nearly as often as Mark Twain thanks to his wit and insight Good humor is a tonic for mind and body. It is the best antidote for anxiety and depression. It is a business asset. It attracts and keeps friends. It lightens human burdens. It is the direct route to serenity and contentment. To every problem there is already a solution whether you know it or not. It is often better to have a great deal of harm happen to one than a little; a great deal may rouse you to remove what a little will only accustom you to endure.","torrent":{"xt":"urn:btih:5d01857b726c2a13414afa8ebfaa709630e9c4a9","amp;dn":"Fifteen+Thousand+Useful+Phrases+by+Grenville+Kleiser+%5BrepublicV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d01857b726c2a13414afa8ebfaa709630e9c4a9","infoHashBuffer":{"type":"Buffer","data":[93,1,133,123,114,108,42,19,65,74,250,142,191,170,112,150,48,233,196,169]},"announce":[],"urlList":[]}}