{"title":"James Patterson &amp; Marshall Karp - NYPD Red (ePub/mobi) [2012","uid":7713356,"size":1345733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d341f23c9c25b8c517861dd303acc18e91b07b1&amp;dn=James+Patterson+%26amp%3B+Marshall+Karp+-+NYPD+Red+%28ePub%2Fmobi%29+%5B2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"xemius","files":-1,"time":1349866462,"description":"Source: mobilism\n\nSummary\nRelease Date: October 8, 2012 | Series: NYPD Red\nIt's the start of Hollywood on Hudson, and New York City is swept up in the glamour. Every night, the red carpet rolls out for movie stars arriving at premieres in limos; the most exclusive restaurants close for private parties for wealthy producers and preeminent directors; and thousands of fans gather with the paparazzi, hoping to catch a glimpse of the most famous and beautiful faces in the world. With this many celebrities in town, special task force NYPD Red is on high alert-and they can't afford to make a single mistake.\n\nThen a world-renowned producer fatally collapses at his power breakfast, and top NYPD Red Detective Zach Jordan is the first one on the scene. Zach works with his beautiful new partner, Detective Kylie MacDonald-who also happens to be his ex-girlfriend-to discover who the murderer might be. But this is only the beginning: the most brutal, public, and horrifyingly spectacular crimes they've ever encountered are about to send all of New York into chaos, putting NYPD Red on the ropes.\n\nZach and Kylie know there's no way of telling what a killer this deranged will do next. With the whole world watching, they have to find a way to stop a psychopath who has scripted his finale down to the last explosive detail. With larger-than-life action, relentless speed, and white-knuckle twists, NYPD Red is the next mega-blockbuster from &quot;The Man Who Can't Miss.&quot; (TIME)\n\nFormats provided are:\n.ePub -\nCompatible with most eReaders including the Apple iPad. If you wish to read .ePub doucuments on a Mac/PC I would recommend downloading Adobe Digital Editions. (Just google it and follow the instructions on the Adobe website.)\n.mobi -\nFor the Amazon kindle. Kindle for PC may also be available depending on your region.\n\nIf you like the book, support the author and buy it!","torrent":{"xt":"urn:btih:5d341f23c9c25b8c517861dd303acc18e91b07b1","amp;dn":"James+Patterson+%26amp%3B+Marshall+Karp+-+NYPD+Red+%28ePub%2Fmobi%29+%5B2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d341f23c9c25b8c517861dd303acc18e91b07b1","infoHashBuffer":{"type":"Buffer","data":[93,52,31,35,201,194,91,140,81,120,97,221,48,58,204,24,233,27,7,177]},"announce":[],"urlList":[]}}