{"title":"Tim Rose - Same (1967) MP3@320kbps","uid":9620811,"size":89571685,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5deb0b36c83daac4e2a6458f6904b244483f77f8&amp;dn=Tim+Rose+-+Same+%281967%29+MP3%40320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AaronVincent","files":13,"time":1392497197,"description":"Tim Rose - Tim Rose (1967)\n\nTim Rose was an American singer-songwriter.\n\n\nTim Rose was born in Washington, D.C. in 1940. As a young man he served in both the US Air Force and the merchant navy before turning to music. He formed a folk trio with Cass Elliot and Jim Hendricks. Known as The Big Three, they saw a fair deal of success, performing around Greenwich Village in New York, releasing two albums, and making several TV appearances. When The Big Three split Rose went solo, and was signed to Columbia Records. He released a number of singles, and his self-titled debut album came out in 1967.\n\nTim Rose was a great record, mixing folk-rock with a bit of blues and soul, carried by his gravelly vocals. It featured both originals and covers, and it's two of the latter which he is best known for, albeit sometimes for the wrong reasons. &quot;Morning Dew&quot; was written and performed by folk singer Bonnie Dobson many years earlier, and Rose controversially gave himself a co-writing credit for it, though he only really changed a couple of words. However this doesn't detract from the brilliance of his rendition, a true folk-rock classic. The other song was &quot;Hey Joe&quot;, which he claimed to be his arrangement of a folk traditional, though most sources argue it was written by Billy Roberts. It had already been given fast folk-rock treatments by The Byrds, Love and The Leaves by the time Rose got his hands on it, and his slowed-down arrangement was later taken by Jimi Hendrix and made into a hit.","torrent":{"xt":"urn:btih:5deb0b36c83daac4e2a6458f6904b244483f77f8","amp;dn":"Tim+Rose+-+Same+%281967%29+MP3%40320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5deb0b36c83daac4e2a6458f6904b244483f77f8","infoHashBuffer":{"type":"Buffer","data":[93,235,11,54,200,61,170,196,226,166,69,143,105,4,178,68,72,63,119,248]},"announce":[],"urlList":[]}}