{"title":"Aynsley Dunbar/To Mum../Remains To Be Heard[2006][320KBPS]","uid":9780048,"size":220927149,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5ea169e0b8093b61e9d3649a984d53e68997354e&amp;dn=Aynsley+Dunbar%2FTo+Mum..%2FRemains+To+Be+Heard%5B2006%5D%5B320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LameDuck69","files":23,"time":1395090433,"description":"Aynsley Dunbar Retaliation - To Mum From Aynsley &amp; The Boys / Remains To Be Heard [2 Albums][1969,1970][2006]\n\n\n\n\n\nCD1 - To Mum From Aynsley &amp; The Boys [1969]\n\n\n01. Don't Take The Power Away  \n02. Run You Off The Hill  \n03. Let It Ride  \n04. Journey's End  \n05. Down, Down And Down  \n06. Unheard  \n07. Sugar On The Line  \n08. Leaving Right Away  \n\n\n\n\nCD2 - Remains To Be Heard [1970]\n\n\n01. Invitation To A Lady  \n02. Blood On Your Wheels  \n03. Downhearted  \n04. Whistlin' Blues  \n05. Keep Your Hands Out  \n06. Sleepy Town Sister  \n07. Fortune City  \n08. Put Some Love On You  \n09. Bloody Souvenir  \n10. Toga  \n\n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nAynsley Thomas Dunbar (born 10 January 1946) is an English drummer. He has worked with some of the top names in rock, including Nils Lofgren, Eric Burdon, John Mayall, Frank Zappa, Ian Hunter, Lou Reed, Jefferson Starship, Jeff Beck, David Bowie, Whitesnake, Sammy Hagar, Michael Schenker, UFO, Flo &amp; Eddie and Journey.\n\nDunbar was born in Liverpool, England. He started his professional career in Derry Wilkie and the Pressmen in 1963. In December 1964 he joined Merseybeat group The Mojos, who were renamed Stu James &amp; the Mojos, with original members vocalist Stu James and guitarist Nick Crouch. Bass player became Lewis Collins (later an actor in the Professionals). This line-up continued till 1966. Dunbar then auditioned for The Jimi Hendrix Experience and Hendrix had difficulty deciding between Dunbar and Mitch Mitchell - the latter won Hendrix's coin flip. Dunbar then joined John Mayall's Bluesbreakers replacing Hughie Flint in the summer of 1966. He stayed with Mayall until the spring of 1967 (playing on the A Hard Road album), being replaced by Mick Fleetwood.\n\nAfter a short stint in The Jeff Beck Group Dunbar founded 'The Aynsley Dunbar Retaliation', which issued a number of albums. Dunbar co-wrote the song &quot;Warning&quot; (later recorded by Black Sabbath on their first album). The Dunbar single version was recorded in 1967 for the Blue Horizon label,[2] prior to his band's first album release The Aynsley Dunbar Retaliation (circa 1969).\n\nSubsequently, Dunbar founded a short-lived progressive rock band called Blue Whale, which debuted with a tour of Scandinavia in January 1970. Following the recent collapse of the original lineup of King Crimson, Dunbar unsuccessfully tried to recruit Robert Fripp as Blue Whale's guitarist. Fripp, in turn, unsuccessfully tried to recruit Dunbar as King Crimson's new drummer. Blue Whale recorded one album, which featured Paul Williams (vocals), Ivan Zagni (guitar), Roger Sutton (guitar), Tommy Eyre (from Retaliation, keys) and Peter Friedberg (bass).\n\nDunbar was later the drummer for Frank Zappa's Mothers of Invention, featuring on albums such as Waka/Jawaka, and The Grand Wazoo, as well as the film 200 Motels. In 1974 he played on the soundtrack for &quot;Dirty Duck&quot;, a Chuck Swenson adult animated movie. In the mid-1970s, Dunbar played drums for former Grin leader, Nils Lofgren, before joining Journey for their first four albums. He joined Jefferson Starship for three albums. In 1985, Dunbar joined Whitesnake, and drummed on their 1987 album, Whitesnake. He also spent some time working with Eric Burdon, Michael Schenker and The Animals.\n\nMore recently, in 2005, he drummed on Jake E. Lee's solo Retraced album.\n\nHe has been the drummer for the World Classic Rockers since 2003.\n\nIn 2008, Dunbar recorded an album of material for Direct Music with Mickey Thomas of Starship, and musicians such as Jake E. Lee, former guitarist for Ozzy Osbourne. The complete recordings of Dunbar's drumming with Frank Zappa at Carnegie Hall in October 1971 were released exactly 40 years later in a four-CD set.\n\nIn 2009, the blues album &quot;The Bluesmasters featuring Mickey Thomas&quot; was released, featuring Dunbar on drums along with Tim Tucker on guitar and Danny Miranda on bass as well as guest stars such as Magic Slim on guitar and vocals.\n\nRemains To Be Heard is a 1970 album credited to (The) Aynsley Dunbar Retaliation, but with minor participation by Dunbar himself. The group proper had disbanded by then. Former lead vocalist Victor Brox assembled it under management suggestion.","torrent":{"xt":"urn:btih:5ea169e0b8093b61e9d3649a984d53e68997354e","amp;dn":"Aynsley+Dunbar%2FTo+Mum..%2FRemains+To+Be+Heard%5B2006%5D%5B320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ea169e0b8093b61e9d3649a984d53e68997354e","infoHashBuffer":{"type":"Buffer","data":[94,161,105,224,184,9,59,97,233,211,100,154,152,77,83,230,137,151,53,78]},"announce":[],"urlList":[]}}