{"title":"Bob Dylan - Self Portrait (1970).flac by JuLeBox","uid":4293189,"size":406324246,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5eb01aa1d19f78869806df0ef833a9b34ea0d373&amp;dn=Bob+Dylan+-+Self+Portrait+%281970%29.flac+by+JuLeBox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SergioPlayboy","files":31,"time":1215982968,"description":"Bob Dylan - Self Portrait (1970)\n-------------------------------------------------------------------------------------\nThere has never been a clearer attempt to shed an audience than Self-Portrait. At least, that\\&amp;#039;s one way of looking at this baffling double album, a deliberately sprawling affair that runs the gamut from self-portrait to self-parody, touching on operatic pop, rowdy Basement Tapes leftovers, slight whimsy, and covers of wannabe Dylans from Paul Simon to Gordon Lightfoot. To say the least, it\\&amp;#039;s confusing, especially arriving at the end of a decade of unmitigated brilliance, and while the years have made it easier to listen to, it still remains inscrutable, an impossible record to unlock. It may not be worth the effort, either, since this isn\\&amp;#039;t a matter of deciphering cryptic lyrics or interpreting lyrics, it\\&amp;#039;s all about discerning intent, figuring out what the hell Dylan was thinking when he was recording -- not trying to decode a song. There are times where it\\&amp;#039;s quite clearly played for a laugh -- if his shambling version of \\&quot;The Boxer\\&quot; isn\\&amp;#039;t a pointed parody of Paul Simon, there was no reason to cut it -- but he\\&amp;#039;s poker-faced elsewhere, and the songs (apart from such earthed gems as \\&quot;Mighty Quinn,\\&quot; which aren\\&amp;#039;t presented in their best versions) are simply not worth much consideration. But, in a strange way, Self Portrait is, because decades have passed and it still doesn\\&amp;#039;t make much sense, even for Dylanphiles. That doesn\\&amp;#039;t necessarily mean that it\\&amp;#039;s worth the time to figure it out -- you\\&amp;#039;re not going to find an answer, anyway -- but it\\&amp;#039;s sort of fascinating all the same.\n\nStephen Thomas Erlewine, AMG\n\n\n\nEAC Log, Cue &amp; Complete Artwork Included.\n\nEnjoy!\n\n\n\nP.S.: After you\\&amp;#039;ve done, please someone upload this to Demonoid. Thanks!","torrent":{"xt":"urn:btih:5eb01aa1d19f78869806df0ef833a9b34ea0d373","amp;dn":"Bob+Dylan+-+Self+Portrait+%281970%29.flac+by+JuLeBox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eb01aa1d19f78869806df0ef833a9b34ea0d373","infoHashBuffer":{"type":"Buffer","data":[94,176,26,161,209,159,120,134,152,6,223,14,248,51,169,179,78,160,211,115]},"announce":[],"urlList":[]}}