{"title":"ExploitedCollegeGirls: Addyson (19 Years Old) [XXX]","uid":12200292,"size":850982178,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5f796d50392e848f02dbf5c40eba8f1897b50e0c&amp;dn=ExploitedCollegeGirls%3A+Addyson+%2819+Years+Old%29+%5BXXX%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Chinu685","files":1,"time":1438814538,"description":"Category: Casting,Amateur,Talking,Legal Teen,College Girl,Natural Tits,Shaved Pussy,Tatu,All Sex,Oral,Vibrator,Mastrubation,Cum On Face\n\n\nCast: Addyson\n\n\n.:Description:.\nWe learn a lot about 19 year old Addyson during Jay's behind the scenes interview, and it just seems to make her sexier. In addition to admitting that she's essentially a submissive and that she loves being pinned to the bed and fucked, she tells Jay that nothing turns her on like having her tits sucked on. When she pulls them out at his urging, they are impressive.\nShe claims D cups, but we're dubious, however when she reveals her fine backside all is forgiven. This week's girl may have the best ass ever featured on ExCoGi thanks to youth and a regular regime of squats. In addition to this being Addyson's first video (though maybe not her last), it's also her first experience with a toy. Fortunately for y'all it's not Jay's first time and he knows how to apply a vibe to the very best effect. He goes to work on Addy and stations a camera right between her legs so you can see everything (including how wet she is) as she has several powerful orgasms.\nAfter getting off a couple of times, it's blowjob time and while Jay sets up the cameras Addyson asks about ECG, and if a lot of people will actually see her video. She is concerned that someone will find out. 'Someone' like'her parents. The obvious answer is: of course. But by that time Addyson has already spread the goods and came hard for Jay's multi-camera setups, so it's too late to back out now: Addyson is going to experience porn fame, if daddy likes it or not. And with her cock sucking abilities she demonstrates a minute later, Addyson's new jizz biz career is not going to remain a secret much longer.\nIf this were an ACTUAL exam like the SATs of dick, Addyson would get a near perfect score and have her choice of cock universities to apply to. She licks the head like it's a lollipop, strokes it and then takes Jay all the way down her throat in a masterful display of gag reflex relaxation. Once hard, Jay pins her down in her favorite position and pounds her into submission. He moves her into several more positions and the view is pretty amazing: Addyson's wet puss waiting to get penetrated. As he fucks her, she grinds into him and gets him so excited that when he unleashes a facial on her she nearly drowns in Jay jizz.\nA girl with a body like this, who loves to suck and fuck as much as Addyson certainly has a future in the biz and if she keeps up the squats and the throat relaxation exercises, she'll be a star. Off camera she suggests the porn name &quot;Addyson Chandler&quot; and while we're dubious as it doesn't contain a luxury car name or synonym for pot, she might not fit in with the porn gal of 2014, but it's a start.\nTake a look at screenshots! Enjoy!\n &lt;a href=&quot;\nhttp://teenimage.org/img-55c2759097ea2.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55c2759097ea2.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://teenimage.org/img-55c275ad42418.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55c275ad42418.html&lt;/a&gt;","torrent":{"xt":"urn:btih:5f796d50392e848f02dbf5c40eba8f1897b50e0c","amp;dn":"ExploitedCollegeGirls%3A+Addyson+%2819+Years+Old%29+%5BXXX%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f796d50392e848f02dbf5c40eba8f1897b50e0c","infoHashBuffer":{"type":"Buffer","data":[95,121,109,80,57,46,132,143,2,219,245,196,14,186,143,24,151,181,14,12]},"announce":[],"urlList":[]}}