{"title":"Green Lantern: The Animated Series #0-8 (2012) [DC Comics]","uid":7827016,"size":133152440,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5faa42494542541953ffddf41313631d87325235&amp;dn=Green+Lantern%3A+The+Animated+Series+%230-8+%282012%29+%5BDC+Comics%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackcanary","files":-1,"time":1352955125,"description":"English | CBZ and CBR | 9 Issues\n\nGreen Lantern: The Animated Series #0-8 (2012) [DC Comics]\nPublisher:  DC Comics\nPublication Date:  November 30, 2011 - November 14, 2012\n\nWritten by Art Baltazar and Franco (#1-7), Ivan Cohen (#8)\nArt by Dario Brizuela (#1-7), Luciano Vecchio (#8)\nColored by Gabe Eltaeb (#1-7), Franco Riesco (#8)\n\nBased on the animated series! When reckless test pilot Hal Jordan and his mentor Kilowog borrow an untested craft to complete a mission to the outer reaches of Guardian space, they discover a new threat. Now, they're far from home and the galaxy's first line of defense against the Red Lanterns!\n\nGreen Lantern: The Animated Series #0\nGreen is the color of will power, and one of the most powerful lights in the universe. The Guardians have harnessed this power to create an intergalactic police force wielding green power rings. What happens when Hal Jordan and Kilowog find one of these rings abandoned in space? Has one of their comrades fallen, or is something even more sinister happening?\n\nGreen Lantern: The Animated Series #1\nHal Jordan faces his greatest challenge onboard the Interceptor, when he faces off against a captured Red Lantern...and his mentor, Kilowog! Has their trip to the outer reaches of Guardian space driven Kilowog mad? Has their rage-filled prisoner influenced him to rebel against the Guardians' will? Hal can't believe his eyes, and neither will you!\n\nGreen Lantern: The Animated Series #2\nHal Jordan and Kilowog patrol the limits of the galaxy in their &quot;borrowed&quot; Green Lantern ship. Has Hal learned the lessons Kilowog's been teaching him? They soon find out as they run into an old foe: the Invisible Destroyer!\n\nGreen Lantern: The Animated Series #3\nHal Jordan and Kilowog find adventure on a new planet, where Aya, the ship's computer, takes her new robot body for a spin. Plus: Razer is almost kidnapped by a Spider Guild bounty hunter!\n\nGreen Lantern: The Animated Series #4\nA member of the Interceptor crew is injured! Can Aya heal the damage? Plus, what is the shocking secret of the Tattooed Man?\n\nGreen Lantern: The Animated Series #5\nThe Interceptor crew fights in the Monster Arena! Can Malvir become a Red Lantern by capturing Hal? Not if Aya and Hal cook up a plan to end Malvir's tyranny first!\n\nGreen Lantern: The Animated Series #6\nThe Red Lanterns attack--and only Hal Jordan responds! Where are Hal's fellow Green Lanterns? Have they been defeated in some distant battle? You'll have to read this issue to learn the truth!\n\nGreen Lantern: The Animated Series #7\nZilius Zox wants to impress Atrocitus and his fiendish plan sends a new villain to attack the Interceptor! Will Hal save the day? Or will Razer?!\n\nGreen Lantern: The Animated Series #8\nAya's experiment has knocked the Interceptor offline! Hal Jordan is stranded on a hostile planet--and his power ring is running low on energy!","torrent":{"xt":"urn:btih:5faa42494542541953ffddf41313631d87325235","amp;dn":"Green+Lantern%3A+The+Animated+Series+%230-8+%282012%29+%5BDC+Comics%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5faa42494542541953ffddf41313631d87325235","infoHashBuffer":{"type":"Buffer","data":[95,170,66,73,69,66,84,25,83,255,221,244,19,19,99,29,135,50,82,53]},"announce":[],"urlList":[]}}