{"title":"Aqua - Barbie Girl (Xvid-2nafish)","uid":5940035,"size":70566926,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:604861828c2bd33aad951a7c0d8fcc72601208f8&amp;dn=Aqua+-+Barbie+Girl+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1289089417,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:21\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2669 Kbps\nQuality Factor : 0.40 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no extra logos or titles.\n\n\n&quot;Barbie Girl&quot; is a song in the bubblegum pop genre by the Danish dance-pop group Aqua, who released it in 1997 as their third single overall, and the first United Kingdom release. The song is included on the album Aquarium and was written by Claus Norreen and SÃƒÂ¸ren NystrÃƒÂ¸m Rasted after the group saw an exhibit on kitsch culture. The song topped the charts worldwide, particularly in European countries such as the UK, where it was a number-one hit for three weeks; it was also on top of the charts in Australia for the same length of time, and debuted and peaked at No. 7 on the U.S. Billboard Hot 100 on 6 September 1997 and It remains Aqua's biggest hit single in the USA to date, and their only one to reach the Top 20 of the Billboard Hot 100.\n\nThe music video played repeatedly on MTV and helped launch the career of Danish director Peder Pedersen, who designed its cartoon-inspired visuals.\n\nThe lyrics of the song are about Barbie and Ken, the dolls made by Mattel. Both the song and its music video feature Lene NystrÃƒÂ¸m as Barbie and RenÃƒÂ© Dif as Ken. As such, the lyrics drew the ire of Barbie's corporate owners.\n\nThe song was voted the fourth &quot;Best Number One of All Time&quot; in a VH1 poll, and was featured in spot #32 on VH1's &quot;Most Awesomely Bad Songs... Ever&quot; countdown. In an unrelated VH1 countdown, VH1's 100 Greatest One-Hit Wonders, it was featured at #88. In 2007, Rolling Stone named &quot;Barbie Girl&quot; as one of the 20 Most Annoying Songs. Also in 2007, MuchMoreMusic featured the song at #27 on the list of the 50 Guilty Pleasures. In 2008, it was featured as &quot;one of the worst songs ever played&quot; on The Morning Wrap, the premiere talk show of the Florida Panhandle. In 2009, Same Difference voted it #2 in their Ultimate Cheese-Fest Top 20 on 4Music. Blender magazine also voted it at #33, as one of the 50 Worst Songs Ever. Despite the criticism, &quot;Barbie Girl&quot; has sold more than 8 million copies worldwide.\n\nMattel sued the band, saying they violated the Barbie trademark and turned Barbie into a sex object, referring to her as a &quot;Blonde Bimbo.&quot; They alleged the song had violated their copyrights and trademarks of Barbie, and that its lyrics had tarnished the reputation of their trademark and impinged on their marketing plan. Aqua claimed that Mattel injected their own meanings into the song's lyrics and MCA Records was not about to let their hit single be suppressed without a fight. They contested Mattel's claims and countersued for defamation after Mattel had likened MCA to a bank robber.\n\nThe lawsuit filed by Mattel was dismissed by the lower courts, and this dismissal was upheld, though Mattel took their case up to the Supreme Court of the United States (Mattel's appeal was later rejected). In 2002, Judge Alex Kozinski ruled the song was protected as a parody under the trademark doctrine of nominative use and the First Amendment to the United States Constitution. He also threw out the defamation lawsuit that Aqua's record company filed against Mattel. Kozinski concluded his ruling by saying, &quot;The parties are advised to chill.&quot; The case was dismissed, and in the process, it garnered lots of media attention for the song and the band. In 2009, Mattel released a series of advertisements and a promotional music video of the song, with modified lyrics, as part of a new marketing strategy brought in to revive sales.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:604861828c2bd33aad951a7c0d8fcc72601208f8","amp;dn":"Aqua+-+Barbie+Girl+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"604861828c2bd33aad951a7c0d8fcc72601208f8","infoHashBuffer":{"type":"Buffer","data":[96,72,97,130,140,43,211,58,173,149,26,124,13,143,204,114,96,18,8,248]},"announce":[],"urlList":[]}}