{"title":"Modern China: A Very Short Introduction - Mitter, Rana [Non-Fict","uid":8859714,"size":4088026,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60db590cd256dd80b06164a5950b13b5e3e7e155&amp;dn=Modern+China%3A+A+Very+Short+Introduction+-+Mitter%2C+Rana+%5BNon-Fict&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"K-Slender","files":5,"time":1377745045,"description":"China today is never out of the news: from human rights controversies and the continued legacy of Tiananmen Square, to global coverage of the Beijing Olympics, and the Chinese &quot;economic miracle.&quot; It is a country of contradictions and transitions: a peasant society with some of the world's most futuristic cities, an ancient civilization that is modernizing as rapidly as possible, a walled-off nation that is increasingly at the center of world trade. This Very Short Introduction offers an indispensable starting point for anyone who needs to quickly know the themes and controversies that have shaped modern China. Prize-winning author and scholar Rana Mitter examines the modern history, politics, economy, and thriving cultural scene of contemporary China, and its relations with the wider world. This lively guide covers a range of social issues from the decline of footbinding and the position of women in society, to the influence of television and film, and the role of the overseas Chinese diaspora. It covers many prominent figures as well, such as the Communist leaders, the last emperors, and prominent writers and artists throughout China's history. ","torrent":{"xt":"urn:btih:60db590cd256dd80b06164a5950b13b5e3e7e155","amp;dn":"Modern+China%3A+A+Very+Short+Introduction+-+Mitter%2C+Rana+%5BNon-Fict","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60db590cd256dd80b06164a5950b13b5e3e7e155","infoHashBuffer":{"type":"Buffer","data":[96,219,89,12,210,86,221,128,176,97,100,165,149,11,19,181,227,231,225,85]},"announce":[],"urlList":[]}}