{"title":"A come Andromeda - Serie Completa 1972 [DVDrip ITA] TNT Village","uid":6446173,"size":3143680000,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:619b72268efbef7742602d6e57c92c45245b352f&amp;dn=A+come+Andromeda+-+Serie+Completa+1972+%5BDVDrip+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"l.diliberto","files":5,"time":1307285927,"description":"A come Andromeda - Serie Completa 1972 [DVDrip ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=64916&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=64916&lt;/a&gt;\n\n.: Trama :.\n\n4 gennaio 1972: sul canale Nazionale (cosÃƒÂ¬ si chiamava allora Rai Uno) inizia la prima puntata di uno sceneggiato un po' anomalo per il pubblico televisivo di allora abituato essenzialmente a trasposizioni televisive di romanzi classici. Su una colonna sonora un po' New Age ante litteram compaiono le immagini di una grossa antenna (ÃƒÂ¨ il radiotelescopio inglese di Jodrell Bank) e appare la scritta &quot;A come Andromeda&quot; con una frase aggiuntiva che preannuncia la fantascienza in TV: &quot;questa storia si svolge in Inghilterra l'anno prossimo&quot;. E' la prima puntata di uno sceneggiato che resterÃƒÂ  nella storia della televisione italiana e che rappresenta quasi sicuramente una delle massime espressioni della fantascienza in televisione. Lo sceneggiato si inserisce in un'epoca in cui sono state fatte importantissime scoperte scientifiche (ÃƒÂ¨ di qualche anno il primo allunaggio e il primo trapianto di cuore) e l'umanitÃƒÂ  dimostra in ogni momento una fiducia elevata nella scienza e nella tecnologia e di conseguenza nel domani. Sull'onda dell'entusiasmo per l'esplorazione spaziale l'UmanitÃƒÂ  si pone un quesito fondamentale e ancora attualissimo: c'ÃƒÂ¨ vita nell'Universo? Su questa domanda si dipana la storia narrata in &quot;A come Andromeda&quot;.\nPrima dell'inaugurazione del piÃƒÂ¹ potente radiotelescopio inglese viene captato un segnale proveniente dalla galassia di Andromeda. L'astronomo John Fleming (Luigi Vannucchi) si accorge con stupore che ÃƒÂ¨ un segnale intelligente e riesce a decodificarlo.Il contenuto del segnale si rivela stupefacente: rappresenta l'insieme delle istruzioni per la costruzione di un supercalcolatore che in seguito provvederÃƒÂ  a clonare una donna (Andromeda). La storia si dipana fra la consapevolezza di un incontro con un'intelligenza aliena e la paura legata alle intenzioni ignote legate a questo incontro. Vengono cosÃƒÂ¬ toccati alcuni temi che a tutt'oggi sono attualissimi: intelligenze aliene, informatica, clonazione. Il romanzo da cui ÃƒÂ¨ tratto lo sceneggiato ÃƒÂ¨ stato scritto qualche anno prima da Fred Hoyle che, oltre a essere un famoso scrittore di fantascienza, ÃƒÂ¨ anche un altrettanto famoso astronomo e da John Elliot. La sceneggiatura di Inisero Comaschi, unita alla sapiente regia di Vittorio Cottafavi, ci regalano 5 puntate ricche di forte emotivitÃƒÂ . Il cast degli attori ÃƒÂ¨ di tutto rispetto: oltre al compianto Luigi Vannucchi (bravissimo attore e appassionato di fantascienza) vi sono Paola Pitagora, Tino Carraro e Nicoletta Rizzi che interpreta l'algida Andromeda (in un primo tempo la parte era stata assegnata a Nicoletta Strambelli ovvero Patty Pravo). Completano il cast un nutrito gruppo di bravissimi caratteristi fra i quali ÃƒÂ¨ opportuno ricordare Giampiero Albertini e\nSandro Tuminelli. Riviste con gli occhi di oggi alcune scene e l'assenza di effetti speciali fanno un po' sorridere ma i quesiti filosofici di fondo e la plausibilitÃƒÂ  e verosimiglianza della storia continuano a far rimanere incollati al video gli spettatori oggi come allora. E' sicuramente da ricordare, pur nella sua semplicitÃƒÂ , la scena con cui si chiude la terza puntata: l'immagine di Andromeda (Nicoletta Rizzi) che compare dall'oblÃƒÂ² della macchina che ha permesso la clonazione di un essere umano. Una curiositÃƒÂ : &quot;A come Andromeda&quot; era stato trasmesso in sette puntate dalla BBC (protagonista Julie Christie) nei primi anni '60 e, sfortunatamente, le cassette contenenti le singole puntate sono state cancellate: l'edizione televisiva italiana resta quindi l'unica disponibile.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img32.imageshack.us/img32/70/andromedan.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img32.imageshack.us/img32/70/andromedan.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nPaese: \tItalia\nAnno: \t1972\nGenere: \tFantascienza\nStagioni: \t1\nPuntate: \t5\nDurata: \t60 minuti per episodio\n\nRegia: \tVittorio Cottafavi\nSoggetto: \tFred Hoyle\nSceneggiatura: \tInisero Cremaschi, John Elliot\nFotografia: \tGiampiero Puliti, Nevio Sivini\nMontaggio: \tGennaro Oliveti\nMusiche: \tMario Migliardi\nScenografia: \tMariano Mercuri\nCostumi: \tAndretta Ferrero\nProduttore: \tRAI\n\nCast:    Luigi Vannucchi: Dottor John Fleming\n    Paola Pitagora: Judy Adamson\n    Tino Carraro: Professor Ernest Reinhart\n    Enzo Tarascio: Colonnello Geers\n    Claudio Cassinelli: Harries\n    Nicoletta Rizzi: Andromeda / Christine Flemstad\n    Franco Volpi: Generale Watling\n    Mario Piave: Dennis Bridger\n    Gabriella Giacobbe: Dottoressa Madeleine Dawnay\n    Ida Meda: Dottoressa Liz Ray\n    Guido Alberti: Primo Ministro\n    Edoardo Toniolo: Ministro Charles Robert Ratcliff\n    Giampiero Albertini: Generale Vandenberg\n    Raffaele Bondini: Egon\n    Maria Brivio: Annunciatrice tv\n    Inisero Cremaschi: Jan Olboyd\n    Guido De Salvi: Maggiore Quadring\n    Arturo Dominici: Sottosegretario Osborne\n    Dino Peretti: Alex\n    Sandro Tuminelli: Barnett\n    Gualtiero Isnenghi: Dottor Hunter\n\n0=============================0\n\n.: Info Ripping :.\n\nRisoluzione: 640x480\nVideo Codec: DivX\nAudio Codec: MP3","torrent":{"xt":"urn:btih:619b72268efbef7742602d6e57c92c45245b352f","amp;dn":"A+come+Andromeda+-+Serie+Completa+1972+%5BDVDrip+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"619b72268efbef7742602d6e57c92c45245b352f","infoHashBuffer":{"type":"Buffer","data":[97,155,114,38,142,251,239,119,66,96,45,110,87,201,44,69,36,91,53,47]},"announce":[],"urlList":[]}}