{"title":"AFGHANISTAN - A Journey to an Unknown Musical World (Starinar)","uid":5343809,"size":103784574,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:61b9990a8964d21853a0a6fa0fbf4c5f148f7581&amp;dn=AFGHANISTAN+-+A+Journey+to+an+Unknown+Musical+World+%28Starinar%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starinar","files":20,"time":1265567931,"description":"Starinar Torrents: Traditional, Tribal, Ritual, Sacred and Indigenous Music. ENJoY!\n\nAfghanistan - A Journey to an Unknown Musical World\n\nA nice collection of &quot;pre-troubled&quot; Afghanistani music, recorded by the German WDR group in 1974, prior to the bulk of the political and religious upheaval that's taken place in the intervening decades. Thanks to the time frame of this recording, the traditions haven't been altered forcefully for the most part (though there are hints at Islamization of works from the Nuristani region). While the pieces hail from around the country, there is a focus on the Herat region and the region of Mazar-E-Sharif (where the works were recorded). The music itself runs the gamut from a simple, barely accompanied shepherd paean to full, harmonium-equipped ensembles backing up trios of singers. The highlight of the disc is the bareness of the music in many cases, which allows a seemingly more heartfelt song to be sung over the accompaniment. The opening love song from Herat is a prime example, with the plaintive cries of a lover filling the room. Just watch the volume when the child singers come on. ~ Adam Greenberg\n\nQuality: 192kbps + cover (byStarinarTorrents)","torrent":{"xt":"urn:btih:61b9990a8964d21853a0a6fa0fbf4c5f148f7581","amp;dn":"AFGHANISTAN+-+A+Journey+to+an+Unknown+Musical+World+%28Starinar%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61b9990a8964d21853a0a6fa0fbf4c5f148f7581","infoHashBuffer":{"type":"Buffer","data":[97,185,153,10,137,100,210,24,83,160,166,250,15,191,76,95,20,143,117,129]},"announce":[],"urlList":[]}}