{"title":"Grass and Plant Instancing in Maya Mental Ray Part 2 HD 720p - s","uid":8823881,"size":4529057243,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:61f6a167f814e7bdb34a880deac035c0c06d0e3c&amp;dn=Grass+and+Plant+Instancing+in+Maya+Mental+Ray+Part+2+HD+720p+-+s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sum1_here","files":-1,"time":1376778209,"description":":General:\nComplete name: Grass and Plant Instancing in Maya Mental Ray Part 2 HD 720p - sum1_here\nFormat: mp4\nSize: 4.21 GB \nDuration4+ hrs\nOverall Bitrate: 618 Kbps\nLanguage: English\nSub Title: None\nEncoder: sum1_here\nSource: mov Thanks\n\n\n\n\n:Video:\nFormat/Info: Advanced Video Codec\nBitrate: 550 Kbps\nWidth: 1280 pixels\nHeight: 720 pixels\nDisplay aspect ratio: 16:9\nFrame rate: 12.000 fps\n\n\n\n:Audio:\nFormat: Advanced Audio Codec\nNominal Bitrate: 128 Kbps\nChannel(s): 2 channels\nSampling rate: 44.1 KHz\n\n\n\n\n\n\nDetails:\n14 Videos\nIn this DVD, Alex covers how to create realistic grass using Maya, Paint Effects and Mental Ray while also sharing his techniques for developing a complete natural environment. We begin by evaluating the default Paint Effects grass library with discussion on the basic adjustments needed to make grass more natural. Techniques for covering large areas with grass are then explored via curves and instancing. Through the use of instancing, particles and surface emitters, Alex shows how to populate large scenes with grass geometry, rendering millions of polygons with a minimal RAM footprint. Included is an expression based technique for orienting instanced geometry with the normal of the generating surface, an issue less important for plants or trees but often very important for grass. When elements need to be interactively and precisely placed, Alex also demonstrates the use of a freely available geometry paint script, as well as how to bake particle instances to geometry. Generating textures, miaMaterials and workflow in conjunction with Physical Sun/Sky is thoroughly discussed. Alex also demonstrates how to render and utilize zDepth passes to add post depth-of-field and fog effects, how to render true volumetric fog effects, as well as Photoshop and After Effects post techniques to increase realism through the use of color correction and plug-ins, including Magic Bullet, LensCare and Sapphire.\n\n\n\n\n\n\n\n\nWe are on FaceBook, Post Your Request, suggestion, and find upcomming Release of Silver RG, you will find all Silver RG Encoders at FB Page so keep in touch\n\n\n\n\n:Greetz:\nTo All Silver RG Encoders, All SilverTorrentHD Encoders &amp; All Other P2P RGs\n\n:Note:\nMake sure its real Silver RG Release From Silver RG Member,A video sample is included in the folder for those who want to check quality and compatibility before downloading the whole movie.\n\nWe Are Looking For Early Access To Anything You Can Provide CAMS, TS, DVD Screeners, VHS Screeners, DVDRips, Direct Audio, Early Music Release, Anything You Can Provide Seedboxes, Accounts, Dedicated Servers \n\n:Support:\nTook 5 Hours to Encode &amp; 24 Hours to Upload &amp; Seed\nTook 30 Minutes to Create Description/Screen Shots etc...\nTakes 10 Seconds to say&quot;Thank You&quot;, or 4 seconds to say &quot;Whoooo&quot;\n","torrent":{"xt":"urn:btih:61f6a167f814e7bdb34a880deac035c0c06d0e3c","amp;dn":"Grass+and+Plant+Instancing+in+Maya+Mental+Ray+Part+2+HD+720p+-+s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61f6a167f814e7bdb34a880deac035c0c06d0e3c","infoHashBuffer":{"type":"Buffer","data":[97,246,161,103,248,20,231,189,179,74,136,13,234,192,53,192,192,109,14,60]},"announce":[],"urlList":[]}}