{"title":"HISTORY OF POP AND ROCK MUSIC - part 542","uid":9422655,"size":1663051215,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6215b70d1a3972e14967890a36728cbb4b6fc144&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+542&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1388617742,"description":"                       \n\n\n                         PART  542\n\n            \n  This is a list of singles that peaked in the Top 10 of the UK Singles Chart during January 2013\n\n\n 13 January CALVIN HARIS (ftTinie Tempah) - &quot;Drinking from the Bottle&quot;  (2013) \n 13 January DAVID BOWIE  - &quot;Where Are We Now?&quot;  (2013) \n 13 January PITBULL  (featuring TJR)  - &quot;Don't Stop the Party&quot;  (2013) \n 20 January 50 CENT  (featuring Eminem &amp; Adam Levine)  - &quot;My Life&quot; (2013)  \n 20 January JUSTIN TIMBERLAKE (featuring Jay-Z)  - &quot;Suit &amp; Tie&quot;  (2013) \n 20 January ONE DIRECTION  -  &quot;Kiss You&quot;  (2013)\n 27 January BINGO PLAYERS (ft. Far East Movement) - &quot;Get Up (Rattle)&quot;  (2013) \n 27 January CONOR MAYNARD  (featuring Wiley)  - &quot;Animal&quot;  (2013) \n 27 January EMELI SANDE  -  &quot;Clown&quot;  (2013)\n\n\n\n            &quot;Drinking from the Bottle&quot; is a song by Scottish DJ and producer Calvin Harris from his third studio album, 18 Months. The song features English rapper Tinie Tempah. The song was released as a single on 27 January 2013. It has peaked at number five on the UK Singles Chart. The video opens with actor Brad Dourif, as the devil, speaking to his friend &quot;Patrick&quot; (dressed as a wizard), how he had sex with Joan of Arc in 1430, just a few months before her burning at the stake. The rest of the video features Harris and Tempah in a dark room with scantily-clad women, with Harris sitting inside a car and Tempah outside it. There are also scenes of drinking, drugs, violence, arson, sex, and nudity, as well as Harris and Tempah meeting up with the devil. Robert Copsey of Digital Spy gave the song three out of five stars and wrote, &quot;With lyrics about necking booze from buckets with sparklers, name-checking Rihanna, the Kardashians and, erm, Danny DeVito as well as a ravey breakdown that you could set your watch to, they've ticked all the necessary boxes for an easy chart hit. 'I know this crazy life can be a bitter pill to swallow,' he continues, prompting our weary response: 'Go on then, one last time won't hurt us... right?'.&quot;\nInspiration for the song is said to come from friend Mad Skillz Tommy Schillz who is regularly seen at clubs drinking a variety of hard alcohol straight out of the bottle.\n              &quot;Where Are We Now?&quot; is the first single from David Bowie's 24th studio album, The Next Day. The single was released on iTunes on 8 January 2013, Bowie's 66th birthday, along with a video by Tony Oursler, which was posted on Bowie's website.  According to producer Tony Visconti, the timing of the release was Bowie's idea, and the single was simply &quot;dropped&quot; in iTunes for fans to discover, with no warning or fanfare. The single made it to the top of the charts in eight countries on the day of its release. It was no. 1 on the British iTunes chart by 3 pm that day. It was at first deemed ineligible for placement on other British singles charts because, in addition to being sold separately, the song was also free to those who pre-purchased The Next Day on iTunes, making the sales difficult to separate. The Official Charts Company resolved the issue, and on 13 January the song entered the UK Singles Chart at no. 6, Bowie's highest charting single there since &quot;Absolute Beginners&quot; reached no. 2 in 1986. It is his first UK top-ten single since &quot;Jump They Say&quot; in 1993. His first top-ten hit was in the UK in 1969 with &quot;Space Oddity.&quot;\n             &quot;Don't Stop the Party&quot; is a song recorded by Pitbull for his seventh studio album Global Warming. The song features TJR and includes samples of the song &quot;Funky Kingston&quot; by Toots and the Maytals replayed by Mark Summers at Scorccio Sample Replays. It was released on September 25, 2012 as the album's third single by RCA Records. The song was written by Pitbull, TJ Rozdilsky, Jose Garcia, Jorge Gomez Martinez, Warwick Lyn, and Frederick Hibbert, and it was produced by Rozdilsky under his stage name TJR, with additional production by Scottish house producr Chris Lake. Rozdilsky had previously written the song as &quot;Funky Vodka&quot;, which caught Pitbull's attention. It has peaked at number 17 on the Billboard Hot 100. The song's accompanying music video was noted for its sexually explicit content, and was subsequently banned from airing in the United Kingdom.\n               &quot;My Life&quot; is a song by  50 Cent and the second official single of his forthcoming fifth studio album Street King Immortal. The single, which features his mentor and fellow American rapper Eminem and Maroon 5's lead singer Adam Levine, was produced by American music producer Symbolyc One. The song premiered on American radio station Hot 97, and was made available for digital download on iTunes Store on November 26, 2012. The song debuted on Billboard Hot 100 on the week of December 6, 2012 at #27, selling 140,000 units in its first week. It also debuted on Billboard Hot R&amp;B/Hip-Hop Songs at #6 and at #5 on Rap Songs. It also charted outside the U.S. on Canadian Hot 100 at #14, on Mega Single Top 100 at #89, Schweizer Hitparade at #36, on Ultratip Flanders at #9 and on others charts. The song reached number 9 on the Belgium Ultratip chart, which is the Belgian equivalent of the Billboard bubbling under chart. It has also debuted at #2 on the UK Singles chart after being released in January.\n           &quot;Suit &amp; Tie&quot; is a song recorded by Justin Timberlake for his third studio album, The 20/20 Experience (2013). It features vocals from American rapper Jay-Z. It was written and produced b","torrent":{"xt":"urn:btih:6215b70d1a3972e14967890a36728cbb4b6fc144","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+542","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6215b70d1a3972e14967890a36728cbb4b6fc144","infoHashBuffer":{"type":"Buffer","data":[98,21,183,13,26,57,114,225,73,103,137,10,54,114,140,187,75,111,193,68]},"announce":[],"urlList":[]}}