{"title":"Kathryn Calder...Bright and Vivid(2011)[FLAC]","uid":6875718,"size":274854259,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:62a60a9a3413b65c611d9376bac819e66ee6cc5e&amp;dn=Kathryn+Calder...Bright+and+Vivid%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":13,"time":1323411820,"description":" &lt;a href=&quot;http://image.allmusic.com/00/amg/cov200/drq500/q515/q51511fybyn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://image.allmusic.com/00/amg/cov200/drq500/q515/q51511fybyn.jpg&lt;/a&gt;\n\nBright and Vivid [2011] File Under Music / 017\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1 One Two Three-Calder\t4:26\n2 Who Are You?-Calder\t4:03\n3 Turn a Light On-Calder\t3:21\n4 Walking in My Sleep-Calder\t3:25\n5 All the Things-Calder\t6:00\n6 Right Book-Calder\t4:50\n7 New Frame of Mind-Calder\t4:17\n8 City of Sounds-Calder\t3:30\n9 Five More Years-Calder\t4:03\n10 Younger Than We've Ever Been-Calder\t3:35\n\nFor an album titled Bright and Vivid, Kathryn Calder's sophomore solo effort sure starts out pretty murky. With its thick, squalling guitars, thudding drumbeat, and smeared, muffled vocals, &quot;One Two Three&quot; initially suggests that Calder is taking a page from the voguish, lo-fi girl group playbook (Dum Dum Girls, Vivian Girls, et al), but that soon turns out to be a bit of a miscue. There's a sense of polish and deliberateness in spite of all the hazy, swirling sonics; what emerges here, and throughout the album, is indeed quite vivid and bright -- but on the order of a lush, richly saturated Impressionist painting (or, perhaps, the album's autumnal-hued cover), an aesthetic far removed from the crisp, neatly delineated formalism of her work with the New Pornographers and Immaculate Machine. While Calder's relatively intimate, understated solo debut demonstrated a keen awareness of texture and a solid understanding of arrangement, those impulses come to the fore here in a considerably fuller and more conspicuous way, becoming as much of a focus as the songs themselves, if not more; take for instance the epically evolving, almost suite-like &quot;All the Things,&quot; which is instrumental for more than half of its six-minute run time, and features Calder's voice, when it does come in, positively drowned in reverb. That voice -- warm, confident, girlishly pure, more richly developed than ever --still serves as the sublime vehicle for melody it has long been, rising brilliantly above the gentle haze on &quot;Right Book,&quot; or tenderly harmonizing on &quot;City of Sounds,&quot; but it's also sometimes treated as just one more, albeit integral, element in the album's lavish, layered tapestry of texture. For all the considerable volume of sound on the album -- which Calder recorded in her living room with her producer-engineer husband Colin Stewart (head of Vancouver's Hive Creative Labs), working at a leisurely pace and enlisting a generous cast of collaborators -- it never feels overstuffed. And while the songs, in general, tend not to announce themselves loudly, but rather blossom gradually, taking time to reveal their ample hooks and charms, they show just as much care and craft as the album's expansive soundscape. Even at their most immediately, infectiously accessible -- the glorious, electro-poppy earworm &quot;Who Are You?,&quot; which has all the makings of an indie-night dance anthem, or the catchy, rocking &quot;Walking in My Sleep&quot; (the closest the album comes to New Pornos-style power pop) -- these are thoughtful, complex pieces of songwriting. A firm step forward on all fronts, Bright and Vivid is a thoroughly engaging listen and establishes Calder as a creative force and pop craftsperson every bit as worthy as her big-deal bandmates.\n\ncd ripped by a mate using x decoder,cheers\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2011/10/25/kathryn-calder/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2011/10/25/kathryn-calder/&lt;/a&gt;","torrent":{"xt":"urn:btih:62a60a9a3413b65c611d9376bac819e66ee6cc5e","amp;dn":"Kathryn+Calder...Bright+and+Vivid%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62a60a9a3413b65c611d9376bac819e66ee6cc5e","infoHashBuffer":{"type":"Buffer","data":[98,166,10,154,52,19,182,92,97,29,147,118,186,200,25,230,110,230,204,94]},"announce":[],"urlList":[]}}