{"title":"Cuckold Fantasies Vol 16 [DVDRip]","uid":7860832,"size":1033836580,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:62b21e932c619d88c355ba49b2d19b4665b9f454&amp;dn=Cuckold+Fantasies+Vol+16+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"R0thschild","files":3,"time":1353927315,"description":"Gallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=834613&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=834613&lt;/a&gt;\n\nCuckold Fantasies has shown you many different types of husbands and wives. But this time it's different. Katie and Rick are a REAL MARRIED COUPLE! For them, cuckolding isn't just a movie fantasy, it's a way of life! AND WHAT A FUCKING LIFE!!! We begin with their visit to kinky marriage counselor, Dr. Phil Errup. When they confess that their sex life has become boring, Dr. Phil recommends they consider a swinging lifestyle. He goes even further, prescribing that they watch Roman Video's series of Cuckold Fantasies. They take the doctor's advice. At home, they watch some cuckold videos and become so turned on that they FUCK with a new found intensity. Rick eats Katie's pussy as she talks about fucking a black guy she's seen at the gym. Katie sucks her husband's cock before he gives her a fierce doggy-style pounding. When he CUMS INSIDE HER she tells him to practice eating other men's cum by starting with his own. He obeys. Seeing her husband so subservient, Katie takes charge, ordering Rick to put on a CHASTITY DEVICE and wait while she goes to the gym to pick the black guy she's been fantasizing about. Later, she returns home with TYLER, and her husband is shocked. He thought it was all just fantasy role play. But Katie took Dr. Phil's advice very seriously. As Rick kneels, naked, he watches his wife pull out Tyler's MASSIVE BLACK COCK and start TIT FUCKING it between her large mammaries","torrent":{"xt":"urn:btih:62b21e932c619d88c355ba49b2d19b4665b9f454","amp;dn":"Cuckold+Fantasies+Vol+16+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62b21e932c619d88c355ba49b2d19b4665b9f454","infoHashBuffer":{"type":"Buffer","data":[98,178,30,147,44,97,157,136,195,85,186,73,178,209,155,70,101,185,244,84]},"announce":[],"urlList":[]}}