{"title":"Scottish Baronial Castles 1250-1450","uid":11774287,"size":29829353,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62cb7bfbee739ed8b2be5704a16ee5282d434bc2&amp;dn=Scottish+Baronial+Castles+1250-1450&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427208946,"description":"Devastated by the civil wars of the 17th century or by the neglect and deliberate destruction of their owners who saw them as archaic and barbaric, the vast majority of Scottish baronial castles built between 1250 and 1450 survive as little more than skeletal ruins. These reminders of Scotland's past have captured the imaginations of romantics, artists, writers and tourists since the late 18th century. Often set in spectacular surroundings, on cliff-tops, islands, and gorges, their ruined grandeur evokes a medieval world of sieges, banquets and murders, and provides a rare physical link with the Anglo-Scottish wars of Robert the Bruce and William Wallace.\n\nThis book examines the three periods of castle building in the years 1250-1450: the years of peace in the late 13th century; the six decades of war with the English when the castles became key centers for garrisons and government; and the post-war era of castle building and reconstruction. Covering castles in the Isles, the Lowlands and the Highlands, and featuring some of the most striking examples of the art, such as Caelaverock and Bothwell this book presents the story of these monuments in an accessible and highly-illustrated format","torrent":{"xt":"urn:btih:62cb7bfbee739ed8b2be5704a16ee5282d434bc2","amp;dn":"Scottish+Baronial+Castles+1250-1450","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62cb7bfbee739ed8b2be5704a16ee5282d434bc2","infoHashBuffer":{"type":"Buffer","data":[98,203,123,251,238,115,158,216,178,190,87,4,161,110,229,40,45,67,75,194]},"announce":[],"urlList":[]}}