{"title":"The Passion of the Christ (2004)","uid":3947603,"size":4680892461,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:62d8ad6f4688d3f7da08aefdc27dd886091b124a&amp;dn=The+Passion+of+the+Christ+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"prince213","files":16,"time":1198610184,"description":"DVD details\n\n* Actors: James Caviezel, Maia Morgenstern, Christo Jivkov, Francesco De Vito, Monica Bellucci\n* Directors: Mel Gibson\n* DVD Format : DVD-5 (CEE Encoded from Original DVD-9)\n* Audio Format: Dolby Digital 5.1 (AC-3)\n* Video Format : MPEG-2\n* TV system : 525/60 (NTSC)\n* Aspect Ratio : 16:9 (Wide Screen)\n* Resolution : 720x480\n* Language : Hebrew\n* Subtitles : English,English for the hearing imparied,French\n* Region: All\n* Number of discs: 1\n* Classification: R (Restricted) (US MPAA rating)\n* Studio: 20th Century Fox\n* DVD Release Date: 31 Aug 2004\n* Run Time: 127 minutes\n\nDescription\n\nThe Passion of The Christ is a film about the last twelve hours of Jesus of Nazareth life.\n\nThe film opens in the Garden of Olives (Gethsemane) where Jesus has gone to pray after the Last Supper. Jesus resists Satan temptations. Betrayed by Judas Iscariot, Jesus is arrested and taken back to within the city walls of Jerusalem where the leaders of the Pharisees confront him with accusations of blasphemy and his results in a condemnations of death. Jesus is brought before Pilate, the Roman Governor of Palestine, who listens to the accusations leveled at him by the Pharisees. Realizing he is confronting a political conflict, Pilate defers to King Herod in the matter. Herod returns Jesus to Pilate who gives the crowd a choice between Jesus and the criminal Barabbas. The crowd chooses to have Barabbas set free and to condemn Jesus. Jesus is handed over to the Roman soldiers and flagellated. Unrecognizable now, he is brought back before Pilate, who presents him to the crowd as if to say is this not enough? It is not. Pilate washes his hands of the entire dilemma, ordering his men to do as the crowd wishes. Jesus is presented with the cross and is ordered to carry it through the streets of Jerusalem all the way up to Golgotha. On Golgotha, Jesus is nailed to the cross and undergoes his last temptation -- the fear that he has been abandoned by his Father. He overcomes his fear, looks at Mary, his Holy Mother, and makes the pronouncement which only she can fully understand, it is accomplished. He then dies: into Thy hands I commend my Spirit. At the moment of his death, nature itself overturns.\n\n\nVisit http://prince213.blogspot.com/ for more...","torrent":{"xt":"urn:btih:62d8ad6f4688d3f7da08aefdc27dd886091b124a","amp;dn":"The+Passion+of+the+Christ+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62d8ad6f4688d3f7da08aefdc27dd886091b124a","infoHashBuffer":{"type":"Buffer","data":[98,216,173,111,70,136,211,247,218,8,174,253,194,125,216,134,9,27,18,74]},"announce":[],"urlList":[]}}