{"title":"Armin Van Buuren - Mirage (Deluxe Version) (Inspiron)","uid":6828120,"size":301465492,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6359bc258f8bc4d89e260a13c128228b8a80bbc7&amp;dn=Armin+Van+Buuren+-+Mirage+%28Deluxe+Version%29+%28Inspiron%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"-inspiron-","files":18,"time":1321660776,"description":"Twitter: inspiron22\n\n\n\n\nTracklist :\n\n\n\n\n\n1.Armin van Buuren, Fiora - Breathe In Deep feat. Fiora (Album Version) \n2.Armin van Buuren, Vanvelzen - Take Me Where I Wanna Go feat. VanVelzen (Album Version) \n3.Armin van Buuren, Cathy Burton - I Surrender feat. Cathy Burton (Album Version) \n4.Armin van Buuren, Jessie Morgan - Love Too Hard feat. Jessie Morgan (Album Version) \n5.Armin van Buuren, Sophie - Virtual Friend feat. Sophie (Acoustic Version) \n6.Armin van Buuren, Christian Burns, Bagga Bownz - Neon Hero feat. Christian Burns feat. Bagga Bownz (Original Mix) \n7.Armin van Buuren, Susana - Desiderium 207 feat. Susana (Leon Bolier Peaktime Remix) \n8.Armin van Buuren - Mirage (Dennis Sheperd Remix) \n9.Armin van Buuren, Adam Young - Youtopia feat. Adam Young (Michael Woods Remix) \n10.Armin van Buuren - Full Focus (Chris Schweizer Mix) \n11.Armin van Buuren, Fiora - Breathe In Deep feat. Fiora (The Blizzard Remix) \n12.Armin van Buuren, Nadia Ali - Who's Watching feat. Nadia Ali (Mike Shivers Garden State Mix) \n13.Rising Star - Touch Me (Sebastian Brandt Remix) \n14.Armin van Buuren - Blue Fear (Orjan Nilsen Remix) \n15.Laura Jansen - Use Somebody (Armin van Buuren Re-Work) \n16.Armin van Buuren, Winter Kills - Take A Moment (Bonus Track) feat. Winter Kills (The Blizzard Remix) \n17.Armin van Buuren, Jessie Morgan - Love Too Hard (Bonus Track) feat. Jessie Morgan (Ron Hagen &amp; Al-Exander Remix) \n\n\n\nEnjoy\n(Inspiron)","torrent":{"xt":"urn:btih:6359bc258f8bc4d89e260a13c128228b8a80bbc7","amp;dn":"Armin+Van+Buuren+-+Mirage+%28Deluxe+Version%29+%28Inspiron%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6359bc258f8bc4d89e260a13c128228b8a80bbc7","infoHashBuffer":{"type":"Buffer","data":[99,89,188,37,143,139,196,216,158,38,10,19,193,40,34,139,138,128,187,199]},"announce":[],"urlList":[]}}