{"title":"Operation Mind Control - by Walter Bowart RARE OOP","uid":4280389,"size":3076432,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:637990f14a7fcf0fecf2aa6406f84d96f3e9fc5f&amp;dn=Operation+Mind+Control+-+by+Walter+Bowart+RARE+OOP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eastern876","files":1,"time":1215387653,"description":"OPERATION MIND CONTROL:\nTHE CRYPTOCRACY&amp;#039;S PLAN TO PSYCHOCIVILIZE YOU\nBy W.H. BOWART\nPDF e-book\n----------------------------------------------------------\n\nOPERATION MIND CONTROL:\nTHE CRYPTOCRACY&amp;#039;S PLAN TO PSYCHOCIVILIZE YOU\n&quot;a synopsis&quot; By W.H. BOWART\n\nNotes on this synopsis: Bowart&amp;#039;s 1st release of Operation Mind Conrol was back in 1978. In an interview, in 1995 [ Richardson, TX] Walter said, &quot;It went into print and made it to the where houses (we think) few made it to the book stores - I got paid &lt;chuckle&gt; nice of theem, to pay me for what they took.&quot; -- Then Mr. Bowart went on to other books and a life of a pretty hip journalist - one of the few people that Frank Zappa gave an interview to! Many say Bowar forgot more than most now know! About the Format --These are e-mail down loads, that I later cleaned up for this format.\nAmicus humani generis,\nEric Heimstadt\n\nDate: Thu, 24 Aug 1995 00:52:21 +0000 From: Freedom of Thought Foundation Subject: (Fwd) OPERATION MIND CONTROL-2\nOPERATION MIND CONTROL: THE CRYPTOCRACY&amp;#039;S PLAN TO PSYCHOCIVILIZE YOU\nBy W.H. BOWART\nIn response to demand here is a synopsis of W.H. Bowart&amp;#039;s seminal work without notes, illustrations and additional material. This synopsis is composed of the first few paragraphs ( some abridged) of each of the 42 chapters of Operation Mind Control, the &quot;Limited Researcher&amp;#039;s Edition&quot; which has been published in a numbered edition of 500 copies signed by the author.\n1 THE CRYPTORIAN CANDIDATE\n\nIt may have been the biggest story since the atom bomb. The headline, however, was small and ignored the larger issue. &quot;Drug Tests by CIA Held More Extensive Than Reported in &amp;#039;75,&quot; said the New York Times on July 16, 1977. What it should have said is &quot;U.S. Develops Invisible Weapons to Enslave Mankind.&quot;\n\nThe testing of drugs by the CIA was just a part of the United States government&amp;#039;s top-secret mind-control project, a project which had spanned thirty-five years and had involved tens of thousands of individuals. It involved techniques of hypnosis, narco-hypnosis, electronic brain stimulation, behavioral effects of ultrasonic, microwave, and low-frequency sound, aversive and other behavior modification therapies. In fact, there was virtually no aspect of human behavioral control that was not explored in their search for the means to control the memory and will of both individuals and whole masses of people...\n2 ONLY ONE MIND FOR MY COUNTRY\n\nThrough the gray waters of amnesia he drifted, coming back from blind coma. First the echoes, like electronically amplified voices speaking from a deep, deep well... then, far off, the dim pink molecules of light... David&amp;#039;s body lay still in the military hospital bed. Only his eyes rolled beneath the lids. For several hours he lay that way, perfectly still -- just eyes fluttering. The fluttering became more intense. Then his eyes opened. &quot;When I woke up,&quot; David said, &quot;I couldn&amp;#039;t remember anything. I couldn&amp;#039;t remember how I&amp;#039;d gotten there or why I was in the hospital.&quot; He asked nurses and aides why he was there. They told him he&amp;#039;d have to ask his doctor. When David finally saw him, the doctor said, &quot;You tried to commit suicide...&quot;\n3 THE MIND LAUNDRY MYTH\n\nDavid&amp;#039;s own assessment of his mental confusion after his air force experience was that he had not been &quot;brainwashed.&quot; By the time David had his mind controlled, &quot;brainwashing&quot; had become a catchall phrase, but what David had suffered was a much more subtle and hideous form of tyranny. George E. Smith was a POW during the early days of the Vietnam War. Unlike David, George did not have a good education. It can even be said that he was a little naive, and therefore a good candidate for brainwashing of both the American and the NLF (Viet Cong) varieties. He was one of the first of the Green Berets captured in the Vietnam conflict in 1963...\n4 WITHOUT KNOWLEDGE OR CONSENT\n\n&quot;I can hypnotize a man -- without his knowledge or consent -- into committing treason against the United States,&quot; boasted Dr. George Estabrooks in the early 1940s. Estabrooks, chairman of the Department of Psychology at Colgate University, was called to Washington by the War Department shortly after Pearl Harbor. Since he was the ranking authority on hypnosis at the time, they wanted his opinion on how the enemy might be planning to use hypnotism. &quot;Two hundred trained foreign operators, working in the United States,&quot; Estabrooks told the military leaders, &quot;could develop a uniquely dangerous army of hypnotically controlled Sixth Columnists...\n5 HOLY ACID WARS\n\nIn 1951, a former naval officer described &quot;a secret&quot; of certain military and intelligence organizations. He called it &quot;Pain-Drug-Hypnosis&quot; and said it &quot;is a vicious war weapon and may be of considerably more use in conquering a society than the atom bomb. This is no exaggeration. The extensiveness of the use of this form of hypnotism in espionage work is now so widespread that it is long past the time when people should have become alarmed about it... Pain-Drug- Hypnosis is a wicked extension of narcosynthesis, the drug hypnosis used in America only during and since the last war...&quot; That naval officer was none other than L. Ron Hubbard. Before the war an explorer and prolific science fiction writer he went on to found one of America&amp;#039;s fastest growing if controversial religions, Scientology. (In an exchange of letters, Hubbard told me that he had written a book called Excaliber which had been stolen. The information in the book, he said, had all been subsequently published in his many other books. Excaliber, was, he intimated, the guts of what would be published as Dianetics, a work which takes all the mind control insights Hubbard was exposed to both in his travels in the east and in Naval Intelligence, and applies them to empower the human spirit -- the exact opposite of mind control as it came to be. He was subsequently kidnapped, and of course we know that he, and The Church of Scientology were hounded by the government much as others like Willhelm Reich had been hounded, for spreading the truth about technologies which may have the potential to liberate, rather than enslave. Several years after Hubbard&amp;#039;s death, The Church of Scientology was granted, in 1993, official recognition by the Internal Revenue Service. It finally granted them the tax-deductible status which run-of-the-mill religious groups have little trouble obtaining.)..\n6 THE GUINEA PIG ARMY\n\nIn June, 1975, it was revealed publicly for the first time what many had suspected -- that the CIA and a number of government agencies under its direction had actually been giving behavior-influencing drugs to citizens within the United States for more than twenty years. I was in Washington at the time, searching the catalogue card files at the National Technical Information Service. A previous search by friends in military intelligence of the M.I. Classified Index had revealed nothing but peripheral references to the object of my study: government research in drugs, hypnosis, behavior modification, and related subjects. The NTIS file is supposed to contain a complete numerical listing of all government contracts, by contract number, whether or not they are classified. The contract cards were indeed numbered in consecutive order, but the ones I was looking for were missing; the index simply skipped over them and continued on in numerical sequence. Other cards in the index were marked &quot;classified,&quot; and I would not have been able to obtain the papers to which they referred. But the reports I was looking for were not even cited in the index, although references to them in scientific journals indicated that they had once existed. Classified or not, these documents had been removed from the record...\n7 THE MKULTRANS\n\nFollowing the release of the Rockefeller Report, John D. Marks, author and former staff assistant to the State Department Intelligence Director, filed a Freedom of Information Act appeal on behalf of the Center for National Security Studies requesting documentation from the CIA. I filed an identical request at about the same time. Marks and I both requested documentation for the evidence cited in the Rockefeller Report on the CIA&amp;#039;s mind-control activities conducted within the United States. Seven months later, Marks was given more than 2,000 pages of top-secret and &quot;eyes only&quot; documents by the CIA&amp;#039;s Information Review Committee. A short time later I began to receive what Marks had gotten. These pages were said to be the bulk of the information upon which the Rockefeller Commission had based its report. Exempted from release were portions of or entire documents which contained information said by CIA officials to pertain to &quot;intelligence sources and methods which the Director of the Central Intelligence has the responsibility to protect from unauthorized disclosure pursuant to section 102 (d) (3) of the National Security Act of 1947.&quot; But in the photo-copied pages obtained was a statement to the effect that within a few hours of his resignation (forced by the disclosures of the Watergate and Church Committees), Director Richard Helms ordered the records shredded and burned...\n8 THE MATA HARI OF MIND CONTROL\n\nCandy Jones was a sex symbol during World War II. Born Jessica Wilcox, with her catchy stage name and shapely legs she rose to a standing second only to Betty Grable as America&amp;#039;s most popular pinup girl. She was a favorite of the troops at the front, and she felt it a duty to entertain them near the battlefields. After her advertised beauty faded and she could no longer serve to raise the morale of the troops with her appearance, she served her country in another way. She served under MKULTRA as a hypno-programmed CIA courier for twelve years. While on a USO tour in the Pacific in 1945 Candy contracted a case of undulant fever and, shortly thereafter, malaria. On top of that, she caught the contagious fungus known as &quot;jungle Rot.&quot; Within a week, her hair had begun to fall out, and her complexion had turned a sickly yellow. The combination of these diseases sent her to a military hospital in Manila, where she met a young medical officer whom she identifies only by the pseudonym &quot;Gilbert Jensen.&quot; Later, he would offer her the opportunity to become a CIA courier...\n9 THE STORY OF O\n\nDue to the volatile nature of the information contained in her story, I am withholding this victim&amp;#039;s identity. The evidence is still being uncovered. Others are coming forward with corroborating information. While details of her testimony is still being checked, we do know, that what she describes in her story is entirely possible, so, from the perspective of students of mind control this story has great value as it is here presented. Future editions may contain more. We&amp;#039;ll call her O. She was born in 1957. Her first memories are of being suffocated by her father&amp;#039;s penis in what was to be a childhood of continual sexual abuse. After six years of &quot;deprogramming&quot; with Mark Phillips, O has come to reintegrate her fragmented personality and has gained access to most of the shocking memories of her abuse by, among others, high government officials...\n10 MINDWAR\n\nIn 1981, Major Michael A. Aquino collaborated with Colonel Paul E. Vallely to produce a paper entitled From PSYOP to MindWar: The Psychology of Victory. The paper was submitted to Military Review and Parameter, the publication of the U.S. Army War College. It was widely circulated among the psyop community and among mind control researchers without a copyright notice. Finally it appeared in its entirety in Milton WIlliam Cooper&amp;#039;s Behold A Pale Horse, a 1991 work that deals largely with the question of Unidentified Flying Objects. LTC John Alexander&amp;#039;s Military Review article in support of &quot;psychotronics&quot; -- intelligence and operational employmeent of ESP-- was decidedly provocative. Criticism of research in this area, based as it is on &amp;#039;existing frontiers of scientific law, brings to mind the laughter that greeted the Italian scientist Spallanzani in 1794 when he suggested that bats navigate in the dark by means of what we now call sonar. &quot;If they see with their ears, then do they hear with their eyes?&quot; went the joke, but I suspect that the U.S. Navy is glad someone took the idea seriously enough to pursue it...\n11 PROJECT MONARCH?\n\nProject Monarch, according to Mark Phillips, is a U.S. Defense Department project begun in the 1960&amp;#039;s. He says its code name was assigned to a subsection of the CIA&amp;#039;s Operation Artichoke which later became Project MKULTRA... So-called &quot;Presidential Models&quot;, the most highly prized products of the Project Monarch mind control factories have a distinct (conditioned) habit of sitting very erect with their legs daintily perched. They serve kings and presidents and high ranking government officials as sex slaves. They are controlled by invisible reins. The Presidential Models have &quot;fluttered about the White House&quot; and European hideaways which, in another day, would have been the &quot;courts.&quot; While they appear to be &quot;lighthearted&quot; and &quot;inconstant&quot; sex slaves, they are trained at the art of pillow talk and do, in fact, have memories like human tape-recorders...\n12 THANKS FOR THE MEMORIES\n\nI met Lois first in Palm Springs, when I was the editor of Palm Springs Life. She was sitting, looking pretty, at one of the many events that bear Bob Hope&amp;#039;s name, the Bob Hope Classic golf tournament or the Hope Center which houses the Palm Desert opera. Her real name was not Lois and I was not introduced to her, but when I saw her again, several years later, she had come along with a Project Monarch survivor just to watch the interview I was doing with their deprogrammer. I knew I&amp;#039;d seen her before, but at first, couldn&amp;#039;t remember where or when...\n13 MONARCH CORROBORATION\n\nA number of friends and fellow researchers can&amp;#039;t bring themselves to believe the story of &quot;O&quot; nor Lois. Neither in the beginning could I. Both dropped too many famous names. Both had witnessed too many important events in history. Both told hideous stories of abuse. How could our high government officials fall to such low perversions? Would they violate the human spirit just for lust? Greed? After a little thought, once one has processed the horror, one realizes that in each case, celebrities and high government official&amp;#039;s vices were fed by the cryptocracy using one of Project Monarch&amp;#039;s programmed &quot;presidential models.&quot; In this case Ms. O&amp;#039;s remarkable gifts, which were the invisible reins of control the cryptocracy held over Senators, Presidents, and Kings. In fact, it looked as if our executive branch of government is now controlled by new innovations in the usual Machiavellian options: bribery, blackmail, threat of death, and/or ultimately assassination. Then, again come the doubts. Here we are taking the word of a &quot;reintegrated&quot; person who&amp;#039;s suffered a lifetime of Multiple Personality Disorder (MPD) which is a relatively new idea in itself. One doesn&amp;#039;t want to believe this...\n14 HIMMLER&amp;#039;S GUINEA KIDS\n\nHeinrich Himmler&amp;#039;s Lebensborn program may have been the grandparent of Project Monarch. Monarch sought to create junior Manchurian Candidates with multiple personalities, each trained to perform a specific specialty. The kids were programmed to respond to codes, mnemonic cues, and audio-reversed triggers and tones. They were trained in killing techniques and the rapid assembly and de-assembly of exotic weapons. They were educated about poisons, explosives, languages and computers, then programmed to forget it all or remember only selected areas upon command. Monarch produced a cadre of child spies who were directed to prey upon high placed military, government and high society paedophiles, sometimes hauling them into blackmail situations. As in the Nazi Lebensborn program there is evidence of selected breeding, adoption of the children, and a peculiarly large number of twins among them. There is mounting evidence that the directors of Project Monarch were former Nazis, and that, like Nazism, the Monarch program was interlaced with Satanism...\n15 FINDERS, KIDNAPPERS, NAZIS\n\nAccording to a Customs Service memorandum, the CIA and FCIA (Foreign Counter Intelligence Agency a distinct and autonomous organization within the FBI ) were both involved in a mysterious group with behaviors similar to the one in Nebraska. Known as the Finders, CIA ownership of this organization was kept secret for seven years after local law enforcement uncovered its practice of child abduction, kiddie-porn, ritual abuse, and slavery. In early February 1987, an anonymous tip to the Tallahassee, Florida police brought cops out like bloodhounds. The caller said two &quot;well dressed men&quot; seemed to be &quot;supervising&quot; six disheveled and hungry children in a local park. The two men were identified as members of the Finders. They were charged with child abuse in Florida. In Washington, D.C., police and U.S. Customs Service agents raided a duplex apartment building and a warehouse connected to the group. Among the evidence seized were detailed instructions on obtaining children for unknown purposes. Several photos of nude children were found, one of which appeared &quot;to accent the child&amp;#039;s genitals...&quot;\n16 TUNED IN TO A MENTAL RADIO?\n\nHad I not heard this story, in essence, from a half dozen other survivors of this kind of mind control, I would not have included it here. But we video taped a number of credible people talking about these &quot;voices&quot; in their heads. People who experience this are what Martin Cannon referred to in his book The Controllers as &quot;wavies.&quot; Cannon wrote: Every Senator and Congressional representative has a &quot;wavie&quot; file. So do many state representatives. Wavies have even pled their case to private institutions such as The Christic Institute. And who are the wavies? They claim to be the victims of clandestine bombardment with non-ionizing radiation -- or microwaves. They report sudden changes in psychological states, alteration of sleep patterns, intracerebral voices and other sounds, and physiological effects.\n\nMost people never realize how many wavies there are in this country. I&amp;#039;ve spoken to a number of wavies myself. I don&amp;#039;t like the term &quot;Wavie.&quot; It&amp;#039;s a hard-hearted term which does not show any sympathy for the people who are suffering this way. They&amp;#039;re suffering just as much as the people who have survived the so-called Project Monarch. Giving them the benefit of the doubt, I&amp;#039;ll term them E-M Targets, E-M for electromagnetic spectrum, since the technical possibilities exist that they are experiencing bombardment by ELF, VLF, SHF microwaves, magnetic waves and other radiation ofthe electromagnetic spectrum which can be modulated so that voices can be heard inside the head, without implants, without speakers. Most of them have been diagnosed as being &quot;Paranoid Schizophrenic...&quot;\n17 THE SLAVES WHO BURIED THE PHARAOH\n\nThe CIA uses thought reform, programming, and indoctrination on its own employees. Patrick J. McGarvey, a veteran of fourteen years in U.S. intelligence service, described the cryptocracy&amp;#039;s more ordinary indoctrination procedures in his book CIA: The Myth and the Madness. McGarvey said that his indoctrination was carried out in a classroom which was &quot;right out of The Manchurian Candidate. It was a cavernous room not unlike a nineteenth century surgical exhibition pit.&quot; That training, he said, consisted of &quot;an admixture of common sense, insanity, old-time religion, and some of the weirdest lectures you can imagine.&quot; The most important result of this early training, as far as the CIA was concerned, McGarvey said, &quot;was the attitudes they managed to inculcate&quot; among the recruits...\n18 BRAVE NEW WORLD IN A SKINNER BOX\n\nThe cryptocracy&amp;#039;s search for reliable mind control methods was one of the most far-reaching secret projects ever undertaken. In addition to research and development in drugs and hypnosis, CIA funds and cryptocracy guidance gave impetus to a number of behavior modification projects carried out in federal prisons and mental institutions. Most of the projects were arranged secretly so recipients of the funds would have no way of knowing that the CIA was backing the research. Even if they had known of the CIA&amp;#039;s involvement, their interest in behavior modification probably would not have been dampened. Previously called conditioned reflex therapy, behavior modification, in the sixties and seventies, was becoming the most popular tool of psycho science since Sigmund Freud asked his first patient to lie down on the couch. Behavior modification is based on conditioning, but conditioning is a big word for a simple form of learning in which a reaction is evoked by an outside action. The reaction is called a response; the outside action is called a stimulus. In 1927 Pavlov won the Nobel Prize for his discovery of a method of making dogs salivate at the ringing of a bell. Salivating dogs were not much good to anyone, and it was not for making dogs drool that Pavlov was so honored. He was honored with the world&amp;#039;s most prestigious award for making dogs drool on cue. He called his process &quot;conditioning&quot;. The dogs&amp;#039; involuntary response, he called a &quot;reflex.&quot; Pavlov&amp;#039;s discoveries provided the breakthrough which behavioral science needed to begin to control the human mind...\n19 A SCHOOL FOR ASSASSINS\n\nThe cryptocracy recruited their assassins from among people who had already demonstrated a violent nature, people who had few reservations about taking human life. No homicidal maniacs were recruited because they could not be controlled. The cryptocracy needed killers who would not murder on impulse, but only upon command. Once selected, the assassin candidates were turned over to the military, where, under the guise of &quot;combat readiness&quot; training,they underwent a complete program of conditioning. Graduates of the program would forever after act with ruthless efficiency. They would eliminate local political leaders in a foreign country, or undertake &quot;search and destroy&quot; missions in violation of national and international laws. They would be given a cover allowing them to enter the Foreign Service; or they would pose as embassy marine guards. In July, 1975, the Sunday Times in London quoted a U.S. Navy psychologist who admitted that U.S. Naval Intelligence had taken convicted murderers from military prisons, conditioned them as political assassins, and then placed them in American embassies around the world. This admission came shortly after the Senate Intelligence Committee had scolded the CIA for plotting a number of political assassinations around the world. From the congressional reports, however, one got the feeling the cryptocracy was being chastised not for the assassinations it had successfully accomplished, but for those which it had attempted,but failed. The attempts on the life of Fidel Castro drew the greatest notice from the congressional committees and thepress...\n20 THE FOUR FACES OF A ZOMBIE\n\nOn March 2, 1967, Luis Angel Castillo, age twenty-four, was arrested by the Philippine National Bureau of Investigation (NBI) on suspicion of conspiring to assassinate President Ferdinand Marcos in Manilla. In a series of interrogation sessions, the NBI and Philippine Army investigators gave him truth serum (at his request) and put him under hypnosis. During one of these sessions, Castillo revealed he had been involved in an assassination four years earlier. Castillo told the NBI, both under hypnosis and truth serum and also in a normal state, that he had been hypnoprogrammed to kill a man riding in an open car. Although Castillo did not know the identity of his target, the scene of his supposed &quot;hit&quot; was Dallas, Texas. The date was November 22, 1963...\n21 THE LONE NUTS\n\nMKULTRA was fully operational when Luis Castillo was programmed. It was active that same decade when events blamed on three &quot;lone assassins&quot; changed the course of history. In a well executed, mass indoctrination campaign employing all the honor, prestige, and power of the U.S. government, Americans were told over and over again the lives of John Kennedy, Martin Luther King, and Robert Kennedy were all taken by lone assassins -- men operating without political motivvation. These three assassins -- Lee Harvey Oswald, James Earl Ray, and Sirhan Sirhan-- conveniently left diaries, underlinings in various books, and other self-incriminating clues to establish their guilt. The evidence gathered on the assassinations remains fragmented and incomplete. Any event of such magnitude as political assassination is bound to invite a large number of interpretations. While in 1978 when the first edition of this book appeared there was not any conclusive proof of a conspiracy, more than eighty percent of the American public then believed there was a conspiracy. Today, after Oliver Stone&amp;#039;s masterful film JFK, more than ninety percent of the public believe that John F. Kennedy was murdered by conspirators working with the U.S. intelligence agencies. While Congress did cite Richard Helms for contempt, and declared that the FBI and the CIA did not cooperate with the Warren Commission, the murders of Kennedy, Kennedy and King remain unsolved mysteries in the public&amp;#039;s opinion. A string of circumstantial evidence, and a knowledge of the fundamentals of mind control invites further speculation.In each case the method was the same -- death by the bullet. In each case the circumstances were the same -- murder in a public place in view of many witnesses. All three assassins were men whose personal histories can be interpreted to indicate they were mentally unstable. Evidence suggests all three had been hypnotized at one time or another...\n22 THE IGNORED CONFESSIONS\n\nOnly an understanding of the techniques and applications of mind control could begin to bring meaning to the fragmented ramblings of Jack Ruby. On June 7, 1964, Jack Ruby was questioned in jail in Dallas, Texas, by Earl Warren and Gerald Ford. In that session Ruby continually pleaded for a lie-detector test or for sodium pentothal. He desperately wanted to prove his honesty so Warren and the commission would know he was telling the truth. Said Ruby: &quot;I would like to be able to get a lie-detector test or truth serum of what motivated me to do what I did at thatparticular time, and it seems as you get further into something, even though you know what you did, it operates against you somehow, brainwashes you, that you are weak in what you want to tell the truth about, and what you want to say which is the truth...&quot;\n23 ANOTHER HYPNO-PATSY?\n\nOn April 4, 1968, Nobel laureate Dr. Martin Luther King was murdered on a second floor balcony of the Lorraine Motel in Memphis Tennessee. Half of the six thousand man FBI force was assigned to the task of bringing the killer to justice. The FBI should have had an easy job. There was an abundance of evidence left behind on the second floor of a rooming house a block from the Lorraine Motel. There were fingerprints on the window ledge of a bathroom next to a room which had been rented to an &quot;Eric S. Galt.&quot; On the sidewalk in front of the house was a weapon, a high powered assault rifle with telescopic sight. Neighbors said they had seen a white Mustang roar away moments after the shooting...\n24 CONFESSION BY AUTOMATIC WRITING\n\nThe circumstances of Robert Kennedy&amp;#039;s death are well known. On June 5, 1968, at 12:15 a.m., Sen. Robert Kennedy was shot in the pantry of the Ambassador Hotel in Los Angeles. Karl Uecker grabbed the gun, a .22 caliber Iver-Johnson revolver. It was smoking in the hand of Sirhan Beshara Sirhan, a Palestinian refugee. The Los Angeles police immediately took Sirhan into custody. At first they appeared to be taking every precaution so they wouldn&amp;#039;t make the same mistakes the Dallas police had made. They taped every interrogation session with the suspect and kepthim under surveillance through a closed-circuit TV camera in his cell. They took every measure to protect the life of this man, the second &quot;lone nut&quot; to gun down a Kennedy. Trying to avoid anything which would be an infringement on the rights of the alleged assassin, the police carefully informed Sirhan of his legal rights before trying to interrogate him. They did not inform his alter personalities of their rights, however. Through the first hours of questioning, Sirhan chose to remain silent. For some time, no one knew who the curly-haired, swarthy man in custody was... ...Police immediately went to his house and searched his bedroom. On the floor next to Sirhan&amp;#039;s bed was a large spiral notebook. On the desk was another notebook. There was a third small notebook, a good deal of occult literature, a brochure advertising a book on mental projection, and a large brown envelope from the Internal Revenue Service on which someone had written, &quot;RFK must be disposed of like his brother was.&quot; At the bottom of the envelope was scrawled &quot;Reactionary.&quot; In one of the notebooks there was a page which was used later in the trial to prove premeditation: &quot;May 18, 9:45 a.m. -- 68. My determination to eliminate RFK is becoming more the more of an unshakable obsession... RFK must die -- RFK must be killed Robert F. Kennedy must be assassinated... Robert F. Kennedy must be assassinated before 5 June 68 Robert F. Kennedy must be assassinated I have never heard please pay to the order of of of of of of of of of this or that pleas pay to the order of...&quot; Also drawn on the page were spirals, diamonds, and doodles. While Los Angeles mayor Sam Yorty ignorantly told the press Sirhan was a &quot;member of numerous Communist organizations, including the Rosicrucians,&quot; Sirhan&amp;#039;s neighbors told a differentstory. One said he was &quot;very religious.&quot; Another reported that he was &quot;just a normal kid.&quot; He took cars and bikes apart and put them back together again.&quot; Neighborhood kids said he was &quot;nice.&quot; When asked if Sirhan was the angry type, a black girl in his Neighborhood said, &quot;He didn&amp;#039;t show it.&quot; Arthur Bean, another neighbor said, &quot;Someone talked that kid into gunning down Kennedy.&quot; When Irwin Garfinkel, a deputy attorney in the public defender&amp;#039;s office, asked Sirhan about the shooting, he said, &quot;I don&amp;#039;t remember much about the shooting, Sir. Did I do it? Well, yes, I am told I did it. I remember being at the Ambassador. I was drinking tom collinses. I got dizzy. I went back to my car so I could go home. But I was too drunk to drive. I thought I&amp;#039;d better find some coffee. The next thing I remember I was being choked and a guy was twisting my knee.&quot; George Plimpton, editor of the Paris Review, was in the hotel pantry when Kennedy was shot. He was one of the men who wrestled Sirhan down. According to Newsweek, Plimpton &quot;offered some eloquent testimony that appeared to some to support the defense&amp;#039;s contention that Sirhan Beshara Sirhan had, in fact, been in a &amp;#039;trance&amp;#039; during the shooting. &amp;#039;He was enormously composed,&amp;#039; recalled Plimpton. &amp;#039;Right in the midst of this hurricane of sound and feeling, he seemed to be almost the eye of the hurricane. He seemed purged...&amp;#039;&quot;\n25 THE PATRIOTIC ASSASSIN\n\nAll the assassins in the cryptocracy&amp;#039;s army of hit men are not, by any means, programmed. There are other ways besides mind control to motivate the commission of murder. In 1298 Marco Polo returned from his Asiatic travels with a tale of assassins who were motivated by an unusually clever technique. Polo described a fortress he had visited in the valley of Alamut in Persia. He said the valley was the headquarters of a notorious group known as the Ashishin, from which the word &quot;assassin&quot; evolved. Polo&amp;#039;s story echoed numerous legends about an &quot;Old Man of the Mountain,&quot; named Allahudin, who used subtle and elaborate psychological tricks to motivate simple country boys to undertake fearless acts of murder. The Old Man had created an inescapable valley between two mountains by building up high walls at both ends. He turned the valley into a beautiful garden, the largest and most beautiful that had ever been seen. In this valley he planted every kind of fruit tree and built several elaborate, ornamented pavilions and palaces which were said to be of such elegance they could not be described in words. Everything that could be, was covered with gold. The buildings housed the most exquisite collection of paintings and sculpture in the known world. Man-made streams flowed wine, milk, honey, and water...\n26 SLEEPER AGENT\n\nJoe called me one day from Australia. I was still working on Grub Street as editor of Palm Springs Life. He told me what most of the victims of mind control have told me: &quot;I read your book.You saved my sanity. I know now that I&amp;#039;m not crazy. Thanks so much for writing it.&quot; That was reward enough for doing it, I suppose, but I didn&amp;#039;t want to do it again. I wanted nothing more to do with mind control. I was burned out on the subject, so Joe got a polite but disinterested reception from me. He kept up a correspondence with me anyway from the outback. At first his letters were fragmented, disjointed, mine were polite, encouraging, brief. I couldn&amp;#039;t tell where he was coming from, but, what do you expect from a victim whose mind has been scrambled? He began by talking about some missing British Scientists:...\n27 DEEP PROBE\n\nJose Delgado stood sweating in the center of a bull ring in Madrid. He was sweating from the heat of the sun reflected on the sand. He felt a twinge of natural fear as the door at one end of the walled ring swung open, and a huge black bull lunged forth from the darkness into the plaza de toros. This was a very good bull, one the best matador would have desired. It charged as if on rails, straight at Delgado. In front of a ton of black beef, two sharp horns aimed to gore the vital parts of his body. Delgado stood face to face with the charging Andalusian toro. But Delgado was no matador. He stood in the ring alone in his shirtsleeves. He wore no &quot;suit of lights&quot; and he carried no cape. Instead of a sword, he held only a little black box. He wanted to wait until the last possible moment, but he could not contain his fear. When the bull was thirty feet away, he pressed the button on the box. The bull immediately quit his attack and skidded to a halt. Toro looked right, then left. Then, as if bewildered, he turned his broad side toward Delgado and trotted away...\n28 FROM BIONIC WOMAN TO STIMULATED CAT\n\nIn 1967 a writer named Lincoln Lawrence published a book which asked the question: Was Lee Harvey Oswald a robot-assassin programmed by a sophisticated technique known as RHIC-EDOM? The letters stood for Radio Hypnotic Intra-Cerebral Control-Electronic Dissolution of Memory. Lawrence speculated that Oswald had been behavior-controlled and prepared during his &quot;defection&quot; to the Soviet Union as a &quot;sleeper&quot; agent programmed to return to the United States and murder on cue. It was the Manchurian Candidate theme, with one exception. Lawrence insisted that the Russians had not masterminded the RHIC-EDOM plan. It had been masterminded, he thought, by an international cartel of commodities merchants who sought to make millions by driving the market with the assassination of a president -- any president. Lawrence wrote, &quot;Lee Harvey Oswald was to be utilized as... (and now you must clear your brain and put aside your preconceived notions of what espionage and sabotage are today)... an RHIC controlled person... somewhat like a mechanical toy. An RHIC controlled person can be processed (as Oswald was in Minsk, allowed to travel to any country... and be put to use even years later by the application of RHIC controls. In short, like the toy, he can in a sense be &amp;#039;wound up&amp;#039; and made to perform acts without any possibility of the controller being detected...\n29 INVISIBLE WARFARE\n\nSince this book first appeared in 1978 there has been a rapid acceleration in public awareness about mind control. It has largely replaced the term &quot;brainwashing&quot; in the press, appearing with some regularity on the front pages of your local daily newspaper. If you are laboring under the impression that the Church Committee hearings stopped Operation Mind Control, in these pages you have learned of evidence to the contrary. Instead of halting mind control, a whole new kind of warfare hasdeveloped around it. The new technology makes the old &quot;Project Monarch&quot; style classical conditioning obsolete. It is the reason so many survivors are remembering and are allowed to talk. They are no longer needed, and there&amp;#039;s a better way to control minds. Public awareness has been outrun by the progress in mind control technology. It has gone from drugs and hypnosis to the effects of microwaves, ELF waves, gravity waves, and modulated signals of all kinds. The basics are the same in all techniques -- the government programmers sneak intoo the subconscious mind of individuals and the masses and influence them without their knowledge or consent...\n30 MAY THE FORCE BE WITH US!\n\nThe first evidence of the use of hypnosis as a reliable operational tool of the cryptocracy, according to John Marks,11 can be found in the work of Morse Allen in 1954. Of course hypnosis itself had been used by shamans and fakirs to manipulate and control people for centuries. Marks explains that Allen&amp;#039;s work came at the height of the Project ARTICHOKE explorations in which the spooks attempted to use hypnosis to &quot;programme&quot; an assassin. CIA documents also reveal that in 1959 John Gittinger recommended the use of hypnosis in operational experiments. ( Of course our latest evidence shows that Navy Intelligence had been using mind control in the 1940&amp;#039;s, at least.) The CIA files contain a translation of a Soviet research project entitled Unperceived Manifestations of Mental Processes in Deep Hypnosis which described the success of their psychoscientists: &quot;We succeeded in programming not only the subject of dreams ( Iwould like to visit Africa in my dream...), but to program color perception (let my dream be blue...), as well as inducing a specific mood after sleepin...&quot;\n31 THE WARRIOR&amp;#039;S TONGUE\n\nJohn Alexander is a busy man these days, not only is he one of the moving forces behind PSITECH, a company that sells military developed remote viewing skills (RVS) to private enterprise, he is the program manager for nonlethal defense at the Los Alamos (N.M.) National Laboratory, an author (The Warrior&amp;#039;s Edge), and a practitioner of the gem of mind control arts -- Neuro-linguistics Programming. Today, after 32 years of military service this retired Colonel has the responsibility of drawing together and nurturing many nonlethal weapons devices which could disable key electronic equipment, blind weapons sensors or shut off the power to a capital city. He has drawn upon a variety of disciplines involving polymer chemistry, microbics, kinetics, acoustics, electrical engineering, materials science and information science, just to demonstrate their feasibility,&quot; in the burgeoning science called Nonlethal defense, at least so said Aviation Week &amp; Space Technology. &quot;As the concept has evolved,&quot; Alexander is reported as saying, &quot; we have come to focus our efforts on antimaterial systems. If you can stop the machines of war, you can inhibit the prosecution of conflict.&quot;...\n32 CULT CONTROL\n\nIn 1990 spychiatrist Dr. Louis Jolyon West, M.D., Professor of Psychiatry, University of California, pet shrink of the cryptocracy gave a speech on cults. As usual it was soft on fact and hard on the cryptocracy line: It is estimated that there are more than 2500 cults in the UnitedStates... Now there must be a lot more &quot;cults&quot; than that since, the Oxford English Dictionary said the word cult meant: &quot;1. worship -- 2. a particular form of religious worship; esp. in reference to itsexternal rites and ceremonies -- 3. devotion to a particular person or thing...&quot; Some would say that includes the Moose, Elks, Shriners, Optimists, Boy Scouts, certain football teams, religions of all denominations, hang gliding clubs, sky diving clubs, James Joyce reading groups and on and on. But without further argument, West&amp;#039;s comments on &quot;CULTS -- PSYCHIATRIC ASPECTS:&quot; ...\n33 THE FIRE IN WACO\n\nPerhaps not since the Reichstag fire in Nazi Germany have flames leaped so visibly onto the pages of history. The flames in both Waco and the Reichstag fires were fueled by mind control. At least that&amp;#039;s the impression you get when you read attorney Paul D. Wilcher&amp;#039;s letter to Attorney General Janet Reno... Dated May 21st, 1993 the letter begins with no salutation, the phone numbers of Ms. Reno, Justice Department Communications Director Carl Stern, Appointments Secretary Melilssa Muller, Assistant Attorney General Richard Scruggs, and James Kramarsic, Special Ops--CIA. With a typical lawyerly lack of style the letter begins: RE: (1) Vital NEW information concerning the conflagration at David Koresh&amp;#039;s Branch Davidian compound, &quot;Ranch Apocalypse,&quot; outside Waco, Texas, on Monday, April 19th, 1993, which is now being kept from you and covered up _ i.e., that what happened was NOT a &quot;mass suicide,&quot; but rather a MASS MURDER... the letter then reads:&quot; DEAR ATTORNEY GENERAL RENO&quot; in caps. The purpose of this letter... is for me to deliver to you extremely sensitive information about the deaths of the 86 men, women, and children who perished at the Branch Davidian compound on Monday, April 19th, 1993, and the truth about how it all happened... But even more important, my purpose here is to demonstrate how the Waco tragedy fits into a much bigger (and far uglier) The subject of mind control is introduced on page four when Wilcher writes: &quot;David Koresh had an extensive CIA background...he was known in CIA circles as a &quot;sleeper&quot; _ someone who had beensubjected to extensive CIA &quot;mind control&quot; training and programming...&quot; Wilcher said that it was not a coincidence that all these events were occurring in or near Waco, Texas _&quot;since Waco is a major center for such CIA &quot;mind control&quot; experimentation and programming _ with much of this activity occurring at the CIA&amp;#039;s Leadership Management Institute in Waco.&quot; Wilcher pointed out that &quot;similar CIA-sponsored &quot;cults&quot; are located across the country including in such places as Salt Lake City, Utah; Provo, Utah; Logan, Utah; Boise, Idaho; and San Francisco, California,&quot; and that one or all of these other &quot;cults can likewise `explode&amp;#039; onto the front pages of the press at any time the CIA deems appropriate, in order to accomplish its pre-determined, hidden, right-wing political agenda.&quot;...\n\n16) Mind Control and Memory Blocks to Ease the Consciences of the CIA&amp;#039;s PROFESSIONAL killers: Thus far, we have been discussing mind control and memory blocks in the context of the CIA&amp;#039;s `Manchurian- Candidate-type&amp;#039; robot assassins _ those low-level individuals _ like Sirhan Sirhan, David Hinckley, Mark David Chapman (who assassinated the Beatles&amp;#039; lead singer/songwriter John Lennon), and the six (6) Black men murdered in Pershing Park _ persons who are programmed by the Agency to be used only once then `thrown away&amp;#039; and discarded _ i.e., persons who are destined either to be killed or imprisoned for the rest of their lives, once they have performed their pre-ordained secret mission. In other words, these low-level individuals are highly expendable _ particularly when getting rid of them will preserve the `plausible deniability&amp;#039; that the Agency had anything to do with their training, conduct, or activities. In the context of these low-level individuals, the mind control programming we have been discussing is used not only to condition the desired robotic response to a pre-ordained secret signal, but also to prevent the subject from remembering anything to do with their training, conduct, or activities. In the context of these low-level individuals, the mind control programming we have been discussing is used not only to condition the desired robotic response to a pre-ordained secret signal, but also to prevent the subject from remembering anything...\n34 HAVE BUCK ROGERS&amp;#039; RAY GUN - WILL TRAVEL\n\nNot far from the melted sand and globs of green Trinitite at the Trinity site -- beneath the tower that exploded the first atomic bomb, just across the desert sands from the Los Alamos National Laboratories where Invisible Weaponry is being developed at an alarming rate, is a private company, Consumertronics, which specializes in all things electronic. Headed by a &quot;weapons engineer&quot;, John J. Williams, the company offers for sale all sorts of VLF, SHF, VHF, ELF devices and designs for devices to produce a variety of waves. It sells both offensive generators and defensive countermeasures &quot;for research purposes only.&quot; It is the only company in the world which advertises this kind of expertise. His ads might as well say: &quot;Have Buck Rogers Ray Gun, Will Travel,&quot; because Williams will travel to your home with a van full of scanners, meters, measurers and monitors and tell you what your electromagnetic environment looks like 24 hours a day. All it takes is money...\n35 HUMAN EM TARGETS\n\nHarlan E. Girard, one of the most level-headed researchers into the lore of mind control has, himself, been an E.M. target for years. He doesn&amp;#039;t like to talk about his personal experiences because he&amp;#039;d rather let others tell their stories, but he admits he still has &quot;handlers&quot; and hears disembodied voices. Like so may of the other so-called &quot;Wavies&quot; Girard is no wild-eyed maniac. He is distinguished, affluent and quietly articulate. The brief abstract printed below sets the overview for this chapter and offers a look at the high quality of the human beings reporting this E.M. Target phenomenon. I&amp;#039;ll introduce Girard to you, the way I met him, through his paper: OFFENSIVE MICROWAVE WEAPONS: Developments in the Technology of Political Control: The Central Intelligence Agency (CIA) has developed a technology which can make the blind see, the deaf hear, and the lame walk. It will never be used this way because the technology is central to the domestic policy and foreign ambitions of the United States Government, whether that government is nominally headed by George Herbert Walker Bush, William Jefferson Clinton, or any possible successor. The effects of these microwave weapons are many and varied, but the most insidious couple with the central nervous system to produce effects which might be described as Satanic possession. remote motor control of human locomotion and movement (including speech) has become possible. Remote motor control can be used to murder by suicide, &quot;accident&quot;, suffocation, asphyxiation and heart attack, or to simply neutralize the victim by making words come out of his/her mouth which he/she had no intention of speaking... Consequently, a situation is created in which the victim appears to be free to uninformed third parties, but at the same time is incarcerated as securely as if he/she had been confined to a maximum security prison. In this manner, human beings can be and are being sadistically tortured in the privacy of their own homes. The bizarre objective of this treatment is to mentally and physically torture the victim until his/her own personality collapses, and he/she becomes something lower than a slave. In science fiction, this computer driven human being is called a cyborg...\n36 A SATANIC-UFO REICH?\n\nOperation Mind Control has brought the mental health profession to the verge of a nervous breakdown. Attacked by cryptocratic peers in such organizations as the Cult Awareness Network and False Memory Syndrome Foundation on the one hand, and grappling with the techniques of psychiatry and psychology which the cryptocracy has leapfrogged with new technology on the other, the profession can only make the mentally tortured comfortable while it looks desperately for a way to heal them. The healing techniques are in the hands of a few. Some of them are &quot;deprogrammer&quot;s who once worked for the cryptocracy, learned the codes, cues, and triggers, and know practically how the classical conditioning technology of the cryptocracy comes to work like hypnosis. The mental health professionals, as we know them, are learning to completely rethink their approaches to healing the victims of the crytpocracy&amp;#039;s mind control projects. While insights into what is state-of-the-art mind control today begins with a study of physics, it is still built upon well-tested patterns of brain functions. But, the traditional &quot;let&amp;#039;s get in touch with our feelings&quot; kinds of therapy are not especially helpful...\n37 THE COM-12 BRIEFING\n\nAlmost simultaneous with the founding of the modern cryptocracy and the passing of the National Security Act in 1947, if the rumors are to be believed, there came to be a faction working within the secret agencies of government to restore the Constitution. It is claimed that this group has been fighting a resistance from within the cryptocracy against the Nazi group known as the Aquarius Group (AG) which came to cluster around the Gehlen/Nazis taken to the breast of the American intelligence community at the end of World War II. While our sources beg for anonymity, they tell us they have been known as the Guardians of the Eternal Flame or The Rowboat Magicians. To my knowledge, only twice has this group communicated with the general public, then not &quot;officially&quot; but through documents &quot;leaked&quot; or &quot;planted&quot; in the samisdat. Then they called themselves Com-12...\n38 PROJECT GREENSTAR?\n\nAs early as 1961, advisors to the late President Kennedy recommended that with the threat of nuclear war hanging over the future, civilized nations could no longer risk overt confrontations that would lead to war, since even conventional war could escalate to Armageddon. If war was necessary it would have to be invisible. It was either invisible warfare or peace, and everyone seemed to agree the economy would &quot;suffer&quot; from peace. Without war, it was believed, the economy would falter and depression would be the dividend of peace. Thus the advisors to the president began to think about what might motivate the U.S. economy as well as war did. They came up with several possibilities, the most fantastic of which was to fake an invasion from outer space...\n39 FALSE MEMORY SPINDROME\n\nMemory is illusive in some cases, vivid in others. A Roper poll conducted in 1993 suggested that up to 20 million people in North America may have memories of &quot;alien&quot; abductions. In 1994 Dr. Colin Ross said that he heard someone on a CBC radio broadcast say that they had evidence that 750,000 babies had been ritually sacrificed. FBI ritual abuse &quot;debunker&quot; Kenneth Lanning in 1992 said that there were 50,000 missing children in the U.S., which law enforcement reports said people believed were &quot; being murdered in human sacrifices...&quot; Incest and child sexual abuse reached epidemic proportions. The generally accepted statistics in 1993 were as follows: * One out of three girls and one of five boys would be sexually molested before the age of eighteen. * A child was sexually abused every 2 minutes with over 95% of the abusers being someone the child knows and trusts. * For every case reported, there were twenty-five cases that went unreported. * Only 5% of all sexual abuse cases ever went to court. In 50% of those cases the child was returned to the abuser. * Approximately 97% of child prostitutes were incest victims. * Child sexual abuse was a major cause of teenage suicide. * One in ten homes were involved in child sexual abuse. * A high percentage of abused children develop dissociative identity disorders. Then, just as the legions of abused children (now grown to adulthood) were beginning to remember satanic abuse, (the ranks of diagnosed cases of Multiple Personality Disorder had reached 25,000 in the U.S.) and Harvard University&amp;#039;s Dr. John Mack was enjoying celebrity as the author of a book on alien abductions, and about twenty percent of those diagnosed as suffering from Multiple Personality Disorder (MPD) were being discovered to have military or intelligence backgrounds, a &quot;robust and adroit&quot; public relations effort was mounted against those who were beginning to remember all sorts of details which related to their abuse as children. Groups were quickly formed to debunk such &quot;nonsense.&quot; One was spearheaded by a woman who was herself named by her daughter as a child abuser. Her name was Pamela Freyd and her organization was the False Memory Syndrome Foundation (FMSF) which sprang suddenly up from nowhere...\n40 DANGEROUS FREE THINKING\n\nIn an undisclosed location, at a secret conference, an emergency panel of five psychiatrists and clinical psychologists met to discuss the alarming data they were gathering about mind control, satanic ritual abuse, and alien programming from patients diagnosed as suffering from Multiple Personality Disorder (MPD) also called Dissociative Identity Disorder (DID). Due to what is, by the standards of a conservative profession, the controversial content of this conference, and due to the fact that many of the doctors have already received the strongest criticism from their peers and threats on their lives, their identities must remain undisclosed -- you&amp;#039;ll understand why as you read more. Although delivered in a conversational tone without footnotes and scientific documentation, there is a lot of technical information in this round-table conference which should be of great use to therapists. For the lay reader a study of the works of Milton Erickson or at least NLP would be helpful in explaining what the doctors are talking about. The term &quot;bloodline&quot; refers to the practice of satanic ritual abuse which carries on generation after generation under the belief that after several generations of &quot;conditioning&quot; a &quot;genetic memory&quot; or a &quot;blood memory&quot; carries on the information which has been programmed. This belief in &quot;blood memory&quot; can be found in a variety of secret societies and not just in satanic cults. A person who is of the &quot;bloodline&quot; is the offspring of parents who are in the cult, and often the great, great, great, great grandchildren of cult members. Some survivors have reported that the sophisticated form of programming described in this conversation goes back more than 100 years and has been co-opted by the intelligence agencies only within the past fifty-odd years. Suffice it to know that the assembled doctors, men and women, are among the most qualified in their profession. They are recipients of the top honors, awards and degrees, members of all the most prestigious societies, editors of the most influential journals. Researchers who are aware of the literature may think they are able to identify some of the doctors by the content of their speeches, but it&amp;#039;s important that they just ignore any failing on my part as an editor, overlooking any speech patterns which may reveal their identities. For the sake of their safety, and at their request, I have done my best to re-write this transcript -- not for content, but for style -- so that these doctors can never be identified. After some preliminary remarks the host of the conference, Dr. A, began:\n\n    Dr A: I have been looking forward to this exchange for quite some time and I hope we can cut right to the chase and talk specifically about ritual abuse and about mind-control programming and brainwashing -- how it&amp;#039;s done, how to get on the inside of it.\n    Dr. B: Until only recently I didn&amp;#039;t believe it. I wasn&amp;#039;t willing to discuss it with colleagues such as you before, and\n    I&amp;#039;m still not willing to speak about it publicly.\n    Dr. C: I have done that in small groups and in consultations, but recently I decided that it&amp;#039;s time that somebody started\n    doing something about it.\n    Dr. D: So we&amp;#039;re going to talk about specifics today?\n    Dr. E: At the international congress I heard about these details for the first time. I thought, &quot;how weird.&quot; &quot;Interesting but weird.&quot;\n\n41 A REPEALING THOUGHT\n\nI watched C-SPAN once again to celebrate the birth of our country. It was the first time I&amp;#039;d watched C-SPAN since the Clinton campaign. I watched just for a couple of synchronistic hours. They were showing programs they&amp;#039;d taped on June 28 and 29. First there was a program called &quot;Project for the Republican Future&quot;. On that program the famous &quot;political consultant and pollster, Dr. Frank Luntz told us that his polls showed that the people in the U.S. today believe the quality of life has gone down since the previous generation and, the majority believe that the next generation will have even a lower standard of living. He said that the polls showed that the average American believed that there was a moral decline in this country. He said, &quot;For the first time in American history, Americans are pessimistic about their future...&quot; ","torrent":{"xt":"urn:btih:637990f14a7fcf0fecf2aa6406f84d96f3e9fc5f","amp;dn":"Operation+Mind+Control+-+by+Walter+Bowart+RARE+OOP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"637990f14a7fcf0fecf2aa6406f84d96f3e9fc5f","infoHashBuffer":{"type":"Buffer","data":[99,121,144,241,74,127,207,15,236,242,170,100,6,248,77,150,243,233,252,95]},"announce":[],"urlList":[]}}