{"title":"The Launch Pad: Inside Y Combinator","uid":10591315,"size":3741021,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6555e70b4b9e1ddcee87ee5beb4ce6d5eb270b6f&amp;dn=The+Launch+Pad%3A+Inside+Y+Combinator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1405800971,"description":" Randall Stross, &quot;The Launch Pad: Inside Y Combinator&quot;\nEnglish | ISBN: 1591846587, 1591845297, 0670923494 | 2013 | 290 pages | PDF | 3 MB\n\nNumber of teams that applied to Y Combinator's summer 2011 batch: 2,089Teams interviewed: 170Minutes per interview: 10Teams accepted and funded: 64 Months to build a viable startup: 3Possibilities: BOUNDLESS Investment firm Y Combinator is the most sought-after home for startups in Silicon Valley. Twice a year, it funds dozens of just-founded startups and provides three months of guid-ance from Paul Graham, YC's impresario, and his partners, also entrepreneurs and mostly YC alumni. The list of YC-funded success stories includes Dropbox (now valued at $5 billion) and Airbnb ($1.3 billion). Receiving an offer from YC creates the oppor-tunity of a lifetime -- it's like &quot;American Idol&quot; for budding entrepreneurs. Acclaimed journalist Randall Stross was granted unprecedented access to Y Combinator's summer 2011 batch of young companies, offering a unique inside tour of the world of software startups. Most of the founders were male programmers in their mid-twenties or younger. Over the course of the summer, they scrambled to heed Graham's seemingly simple advice: make something people want. We watch the founders work round-the-clock, developing and retooling products as diverse as a Web site that can teach anyone program-ming, to a Wikipedia-like site for rap lyrics, to software written by a pair of attorneys who seek to &quot;make attorneys obsolete.","torrent":{"xt":"urn:btih:6555e70b4b9e1ddcee87ee5beb4ce6d5eb270b6f","amp;dn":"The+Launch+Pad%3A+Inside+Y+Combinator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6555e70b4b9e1ddcee87ee5beb4ce6d5eb270b6f","infoHashBuffer":{"type":"Buffer","data":[101,85,231,11,75,158,29,220,238,135,238,91,235,76,230,213,235,39,11,111]},"announce":[],"urlList":[]}}