{"title":"Fabled.Enemies.ISO.NTSC.Official-chakra71","uid":4404550,"size":4681436812,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:65f4b6db8de6256661fca14857d2cbf95ab00758&amp;dn=Fabled.Enemies.ISO.NTSC.Official-chakra71&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chakra71","files":2,"time":1221873601,"description":"Fabled Enemies by Jason Bermas is the latest film to question the events of September 11th 2001. Instead of the focus being on physical anomalies surrounding the attacks, it focuses on a vast intelligence network and how they were able to succeed 7 years ago.\n\nIt begins with footage from the morning itself reminding everyone that in the court of public opinion Osama Bin laden was convicted on day 1, there were no other suspects. We then delve into the fact that many of the alleged hijackers were trained at U.S. military facilities, and still others had ties to the FBI. When others within the FBI tried to go after Bin Laden, and his financial supporters there investigations were impeded and shut down.\n\nAble Danger the Black Ops program that identified the hijackers prior to 9/11 had also tried to move the information tot he FBI, but the FBI still was not interested for some reason. Anthony Shaffer who headed up this team later met with Phillip Zelikow, the Executive Director of the 9/11 Commission, to try and pass this information along after the fact. It was then covered up, not included in the report, and Shaffer and his team were gagged and slandered.\n\nThe film then explores the mystery of those who were detained on the morning of September 11th. Several vans were stopped that morning containing Israeli citizens, who either seemed to have prior knowledge of the attacks, or had explosives in their vehicle. When investigators started looking into this network it was revealed they did indeed have a classified role in 9/11, and that two companies within the United States may have been helping them gain their intel.\n\nThis network&amp;#039;s existence is then confirmed by whistle blower Sybyl Edmonds, who came across a international spy ring containing Turks, Israelis, and member&amp;#039;s of Pakistani Intelligence. The Pakistani operation was headed by General Mahmoud Ahmed, who had financial ties to the hijackers, and diplomatic ties to the upper echelons of Washington.\n\nAfter two separate government investigations into 9/11 you would think that the public would be satisfied with their efforts and conclusions. However we show you how both the Congressional Report and the 9/11 Commission Report were a whitewash and a scam to begin with, and how it was used to manipulate the public into believing the issue had been dealt with and thoroughly explained.\n\nIn reality there were many warnings prior to 9/11, and the US government seemed to be listening, because in the months leading up to 9/11 it had been running drills of hijacked aircraft being flown into buildings. Then on the morning of 9/11 itself drills mirroring the attacks were taking place at the same time as the &quot;real&quot; hijackings happened.\n\nAir Force One and the White House were also reported to have been targets that day, and further evidence presented in the film suggests that there were indeed many other targets that morning, and that our leaders were very aware of this. This information then fell into the memory hole, never to be discussed in a meaningful way again.\n\nAnother fact that has fallen below the radar is that the Continuity of Government program or &quot;Shadow Government&quot; was put into power on the morning of 9/11. This program was revamped in the early 80&amp;#039;s by none other than George Herbert Walker Bush, the presidents father. It should also come as no surprise that operational centers that carried many of those in charge of the COG program were already in the air that morning as part of the Global Guardian exercise that was taking place.\n\nWorld Trade Center building 7 is then put under the microscope as it was New York City&amp;#039;s number one spook house and operational center. It not only contained the Office of Emergency Management which all local government was supposed to flock to in the case of such an emergency, but also the largest Secret Service office in the world, the largest CIA base outside of Virginia, and scores of other agencies such as the SEC, the DOD, and the IRS. We take you inside 7 with emergency worker Barry Jennings account of multiple explosions inside the building before either tower had fell.\n\nThe case of the anthrax attacks is also explored. Several letters reading &quot;9-11 01&quot; &quot;Death to America&quot; and &quot;Death to Israel&quot; were mailed to members of the media and congress in a successful attempt to strike more fear into the population, while blaming radical Muslims. The anthrax was then analyzed, and despite efforts to cover it up, it was highly weaponized and refined, and was made in one U.S. military facility at Ft. Detrick Maryland.\n\nAll of this and much, much more is discussed in the new film, and we hope that you support our efforts here at Infowars by getting the DVD and making numerous copies and handing them out to others.\n\n-------------------------------\nDVD ripped and cleaned with RipIt4me &amp; DVD Decrypter then compressed with DVDShrink (2 pass encoding) to fit a DVD-5.  Contains all menus, and extras.\n\nPlease do your part and seed this film.  Pass it out to your friends, family, co-workers, strangers!  Then go out and BECOME CHANGE.\n\nTrailer 1 - Bin Laden: &lt;a href=&quot;\nhttp://fabledenemies.com/Trailer1.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://fabledenemies.com/Trailer1.html&lt;/a&gt;\n\nTrailer 2 - Israelis: &lt;a href=&quot;\nhttp://fabledenemies.com/Trailer2.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://fabledenemies.com/Trailer2.html&lt;/a&gt;\n\nTrailer 3 - Continuity of Government: &lt;a href=&quot;\nhttp://fabledenemies.com/Trailer3.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://fabledenemies.com/Trailer3.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://prisonplanet.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://prisonplanet.com&lt;/a&gt; &lt;a href=&quot;\nhttp://prisonplanet.tv&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://prisonplanet.tv&lt;/a&gt; &lt;a href=&quot;\nhttp://truthnews.us&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://truthnews.us&lt;/a&gt; &lt;a href=&quot;\nhttp://arnoldexposed.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://arnoldexposed.com&lt;/a&gt; &lt;a href=&quot;\nhttp://jonesreport.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jonesreport.com&lt;/a&gt; &lt;a href=&quot;\nhttp://infowars.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://infowars.net&lt;/a&gt; &lt;a href=&quot;\nhttp://fabledenemies.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://fabledenemies.com&lt;/a&gt;\n\nPurchase an official DVD here: &lt;a href=&quot;\nhttp://infowars-shop.stores.yahoo.net/enemies.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://infowars-shop.stores.yahoo.net/enemies.html&lt;/a&gt;","torrent":{"xt":"urn:btih:65f4b6db8de6256661fca14857d2cbf95ab00758","amp;dn":"Fabled.Enemies.ISO.NTSC.Official-chakra71","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65f4b6db8de6256661fca14857d2cbf95ab00758","infoHashBuffer":{"type":"Buffer","data":[101,244,182,219,141,230,37,102,97,252,161,72,87,210,203,249,90,176,7,88]},"announce":[],"urlList":[]}}