{"title":"40 Year Old Virgin[2005]DVDRip.AC3(ENG)-DROCK","uid":6012250,"size":733474816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:661900db48417a6f80fcabecbd8f46a0d17401b9&amp;dn=40+Year+Old+Virgin%5B2005%5DDVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drock232","files":-1,"time":1291502732,"description":"One man nervously ventures forth into the final frontier in this comedy starring comic actor Steve Carell. Andy Stitzer (Carell) is a cheerfully geeky guy who is settling into middle age with his large collection of comic books, action figures, and collectable models. Andy works in an electronics store, and seems reasonably happy with his life. However, one day his friends and co-workers David (Paul Rudd), Jay (Romany Malco), and Cal (Seth Rogen) discover that Andy has a secret -- due to his rather severe jitters around women, Andy is still a virgin. Andy's pals are appalled at this state of affairs, and set out to find a woman who'd be willing to get horizontal with him. After a number of disastrous dates, everyone thinks Andy has finally struck gold when he meets Trish (Catherine Keener), an attractive single mother who takes an immediate liking to him. What the other guys don't know is that Trish has just gotten out of a bad relationship, and has informed Andy she isn't ready to be intimate with him just yet. The 40-Year-Old Virgin was the first feature film directed by Judd Apatow, who previously served as a writer and producer for the well-regarded television shows Freaks and Geeks, Undeclared, and The Larry Sanders Show.\n\nRipped with DVD Decrypter and Autogk.","torrent":{"xt":"urn:btih:661900db48417a6f80fcabecbd8f46a0d17401b9","amp;dn":"40+Year+Old+Virgin%5B2005%5DDVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"661900db48417a6f80fcabecbd8f46a0d17401b9","infoHashBuffer":{"type":"Buffer","data":[102,25,0,219,72,65,122,111,128,252,171,236,189,143,70,160,209,116,1,185]},"announce":[],"urlList":[]}}