{"title":"Suicide Squad (2001-11) 01-12 (digital) (OkC.O.M.P.U.T.O.-Novus-","uid":10513252,"size":445214842,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:661d320526512e363af1ac2f1cff817c63242057&amp;dn=Suicide+Squad+%282001-11%29+01-12+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dadrkhomr","files":12,"time":1404874671,"description":"\nA Novus Release\n\n\n\n\nThis torrent includes the HD version.\n  \n \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n\n\n\n\n\nThe first issue details the former Injustice League's terminally botched attempt to extract a kidnapped scientist from an Icelandic facility. With all but one team member (Major Disaster) presumed dead by issue's end, Sgt. Rock forms a new Suicide Squad for the missions ahead.[45] Major Disaster, Deadshot, and Killer Frost are mainstays of the field team. For his part, Rock is every bit as ruthless as Amanda Waller was (though far more affable), remorselessly sending his agents to die for the good of their country.\n\nThe Squad's missions involve eliminating an out-of-control colony of bio-engineered army ants,[46][50] and investigating the mysterious island of Kooey Kooey Kooey to discourage its telepathic inhabitants from declaring war on Earth.[44][51][52] Havana is revealed to be Amanda Waller's daughter,[53] and the final story arc revolves around an all-out attack on the Squad by the members of Onslaught, led by the son of longtime Squad enemy Rustam. Onslaught kills Modem and captures Rock, Havana, and Waller.[54]\n\nUpon learning that the Squad has been compromised, Waller's office drafts the Justice Society of America to counterattack Onslaught alongside the Squad, but they arrive too late to save Havana from Rustam's wrath. Deadshot discovers a discarded Sgt. Rock mask inside an empty holding cell, which prompts Bulldozer (who is monitoring the situation remotely via Deadshot's video camera) to stand from his wheelchair and announce &quot;Oh, boy!&quot; before leaving. Back in her office, Amanda Waller reviews Bulldozer's file, and states that he and Sgt. Rock died in 1945.[49]\n\n\n\n\n\n\n\nThanks goes to the OkC.O.M.P.U.T.O for this release.\n\n\n","torrent":{"xt":"urn:btih:661d320526512e363af1ac2f1cff817c63242057","amp;dn":"Suicide+Squad+%282001-11%29+01-12+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"661d320526512e363af1ac2f1cff817c63242057","infoHashBuffer":{"type":"Buffer","data":[102,29,50,5,38,81,46,54,58,241,172,47,28,255,129,124,99,36,32,87]},"announce":[],"urlList":[]}}