{"title":"NubileFilms - Janice Griffith (Persuasive Beauty)","uid":15352674,"size":399645123,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6664a7e0d1a3aa845fb28fae73364843daa1014b&amp;dn=NubileFilms+-+Janice+Griffith+%28Persuasive+Beauty%29++&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SudoSu","files":1,"time":1468954601,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n――――――――――――――――――――――――― \nhttp://imgkiss.com/image/0SjAd \nhttp://imgkiss.com/image/0SuTR \nhttp://imgkiss.com/image/0S9p6 \nhttp://imgkiss.com/image/0SPIe \nhttp://imgkiss.com/image/0SQZ4 \nhttp://imgkiss.com/image/0SSRL\r\n\r\nBlonde bombshell Janice Griffith is bent on seduction with her super skinny body clad in a sheer pink bra and barely-there thong. When she struts up to Johnny Castle in her high heels, he knows that it's time to stop getting ready for work and to start pleasuring the willing woman in his bed. Starting with a series of lusty kisses, Johnny gradually works his way down Janice's body. Her bra is soon pulled down as Johnny unveils her full boobs. When he pulls Janice's thong aside to sample her delectable wetness, Johnny finds her delicious and ready for fun. Peeling her thong off, he dives in for an extended pussy licking and fingering session. After licking Johnny's fingers clean of her pussy juices, Janice enjoys her victory over his plan to go to work by helping him undress. In a matter of moments his clothes have started hitting the floor, unveiling his long thick dick for Janice's pleasure. She wastes no time dropping to her knees and wrapping her puffy lips around the head of his cock. Soon she is sucking away and even deep throating his long stiffie for both of their pleasure.\r\n\r\nRemoving the last of her underwear so that her tan lines are proudly visible, Janice gets on her hands and knees and watches over her shoulder as Johnny positions himself at the mouth of her snatch and then fills her up with one long stroke. Her gasps of excitement quickly turn into full-blown moans of pleasure as her lover delivers the pussy pounding that she craves. Taking a well-earned break, Johnny lays back on the bed and lets Janice crawl between his legs. She takes the time to lick and suck his dick for a bit, but soon enough she rises over him and slowly impales herself on his fuck stick. When she's fully seated, she goes to work bouncing her booty up and down to create the friction that they both crave. Her intimate position places her eye to eye with her boyfriend making it easy for them to exchange searing kisses as Janice goes for a long stiffie ride. Restored from his rest while Janice does the work, Johnny flips his love over onto her back and pulls up one of her legs to open her bare fuck hole for his entry. He holds nothing back much to Janice's joy. Between his hard fast strokes and her own clit-massage, the blonde gradually works herself to a climax that leaves her panting with joy. Johnny follows her over the edge moments later, pulling out so that Janice can aim his dick and cover her own boobs and belly with hot cum.\r\n\r\nTop 0-Day and selected porn at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:6664a7e0d1a3aa845fb28fae73364843daa1014b","amp;dn":"NubileFilms+-+Janice+Griffith+%28Persuasive+Beauty%29++","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6664a7e0d1a3aa845fb28fae73364843daa1014b","infoHashBuffer":{"type":"Buffer","data":[102,100,167,224,209,163,170,132,95,178,143,174,115,54,72,67,218,161,1,75]},"announce":[],"urlList":[]}}