{"title":"ARIANEB SOMETHING'S IN THE AIR V1.3RD","uid":15699017,"size":284337126,"categoryP":"porn","categoryS":"games","magnet":"?xt=urn:btih:66faaa6c2e0373c99d98a37ecc6dede485bfe0d0&amp;dn=ARIANEB+SOMETHING%27S+IN+THE+AIR+V1.3RD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Woonesuf8368","files":1,"time":1472461514,"description":"You are a single American guy who moved to a new city a few weeks ago for work. Your social circle consists of a couple of guys from work, and Dave an old friend from your home town who moved here before you. Between work and getting settled, you have not had much of a chance to get a social life going. So far all you have done is join a gym and go on one date with a girl named Ariane, and that was over a week ago. You are determined that on your next day off work, you are going to go meet new people. Especially female people... or at least ask Ariane out again. It's a beautiful Saturday morning in the middle of summer. Now is your chance! Join the romantic comedy adventure and make your own decisions, leading to over 25 different endings.\r\n\r\nImprovements in new version 1.3rd:\r\nI am calling the newest version the &quot;third edition&quot; like a normal novel would. There have only been minor changes to the text and story, predominantly where it comes to events of the &quot;last date with Ariane&quot;. I dropped the ability to import dates, it was not that popular anyways, and instead created 33 &quot;last dates&quot; that cover most of the major events from &quot;Date Ariane&quot;, I left a few events out and left out details to prevent &quot;spoilers&quot; for players who play Something's In The Air first. Unlike previous versions, you can change the &quot;last date&quot; in the middle of the game. You used to have to start a new game.\r\nAnother change from the last version: No more on screen keyboard. It felt a little tacky and not Android compatible. However, there still may be issues with people playing on tablets who cant use their keyboard to type a name in. As a back up, you can pick from a list of 48 male names, including one common name for each letter of the alphabet, 6 silly fictional names, 8 regional ethnic names, and the top male names in America (where the story is set).\r\nAlso, buttons are bigger in height, smaller in width. This makes them easier to touch when playing on a small tablet or phone. I changed the main font as well to make it easier to read on smaller screens. I also fixed a few pictures either because they looked bad or they were not consistent with the new Date Ariane","torrent":{"xt":"urn:btih:66faaa6c2e0373c99d98a37ecc6dede485bfe0d0","amp;dn":"ARIANEB+SOMETHING%27S+IN+THE+AIR+V1.3RD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66faaa6c2e0373c99d98a37ecc6dede485bfe0d0","infoHashBuffer":{"type":"Buffer","data":[102,250,170,108,46,3,115,201,157,152,163,126,204,109,237,228,133,191,224,208]},"announce":[],"urlList":[]}}