{"title":"The 4000 Year Battle for Jerusalem","uid":12721492,"size":7751341034,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:671028e10ac7b52d49a5b2e245414bc3b2b535cf&amp;dn=The+4000+Year+Battle+for+Jerusalem&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"POtHS11","files":56,"time":1446998606,"description":"\nThe 4000 Year Battle for Jerusalem\r\n\r\n\r\n\r\nJerusalem: The Biography\r\nRate this book\r\n1 of 5 stars\r\n2 of 5 stars\r\n3 of 5 stars\r\n4 of 5 stars\r\n5 of 5 stars\r\nJerusalem: The Biography\r\nby Simon Sebag Montefiore (Goodreads Author)\r\n3.97 of 5 stars\r\n3.97  ·  rating details  ·  3,597 ratings  ·  465 reviews\r\nJerusalem is the universal city, the capital of two peoples, the shrine of three faiths; it is the prize of empires, the site of Judgement Day and the battlefield of today’s clash of civilizations. From King David to Barack Obama, from the birth of Judaism, Christianity and Islam to the Israel–Palestine conflict, this is the epic history of 3,000 years of faith, slaughter, fanaticism and coexistence.\r\n\r\n\r\nHow did this small, remote town become the Holy City, the ‘centre of the world’ and now the key to peace in the Middle East? In a dazzling narrative, Simon Sebag Montefiore reveals this ever-changing city in its many incarnations, bringing every epoch and character blazingly to life. Jerusalem’s biography is told through the wars, love affairs and revelations of the men and women – kings, empresses, prophets, poets, saints, conquerors and whores – who created, destroyed, chronicled and believed in Jerusalem. As well as the many ordinary Jerusalemites who have left their mark on the city, its cast varies from Solomon, Saladin and Suleiman the Magnificent to Cleopatra, Caligula and Churchill; from Abraham to Jesus and Muhammad; from the ancient city of Jezebel, Nebuchadnezzar, Herod and Nero to the modern times of the Kaiser, Disraeli, Mark Twain, Rasputin and Lawrence of Arabia.\r\n\r\n\r\nDrawing on new archives, current scholarship, his own family papers and a lifetime’s study, Montefiore illuminates the essence of sanctity and mysticism, identity and empire in a unique chronicle of the city that is believed will be the setting for the Apocalypse. This is how Jerusalem became Jerusalem, and the only city that exists twice – in heaven and on earth. (less)","torrent":{"xt":"urn:btih:671028e10ac7b52d49a5b2e245414bc3b2b535cf","amp;dn":"The+4000+Year+Battle+for+Jerusalem","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"671028e10ac7b52d49a5b2e245414bc3b2b535cf","infoHashBuffer":{"type":"Buffer","data":[103,16,40,225,10,199,181,45,73,165,178,226,69,65,75,195,178,181,53,207]},"announce":[],"urlList":[]}}