{"title":"[DIVX ITA MP3] NIKITA - LUC BESSON","uid":4521814,"size":1212686844,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67946a458247d673b6fdaccacd3aa15a21d85141&amp;dn=%5BDIVX+ITA+MP3%5D+NIKITA+-+LUC+BESSON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"golet","files":-1,"time":1227195030,"description":"Nikita ÃƒÂ¨ un film del 1990, diretto da Luc Besson. Il film, oltre ad un telefilm, ha ispirato innumerevoli riedizioni. Besson ha dichiarato che il film ÃƒÂ¨ stato talmente importante per lui che la sua carriera ÃƒÂ¨ divisa in due fasi: prima e dopo Nikita.\n\nNikita (Anne Parillaud), tossicomane, partecipa con la sua gang della banlieue parigina ad una rapina per procurarsi la droga nella farmacia dei genitori di Antoine, uno dei membri della gang. Durante la rapina la polizia interviene uccidendo tutti i suoi compagni. Stordita dalla sua tossicodipendenza uccide uno dei poliziotti intervenuti, a sangue freddo, prima di venire arrestata.\n\nViene processata e condannata all&amp;#039;ergastolo. Poco dopo perÃƒÂ² i servizi segreti francesi fingono la sua morte per overdose di tranquillanti, trasportandola nel frattempo narcotizzata in una piccola ed anonima cella. In realtÃƒÂ  finisce dentro una struttura del DGSE dove un agente dei servizi francesi (TchÃƒÂ©ky Karyo), che poi le farÃƒÂ  da tutore, la mette davanti una scelta: diventare una killer per lui oppure finire realmente nella tomba. Dopo alcune iniziali resistenze Nikita impara tutti i meccanismi del mestiere attraverso un durissimo addestramento.\n\nViene invitata per la prima volta in un ristorante, dove come regalo riceve una pistola ed ÃƒÂ¨ costretta ad uccidere un uomo: ÃƒÂ¨ il suo ultimo esame da apprendista. Esce dal centro di addestramento e diventa cosÃƒÂ¬ un vero killer dei servizi segreti, ricominciando una vita apparentemente normale. Basta una parola al telefono per farla trasformare in un sicario implacabile: &quot;JosÃƒÂ©phine&quot;, il suo nome in codice.\n\nTra una missione e l&amp;#039;altra incontra in un supermercato Rico, l&amp;#039;uomo della sua vita; sarÃƒÂ  la persona che le farÃƒÂ  scoprire il sorriso, la quotidianitÃƒÂ , l&amp;#039;amore. Ma il DSGE non smette di esigere il suo debito di sangue. UcciderÃƒÂ  ancora, fino alla sua ultima missione, che finirÃƒÂ  in un fallimento, dove ÃƒÂ¨ costretta ad assecondare Victor il pulitore (Jean Reno).\n\nAl termine di quella drammatica notte, Nikita scompare nel nulla lasciando l&amp;#039;amore e le pistole.","torrent":{"xt":"urn:btih:67946a458247d673b6fdaccacd3aa15a21d85141","amp;dn":"%5BDIVX+ITA+MP3%5D+NIKITA+-+LUC+BESSON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67946a458247d673b6fdaccacd3aa15a21d85141","infoHashBuffer":{"type":"Buffer","data":[103,148,106,69,130,71,214,115,182,253,172,202,205,58,161,90,33,216,81,65]},"announce":[],"urlList":[]}}