{"title":"Dispatches - Unholy War (2007) [Islam]","uid":10590816,"size":730580992,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:68608a7537d87632e242db19d627d1f7bca317bd&amp;dn=Dispatches+-+Unholy+War+%282007%29+%5BIslam%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kidon01","files":1,"time":1405796279,"description":"UK - Channel 4. Dispatches: Unholy War.  Monday 17th September 2007.\n\n\nDispatches investigates the violence and intimidation facing Muslims who convert to Christianity in Britain. Dispatches reporter Antony Barnett meets former Muslims who now live under the threat of reprisals from their former communities. Many are still living in fear. He interviews a family who have been driven out of their home and a convert whose brother was beaten close to death. \n\nThe investigation uncovers a network of churches supporting converts from Islam who have to worship under a veil of secrecy. It is estimated there are as many as 3,000 Muslims who have converted to Christianity living in Britain. \n\nConverting to another religion for a Muslim is not just considered a taboo act by some believers. Certain Islamic texts demand converts - also known as apostates - be punished severely for deserting their faith. In several Islamic states, the death penalty is imposed. Here in Britain, Dispatches discovers a form of mob justice is taking place on our streets. A concerned Christian bishop tells Dispatches that it may not be long before a British convert is killed, and implores Muslim leaders to take action. \n\nDispatches discovers the situation for converts from Islam in Britain is a tinderbox waiting to explode. Increasingly asylum seekers from Islamic countries are exploring different faiths in Britain while a new strand of evangelical Christianity is targeting Britain's Muslims for conversion. \n\nWith radical British Islamic groups calling for apostates to be executed if they achieved their goal of a worldwide Islamic state, it's a potentially dangerous cocktail that has been exacerbated by the silence of both Muslim and Christian ","torrent":{"xt":"urn:btih:68608a7537d87632e242db19d627d1f7bca317bd","amp;dn":"Dispatches+-+Unholy+War+%282007%29+%5BIslam%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68608a7537d87632e242db19d627d1f7bca317bd","infoHashBuffer":{"type":"Buffer","data":[104,96,138,117,55,216,118,50,226,66,219,25,214,39,209,247,188,163,23,189]},"announce":[],"urlList":[]}}