{"title":"2000AD Progs 1100 - 1853 &amp; Annuals (- Nem -)","uid":9150286,"size":15746301701,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:68cb4d6e6b68f41c150393660d6441e44176a5c4&amp;dn=2000AD+Progs+1100+-+1853+%26amp%3B+Annuals+%28-+Nem+-%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nemesis43","files":776,"time":1383679094,"description":"Iconic, cult and British aptly describe 2000 AD. For over 35 years it has delivered weekly thrill-power to the masses. Much of its success lies in its consistency, as original creators Pat Mills and John Wagner still write for the comic and future lawman Judge Dredd has been at the core of the sci-fi anthology since prog 2. As well as appearing in the weekly, Dredd's popularity has granted him his own series, which is still going today having topped 300+ issues as well as appearances in Annuals (1980-1990), Yearbooks (1991-1994) and Mega-Specials (1988-1996).\n\n2000 AD has launched the careers of some of British comics best known writers and artists such as Alan Moore, Alan Grant, Brian Bolland, Dave Gibbons, Frank Quitely, Grant Morrison, Garth Ennis, John Wagner, Kevin O'Neill, Pat Mills, Peter Milligan, Simon Bisley and many more.\n\nThroughout its publishing history (from IPC, Fleetway, Egmont and currently Rebellion), there have been many spin-off specials and series, including:\n\nHardbacked Annuals (1977-1990) and softcover Yearbooks (1991-1994)\nSummer Supercomics and Sci-Fi Specials (1977-1996)\nAction Special (1992), Winter Specials (1988-2005) and poster progs (1977-2004)\nBritish boys comics have been in decline since the 1980s and 2000 AD is now the last man standing, having seen off all of the competition. But despite all of these cancellations, only two other comics have ever merged with 2000 AD - Starlord (1978) and Tornado (1979). Both added new characters to the 2000 AD roster including Strontium Dog from Starlord, which is still in the line-up today and still being scripted and illustrated by its original creators.\n\nWith such a back catalogue of characters, stories and sagas, reprints were inevitable. In the UK, Titan Books printed the first graphic novel collections, starting with Judge Dredd in 1981. In the US, Eagle Comics began printing a monthly Judge Dredd comic in 1983 (with iconic covers from Brian Bolland).\n\nOver the years there have been countless graphic novel collections and reprint titles. In the UK these have taken the form of the more traditional anthology format (Best of 2000AD, Classic 2000AD and Extreme Editions), but in the US, stories have been resized and recoloured to fit the smaller format and released as specific character series (such as ABC Warriors, Nemesis the Warlock, Sam Slade and Judge Dredd).\n\nTo mark the millennium (a year nobody thought the comic would see), a new tradition was started with the publication of the 'Annual Progs'.\n\nThese 100-page specials slot in between the last prog of the old year and the first of the new. As well as featuring special one-off stories and features, they also kick-off the new years series.\n\n2012 and 2000 AD celebrated its 35th anniversary. With the comic in rude health, this special year saw the release of new movie Dredd - a faithful adaptation of the future lawman that banished memories of Sylvester Stallone's 1995 effort. Plus, IDW launched their own original Judge Dredd series (the first time a US publisher has printed new Dredd stories since DC gave us Judge Dredd and Legends of the Law back in 1994).","torrent":{"xt":"urn:btih:68cb4d6e6b68f41c150393660d6441e44176a5c4","amp;dn":"2000AD+Progs+1100+-+1853+%26amp%3B+Annuals+%28-+Nem+-%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68cb4d6e6b68f41c150393660d6441e44176a5c4","infoHashBuffer":{"type":"Buffer","data":[104,203,77,110,107,104,244,28,21,3,147,102,13,100,65,228,65,118,165,196]},"announce":[],"urlList":[]}}