{"title":"Abraham-Hicks 1993 AV-7 PARENTING VHS to DVDRip+MP3s v1.1","uid":11721305,"size":1067983432,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:68cf3f966580660e548815fbedf257a82023af2a&amp;dn=Abraham-Hicks+1993+AV-7+PARENTING+VHS+to+DVDRip%2BMP3s+v1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"artofallowing","files":72,"time":1424839282,"description":"This is the LAST video tapes recorded in Albuquerque, New NM on May 15th, 1993 (17 years ago)\nIt was sold only in VHS format. No longer available from AH\n\nNOTE:  The content of this &quot;parenting&quot; video is already included in the other 5 videos.\nSince there were many questions on parents and children, AH put them together on this tape calling it &quot;Parenting&quot;\nIf you downloaded the other 5 of the series the parenting video is already in No 2-3 and 5.\n\n\n\nIn those days, there were NO INTERNET SITE FOR ABRAHAM-HICKS and the only books published were A NEW BEGINNING I AND II.\nNo CD's (only cassette tapes were available and this video series)\nWe had to phone in to place our orders. We were getting news through the QUARTERLY JOURNAL for those who subscribed to it.\nJerry and Esther were mostly traveling by plane from city to city. (no monster bus then)\n\nYou can imagine how happy we were when this video came out.\nIt was like watching Abraham LIVE for the first time.\n(Top quality was not an issue then - Third copy of VHS was the best and only format available...but who cares..we had a visual of Abraham in action through Esther.)\n\nTo prevent further deterioration, I had my VHS tapes transferred to DVD some 5 years ago. Now for you to enjoy !\n\nThere are some minor defect coming from my VHS tapes (which was common in those days) but all and all you get a good sense of how workshops were done in 1993 and what Jerry and Esther looked like in those days.\n\nThanks to Wally51 for helping me put this together.\n\nA smaller size DVD-Rip of this DVD is coming.  Please check the following website.\n\nFor more Abraham-Hicks_Torrents see webpage at: &lt;a href=&quot; http://www.abeshares.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.abeshares.com/&lt;/a&gt;\n\n to be automatically informed of any new Abraham-Hicks torrents.\n\nEnjoy - Please seed\n\nArt-of-Allowing","torrent":{"xt":"urn:btih:68cf3f966580660e548815fbedf257a82023af2a","amp;dn":"Abraham-Hicks+1993+AV-7+PARENTING+VHS+to+DVDRip%2BMP3s+v1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68cf3f966580660e548815fbedf257a82023af2a","infoHashBuffer":{"type":"Buffer","data":[104,207,63,150,101,128,102,14,84,136,21,251,237,242,87,168,32,35,175,42]},"announce":[],"urlList":[]}}