{"title":"Nanophotonics - Paras N. Prasad","uid":15534430,"size":7535137,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a19b18a43ced837b24403cfd2730348d0babc64&amp;dn=Nanophotonics+-+Paras+N.+Prasad&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1470867206,"description":"Nanophotonics - Paras N. Prasad (Wiley, 2004).pdf\r\n\r\nThe only comprehensive treatment of nanophotonics currently available\r\nPhotonics is an all-encompassing optical science and technology which has impacted a diverse range of fields, from information technology to health care. Nanophotonics is photonic science and technology that utilizes light-matter interactions on the nanoscale, where researchers are discovering new phenomena and developing technologies that go well beyond what is possible with conventional photonics and electronics. These new technologies could include efficient solar power generation, high-bandwidth and high-speed communications, high-capacity data storage, and flexible- and high-contrast displays. In addition, nanophotonics will continue to impact biomedical technologies by providing new and powerful diagnostic techniques, as well as light-guided and activated therapies.\r\nNanophotonics provides the only available comprehensive treatment of this exciting, multidisciplinary field, offering a wide range of topics covering:\r\n* Foundations\r\n* Materials\r\n* Applications\r\n* Theory\r\n* Fabrication\r\nNanophotonics introduces students to important and timely concepts and provides scientists and engineers with a cutting-edge reference. The book is intended for anyone who wishes to learn about light-matter interactions on the nanoscale, as well as applications of photonics for nanotechnology and nanobiotechnology. Written by an acknowledged leader in the field, this text provides an essential resource for those interested in the future of materials science and engineering, nanotechnology, and photonics","torrent":{"xt":"urn:btih:6a19b18a43ced837b24403cfd2730348d0babc64","amp;dn":"Nanophotonics+-+Paras+N.+Prasad","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a19b18a43ced837b24403cfd2730348d0babc64","infoHashBuffer":{"type":"Buffer","data":[106,25,177,138,67,206,216,55,178,68,3,207,210,115,3,72,208,186,188,100]},"announce":[],"urlList":[]}}