{"title":"Fire - Deepa Mehta XviD","uid":4210519,"size":732533009,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6af780447c91f538f8353c8fb20596f65625bcca&amp;dn=Fire+-+Deepa+Mehta+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"somfatmtylm","files":2,"time":1212042953,"description":"Fire - Directed by Deepa Mehta &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0116308/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0116308/&lt;/a&gt;\nRead about the controversy when this film was released at http://www.sawnet.org/news/fire.html\nRead an interview with Deepa Mehta at http://www.mybindi.com/arts-entertainment/whatson/water.cfm\nDeepa Mehta\\&amp;#039;s third feature film, Fire, is a delicate, tender story about two women finding love while caught in the bounds of tradition, a joint family, a somewhat tyrannical mother-in-law with a bell and a bed in the central location of the house, and self-consumed husbands. Sita (Nandita Das) comes into the household as the younger daughter-in-law, married to a man (Jaaved Jaaferi) in love with another woman and with no tenderness or kindness for Sita. \nSita gradually coaxes the sparks of rebellion and love in Radha (Shabana Azmi), the elder daughter-in-law. The moments of tenderness between Radha and Sita are little eddies of erotic poetry that seem to touch only the two women without being noticed by their husbands. At one point the family is at a picnic and Sita insists on massaging Radha\\&amp;#039;s feet. At this very erotic moment, Radha\\&amp;#039;s husband (Kulbushan Kharbanda) encourages the younger sister-in-law to continue massaging Radha\\&amp;#039;s feet as it is her duty to serve her elders. The servant (Ranjit Chowdhry) seems to be the only one to resent the growing relationship between the two women because of his crush on Radha. The servant is a wonderfully developed character and his desires and needs for love and human contact are well explored. \nIt is easy to see and understand, though not forgive, how tradition and culture make men like Radha\\&amp;#039;s husband construct their own prisons. To the end he can only think of his own needs, especially his need to justify and prove to himself that he has reached some salvation even though he believes he has failed at the essential task of producing a child, especially the all-important male heir. His only kindness to Radha, who is commanded to participate in his experiments on celibacy Mahatma Gandhi style, is not to have thrown her out for being barren (\\&quot;Sorry madam, no eggs in ovary,\\&quot; was what the doctor said). \nThe only discordant note in an otherwise perfect film is the characters speaking in English. It would be more authentic to have the characters speak in Hindi and provide subtitles.","torrent":{"xt":"urn:btih:6af780447c91f538f8353c8fb20596f65625bcca","amp;dn":"Fire+-+Deepa+Mehta+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6af780447c91f538f8353c8fb20596f65625bcca","infoHashBuffer":{"type":"Buffer","data":[106,247,128,68,124,145,245,56,248,53,60,143,178,5,150,246,86,37,188,202]},"announce":[],"urlList":[]}}