{"title":"Listening In by Ted Widmer, Caroline Kennedy","uid":9243716,"size":13439217,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6bced887dee630df1e7ea3b76673230310a1a140&amp;dn=Listening+In+by+Ted+Widmer%2C+Caroline+Kennedy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"perseu","files":-1,"time":1385332843,"description":"In July 1962, in an effort to preserve an accurate record of \nPresidential decision-making in a highly charged atmosphere \nof conflicting viewpoints, strategies and tactics, John F. \nKennedy installed hidden recording systems in the Oval Office \nand in the Cabinet Room. The result is a priceless historical \narchive comprising some 265 hours of taped material. JFK was \nelected president when Civil Rights tensions were near the \nboiling point, and Americans feared a nuclear war. Confronted \nwith complex dilemmas necessitating swift and unprecedented \naction, President Kennedy engaged in intense discussion and \ndebate with his cabinet members and other advisors. Now, in \nconjunction with the fiftieth anniversary of the Kennedy \npresidency, the John F. Kennedy Library and historian Ted \nWidmer have carefully selected the most compelling and \nimportant of these remarkable recordings for release, fully \nrestored and re-mastered onto two 75-minute CDs for the first \ntime.&quot; Listening In&quot; represents a uniquely unscripted, insider \naccount of a president and his cabinet grappling with the \nday-to-day business of the White House and guiding the nation \nthrough a hazardous era of uncertainty.\n\nAccompanied by extensively annotated transcripts of the \nrecordings, and with a foreword by Caroline Kennedy, &quot;Listening \nIn&quot; delivers the story behind the story in the unguarded words \nand voices of the decision-makers themselves.&quot; Listening In&quot; \ncovers watershed events, including the Cuban Missile Crisis, the \nSpace Race, Vietnam, and the arms race, and offers fascinating \nglimpses into the intellectual methodology of a circumspect \npresident and his brilliant, eclectic brain trust. Just as the \nunique vision of President John F. Kennedy continues to resonate \nhalf a century after his stirring speeches and bold policy \ndecisions, the documentary candor of &quot;Listening In&quot; imparts a \nvivid, breathtaking immediacy that will significantly expand our \nunderstanding of his time in office.\n\n\n\nListening In: The Secret White House \nRecordings of John F. Kennedy\nby Ted Widmer, Caroline Kennedy\nISBN:1401324568 \n(ISBN13: 9781401324568) \nFormat: EPUB\nLanguage: EN\nPages:599","torrent":{"xt":"urn:btih:6bced887dee630df1e7ea3b76673230310a1a140","amp;dn":"Listening+In+by+Ted+Widmer%2C+Caroline+Kennedy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bced887dee630df1e7ea3b76673230310a1a140","infoHashBuffer":{"type":"Buffer","data":[107,206,216,135,222,230,48,223,30,126,163,183,102,115,35,3,16,161,161,64]},"announce":[],"urlList":[]}}