{"title":"Nuclear Nightmares - Securing the World Before It Is Too Late -","uid":9431369,"size":1759394,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c16481092cdfd51cbf890098d48b48edd254711&amp;dn=Nuclear+Nightmares+-+Securing+the+World+Before+It+Is+Too+Late+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KhushSidhu","files":1,"time":1388811876,"description":"\n\nNuclear Nightmares: Securing the World Before It Is Too Late\n\nBy Joseph Cirincione\n\nHardcover: 280 pages - Publisher: Columbia University Press \n(November 26, 2013) - Language: English\nISBN-10: 0231164041 - ISBN-13: 978-0231164047\n\nThere is a high risk that someone will use, by accident or design, one or more of the 17,000 nuclear weapons in the world today. Many thought such threats ended with the Cold War or that current policies can prevent or contain nuclear disaster. They are dead wrong -- these weapons, possessed by states large and small, stable and unstable, remain an ongoing nightmare.\n\nJoseph Cirincione surveys the best thinking and worst fears of experts specializing in nuclear warfare and assesses the efforts to reduce or eliminate these nuclear dangers. His book offers hope: in the 1960s, twenty-three states had nuclear weapons and research programs; today, only nine states have weapons. More countries have abandoned nuclear weapon programs than have developed them, and global arsenals are just one-quarter of what they were during the Cold War. Yet can these trends continue, or are we on the brink of a new arms race -- or worse, nuclear war? A former member of Senator Obama's nuclear policy team, Cirincione helped shape the policies unveiled in Prague in 2009, and, as president of an organization intent on reducing nuclear threats, he operates at the center of debates on nuclear terrorism, new nuclear nations, and the risks of existing arsenals.","torrent":{"xt":"urn:btih:6c16481092cdfd51cbf890098d48b48edd254711","amp;dn":"Nuclear+Nightmares+-+Securing+the+World+Before+It+Is+Too+Late+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c16481092cdfd51cbf890098d48b48edd254711","infoHashBuffer":{"type":"Buffer","data":[108,22,72,16,146,205,253,81,203,248,144,9,141,72,180,142,221,37,71,17]},"announce":[],"urlList":[]}}