{"title":"David Potter - The Victors Crown [2012][A]","uid":9940043,"size":3408391,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c55528876a06e32e3eba7258a8122276f597586&amp;dn=David+Potter+-+The+Victors+Crown+%5B2012%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1397226011,"description":"Description\nProduct Details\nBook Title: The Victor's Crown: A History of Ancient Sport from Homer to Byzantium\nBook Author: David Potter (Author)\nHardcover: 448 pages\nPublisher: Oxford University Press, USA (November 7, 2011)\nLanguage: English\nISBN-10: 0199842736\nISBN-13: 978-0199842735\n\nThe Victor's Crown brings to vivid life the signal role of sport in the classical world. Ranging over a dozen centuries--from Archaic Greece through to the late Roman and early Byzantine empires--David Potter's lively narrative shows how sport, to the ancients, was not just a dim reflection of religion and politics but a potent social force in its own right. The passion for sport among the participants and fans of antiquity has been matched in history only by our own time.\nPotter first charts the origins of competitive athletics in Greece during the eighth century BC and the emergence of the Olympics as a preeminent cultural event. He focuses especially on the experiences of spectators and athletes, especially in violent sports such as boxing and wrestling, and describes the physiology of conditioning, training techniques, and sport's role in education. Throughout, we meet the great athletes of the past and learn what made them great. The rise of the Roman Empire transformed the sporting world by popularizing new entertainments, particularly gladiatorial combat, a specialized form of chariot racing, and beast hunts. Here, too, Potter examines sport from the perspectives of both athlete and spectator, as he vividly describes competitions held in such famous arenas as the Roman Coliseum and the Circus Maximus. The Roman government promoted and organized sport as a central feature of the Empire, making it a sort of common cultural currency to the diverse inhabitants of its vast territory.\nWhile linking ancient sport to events such as religious ceremonies and aristocratic displays, Potter emphasizes above all that it was the thrill of competition--to those who competed and those who watched--that ensured sport's central place in the Greco-Roman world.\n&quot;Vivid and authoritative. Potter skillfully reveals how the gymnasium lay at the heart of Greek life and culture, but his passion is clearly for the Olympics. When Potter moves on to Roman sport, things get livelier still. He meticulously traces the origins, careers and lifestyles of athletes, gladiators and charioteers alike, and demolished some cherished myths along the way. Most gladiatorial combats apparently ended in surrender, not death, although a crowd might well call out &quot;ingula!&quot; (kill!), running their thousands of thumbs under their throats in the original 'thumbs up' gesture. Fascinating and impressive.&quot;\n--James McConnachie, Sunday Times\n\nReviews\n&quot;Well written and informative, this book makes complex ideas understandable. Highly recommended.&quot;--S.A. Riess, CHOICE\n\n&quot;Written in lively style, packed with detail bringing the era to pungent life.&quot; --The Independent\n\n&quot;Vivid and authoritative....Potter skillfully reveals how the gymnasium lay at the heart of Greek life and culture, but his passion is clearly for the Olympics.... When Potter moves on to Roman sport, things get livelier still....He meticulously traces the origins, careers, and lifestyles of athletes, gladiators and charioteers alike, and demolished some cherished myths along the way. Fascinating and impressive.&quot; --James McConnachie, Sunday Times\n\nAbout the Author\nDavid Potter is Francis W. Kelsey Collegiate Professor of Greek and Roman History and Arthur F. Thurnau Professor of Greek and Latin in the Department of Classical Studies at the University of Michigan. He is the author of Ancient Rome: A New History and Emperors of Rome as well as two forthcoming OUP titles, Constantine the Emperor and Theodora.\n","torrent":{"xt":"urn:btih:6c55528876a06e32e3eba7258a8122276f597586","amp;dn":"David+Potter+-+The+Victors+Crown+%5B2012%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c55528876a06e32e3eba7258a8122276f597586","infoHashBuffer":{"type":"Buffer","data":[108,85,82,136,118,160,110,50,227,235,167,37,138,129,34,39,111,89,117,134]},"announce":[],"urlList":[]}}