{"title":"SAINT-SAENS - Symphony No. 3  Le Rouet d'Omphale [1993] NAXOS","uid":4565058,"size":51241382,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6d42f6aff3a7226f4aa36c6e5a1747181cd760f6&amp;dn=SAINT-SAENS+-+Symphony+No.+3++Le+Rouet+d%5C%27Omphale+%5B1993%5D+NAXOS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sweetthing","files":7,"time":1228840903,"description":"About this Recording\n8.550138 - SAINT-SAENS: Symphony No. 3 / Le Rouet d&amp;#039;Omphale   \nEnglish  \n\n--------------------------------------------------------------------------------\n\nCamille Saint-SaÃƒÂ«ns (1835 - 1921)\n\nSymphony No.3 In C Minor (Organ Symphony), Opus 78\nLe Rouet d&amp;#039;Omphale, Opus 31 \nBacchanale from &quot;Samson &amp; Delilah&quot;, Opus 47\n\nCamille Saint-SaÃƒÂ«ns lived a long life, composed a large amount of music, and by the time of his death in 1921 at the age of 86 seemed a relic of a distant age. As a young man he had earned the nick-name of the French Mendelssohn. He found himself, in old age, in the world of composers such as Ravel, Stravinsky and Schoenberg.\n\nSaint-SaÃƒÂ«ns was born in Paris in 1835. His father, a clerk in the Ministry of the Interior, died shortly after his son &amp;#039;s birth, and the boy was brought up by his mother and her aunt, the latter giving him his first piano lessons when he was two and a half. He showed exceptional ability and at the age of ten appeared in a public concert at the Salle Pleyel, having already learned by heart all the Beethoven sonatas.\n\nIn an otherwise distinguished enough career at the Conservatoire, where he had composition lessons from Halevy and studied the organ with Bergist, Saint-SaÃƒÂ«ns failed to win the Prix de Rome, but w rote an impressive series of compositions. In common with many other French composers, he took an appointment as an organist in Paris and was for nearly twenty years employed in that capacity at the Madeleine.\n\nFor four years Saint-SaÃƒÂ«ns, from 1861 until 1865, taught at the Ecole Niedermeyer and it was there that he met Gabriel FaurÃƒÂ¨, who was to remain his close friend throughout his life. His marriage in 1875 was brief and unhappy and lasted a mere six years, with his two children dying in infancy. The death of his mother in 1888 proved a greater blow to his security, and he was thereafter to spend a great deal of time travelling, particularly to Egypt and to AIgeria. He died in Algiers in 1921.\n\nSaint-SaÃƒÂ«ns was immensely gifted, both as a performer and as a composer. Liszt, who heard him improvise at the Madeleine, described him as the greatest living organist, while Hans von Buelow, who heard him read at sight at the piano the score of Wagner&amp;#039;s Siegfried declared him the greatest musical mind of the time. As a pianist he performed principally his own music, avoiding the inevitable drudgery of the mere virtuoso he might so easily have become.\n\nThe compositions of Saint-SaÃƒÂ«ns cover almost every possible genre of music. He w rote for the theatre and for the church, composed songs, orchestral music and chamber music, with works for the piano and for the organ. In style he deserved the comparison with Mendelssohn, sharing with that composer an ability in the handling of traditional forms and techniques and a gift for orchestration.\n\nThe third and last of the numbered symphonies that Saint-SaÃƒÂ«ns wrote, the so-called Organ Symphony, was completed in 1886, the year of the famous private jeu d&amp;#039;esprit, Le carnaval des animaux. It was dedicated to the memory of Franz Liszt, who died that year in Bayreuth. The two movements of the work include the normal structure of a four-movement symphony, with the use of cyclic thematic material, melodies or fragments of melodies that recur and provide over-all unity, a technique used by Cesar Franck in his own symphony, which he had started in the same year. \n\nThe first movement, after a slow introduction, leads to a theme of Mendelssohnian character, followed by a second subject of a gentler cast. The organ introduces a slow movement of sadder complexion, in which memories of the cyclic theme recur, as it undergoes its Lisztian metamorphosis into something still richer and stranger. A following section takes the place of a scherzo, opening with an energetic string melody, and framing a more lyrical passage at its heart. The final part of the symphony is again started by the organ, introducing an orchestral fugato.\n\nThis last movement is of considerable variety, including a chorale, that makes an early appearance in an unusual form, polyphonic writing and a brief pastoral interlude, replaced by the massive climax of the whole symphony.\n\nLe rouet d&amp;#039;Omphale belongs to a group of earlier symphonic poems written in the 1870s that includes PhaÃƒÂ©ton, the famous Danse macabre and La jounesse d&amp;#039;Hercule. The legend of the Lydian queen Omphale involves the mythical hero Hercules, who was condemned by Apollo to serve her in the guise of a woman, an episode in which some were to find a moral, as the strongest of men was enslaved in this way. The symphonic poem makes much of the sound of the spinning-wheel at which Omphale and her maids worked. \n\nThe successful opera Samson &amp; Delilah was first staged in Weimar in 1877. The work had originally been conceived as an oratorio, but proved too Wagnerian for French taste, so that it was not to be seen in France until 1890, when there was a performance at Rouen, followed seven months later by staging in Paris. The Bacchanale, which might at first seem an inappropriate indulgence even for a Philistine, provides a necessary divertissement in the biblical story.\n\nCzech Radio Symphony Orchestra (Bratislava) \nThe Czech Radio Symphony Orchestra (Bratislava), the oldest symphonic ensemble in Slovakia, was founded in 1929 at the instance of Milos Ruppeldt and Oskar Nedbal, prominent personalities in the sphere of music. The orchestra was first conducted by the Prague conductor FrantiÃ…Â¡ek Dyk and in the course of the past fifty years of its existence has worked under the batons of several prominent Czech and Slovak conductors. Ondrej Lenard was appointed its conductor in 1970 and in 1977 its conductor-in-chief. The orchestra has recently given a number of successful concerts both at home and abroad, in West and East Germany, Russia, Bulgaria, Denmark, France, Spain, Italy, and Great Britain.\n\nStephen Gunzenhauser \nThe American conductor Stephen Gunzenhauser was educated in New York, continuing his studies at Oberlin, at the Salzburg Mozarteum, at the New England Conservatory and at Cologne State Conservatory. His period at the last of these was the result of a Fulbright Scholarship, followed by an award from the West German Government and a first prize in the conducting competition held in the Spanish town of Santiago.\n\nDuring the last two decades, Gunzenhauser has enjoyed a varied and distinguished career, winning popularity in particular for his work with the Delaware Symphony. an orchestra which he has recently conducted on an eight-concert tour of Portugal. His other engagements have included appearances with orchestras in Europe and America, from the RIAS Orchestra of Berlin, the Hessischer Rundfunk Orchestra of Frankfurt and Dublin Radio Orchestra to the Charlotte Orchestra of North Carolina, and orchestras in Victoria, B.C., Spokane and Knoxville.\n\nFor the Marco Polo label Stephen Gunzenhauser has recorded works by Liadov, GliÃƒÂ¨re and Rubinstein, and for NAXOS Tchaikovsky&amp;#039;s Symphony No.5, Vivaldi&amp;#039;s Four Seasons and Mozart&amp;#039;s Violin Concertos Nos. 3 &amp; 5.\n \n","torrent":{"xt":"urn:btih:6d42f6aff3a7226f4aa36c6e5a1747181cd760f6","amp;dn":"SAINT-SAENS+-+Symphony+No.+3++Le+Rouet+d%5C%27Omphale+%5B1993%5D+NAXOS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d42f6aff3a7226f4aa36c6e5a1747181cd760f6","infoHashBuffer":{"type":"Buffer","data":[109,66,246,175,243,167,34,111,74,163,108,110,90,23,71,24,28,215,96,246]},"announce":[],"urlList":[]}}