{"title":"Full.Steam.Ahead.[2016].s01e04.EN.SUB.MPEG4.x264.WEBRIP.[MPup]","uid":15587398,"size":1062420009,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6d61b20ab28604f3ceb2f87c184ea04a0f6424c7&amp;dn=Full.Steam.Ahead.%5B2016%5D.s01e04.EN.SUB.MPEG4.x264.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1471476332,"description":"Full.Steam.Ahead.[2016].s01e04.EN.SUB.MPEG4.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nFull Steam Ahead (2016) is a six part documentary series that brings back to life the golden age of steam and explores how the Victorian railways created modern Britain.\r\n\r\n\t---------------------------------------------\r\n\r\nIt is full steam ahead for historians Ruth Goodman, Alex Langlands and Peter Ginn as they bring back to life the golden age of steam and explore how the Victorian railways created modern Britain.\r\n\r\nAt the National Railway Museum, Alex and Peter help get the most famous locomotive in the world, the Flying Scotsman, into steam. The team take a ride of a lifetime as the loco travels along its original route, connecting the two most important financial capitals of the empire - London and Edinburgh - and Alex finds out what it is like for catering staff with 250 hungry mouths to feed. Peter heads to the Great Central Railway to find out how the railways revolutionised the delivery of mail right across Britain and is put to task on the travelling post office, where time is of the essence.\r\n\r\nThe boys visit the Milton Keynes Museum to find out how the railways facilitated the first ever electrical communication service - instantaneous messaging over a hundred years before the arrival of emails. With the railways opening up many new and interesting titled jobs, Ruth finds out what the role of the wheel-tapper entailed and helps to tyre a wheel with a steel band at the South Devon Railway workshop. In Bristol, Alex discovers how the railways were responsible for bringing the nation into sync, as he visits a clock with not one, but two minute hands! Meanwhile, Peter learns how the railways brought Britain current news, hot off the press, for the first time","torrent":{"xt":"urn:btih:6d61b20ab28604f3ceb2f87c184ea04a0f6424c7","amp;dn":"Full.Steam.Ahead.%5B2016%5D.s01e04.EN.SUB.MPEG4.x264.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d61b20ab28604f3ceb2f87c184ea04a0f6424c7","infoHashBuffer":{"type":"Buffer","data":[109,97,178,10,178,134,4,243,206,178,248,124,24,78,160,74,15,100,36,199]},"announce":[],"urlList":[]}}