{"title":"Mr Reliable","uid":11767359,"size":1461933896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6d9e02cf3089b42a9062ee9fbd5bcd222066fd11&amp;dn=Mr+Reliable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"a468041","files":4,"time":1426901324,"description":"Based on a true-life story, &quot;Mr Reliable&quot; (also known as &quot;My Entire Life&quot;) is a hostage story with a twist, exploring a unique and calamitous incident of suburban Aussie mayhem, from the AFI award-winning director of &quot;Malcolm&quot; and &quot;Matching Jack&quot;.\n\nDuring a scorching 1968 Sydney summer, convicted car thief Wally Mellish (Colin Friels, &quot;Malcolm&quot;) attempts to turn over a new leaf and bask in the fulfillment of family, despite a changing social landscape.\n\nOut of prison and in love with single mum Beryl (Jacqueline McKenzie, &quot;Romper Stomper&quot;) the two shack-up to enjoy the best of family life in a quiet suburban street. But it is not long before Wally resorts to his old-fashioned ways and trips up on a minor misdemeanour that soon becomes blown out of proportion.\n\nNot wishing to return to prison, Wally takes the matter into his own two hands, raising a shotgun to the surrounding police, inadvertently beginning a household siege of outrageous scope.\n\nA madcap tale of misunderstandings, nosy neighbours, underdogs and a media circus gone wild, &quot;Mr Reliable&quot; also features Susie Porter, Jonathan Hardy and Barry Otto.\n\n\n-Summary from back cover.\n\n\n----------\n\n\nSource: PAL DVD\nContainer: MP4\nVideo: 720x540, 24 fps, h.264 (x264)\nAudio: 48 KHz, stereo, 128 Kbps, AAC-LC (Fraunhofer)\n\n\n----------\n\nIf you want a smaller size, this movie has been previously uploaded under the alternative title. It was most likely taken from the same pressing. Since I've spent more time than I should have adding a little extra value to this, I've decided to release it anyway even though I've been beaten to it.\n\nFor anyone wondering how &quot;true&quot; this story is, well, it happened in July, not January!","torrent":{"xt":"urn:btih:6d9e02cf3089b42a9062ee9fbd5bcd222066fd11","amp;dn":"Mr+Reliable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d9e02cf3089b42a9062ee9fbd5bcd222066fd11","infoHashBuffer":{"type":"Buffer","data":[109,158,2,207,48,137,180,42,144,98,238,159,189,91,205,34,32,102,253,17]},"announce":[],"urlList":[]}}