{"title":"Nubiles-Porn - Janice Griffith, Jessa Rhodes (Secret Rendezvous","uid":13106758,"size":267504628,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6dfd66e0b60e2ad3ab52665ee0f9aff2f48b5a9a&amp;dn=Nubiles-Porn+-+Janice+Griffith%2C+Jessa+Rhodes+%28Secret+Rendezvous&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"SudoSu","files":1,"time":1451305755,"description":"\nhttp://youpornbook.com/\r\n.......................\r\n\r\n&gt;&gt;---:Screenshots:---&lt;&lt;\r\n----------------------- \nhttp://imgpremium.com/album/eX\r\n\r\nThe name of the actress: Janice Griffith, Jessa Rhodes\r\nName movie: Secret Rendezvous\r\nNPP site and the site: Nubiles-Porn.com / NubilesNetwork.com\r\n\r\nYear: 2015\r\nGenre: Small Boobs, Medium Boobs, Shaved Pussy, Blonde, Long hair, Hardcore, High Heels, Petite, Girl-Girl-Boy, Blowjob, Deep Throat\r\nDuration: 00:25:24\r\n\r\nLusty teen Janice Griffith has been invited over by her teacher Jessa Rhodes for some naughty fun. Janice agrees, but only if her boyfriend Tyler Nixon can come. As soon as Janice and Tyler arrive, the trio starts slipping out of their clothes until Janice is naked from the waist down and on her knees making love to Tyler's dick with her generous mouth while Jessa masturbates.\r\n\r\nWhen Janice lies down on her back so that Tyler can push his cock deep into her dripping twat, Jessa finally stirs herself to help out. She takes turns using her hands to pleasure Janice's boobs while putting her naughty mouth to work sucking Tyler off any time he pulls out of Janice's twat.\r\n\r\nThe girls finally help each other strip down to bare skin and exchange a long kiss before letting Tyler enjoy a double blowjob. When they lay down side by side, Tyler gets to deliver a pussy pounding first to Jessa's landing strip snatch and then to Janice when she goes up on her knees for a doggy style fuck. When Jessa sees how much Janice is enjoying having her pussy pounded like that, she demands the doggy style treatment, too!\r\n\r\nKnowing that she's only got one more climax in her, Janice climbs onto Tyler's member for a wild stiffie ride that only gets better as Jessa works her tits. Jessa takes a final turn as well, pounding her ass in reverse cowgirl until her moans of pleasure fill the room. Then it's finally Tyler's turn to cum, which he does with great enthusiasm thanks to a final double blowjob that fills both girls' mouths with cum that they swap in a snowball kiss.\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 640x360 23.976fps 1325kbps\r\nAudio: AAC 44100Hz stereo 74kbps","torrent":{"xt":"urn:btih:6dfd66e0b60e2ad3ab52665ee0f9aff2f48b5a9a","amp;dn":"Nubiles-Porn+-+Janice+Griffith%2C+Jessa+Rhodes+%28Secret+Rendezvous","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dfd66e0b60e2ad3ab52665ee0f9aff2f48b5a9a","infoHashBuffer":{"type":"Buffer","data":[109,253,102,224,182,14,42,211,171,82,102,94,224,249,175,242,244,139,90,154]},"announce":[],"urlList":[]}}