{"title":"Doctor Who - Voyager Graphic Novel - Marvel UK","uid":4769604,"size":166870168,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6e2de381a6b39908c53ac37cc7d104aee6398a63&amp;dn=Doctor+Who+-+Voyager+Graphic+Novel+-+Marvel+UK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"3xman","files":2,"time":1236993101,"description":"Doctor Who - Voyager (Complete Sixth Doctor Comic Strips Vol. 1)\nBy Steve Parkhouse; Alan McKenzie\n\nThe first two volumes featuring the Sixth Doctor's complete comic strip run from the pages of Doctor Who Magazine. Featuring the epic stories: The Shape-Shifter, Voyager, Polly the Glot, Once Upon a Time Lord, War Game, Funhouse, Kane's Story, Abels' Story and Frobisher's Story.\n\nChange my dear, and it seems not a moment too soon...\n\nStunning, imaginative storytelling5\nWell. Finally got my grubby little protuberances on this latest in the series of reprinted Doctor Who Magazine comics, and this has to be the strongest yet. I can't recommend it enough! Everyone involved in its reprinting deserves congratulation.\n\n... And the story 'Voyager' itself is an absolute masterpiece - grand, mythic, and illusorily dreamlike, it really puts to shame all those reviewers who've praised the scope of Russell T Davies' imagination; this is the real deal. Worth the entry fee alone - which is just as well, as the last third of the collection suffers a noticeable drop in quality with the departure of writer Steve Parkhouse. The remaining stories are generic, reheated `sci-fi escapades,' but, oh well; they're more than compensated by the earlier stories.\n\nIf only more of Doctor Who, in all its varied media, could be brave enough to embrace stories so huge and strange and fairytale! It's also particularly nice for such a story to feature the overlooked Sixth Doctor. ","torrent":{"xt":"urn:btih:6e2de381a6b39908c53ac37cc7d104aee6398a63","amp;dn":"Doctor+Who+-+Voyager+Graphic+Novel+-+Marvel+UK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e2de381a6b39908c53ac37cc7d104aee6398a63","infoHashBuffer":{"type":"Buffer","data":[110,45,227,129,166,179,153,8,197,58,195,124,199,209,4,174,230,57,138,99]},"announce":[],"urlList":[]}}