{"title":"Digital Juice Spring and Summer Canvases","uid":7044434,"size":692993209,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:6e62fd92641934b029fc74db59f03792c2df2fc4&amp;dn=Digital+Juice+Spring+and+Summer+Canvases&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DJ_Junkie","files":204,"time":1329694226,"description":"Throw open the windows and breathe the fresh air because Spring has arrived in the form of our latest Canvases downloadable collection! Spring &amp; Summer Canvases contains 40 all-new warm-weather seasonal image backgrounds, each delivered in 5 useful size formats for a total of 200 brand new canvases. No more staring at a blank page or an empty timeline hoping for inspiration. This fresh new library of subtle background images (including nature, food, vacation, floral and weather themes) provides a wide variety of powerful starting points for your next Spring or Summer seasonal graphics presentation. Unlike our more complex Juice Drops illustrations, Canvases are not about layers and lots of graphic elements. They are about giving your text, your photos and your ideas the perfect foundation to come alive and project your message.\nWe know you are working on a limited budget and with constant deadlines. You need something you can use right away that will make an impact and drive your message home. Look at any professionally designed poster, magazine ad or multimedia presentation and you are unlikely to find a simple solid color background. Instead you will find a sophisticated mix of color and texture that creates a perfect backdrop for the message or product being promoted. This is what Spring &amp; Summer Canvases provides for you - without all the hard work and without breaking the bank. It gives you an interesting graphic foundation and a creative nudge to get your ideas flowing and your project moving. These images provide a subtle fresh warm weather-themed environment that enhances your text, photos or videos and makes your material stand out.\n\n\n","torrent":{"xt":"urn:btih:6e62fd92641934b029fc74db59f03792c2df2fc4","amp;dn":"Digital+Juice+Spring+and+Summer+Canvases","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e62fd92641934b029fc74db59f03792c2df2fc4","infoHashBuffer":{"type":"Buffer","data":[110,98,253,146,100,25,52,176,41,252,116,219,89,240,55,146,194,223,47,196]},"announce":[],"urlList":[]}}