{"title":"Crime Inc - The True Story of the Mafia","uid":3577187,"size":2225866566,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6ed268025fab1164c132c35e60813e9cbe9934c9&amp;dn=Crime+Inc+-+The+True+Story+of+the+Mafia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"grinreaper_CCE","files":8,"time":1166191861,"description":"CRIME INC - THE TRUE STORY OF THE MAFIA\n\nSynopsis\nThe real story behind the Mob with interviews with former mafia boss Jimmy The Weasel Fratianno, archive home movies and FBI surveillance footage.\n\nFrom the Back Cover\nWith archive film including home movies and FBI surveillance material the award-winning Crime Inc. tell the true story behind the world?s most powerful crime syndicate, The Mob, La Cosa Nostra or The Mafia.\n\nInterviews with mob members turned informants, including former boss Jimmy ?The Weasal? Fratianno, reveal the inner workings of The Mafia, from the ritual of becoming a ?made? man and their code of honour, to the harrowing and detailed descriptions of their work, accompanies by equally graphic images and film footage.\n\nCrime Inc. dared to get close to the heart of ?The Family? and the result is frightening and compelling. Forget what you?ve seen in the movies. The fact is more shocking than the fiction. \n\nDaily Express\n&quot;TV shocker that lifts the lid on The Godfather&quot;\n\nThe Sun\n&quot;Superb? But you?ve got to have a strong stomach&quot;\n\nNew York Times\n&quot;The Godfather as a documentary&quot;\n\nThe Sunday Times\n&quot;An unprecedented expose of the Mafia&quot;\n\nThe Observer\n&quot;Chilling&quot;\n\nThe Sunday Mirror\n&quot;Makes Marlon Brando in The Godfather look like Santa Claus&quot; \n\nAmazon.co.uk Review\nCrime Inc. is a documentary series about the Mafia, produced in the mid-1980s by Thames Television. It&amp;#039;s fascinating to observe how the intervening years have led the issuing company of this complete release of all seven episodes down the road of the cheapest and nastiest sensationalism: &quot;MEET THE REAL GOODFELLAS&quot; yells the front cover of the two-disc set at its presumably dumbed-down target market, while the back cover shows a string of silly press quotes. The irony is that, for anyone interested in the history of organised crime or in any aspect of the dark undercurrents which pervade American and European society, such lowbrow tactics are completely unnecessary. For Crime Inc. is a good, solid, properly budgeted and carefully researched series, dating from when such things were what viewers could expect as a matter of course.\n\nMuch of the fascination of the series stems from the fact that the producers have used as much primary source material as possible, including original archive footage and interviews (many presumably conducted in jail) with defectors from the cause. The most startling revelation, oddly enough, has nothing to do with the secrecy, extortion and torture employed by the organisation--after all, there are plenty of legitimised governments throughout the world who routinely use the same tactics--rather, it&amp;#039;s the statement, made very early on, that until informants started going public US police forces would simply deny the fact that the Mafia even existed. Remarkable stuff.\n\nOn the DVD: Crime Inc. has no extra features, but with six hours of running time this is hardly cause for complaint. It is presented in standard 4:3 ratio. --Roger Thomas\n\nDVD Description\nEPISODES\n1 ? All in The Family\n2 ? Making of The Mob\n3 ? Racket Busters\n4 ? Birthright of Gangsters\n5 ? The Mob at Work\n6 ? Make it Legitimate\n7 ? The Old Mob and The New\n\nRunning Time: 6 hours\nAudio: Mono\n\nTech specs (times 7):\n\nGeneral #0 \nFileSize/String : 301 MiB \nFormat/String : Audio Video Interleave \nOveralBitRate/String : 834 Kbps \nPlayTime/String : 50mn 22s \n\nVideo #0 \nCodec/String : DivX 5 \nCodec/Info : DivX 5.0 \nBitRate/String : 773 Kbps \nWidth : 720 \nHeight : 576 \nAspectRatio/String : 4/3 \nFrameRate/String : 25 fps \nBits/(Pixel*Frame) : 0.075 \n\nAudio #0 \nCodec/String : MPEG1/2 L3 \nCodec/Info : MPEG1 or 2 Audio Layer 3 \nBitRate/String : 48 Kbps \nChannel(s)/String : 2 channels \nSamplingRate/String : 24 KHz \n\n===============================================================================\nLearn the true nature of the world, come visit our huge dedicated e-library and forums @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n===============================================================================","torrent":{"xt":"urn:btih:6ed268025fab1164c132c35e60813e9cbe9934c9","amp;dn":"Crime+Inc+-+The+True+Story+of+the+Mafia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ed268025fab1164c132c35e60813e9cbe9934c9","infoHashBuffer":{"type":"Buffer","data":[110,210,104,2,95,171,17,100,193,50,195,94,96,129,62,156,190,153,52,201]},"announce":[],"urlList":[]}}