{"title":"Kamikaze - Japan's Suicide Gods (Malestrom)","uid":4756826,"size":4395927,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6eeda298741e08dad789fe8c472490494deb4861&amp;dn=Kamikaze+-+Japan%5C%27s+Suicide+Gods+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1236506581,"description":" &lt;a href=&quot;http://www.image-upload.net/images/gwik52m5u6akxrzuftbh.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/gwik52m5u6akxrzuftbh.jpeg&lt;/a&gt;\n\nAlbert Axell - Kamikaze: Japan's Suicide Gods\nLongman | 2002 | ISBN: 058277232X | Pages: 296 | PDF\n\nThe untold story of the Kamikaze pilots, a remarkable piece of military history and one of the most dramatic developments of World War II.\n\n* Gripping real-life stories of life &amp; death.\n* Contains original material, interviews and new sources including excerpts from a never-before published suicide manual.\n* Reports on survivors who have lived to tell the tale of the Second World War.\n\nThe use of Kamikaze pilots was one of the most dramatic and chilling developments of the Second World War. But who were the kamikaze pilots and what motivated them to give the ultimate sacrifice? Why was the practice initiated by the Japanese air force? This is the untold story of a remarkable development in military and world history. In this gripping account, Albert Axell explains that Kamikaze pilots were part of the national military policy of Japan during the 2nd World War. He writes that Japanese Vice Admiral Takashiro Ohnishi noted that the most effective way to inflict damage to warships was to crash planes into them. Those attacks took the American fleet completely by surprise - they were bewildered by the suicide missions and completely unable to comprehend the mentality behind them. We learn, however, that the call for kamikaze pilots drew a staggering response, with three times as many volunteers for suicide flights as the number of planes available. Kamikaze: The Untold Story sheds light on the world of the Kamikaze pilots, where they came from, what they were thinking about, how they looked at life and death, what they did in their last hours.\n\nAlbert Axell has done historical research in China, Japan, Mongolia and Russia and has written several books about these countries (including 'Russia's Heroes' and 'Stalin's War'). He also observed the Vietnam War as a journalist. During the Cold War years he met John F. Kennedy, Richard Nixon, and Brezhnev and has met thirty of Stalin's surviving generals.","torrent":{"xt":"urn:btih:6eeda298741e08dad789fe8c472490494deb4861","amp;dn":"Kamikaze+-+Japan%5C%27s+Suicide+Gods+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6eeda298741e08dad789fe8c472490494deb4861","infoHashBuffer":{"type":"Buffer","data":[110,237,162,152,116,30,8,218,215,137,254,140,71,36,144,73,77,235,72,97]},"announce":[],"urlList":[]}}