{"title":"Big John Patton - Let 'Em Roll@320","uid":4302147,"size":110471058,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6f3f08602cf8c016149a23033ff777c713a36d5a&amp;dn=Big+John+Patton+-+Let+%5C%27Em+Roll%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alekow1","files":14,"time":1216361036,"description":"In an unusual setting for a groove/soul jazz setting, B3 organist extraordinaire big John Patton creates a band around himself that includes Grant Green, drummer Otis Finch, and vibraphonist Bobby Hutcherson. It&amp;#039;s truly weird to think of vibes on a groove date, but the way Patton&amp;#039;s understated playing works, and the way Green is literally all things to all players, Hutcherson&amp;#039;s role is not only a clearly defined one, but adds immeasurably to both depth and texture on this date. What also makes this possible is the symbiotic relationship between Patton and Green.\nThere is a double groove conscious swing happening on every track here, from the bluesed-out slip and slide of the title track which opens the record to a killer version of Hank Mobley&amp;#039;s &quot;The Turnaround,&quot; which expands the blues vibe into solid soul territory because of Hutcherson&amp;#039;s ability to play pianistically and slip into the funk groove whenever necessary. Green&amp;#039;s deadly in his solo on the track, shimmering arpeggios through Patton&amp;#039;s big fat chords and chunky hammering runs.\nAlso notable are Patton&amp;#039;s own tunes, the most beautiful of which is &quot;Latona,&quot; a floating Latin number with a killer salsa rhythm in 6/8. As Patton vamps through the chorus, Green slips in one of his gnarliest solos ever. It begins with a groove like run in the hard bop blues and then shoves itself into overdrive, capturing the cold sweat of a Bola Sete or Wes Montgomery in his groove years. But when Green goes for the harmonic edges, all bets are off: Hutcherson lays out, and he and Patton go running to the bridge and bring the melody back just in time to take it out.\nThis is one of the least appreciated of Patton&amp;#039;s records, and there&amp;#039;s no reason for it; it is great. (AMG)\n\n\n01. Let&amp;#039; Em Roll\n02. Latona\n03. The Shadow Of Your Smile\n04. The Turnaround\n05. Jakey\n06. One Step Ahead\n\n\nDrums - Otis Finch\nGuitar - Grant Green\nOrgan - John Patton\nVibraphone [Vibes] - Bobby Hutcherson\n\nProducer - Alfred Lion\nRecorded By [Recording By] - Rudy Van Gelder\nLabel: Blue Note\nReleased: 11 Dec 1965\n\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\nEnjoy,Seed and Share","torrent":{"xt":"urn:btih:6f3f08602cf8c016149a23033ff777c713a36d5a","amp;dn":"Big+John+Patton+-+Let+%5C%27Em+Roll%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f3f08602cf8c016149a23033ff777c713a36d5a","infoHashBuffer":{"type":"Buffer","data":[111,63,8,96,44,248,192,22,20,154,35,3,63,247,119,199,19,163,109,90]},"announce":[],"urlList":[]}}