{"title":"Marcia Luyten - Ziende blind. NL Ebook. DMT ","uid":9849161,"size":646348,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f45c6144eda3d056acff319432fcb49343340c2&amp;dn=Marcia+Luyten+-+Ziende+blind.+NL+Ebook.+DMT+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BiWild","files":-1,"time":1396126174,"description":"Marcia Luyten - Ziende blind. NL Ebook. DMT \n\nAfbeelding\n\nAuteur: Marcia Luyten \nPagina's: 190\nTaal: Dutch/Nederlands\nUitgever: Fosfor\nJaar van uitgifte: 2013\nGenre: Overigen\n\nSamenvating\n\nZoals zij ooit als buitenlander een boek schreef over het Afrika waar zij woonde (`Witte geef geld), zo schrijft Marcia Luyten na terugkomst \nover het Nederland dat zij aantreft: met dezelfde verwondering van de betrokken buitenstaander. Haar oog voor zowel het menselijk detail \nals het maatschappelijk verband doet haar dingen zien waar wij vaak niet bij stilstaan. Op de deur van haar favoriete sauna bijvoorbeeld is \neen plakkaat gespijkerd: `kijken heet voortaan seksuele intimidatie. Een vreemde waarschuwing, vindt Luyten. Dit is een krakerssauna en \nde vrije en anarchistische mens heeft een hekel aan regels. Wat is hier misgegaan? Het brengt haar tot een beschouwing over de jaren zestig, \nniet als schuldige, maar als bron van geluk - alleen moet de revolutie van toen hoognodig worden afgemaakt. Wat in de sauna is gebeurd, \nziet Luyten ook in andere domeinen: we raken minder bedreven in de hogere kunst van vrijheid en welvaren. De hele samenleving krijgt in \ntoenemende mate te kampen met onzekerheid en wantrouwen. In de economie is het langetermijnperspectief verruild voor dagkoersen. \nHet nieuws - en daarmee ook het wereldbeeld - raakt versplinterd door talloze blogs en satellietzenders.Bestuurders laten zich vorstelijk \nbelonen met publiek geld en in de politiek draait het om personen in plaats van partijen. En als politici dan ook nog het spel bederven \nen democratische instituties verraden, dan daagt er een patroon - een patroon dat Marcia Luyten maar al te goed kent\n\nMet dank aan de originele poster !! \n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:6f45c6144eda3d056acff319432fcb49343340c2","amp;dn":"Marcia+Luyten+-+Ziende+blind.+NL+Ebook.+DMT+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f45c6144eda3d056acff319432fcb49343340c2","infoHashBuffer":{"type":"Buffer","data":[111,69,198,20,78,218,61,5,106,207,243,25,67,47,203,73,52,51,64,194]},"announce":[],"urlList":[]}}