{"title":"Dreamweaver CS5.5-Designing and Developing for Mobile with jQuer","uid":6604629,"size":8684224,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f965d63efe1a26f9c616acdd13701267d41f007&amp;dn=Dreamweaver+CS5.5-Designing+and+Developing+for+Mobile+with+jQuer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1313345308,"description":"Learn to use Dreamweaver CS5.5 to create Web pages for mobile devices using modern technologies like HTML5, CSS3, and jQuery\n\n    * Teaches best practices for optimizing sites to be viewed on a range of devices from desktops to mobile phones, and covers all the main new features in the latest version of Adobe Dreamweaver.\n    * Detailed coverage of jQuery Mobile, the new JavaScript and CSS framework for mobile web development.\n    * Written by prolific author and Adobe Certified Instructor David Powers.\n\nWith the launch of Adobe CS5.5, Adobe is focusing on new tools to develop websites for multiple platforms with HTML, CSS, and JavaScript in Dreamweaver CS5.5. In particular, Dreamweaver engineers have been working closely with the developers of jQuery, the de-facto standard JavaScript framework, to develop jQuery Mobile. This is a new JavaScript/CSS framework designed to create websites and applications that work consistently in all major mobile platforms, including iPhone, Android, BlackBerry, and Symbian. This book explores in depth the integration of jQuery Mobile in Dreamweaver, together with other new features aimed at building websites that work across multiple devices. Using a series of practical examples, the book will show how to optimize an existing website for display in desktops, tablets, and mobile phones, using CSS media queries. Readers will also learn how to create a dedicated mobile site using jQuery Mobile. The book will explain the structure of jQuery Mobile websites and web applications, so that developers can go beyond the basics to add custom functionality and design features. The book will also utilize the core jQuery framework, demonstrating how the new jQuery code hinting in Dreamweaver CS5.5 speeds up the development process for experienced developers and acts as a learning aid for those new to jQuery.\n                                               \n\n\n****************************Please Seed So Others May Benefit**********************\n\n*********************************** Thank You************************************","torrent":{"xt":"urn:btih:6f965d63efe1a26f9c616acdd13701267d41f007","amp;dn":"Dreamweaver+CS5.5-Designing+and+Developing+for+Mobile+with+jQuer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f965d63efe1a26f9c616acdd13701267d41f007","infoHashBuffer":{"type":"Buffer","data":[111,150,93,99,239,225,162,111,156,97,106,205,209,55,1,38,125,65,240,7]},"announce":[],"urlList":[]}}