{"title":"Nashville - Robert Altman (1975)","uid":5597258,"size":8447741435,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6fcc5fbe27576b570213c6ffcb705ab8d5d1d179&amp;dn=Nashville+-+Robert+Altman+%281975%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"mfccorrea","files":27,"time":1275078612,"description":"Plot Synopsis, by Lucia Bozzola (from allmovie)\n\nFollowing 24 characters through 5 days in the country music capital, Robert Altman's 1975 epic presents a complexly textured portrayal (and critique) of American obsessions with celebrity and power. Among the various stars, aspirants, hangers-on, observers, and media folk are politically ambitious country icon Haven Hamilton (Henry Gibson) and his fragile star protegÃƒÂ©e Barbara Jean (Ronee Blakley); Tom (Keith Carradine), a self-absorbed rock star who woos lonely married gospel singer Linnea Reese (Lily Tomlin); Sueleen Gay (Gwen Welles), a talentless waitress painfully humiliated at her first singing gig; Albuquerque (Barbara Harris), a runaway wife with dreams of stardom; nightclub owner Lady Pearl (Barbara Baxley), who reminisces about &quot;those Kennedy boys&quot;; single-minded groupie L.A. Joan (Shelley Duvall); vapid BBC commentator Opal (Geraldine Chaplin); and campaign guru John Triplette (Michael Murphy), who is trying to organize a concert rally for the unseen but always heard populist presidential candidate-cum-demagogue Hal Phillip Walker. Everything comes to a head during a climactic concert at Nashville's replica of the Parthenon temple, as the entertainment-hungry audience is momentarily woken out of its stupor by unexpected violence, only to be lulled into a restorative sing-along to &quot;It Don't Worry Me.&quot; \n\n IMDb.............: http://www.imdb.com/title/tt0073440/\n Year.............: 1975\n Country..........: USA\n Runtime..........: 160 Minutes\n Audio............: English (DD 5.1 Dolby)\n Subtitles........: English, Spanish (custom), Portuguese (custom)\n Video Format.....: NTSC\n Aspect Ratio.....: 2.35:1\n DVD Source.......: DVD9\n DVD Distributor..: Paramount (Release Date: August 15th, 2000)\n\nPosted originally at Cinematik by elhippie, whom I thank for the opportunity of having this film with Portuguese subtitles (the DVD was never released in Brazil; I donÃ‚Â´t know about Portugal).","torrent":{"xt":"urn:btih:6fcc5fbe27576b570213c6ffcb705ab8d5d1d179","amp;dn":"Nashville+-+Robert+Altman+%281975%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fcc5fbe27576b570213c6ffcb705ab8d5d1d179","infoHashBuffer":{"type":"Buffer","data":[111,204,95,190,39,87,107,87,2,19,198,255,203,112,90,184,213,209,209,121]},"announce":[],"urlList":[]}}