{"title":"The People's Post (BBC Radio 4 Documentary)","uid":6909766,"size":96848832,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:70282efdbc3bee6aa8a544925e596f11dfb1548c&amp;dn=The+People%5C%27s+Post+%28BBC+Radio+4+Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fakeplastictrousers2","files":-1,"time":1324742416,"description":"The People's Post\n\nFrom BBC Radio 4. Written and Presented by Dominic Sandbrook.\n\nThroughout its history, the Post Office has been a consistently progressive and democratising force in society. Launched in 1516 by Henry VIII, the Royal Mail was intended to support official communications and bolster intelligence. It was only a rise in literacy, trade and interest that stimulated a demand for a public service.\n\nIt became a vehicle for literacy, free speech, commerce and communications in the eighteenth and nineteenth centuries, before evolving into a kind of prototypical welfare state in the early twentieth century, when it was the largest employer in the world. The Post Office has become a cherished social institution, linking people together and extending their vision outward into the wider world.\n\nIt's called Royal Mail but it should be known as the People's Post.\n\nEpisode 1: The Secret Room\n\nDuring the English Civil War, agents opened and copied letters from suspected dissidents.\n\nEpisode 2: The London Penny Post\n\nPenny Post was the first accessible and cheap method for sending mail within the capital.\n\nEpisode 3: A Culture of Letters\n\nDuring the 18th century, an expanding postal network offered new possibilities.\n\nEpisode 4: The Mail Coach\n\nIntroduced in 1784, the mail coach slashed journey times by two thirds.\n\nEpisode 5: Freepost\n\nIn the early 1800s, the post office operated an expensive and illogical payment system.\n\nEpisode 6: The Penny Black\n\nThe arrival of Universal Penny Postage in 1840.\n\nEpisode 7: Business Post\n\nThanks to cheap postage, businesses could advertise and interact with people more directly.\n\nEpisode 8: Love Letters\n\nThe role of love letters in the history of the Post Office.\n\nEpisode 9: A Community Hub\n\nFrom 1862, the Post Office Savings Bank offers savings accounts to poorer people.\n\nEpisode 10: The Postal Worker's Strike\n\nThe industrial action of the postmen in 1890.\n\nEpisode 11: The Telegrath\n\nIn 1870, the telegraph system came under the control of the post office.\n\nEpisode 12: The Post Office at War\n\nIn 1914, the post office was called upon to play a vital role in the country's war effort.\n\nEpisode 13: A Job in a Million\n\nIn the 1930s, the GPO was a model employer, offering staff a secure career path.\n\nEpisode 14: The Post Code\n\nWhen a national postcode system was introduced in the 1970s, it met with fierce resistance.\n\nEpisode 15: The Last Post\n\nAs it sits on the brink of privatisation, what does the Royal Mail mean today? ","torrent":{"xt":"urn:btih:70282efdbc3bee6aa8a544925e596f11dfb1548c","amp;dn":"The+People%5C%27s+Post+%28BBC+Radio+4+Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70282efdbc3bee6aa8a544925e596f11dfb1548c","infoHashBuffer":{"type":"Buffer","data":[112,40,46,253,188,59,238,106,168,165,68,146,94,89,111,17,223,177,84,140]},"announce":[],"urlList":[]}}