{"title":"Louisiana Red Millennium Blues(blues)(mp3@320)[rogercc]","uid":7070799,"size":145131520,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:703d374de04cc1c88ba95acbb8bac8b40cf26e0b&amp;dn=Louisiana+Red+Millennium+Blues%28blues%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":13,"time":1330649337,"description":"Louisiana Red  Millennium Blues\nReleased: 1999\nLabel: Earwig \nFormat: Mp3@320\n\nIt's an event when Iverson Minter (aka Louisiana Red) puts out a recording, but even rarer a date that has Willie &quot;Big Eyes&quot; Smith, an exceptional blues drummer, wailin' on the harmonica! Add bassist Willie Kent, keyboardist Allen Batts, drummer Dave Jefferson, and second guitarist Brian Bisesi for an excellent blues crew. In the middle is Red's gruff vocal and simple, loping guitar, the catalyst for the fireworks on this authentic roots and contemporary Chicago-style blues CD. These are mostly personal songs, reflecting the tragedy and sorrow of Red's childhood, and the injustice of the current world we live in. The first piece, &quot;Red's Vision,&quot; speaks of the President's impeachment, churches burning, and memories of Muddy Waters and Lightnin' Hopkins. &quot;That Detroit Thing&quot; recalls his time in the Motor City. &quot;Arlene Blues&quot; asks &quot;what kinda gal are you?&quot; Then you have good-time tunes like &quot;Let Me Be Your Electrician&quot; so &quot;I can turn your power on.&quot; There are three instrumentals, the easygoing swing of &quot;Red's Jazz Groove,&quot; the &quot;Killin' Floor&quot;-like &quot;Texas Jump,&quot; and the Muddy Waters ramblin' rock of the title track. In the middle of the program is an acoustic guitar and vocals-only autobiographical section, with songs about being in an orphanage, a story about old squeeze &quot;Leechie Geddens,&quot; and the tale of running away and being &quot;Home in a Rock.&quot; These are more in the Leadbelly to Mississippi Fred McDowell bag, and an intriguing change of pace. Red sounds good, the band sounds good, Smith is a surprisingly good harmonica player, and there's no reason why blues fans everywhere won't get next to this CD by a man who intimately knows the blues from a deep, personal perspective, and is not shy about telling you how he feels.\n\nTracklist:\n\n1. Red's Vision\n2. Play on Your Harp \n3. Let Me Be Your Electrician \n4. Red's Jazz Groove\n5. Too Poor To Die \n6. Red's Childhood Memories\n7. Orphanage Home Blues \n8. Leechie Geddens\n9. Got A Home In That Rock\n10. Arlene Blues\n11. Texas Jump \n12. That Detroit Thing \n13. Millennium Blues \n\nRecording information: Hot Ham 'N Cheese Recording Stu (11/07/1998/11/08/1998).\n\nLouisiana Red - Lead Guitar, Solo Acoustic Guitar, Vocals\nAllen Batts - Electric Piano\nBrian Bisesi - Rhythm and Lead Guitar\nWillie Kent - Bass\nDave Jefferson - Drums\nWillie 'Big Eye' Smith - Harmonica tr.5\n\nRIP Iverson Minter AKA Louisiana Red March 23rd, 1932- to February 25, 2012.\nIt is with a heavy heart that we report the passing of one of the greatest and most beloved traditional blues artists. Louisiana Red died on February 25th in a hospital in Germany. He was 79. Louisiana Red was a powerful downhome blues artist who could channel his teachers (among them Muddy Waters, Elmore James, Robert Nighthawk, Lightnin' Hopkins and John Lee Hooker) into his own heartfelt musical conversation, delivered with such moving passion and honesty that it would leave his audiences indelibly touched. He was fine singer with a distinctive voice, and an amazing guitarist who could play all of the traditional blues styles and excelled as one of the world's greatest slide guitarists. He could create moods and textures, both musically and spiritually, and had the ability of falling so deep into his own songs that he would go to tears, making his audience cry with him. That was the gift of this great artist.\n\n","torrent":{"xt":"urn:btih:703d374de04cc1c88ba95acbb8bac8b40cf26e0b","amp;dn":"Louisiana+Red+Millennium+Blues%28blues%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"703d374de04cc1c88ba95acbb8bac8b40cf26e0b","infoHashBuffer":{"type":"Buffer","data":[112,61,55,77,224,76,193,200,139,169,90,203,184,186,200,180,12,242,110,11]},"announce":[],"urlList":[]}}