{"title":"Jack.of.all.Tribes.v1.0.DC20110303-OUTLAWS","uid":6259037,"size":135529782,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:705bd01516a5852a26d2fdf54d09504146492427&amp;dn=Jack.of.all.Tribes.v1.0.DC20110303-OUTLAWS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MAFIAA.","files":30,"time":1300689070,"description":"GAME ......... Jack of all Tribes v1.0 DC20110303\nLANGUAGE ..... ENGLISH\nDEVELOPER .... DivoGames\nDISKS ........ 28\nDATE ......... 20/03/2011\nGENRE ........ GAME\nPROTECTION ... Armadillo\nRiPPED ....... NOthing\n\n\n\nDivogames, the developer of &quot;Be Rich&quot; games, invites you to\nthe primeval world to unveil its secrets The story begins when\nJack comes to an amusement park to ride a new attraction called\n&quot;Tunnel of Destiny&quot;. When he enters the tunnel in a railcar,\neverything goes wrong The railcar stops in the darkness. Jack\nruns out of patience and begins to press all buttons and levers,\ntrying to move it. Suddenly the railcar dashes out of the tunnel,\nfalling down into a deep lake. Shocked, Jack sees shaggy members\nof a primitive tribe. It is a real time travel\n\nJudging by Jacks unusual looks, the tribes chief decides that\nthe young man is the redeemer predicted by the Great Shaman. The\nprophecy says that the redeemer will free the tribes from the\noppressive domination of the Dumbheads. Now Jack must follow the\ninstructions given in the prophecy and find all hidden artifacts\n- otherwise he will never return home\n\nBesides the fascinating plot, Jack of all Tribes features a very\noriginal gameplay. It is strategy-based, but includes challenging\nHidden Object mini-games. Jack explores the mapped territory,\nvisiting several dwelling sites one by one and meeting a lot of\nvarious non-player characters. They give him unique tasks or useful\ntips, thus helping him in his mission. Tribe members fulfill Jacks\norders, but they also have their own demands, which Jack should\ntake into account, as happy people move much faster and work more\nefficiently. Their emotions and needs are indicated by small icons\nabove the heads\n\nSometimes Jack finds anomalies where he has to complete Hidden\nObject tasks, collecting scattered artifacts from the future. Some\nof them will prove useful - e.g., sneakers increase the workers\nspeed by 15\n\nJack of all Tribes guarantees you hours of fun and entertainment\nBy the way, both children and adults will surely enjoy the\ncolorful graphics, sweet background music and Jacks witty comments\n\nFeatures\n\n- Incredible journey to the Stone Age\n- Rule a primitive tribe\n- Collect Hidden Objects to resolve time paradox\n- Meet chieftains and shamans\n- Help Jack return home to the future\n\nURL: http://www.divogames.com\n\nIf you like the game, support the developers and buy it","torrent":{"xt":"urn:btih:705bd01516a5852a26d2fdf54d09504146492427","amp;dn":"Jack.of.all.Tribes.v1.0.DC20110303-OUTLAWS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"705bd01516a5852a26d2fdf54d09504146492427","infoHashBuffer":{"type":"Buffer","data":[112,91,208,21,22,165,133,42,38,210,253,245,77,9,80,65,70,73,36,39]},"announce":[],"urlList":[]}}