{"title":"Chico Buarque de Hollanda - Per un pugno di samba (com Ennio Mor","uid":4659556,"size":36628213,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:70ac1725a3f71ebd68c45745931d8b10b16f4977&amp;dn=Chico+Buarque+de+Hollanda+-+Per+un+pugno+di+samba+%28com+Ennio+Mor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sombarato","files":14,"time":1232328663,"description":"Ano:  1970 \nGravadora:  RCA \nAudio BitRate:  128 KB/s \n \n\nChico Buarque de Holanda e Ennio Morricone &quot;Per un pugno di samba&quot;\n\nNo auto-exÃƒÂ­lio italiano, Chico fez um disco em italiano com o compositor e arranjador Ennio Morricone, famoso pelas trilhas sonoras para filmes como Era um Vez no Oeste e Por Um Punhado de DÃƒÂ³lares (daÃƒÂ­ o trocadilhesco nome do trabalho). Conta Chico: &quot;O Ennio era vizinho do Sergio Bardotti, meu produtor e letrista lÃƒÂ¡ na ItÃƒÂ¡lia. Moravam num condomÃƒÂ­nio suburbano de Roma. Foi o Sergio quem me levou a casa do Ennio, que escreveu os arranjos&quot; - uma coisa de prestÃƒÂ­gio. &quot;Era tentativa da RCA italiana de me vender lÃƒÂ¡. NÃƒÂ£o aconteceu nada com o disco, na verdade.&quot;\nNÃƒÂ£o aconteceu atÃƒÂ© porque Chico voltou para o Brasil e lanÃƒÂ§ou aqui o seu quarto disco (seria o quinto, se esse italiano estivesse contando na discografia oficial). Os trÃƒÂªs primeiros saÃƒÂ­ram peLa RGE; o quarto, pela Phillips (hoje, Universal). E o italiano, pela RCA (hoje, BMG). Havia, portanto, problemas de direitos. Mas foi um trabalho feito com cuidado. As letras foram vertidas para o italiano por Chico e Bardotti. &quot;Eu jÃƒÂ¡ estava na ItÃƒÂ¡lia havia algum tempo, de modo que pude dar palpites nas versÃƒÂµes&quot;, conta o compositor.\nMuito bem, o disco foi esquecido. Ate hÃƒÂ¡ bem pouco, nem mesmo Chico tinha um exemplar dele. Em 2003, finalmente, a BMG brasileira resgatou o tesouro e lanÃƒÂ§ou o trabalho em CD, com Sogno di un Carnevale, Funerale di un Contadino, enfim, mÃƒÂºsicas do repertÃƒÂ³rio dos trÃƒÂªs primeiros discos brasileiros de Chico. Mas ele tinha outras, prontas, que fariam parte de seu quarto disco por aqui e que, afinal, foram lanÃƒÂ§adas antes em italiano. SÃƒÂ£o elas: Nicanor, NÃƒÂ£o Fala de Maria e Samba e Amor.\nOs arranjos de Morricone nÃƒÂ£o casam muito bem com a mÃƒÂºsica de Chico, mas Per un Pugno di Samba tem o sabor curioso da raridade e completa a historia fonogrÃƒÂ¡fica do artista. Por muitos anos, foi um dos discos mais disputados no mercado paralelo brasileiro, com as cÃƒÂ³pias em vinil valendo pequenas fortunas.\n\nTodas as composiÃƒÂ§ÃƒÂµes de Chico Buarque com adaptaÃƒÂ§ÃƒÂ£o de Bardotti com exceÃƒÂ§ÃƒÂ£o de:\n&gt;Funerale di un contadino (Funeral de um lavrador) Panvini - Rosati - Bardotti - J.Cabral de Melo de Neto - Chico Buarque; \n\n&gt;In memoria di un congiurate (Tema dos Inconfidentes) Cecilia Meireles - Bardotti - Chico Buarque\n\nfonte: http://www.chicobuarque.com.br\n\nLista das MÃƒÂºsicas: \n\n1- Rotativa (Roda viva)\n2- Samba e amore (Samba e amor)\n3- Sogno di un carnevale (Sonho de um carnaval)\n4- Lei no, lei sta ballando (Ela desatinou)\n5- Il nome di Maria (NÃƒÂ£o fala de Maria)\n6- Funerale di un contadino (Funeral de um lavrador)\n7- In te (Mulher, vou dizer quanto te amo)\n8- Queste e quelle (Umas e outras)\n9- Tu sei una di noi (Quem te viu, quem te vÃƒÂª)\n10- Nicanor\n11- In memoria di un congiurate (Tema dos Inconfidentes)\n12- Ed ora dico sul serio (Agora falando sÃƒÂ©rio)","torrent":{"xt":"urn:btih:70ac1725a3f71ebd68c45745931d8b10b16f4977","amp;dn":"Chico+Buarque+de+Hollanda+-+Per+un+pugno+di+samba+%28com+Ennio+Mor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70ac1725a3f71ebd68c45745931d8b10b16f4977","infoHashBuffer":{"type":"Buffer","data":[112,172,23,37,163,247,30,189,104,196,87,69,147,29,139,16,177,111,73,119]},"announce":[],"urlList":[]}}