{"title":"Near Death Experiences and trip`s to HELL And Back Doc. 2009:","uid":5328707,"size":1285592135,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:71b559e7e178a0066d633ca905849d0055b0554d&amp;dn=Near+Death+Experiences+and+trip%60s+to+HELL+And+Back+Doc.+2009%3A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mardu33","files":29,"time":1265104349,"description":"Near Death Experiences and trip`s to HELL And Back Documentary 2009:\n\n\nMOVIES INFO\nTitles................................: \t\n\n23 Minutes in Hell by Bill Wiese:\nTo Hell and Back - Dr. Maurice Rawlings\nTyrone went to Hell\nGod's Wrath is Hell\nA Glimpse of Eternity - by Ian McCormack\nDon Piper - 90 Minutes in Heaven\nIt s Supernatural - Mickey Robinson\n\t\t\t\t\t\n\t\t\t\t\t\n\n\nVideo Format.........................: wmv / divx\nSource...............................: DVD\nLanguage.............................: English\nGenre................................: Dokumentary\nRelease Date.........................: 7/2009\nMPAA Rating..........................: None\nSubtitles............................: None\n\nAspect Ratio.........................: Fullscreen\nRuntime..............................: 05:03:00\n(1:03:00, 1:28:58, 0:15:57, 0:13:56, 0:40:54, 0:56:55 , 0:26:04)\n\nFile Size............................: 1.19 GB\n\nPLOT SUMMARY:\nDocumentary on Near Death Experiences and trip`s to HELL And Back:\n(+ 2 Heaven Videos)\n\n23 Minutes in Hell by Bill Wiese:\n---------------------------------\nBill Wiese saw the searing flames of hell, felt total isolation, and experienced \nthe putrid and rotting stench, deafening screams of agony, terrorizing demons, \nand finally, the strong hand of God lifting him out of the pit. Bill was placed \nin Hell not as a casual observer, but as someone who was not saved. He recounts \nall the horrid details with such precision that it captivates the listener \nfrom start to finish. His soul was returned to his earthly body with a warning \nand message for all.\n\nTo Hell and Back - Dr. Maurice Rawlings:\n----------------------------------------\nDr. Maurice Rawlings, MD, a heart surgeon, has written a number of books on the death experience and clearly shows from his own practice and from the experiences of his patients, that not everyone goes to the light when they die, where there is total love.  \nMany of his patients, after being resuscitated on the operating table, spoke about hell.\n\n\nTyrone went to Hell:\n--------------------\nThis is a &quot;True Life after Death Story&quot; of an individual who lost his right arm in a car accident then flat-lined. Watch and listen Tyrone tell his own experience while in hell.\n\nGod's Wrath is Hell:\n--------------------\nWatch and try to imagine people you know who are not saved in these shocking scenes. In this story, you will see a woman die and be cast into Hell. After watching the entire video, you should begin to grasp the horrors that await all those who are foolish enough to go to Hell.\n\n&quot;A Glimpse of Eternity&quot; - by Ian McCormack:\n-------------------------------------------\nA Glimpse of Eternity One man?s encounter with death and the realms beyond it. \nWhat happens to us when we die?  ?A Glimpse of Eternity? is the incredible true \nstory of one man?s encounter with death and the world beyond it. Stung by five box \njellyfish while diving off the coast of Mauritius, Ian later died in hospital \nfor between 15-20 minutes. During this time he experienced hell and heaven and \ncame back to tell the story! Dying was his doorway to true life and his story \nis still transforming lives around the world as it touches on some of the \ndeepest questions we all eventually ask.\n\nDon Piper - 90 Minutes in Heaven:\n---------------------------------\nAs he is driving home from a minister's conference, Baptist minister Don Piper \ncollides with a semi-truck that crosses into his lane. He is pronounced dead at the scene. For the next 90 minutes, Piper experiences heaven where he is greeted by those who had influenced him spiritually. He hears beautiful music and feels true peace. Back on earth, a passing minister who had also been at the conference is led to pray for Don even though he knows the man is dead. Piper miraculously comes back to life and the bliss of heaven is replaced by a long and painful recovery. \nFor years Piper kept his heavenly experience to himself. Finally, however, \nfriends and family convinced him to share his remarkable story.\n\n90 Minutes in Heaven offers a glimpse into a very real dimension of eternity. \nIt encourages those recovering from serious injuries and those dealing with the \nloss of a loved one. The experience dramatically changed Piper's life, \nand it will change yours too.\n\nIt s Supernatural - Mickey Robinson:\n------------------------------------\nAfter surviving severe burns resulting from an airplane crash while skydiving, \nMickey Robinson had a &quot;Death's Door&quot; experience and spiritual rebirth that \nradically changed his life. During the long period of time required to recover, \nhe not only received several miraculous healings, but also struggled with finding \nhis purpose in life.\t\t","torrent":{"xt":"urn:btih:71b559e7e178a0066d633ca905849d0055b0554d","amp;dn":"Near+Death+Experiences+and+trip%60s+to+HELL+And+Back+Doc.+2009%3A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71b559e7e178a0066d633ca905849d0055b0554d","infoHashBuffer":{"type":"Buffer","data":[113,181,89,231,225,120,160,6,109,99,60,169,5,132,157,0,85,176,85,77]},"announce":[],"urlList":[]}}