{"title":"Broken Social Scene - Bee Hives [24 bit FLAC] vinyl","uid":8291903,"size":1088618184,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:728a72e8a0f76734f2ae7097bc66a7f790f4be62&amp;dn=Broken+Social+Scene+-+Bee+Hives+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"24.96","files":-1,"time":1364063603,"description":"  Broken Social Scene - Bee Hives (2004) [24 bit FLAC] vinyl\n\n  Released: 2004\n  Source: A&amp;C 006 / Canada\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. (Untitled) \n  A2. Market Fresh \n  A3. Weddings \n  A4. Hallmark \n  A5. Backyards \n  B1. Da Da Da Da \n  B2. Ambulance For The Ambience \n  B3. Time = Cause \n  B4. Lover's Spit \n\n  It wasn't until Toronto's Arts &amp; Crafts label released Broken Social Scene's You Forgot It in People in early summer 2003 that the band's experimental indie pop caught on in America. A Juno Award for best alternative album and a successful North American tour later, Broken Social Scene issue a delightful collection of B-sides, Bee Hives. Recorded for their friends, the nine-song selection is essentially an album of instrumentals; however, it captures different shades and moods of the band's thus-far five-year career quite nicely. The twangy banjo licks of &quot;Backyards&quot; were specially recorded as a project for one of Broken Social Scene's friends in art school. Brendan Canning, Charles Spearin, Kevin Drew, and the wispy vocals of Emily Haines had to have helped their friend earn a top grade, for the dreamy soundscape that is &quot;Backyards&quot; is surely a standout in the band's catalog. Dressed in a hushing mix of guitars, organs, and synth beats, &quot;hHallmark&quot; and &quot;Ambulance for the Ambience&quot; are two charming tracks recorded in between Feel Good Lost and You Forgot It in People. The listener should sense Broken Social Scene's earnest approach in experimenting with their lo-fi-induced style of sound throughout Bee Hives; therefore, the distinctive arrangement of each song will be as interesting as each one unfolds. &quot;Time = Cause,&quot; which coincided with the U.K. single for &quot;Stars and Sons,&quot; is a song like that. It explores more of a dark-colored side to the band's typically glossy pop. Backing vocals are ghostly while strings and electronic rhythms are nearly colorless. That's not to say Bee Hives is mostly unspirited; there's a calmer spirit lingering around Broken Social Scene. The lush version of &quot;Lover's Spit&quot; that's included on You Forgot It in People is stripped down to just a piano. It hurts so much more, mostly due to the beautifully aching lead vocals from Leslie Feist, but in the way that's positively affecting. If you want to single out one stunning moment, that's the one. It cushions Bee Hives for the wonder that it is.","torrent":{"xt":"urn:btih:728a72e8a0f76734f2ae7097bc66a7f790f4be62","amp;dn":"Broken+Social+Scene+-+Bee+Hives+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"728a72e8a0f76734f2ae7097bc66a7f790f4be62","infoHashBuffer":{"type":"Buffer","data":[114,138,114,232,160,247,103,52,242,174,112,151,188,102,167,247,144,244,190,98]},"announce":[],"urlList":[]}}