{"title":"Kure.Kure.Takora.COMPLETE.DVDRip.XviD-TOBA","uid":3502145,"size":6129278108,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:730cf96efd45eddcb2bbe0016251c02302a9f26d&amp;dn=Kure.Kure.Takora.COMPLETE.DVDRip.XviD-TOBA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Toba","files":-1,"time":1152531368,"description":"\n\n                   &lt;a href=&quot; http://www.kurekuretakora.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.kurekuretakora.com&lt;/a&gt;\n\n\n\n\n....::::: Toba proudly presents to the filesharing community :::::...\n\n\n              Kure.Kure.Takora.COMPLETE.DVDRip.XviD-TOBA\n\n\n\n:ABOUT:\nThis is the complete series of Kure Kure Takora (Gimmie Gimmie Octopus) the\nmessed-up kids program which first appeared on the Japanese Broadcasting\nCorporation's JOCX-TV on October 1st, 1973.\nEvery episode is basically about Kure Kure Takora wanting something that belongs to\nthe other characters and then tries to steal it.\n\nWhile the episodes only run 2 and a half minutes each, you'll be treated to acts of:\n\n\n\n\n* anti-social behaviour (always guaranteed)\n* random violence (guaranteed)\n* cannibalism\n* Love triangles that cross not only species but also plant/animal classifications\n* torture\n* set decorations inspired by Fauvism\n* suicide attempts\n\n\n\n\n\n:INFO:\n\nInfo-link........: http://en.wikipedia.org/wiki/Kure_Kure_Takora\nGenre............: Comedy, Horror, Romance, Action, Insanity.\nSource...........: Ripped off DVD but dont know what the original source is.\nDVD Format.......: NTSC\nDVD Size.........: DVD5\nScreen format....: Fullscreen\nAudio Language...: Japanese\nAudio Format.....: 2.0\nSubtitles........: None (really not needed)\nEpisodes.........: 257 + 1 behind the scenes documentary\n\n\n:STAFF:\n\n* Creator/Planning - Osamu Isono\n* Writers - Shinichi Ichikawa, Hiroshi Kashiwabara, Yuko Kinoshita, Yoshimi Shinozaki, Yuji Watanabe\n* Directors - Katsumune Ishida, Ko Tsuboshima, Tsugunobu Otani\n* Music - Shunsuke Kikuchi\n\n\n\n\n\n:EXTRAS:\n\nOn top of the final episodes of Kure Kure Takora is a short documentary/behind the\nscenes feature. This 8mm documentary contains prototypes of character and set designs,\nconstuction of the costumes and glimpses of the actors who play each of the\ncharacters. This feature is essential for any fan of the show. In Japanese only.\n\n\n\n:HIGHLIGHTS:\n\n* Kure Kure is disgraced and is forced to commit harakari with Debora as his &quot;backup&quot;.\n* Kure Kure and Chonbo work out a scam where they beat the shit out of the other\ncharacters and then charge them exorbitant doctor's fees.\n* Kure Kure uses his Ninjitsu to impersonate other characters in a bid to spring\nChonbo out of jail.\n* Kure Kure and Chonbo take over To Ro Ro's spiritual medium/fortune teller business\n(ie. they beat the shit out of him and take his business) with disastrous results.\n* Biragon snaps! After Kure Kure and Chonbo attempt to steal his marbles, he captures\nChonbo and threatens to dice him up with his katana.\n* Kure Kure and Chonbo spy on one of the Sea Cucumber Gang dancing around in a grass\nskirt. What next transpires is one of the greatest battle royales in the show's\nhistory where nearly every character wants in on the grass skirt!\n* Kure Kure and Chonbo find a fire extinguisher and go around spraying everyone's\nfood with it causing some of the villagers to get upset with them.\n* Debora decides to run a remedial math class for the village but he finds keeping\ndiscipline in the classroom to be a problem.\n* Kure Kure sniffs too much incense at Debora's church and he begins to hallucinate\nabout what married life with Monro might be like.\n* Kure Kure proves once and for all that cowboys are tougher than samurais.\n* Kure Kure begins cross-dressing in an attempt to impress the other villagers, but\nhe's punished for gender transgression.\n* To Ro Ro uses a magic lantern to produce a robot servant. Behind Kure Kure's back,\nChonbo steals the lantern and gets the robot to do his laundry for him.\n\n\n\n\nGetting to know the gang from Kure Kure Takora :\n\n\n\n\nKure Kure Takora.\n\nFact: His best-friend is a weak-willed squash* although he has no problems about\nleaving him for dead if he has to make a fast getaway.\nFact: Like everyone else in the world, he's in love with a fickle pink walrus.\nFact: Kure Kure Takora employs a type of Ninjitsu where he can turn into anything\nfrom a dopey iguana to a vacuum cleaner to a guitar.\nFact: Kure Kure Takora's greatest fear is being doused with vinegar and being\nserved as Sudako (pickled octopus).\n\n\n\n\n\nChonbo.\n\nFact: Kure Kure Takora's best friend and toadie.\nFact: Is a squash-humanoid of the genus cucurbita, who is able to cough up coins for\nvending machines at will.\nFact: Although he is complicit in many of Kure Kure's schemes, he's just as often on\nthe receiving end of Kure Kure's abuse.\nFact: Very mobile for a squash, Chonbo is often seen somersaulting and tumbling.\n\n\n\n\n\nTo Ro Ro.\n\nFact: Is a short jellyfish who squawks like Flipper.\nFact: Is able to spray vinegar out of the top of his head via a sprinkler (?!).\nKure Kure often attempts to neutralize this super power (Kure Kure is deadly\nafraid of vinegar) by throwing hats on his head.\nFact: Can turn invisible and teleport at will.\nFact: Is even a bigger trouble-maker than Kure Kure Takora, and most of the other\ncharacters are frightened of him.\n\n\n\n\n\nMonro.\n\nFact: Is pink walrus with a breathy voice and sexy theme music.\nFact: Acts as the female McGuffin, or little object a, that all the other male\ncharacters pursue.\nFact: Often demands unreasonable things from her suitors before she loses interest\nin them.\nFact: Has been romantically involved with every creature (even the repellent sea\ncucumber gang) on the show.\n\n\n\n\n\nDebura.\n\nFact: A rotund badger who is often seen chewing on the stub of a cigar.\nFact: This tough cop runs the local jail.\nFact: He's the only character who wears clothes* gun belt, holster, truncheon, and\nsometimes a helmet.\n\n\n\n\n\nBiragon.\n\nFact: A dumb, slow-witted iguana.\nFact: He is extremely lazy and spends most of his time sleeping.\nFact: Maybe the richest character on the show, he often has a new gadget or toy that\nis covetted by Kure Kure.\n\n\n\n\n\nThe Sea Cucumber Gang\n\nFact: Last, and certainly least, is the repellant Sea Cucumber Gang.\nFact: These dummies have their own theme song which they occasionally break in to.\nFact: I believe each of them refer to anger (Ikari), happiness (Hera Hera) and\nsadness (Shiku Shiku).\nFact: The Sea Cucumber Gang are on the very bottom of the hierarchy of the characters,\nand poor Shiku Shiku gets picked on the most!\n\n\n\n\n\nHere's the lyrics to the theme song (and a translation):\n\nKURE KURE KURE\nKUREPPE\nKURYARUKA\nKURYARINKO\nNandemo hoshigaru KUREKURE TAKORA\n\nGimmie Gimmie Gimmie\nScheming win or lose\nScheming little thief (child pickpocket)\nYou?ll do anything to get what you want, Gimmie Gimmie Octopus\n\n\n\nFinal comments:\nHope you like it as much as I did! I got this off a user on a bittorrent site which\nin his place got it off someone else.\nRespect to everyone that made this release possible!\n\nDid you like it? Keep seeding/sharing/distributing it!\n\n\n\n\nScreencaps: &lt;a href=&quot;\nhttp://img207.imageshack.us/img207/7599/bscap0033jj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img207.imageshack.us/img207/7599/bscap0033jj.jpg&lt;/a&gt;\nhttp://img396.imageshack.us/img396/3962/bscap0133qz.jpg\nhttp://img214.imageshack.us/img214/1712/bscap0111hr.jpg\nhttp://img214.imageshack.us/img214/5479/bscap0109ss.jpg\nhttp://img483.imageshack.us/img483/6021/bscap0206gd.jpg\nhttp://img386.imageshack.us/img386/1208/bscap0246hk.jpg\nhttp://img391.imageshack.us/img391/5673/bscap0303qy.jpg\n\n\n\nCant get enough? head to http://www.kurekuretakora.com !","torrent":{"xt":"urn:btih:730cf96efd45eddcb2bbe0016251c02302a9f26d","amp;dn":"Kure.Kure.Takora.COMPLETE.DVDRip.XviD-TOBA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"730cf96efd45eddcb2bbe0016251c02302a9f26d","infoHashBuffer":{"type":"Buffer","data":[115,12,249,110,253,69,237,220,178,187,224,1,98,81,192,35,2,169,242,109]},"announce":[],"urlList":[]}}