{"title":"Damon Ieremia Salesa - Racial Crossings. Race, Intermarriage, an","uid":9940056,"size":2506526,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73105ea1b8c7d8e4204b4d62673cd6421f42eddc&amp;dn=Damon+Ieremia+Salesa+-+Racial+Crossings.+Race%2C+Intermarriage%2C+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1397226390,"description":"Description\nProduct Details\nBook Title: Racial Crossings: Race, Intermarriage, and the Victorian British Empire (Oxford Historical Monographs)\t\nBook Author: Damon Ieremia Salesa (Author)\nSeries: Oxford Historical Monographs\nHardcover: 320 pages\nPublisher: Oxford University Press, USA (July 14, 2011)\nLanguage: English\nISBN-10: 0199604150\nISBN-13: 978-0199604159\n\nBook Description\nPublication Date: July 14, 2011 | ISBN-10: 0199604150 | ISBN-13: 978-0199604159\nThe Victorians were fascinated with intersections between different races. Whether in sexual or domestic partnerships, in interracial children, racially diverse communities or societies, these 'racial crossings' were a lasting Victorian concern. But in an era of imperial expansion, when slavery was abolished, colonial wars were fought, and Britain itself was reformed, these concerns were more than academic. In both the British empire and imperial Britain, racial crossings shaped what people thought about race, the future, the past, and the conduct and possibilities of empire. Victorian fears of miscegenation and degeneration are well known; this study turns to apparently opposite ideas where racial crossing was seen as a means of improvement, a way of creating new societies, or a mode for furthering the rule of law and the kingdom of Heaven.\nSalesa explores how and why the preoccupation with racial crossings came to be so important, so varied, and so widely shared through the writings and experiences of a raft of participants: from Victorian politicians and writers, to philanthropists and scientists, to those at the razor's edge of empire - from soldiers, missionaries, and settlers, to 'natives', 'half-castes' and other colonized people. Anchored in the striking history of colonial New Zealand, where the colonial policy of 'racial amalgamation' sought to incorporate and intermarry settlers and New Zealand M=aori, Racial Crossings examines colonial encounters, working closely with indigenous ideas and experiences, to put Victorian racial practice and thought into sharp, critical, relief.\n\nReviews\n&quot;This is a complex and dense book with far too many dimensions and insights to be highlighted here. Salesa's study breaks new ground in understanding the importance of interracial intimacy in forging new societies.&quot; --Mixed Race Studies\n\n&quot;This new study is a fascinating look at the theoretical underpinnings of racial amalgamation...as a means of successful colonization within the nineteenth-century British Empire...Racial Crossings is a welcome contribution to the filed, clearly conveying the significance of race and gender to the Victorians and highlighting the importance of New Zealand in the British Empire.&quot; --The Historian\n\n&quot;Racial Crossings joins a robust historiography in the history of interracial sex and marriage... Salesa excavates the multivalent history of racial amalgamation to provide a fine-grained account.&quot; --Victorian Studies\n\nAbout the Author\nDamon Salesa is an Associate Professor of History, American Culture, and Asian/Pacific Islander Studies at the University of Michigan. A graduate of the University of Auckland and Oxford University, he is an historian of the British and American empires, and of the Pacific Islands. He is the author of a number of articles on these topics, is one of the contributors to The New Oxford History of New Zealand, has authored a short textbook series on the history of Polynesia, and is one of the editors of the forthcoming Tangata o Moana Nui (Te Papa Tongarewa/Museum of New Zealand Press). Educated in New Zealand, he was the first Samoan Rhodes Scholar. He is also a holder of the title Toeolesulusulu from the village of Satapuala, Samoa.\n","torrent":{"xt":"urn:btih:73105ea1b8c7d8e4204b4d62673cd6421f42eddc","amp;dn":"Damon+Ieremia+Salesa+-+Racial+Crossings.+Race%2C+Intermarriage%2C+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73105ea1b8c7d8e4204b4d62673cd6421f42eddc","infoHashBuffer":{"type":"Buffer","data":[115,16,94,161,184,199,216,228,32,75,77,98,103,60,214,66,31,66,237,220]},"announce":[],"urlList":[]}}