{"title":"The.Nail.The.Story.of.Joey.Nardone.2009.DVDRiP.XViD-MisFitZ","uid":5090143,"size":734303575,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:734ca131a7760db5f9885213ed193ec53bb6ffdf&amp;dn=The.Nail.The.Story.of.Joey.Nardone.2009.DVDRiP.XViD-MisFitZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"XoLWoX","files":-1,"time":1253067659,"description":"Genres:Drama\n\nRating:6.8/18 (Votes)\n\nCountry:USA\n\nLanguages:English\n\nPlot Outline:After spending 8 years in prison for an unfortunate accident, heavy-weight boxer Joey Nardone returns to a solitary life in Philadelphia...\n\n\nPlot: After spending 8 years in prison for an unfortunate accident, heavy-weight boxer Joey Nardone returns to a solitary life in Philadelphia. His time in prison and the opportunity to reflect has changed him. Feeling like a stranger in his own neighborhood and searching for some semblance of normalcy, he takes a job at the boxing gym where he used to work-out. Joey finds comfort in the familiarity of his old friends. But his buddies notice a change in Joey Nardone. Where is the spark and zest for life, once inherent in their pal Joey? Joey, struggling to find meaning in life, meets a 14 yr. old Puerto Rican kid named Jesus, who is repeatedly beaten up by the neighborhood bully. The kid, not used to kindness from strangers, has no time for Joey. Life is hard for Jesus, a scrawny boy, who is not only dealing with his peers picking on him at school, but he also has an alcoholic, abusive father to contend with at home. The chemistry between these two unlikely friends; Joey, an over-the-hill over weight ex-boxer and Jesus a target for bullies, is pure synergistic &quot;magic.&quot; They begin a relationship that gives them both a new and inspired life with a purpose: to only &quot;fight for the right.&quot; the life lessons the old boxer teaches the kid are golden. This heartwarming story of two lost souls finding each other on the streets and boxing arenas of Philadelphia, will capture your heart. Because in life SOME THINGS ARE WORTH FIGHTING FOR.The Nail is a story forgiveness, hope and second chances","torrent":{"xt":"urn:btih:734ca131a7760db5f9885213ed193ec53bb6ffdf","amp;dn":"The.Nail.The.Story.of.Joey.Nardone.2009.DVDRiP.XViD-MisFitZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"734ca131a7760db5f9885213ed193ec53bb6ffdf","infoHashBuffer":{"type":"Buffer","data":[115,76,161,49,167,118,13,181,249,136,82,19,237,25,62,197,59,182,255,223]},"announce":[],"urlList":[]}}