{"title":"AMAZING MYSTERIES - THE BILL EVERETT ARCHIVES (2011) (Fantagraph","uid":8953433,"size":280221179,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:736a5f1a70c1b0ab0c0b4acb038a7a3e16da17d3&amp;dn=AMAZING+MYSTERIES+-+THE+BILL+EVERETT+ARCHIVES+%282011%29+%28Fantagraph&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"STFmaryville","files":-1,"time":1379946329,"description":"The 1939 creation of the Sub-Mariner for the first issue of Marvel Comics assures Bill Everett a place in history. Co-creating Daredevil, the Man Without Fear, for Marvel Comics in 1964 gave Everett a link to one of the most popular superheroes of the past 50 years. And producing over 400 additional pages of superhero-related work in the very early days of the Golden Age of Comics (1938-42) makes Bill Everett a legend.\n\nThis book collects over 200 pages of this never-before-reprinted work from titles such as Amazing Mystery Funnies (1938), Amazing-Man Comics (1939), Target Comics (1940), Heroic Comics (1940), and Blue Bolt Comics (1940). These titles feature an endless array of great vintage Everett characters such as Amazing-Man, Hydroman, Skyrocket Steele, Sub-Zero, The Chameleon, and many more, all produced by Everett's shop Funnies, Inc. for such clients as Centaur, Novelty Press, and Eastern Color, and all displaying Everett's brilliant cartooning and energetic storytelling.\n\nEdited and compiled by best-selling author and comic-book historian Blake Bell (Strange and Stranger: The World of Steve Ditko), Amazing Mysteries: The Bill Everett Archives is a stunning companion to Bell's 2010 critically acclaimed Everett biography and art book, Fire and Water: Bill Everett, The Sub-Mariner and the Birth of Marvel Comics. This volume follows the format of Bell's Steve Ditko Archives series; never-before-reprinted, beautifully restored, full-color stories from one of comic books' greatest visionaries and most accomplished artists. Also includes an introduction by Bell that delves even deeper into Everett's life, fiery personality, and the history of the era. The resultant package enhances Everett's place in history as one of the first and best comic-book creators of all time.","torrent":{"xt":"urn:btih:736a5f1a70c1b0ab0c0b4acb038a7a3e16da17d3","amp;dn":"AMAZING+MYSTERIES+-+THE+BILL+EVERETT+ARCHIVES+%282011%29+%28Fantagraph","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"736a5f1a70c1b0ab0c0b4acb038a7a3e16da17d3","infoHashBuffer":{"type":"Buffer","data":[115,106,95,26,112,193,176,171,12,11,74,203,3,138,122,62,22,218,23,211]},"announce":[],"urlList":[]}}