{"title":"THiNK -- Critical Thinking by Judith A. Boss","uid":8399170,"size":111186591,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73788f6f5799e5ec4b1c7d59f6cdeafd35fde003&amp;dn=THiNK+--+Critical+Thinking+by+Judith+A.+Boss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"*reagan*","files":-1,"time":1366650263,"description":"THiNK: Critical Thinking and Logic Skills for Everyday Life\n\nPublication Date: January 7, 2011 \nISBN-10: 0078038200 \nISBN-13: 978-0078038204 \nEdition: 2\nPages: 496\nFormat: PDF\n\nAll critical thinking texts aim to make their students critical thinkers for life, but unlike other texts, THiNK was written from the framework of understanding that students approach their worlds from a place of opinions and feelings. Judith Boss begins by proposing three stages of critical thinking development: Dualism: thinking things are either right or wrong; Relativism: accepting that not everything is right/wrong, and subsequently thinking all opinions are equally valid, and finally, Commitment:choosing a position based on careful reasoning. Judith Boss has found that the majority of her students come to class in the relativism stage. THiNK guides students to the final stage of critical thinking development by showing students the importance of overcoming their feelings and opinions to commit to positions based on reason and logic. In the process, students learn to apply critical thinking to their every day lives.\n\nThis innovative program provides instructors with scholarly yet succinct content on critical thinking and logical argumentation in a format that is portable, current, and captivating. With extensive opportunity for application and practice, and groundbreaking digital content (Connect Critical Thinking), THiNK directs students to make connections between skill development and application to their college studies, careers, and personal lives.\n\nConnect Critical Thinking is a first: a learning program with pedagogical tools that are anchored in research on critical thinking. Connect actively and personally engages students in thinking critically while also showing students how to apply those thinking skills in everyday life. Connect provides assignable and assessable exercises including real-life simulations that are tied to learning objectives, providing students with immediate feedback and allowing instructors to track student progress.","torrent":{"xt":"urn:btih:73788f6f5799e5ec4b1c7d59f6cdeafd35fde003","amp;dn":"THiNK+--+Critical+Thinking+by+Judith+A.+Boss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73788f6f5799e5ec4b1c7d59f6cdeafd35fde003","infoHashBuffer":{"type":"Buffer","data":[115,120,143,111,87,153,229,236,75,28,125,89,246,205,234,253,53,253,224,3]},"announce":[],"urlList":[]}}