{"title":"Rubicon: Triumph andTragedy of the Roman Republic","uid":7545933,"size":427593094,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:73c9eca7a391abb6bc7797270d049684bae84444&amp;dn=Rubicon%3A+Triumph+andTragedy+of+the+Roman+Republic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sulla_felix","files":47,"time":1345348135,"description":"The Roman Republic was the most remarkable state in history. What began as a small community of peasants camped among marshes and hills ended up ruling the known world. Rubicon paints a vivid portrait of the Republic at the climax of its greatness - the same greatness which would herald the catastrophe of its fall. It is a story of incomparable drama.\n\nThis was the century of Julius Caesar, the gambler whose addiction to glory led him to the banks of the Rubicon, and beyond; of Cicero, whose defence of freedom would make him a byword for eloquence; of Spartacus, the slave who dared to challenge a superpower; of Cleopatra, the queen who did the same. Tom Holland brings to life this strange and unsettling civilization, with its extremes of ambition and self-sacrifice, bloodshed and desire. Yet alien as it was, the Republic still holds up a mirror to us. Its citizens were obsessed by celebrity chefs, all-night dancing and exotic pets; they fought elections in law courts and were addicted to spin; they toppled foreign tyrants in the name of self-defence. Two thousand years may have passed, but we remain the Romans' heirs.\n\n-------------------------------------------------------------------------------------\n\nPirates, sharing is caring! Please do your part to show combat copyright everywhere! Seed the torrents you download, and upload your own!\n\nAnd remember... &quot;If Sulla did it, why can't I?&quot;\t\t","torrent":{"xt":"urn:btih:73c9eca7a391abb6bc7797270d049684bae84444","amp;dn":"Rubicon%3A+Triumph+andTragedy+of+the+Roman+Republic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73c9eca7a391abb6bc7797270d049684bae84444","infoHashBuffer":{"type":"Buffer","data":[115,201,236,167,163,145,171,182,188,119,151,39,13,4,150,132,186,232,68,68]},"announce":[],"urlList":[]}}