{"title":"De-Lovely - Soundtrack 320cbr (Big Papi) 2004","uid":9486174,"size":140473068,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:740ebcc087276bbc573bf8088aab487c3086ffcd&amp;dn=De-Lovely+-+Soundtrack+320cbr+%28Big+Papi%29+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389893632,"description":"De-Lovely - Soundtrack 320cbr (Big Papi) 2004\n\n\nSource: 2004 CD\n\n\n \t\t\n01 Robbie Williams - It's De-Lovely.mp3\t10.85 MB\n \t\t\n02 Alanis Morissette - Let's Do It (Let's Fall in Love).mp3\t7.9 MB\n \t\t\n03 Sheryl Crow - Begin the Beguine.mp3\t10.39 MB\n \t\t\n04 Elvis Costello - Let's Misbehave.mp3\t6.05 MB\n \t\t\n05 Chorus - Be a Clown.mp3\t6.83 MB\n \t\t\n06 Kevin Kline - Night and Day.mp3\t6.5 MB\n \t\t\n07 Ashley Judd - True Love.mp3\t5.11 MB\n \t\t\n08 Lemar - What Is This Thing Called LoveÂ¿.mp3\t6.16 MB\n \t\t\n09 Mick Hucknall - I Love You.mp3\t5.02 MB\n \t\t\n10 Diana Krall - Just One of Those Things.mp3\t7.66 MB\n \t\t\n11 Chorus - Anything Goes.mp3\t4.8 MB\n \t\t\n12 Kevin Kline - Experiment.mp3\t6.03 MB\n \t\t\n13 Vivian Green - Love for Sale.mp3\t12.99 MB\n \t\t\n14 Mario Frangoulis - So in Love.mp3\t8.2 MB\n \t\t\n15 Natalie Cole - Ev'ry Time We Say Goodbye.mp3\t8.73 MB\n \t\t\n16 Cast - Blow, Gabriel, Blow.mp3\t6.66 MB\n\n17 Ashley Judd - In the Still of the Night.mp3\t5.96 MB\n \t\t\n18 Cole Porter - You're the Top.mp3\t7.99 MB\n\n\n\n\n\nBy Lawrance M. Bernabo VINE VOICE\n\n\n\nOne of the more interesting aspects of the &quot;De-Lovely,&quot; the musical biography of Cole Porter, is that despite the appearance of major recording stars such as Sheryl Crow and Alanis Morissette to sing the songs it is the songs that you remember much more than the singers. This soundtrack collection does a nice job of presenting pretty much everything we heard in Irwin Winkler's 2004 film and if nothing here is a definitive version of a classic Cole Porter tune, then that is okay because the idea here is to introduce a new generation of fans to those songs while the rest of us take a nice musical walk down memory lane.\n\nMy favorite track is when Kline's Porter instructs John Barrowman's character on how to sing &quot;Night and Day.&quot; My only serious complaint about the movie is that Kline really has to restrain his performances so that they are more in keeping with Porter's own singing abilities (which are amply demonstrated on the final track, &quot;You're the Top&quot;). If somebody wanted to let Kline record a collection of Cole Porter songs that would sound good to me; with Porter's witty lyrics having a performer who brings the sensibilities of an actor more than those of a singer, that would make sense to me. In a similar vein, I like Ashley Judd's sweet little duet with Tayler Hamilton on &quot;True Love,&quot; so do not be surprised if you like the actors more than the singers on this one.\n\nThe spirited renditions of &quot;Anyting Goes,&quot; &quot;Be a Clown&quot; and &quot;Blow, Gabriel, Blow&quot; by the cast lose a little something reduced to just the audio dimension, but that is standard with any good production number from a movie. Elvis Costello's &quot;Let's Misbehave&quot; is okay, and the same is true for Crow's &quot;Begin the Beguine&quot; and Morissette's &quot;Let's Do It (Let's Fall in Love).&quot; I kept waiting for one of the big names on the album to really blow me away with one of these songs, and it just never happened. Robbie Williams doing the title track is pretty good, as is Natalie Cole on &quot;Ev'ry Time We Say Goodbye,&quot; and I like Diana Krall's &quot;It Was Just One of Those Things&quot; more each time I hear it. But if after listening to the soundtrack for &quot;De-Lovely&quot; I am compelled to check out more recordings of Cole Porter tunes, I know I am not going to be alone. Fortunately, I know of a couple of definite directions in which to go (think Bobby Short).","torrent":{"xt":"urn:btih:740ebcc087276bbc573bf8088aab487c3086ffcd","amp;dn":"De-Lovely+-+Soundtrack+320cbr+%28Big+Papi%29+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"740ebcc087276bbc573bf8088aab487c3086ffcd","infoHashBuffer":{"type":"Buffer","data":[116,14,188,192,135,39,107,188,87,59,248,8,138,171,72,124,48,134,255,205]},"announce":[],"urlList":[]}}