{"title":"Technical Communication Today 2nd Edition by Richard Johnson-She","uid":4771677,"size":333263824,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7435e2645ff77ef2c912ab67ebf115023d3605e8&amp;dn=Technical+Communication+Today+2nd+Edition+by+Richard+Johnson-She&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"codumon","files":-1,"time":1237061727,"description":"Technical Communication Today (2nd Edition) (MyTechCommLab Series) (Paperback)\nby Richard Johnson-Sheehan\n\n    * Paperback: 784 pages\n    * Publisher: Longman; 2 edition (January 7, 2007)\n    * Language: English\n    * ISBN-10: 0321457587\n    * ISBN-13: 978-0321457585\n    * Product Dimensions: 9.1 x 7.8 x 1.1 inches\n\nProduct Description\nTechnical Communication Todayremains the only text to fully centralize the computer in the technical workplace, presenting how it is used throughout today's communication process. The text is based on a solid core of rhetorical principles. Clear instruction not only describes technical documents, but it guides the user through the activity of producing them. Technical Communication Today foregrounds computers as a thinking tool--helping communicators to draft and design documents, prepare material for print and Web publication, and make oral presentations. It more accurately reflects the modern day computer-centered technical workplace. Technical Communication Today epitomizes the shift in technical communication from literal-linear created to visual-spatial created documents. This evolution, which has been provoked by the ubiquity of the computer as a communication tool, is changing fundamental writing and reading processes. The text has been designed using the idea of &quot;chunking,&quot; where readable portions of text are combined with graphics. Not only does this concept facilitate learning, but it models the way today's technical documents should be designed.Its presentation of teaching readers how to write integrates a new awareness of how documents are read--by &quot;raiding&quot; for the information needed. The author wrote the text with the presumption that users are researching, organizing, drafting, designing, and revising directly on their computer screens. By mirroring these processes in its content and structure, Technical Communication Today offers a higher level of accessibility for readers.","torrent":{"xt":"urn:btih:7435e2645ff77ef2c912ab67ebf115023d3605e8","amp;dn":"Technical+Communication+Today+2nd+Edition+by+Richard+Johnson-She","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7435e2645ff77ef2c912ab67ebf115023d3605e8","infoHashBuffer":{"type":"Buffer","data":[116,53,226,100,95,247,126,242,201,18,171,103,235,241,21,2,61,54,5,232]},"announce":[],"urlList":[]}}