{"title":"Teen Cum Dumpsters 3 (xvid) - swallow, Lela Star,Mindy Main","uid":4612193,"size":1477887601,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:746e3899cba4383cbeb1039774659e4b48403131&amp;dn=Teen+Cum+Dumpsters+3+%28xvid%29+-+swallow%2C+Lela+Star%2CMindy+Main&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"pure_screens","files":6,"time":1230674201,"description":"Teen Cum Dumpsters 3\n\n\n\n\n\nlarge DVD-covers + all 5 screens:\n &lt;a href=&quot;\nhttp://main.blogbugs.org/4509998/Teen-Cum-Dumpsters-3---5-screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://main.blogbugs.org/4509998/Teen-Cum-Dumpsters-3---5-screens.html&lt;/a&gt;\n\n\n\n\n\n\n\nWatch them go from hand jobs to hardcore in a single load!!!\nA cum guzzlin, cock smokin, finger bangin good time!!\nWho would have thought these cute young chicks would swallow... a gallon-of-cum!!!\nI bet you never saw a girl this young take cock that big!!\n\n\nActresses\n\n    * Isabella Summers [Facial Bald Swallow]\n    * Jessica Jules [Facial Bald]\n    * Kaci Star [Facial DVDOnly IR]\n    * Lela Star [Facial Bald Swallow]\n    * Mindy Main [Facial Bald Swallow]\n    * Tiffany Price [Facial Bald Swallow]\n\n\n   \nScene Breakdowns\n\n    * Scene 1. Frank Towers, Guy, Mindy Main\n    * Scene 2. James Deen, Mindy Main\n    * Scene 3. Isabella Summers, J. Crew\n    * Scene 4. Justice Young, Tiffany Price\n    * Scene 5. Frank Towers, Guy DiSilva, Guy, Jessica Jules\n    * Scene 6. J. Crew, Jessica Jules\n    * Scene 7. 2 Guys, Frank Towers, Lela Star\n    * Scene 8. Justice Young, Lela Star\n\n\nStudio:  \tVoodoo House\nRelease Date: \tJun 14, 2006\nCategory: \tAll Sex, Legal Teen, Straight, Toy Play, Swallowing\nDirector: \tDestro Damus\nFormat:         Xvid\nLanguage:       English\n\n\n\nREVIEW:\n\n\nEach scene starts off with a brief interview and/or tease. Plus all the girls are shown as first timers.\n\nScene 1: Mindy Main\n\nAfter her brief interview she shows off in front of two random guys with a silver vibrator. The two guys that are watching her use the vibrator then cum in her mouth which she then swallows. She is apprehensive about taking the cum in her mouth but does anyway. She is then told to close her eyes and open her mouth. She does and another guy proceeds to slide his cock in her mouth. She gives a nice BJ as they go into dogie after that. From there they go into missionary before moving to the couch. Once on couch she rides him in reverse cowgirl The guy then cums in her mouth and she swallows. She takes it all like before but doesn't mind it this time. Very Hot scene with a hot girl.\n\nScene 2: Isabella Summers\n\nThis scene starts with this gray haired guy (who eds up being the sex partner) talking about how he wants to stretch the limits with this girl. Isabella comes in and after her interview she takes her top off and gets felt up. Again she gets a couple loads in her mouth and swallows them. She then starts sucking on his cock and doing a nice job. They then go into doggie and missionary then back to doggie. They then go into cowgirl. About halfway through the guy leans back and the camera swings around so we get a nice view of Isabella. She then starts blowing him again this time even deepthroating. They have a bit more sex in doggie before he pops in her mouth and she swallows. Another hot scene. Gut has a long dick but it's skinny.\n\nScene 3: Tiffany Price\n\nAfter her brief interview and strip, Tiffany proceeds to use a pink vibrator. While she uses it a guy comes over and blindfolds her and gropes her. She continues to masturbate and gets a load in her mouth which she then swallows. She looks like she has a bunch of food and stuff on her which indicates they did a bunch of stuff that got cut. She then goes over to a different area and start blowing a different guy. That quickly turns into a 69 which is in itself short. Sex starts off in doggie then flows into cowgirl, spoons the missionary. The scene ends again with a pop on the face and her swallowing the cum. Another hot scene and hot girl.\n\nScene 4: Jessica Jules\n\nAfter her interview and striptease she starts to masturbate. After a bit of that she takes 3 loads in her mouth and swallows them all. She does gag a little while receiving the loads though. The BJ then commences. After she blows him they go into cowgirl then spoons. She then swallows and gags a bit again. Not bad scene but definitely weakest on the disc.\n\nScene 5: Lela Star\n\nThis one starts off a little different. Instead of an interview they start off with her stripping as they take stills. She then goes and lays on desk while the guy gropes her. They then proceed to use her pussy pump on her. She then gets her nipples sucked on while she uses a vibrator on herself. At this time a guy cums in her mouth and she swallows. Still using the vibrator she start blowing a different guy. After the BJ they start having sex in doggie. Followed by cowgirl and missionary. The guy then lifts her off the desk and brings her to the couch. Once there they continue in cowgirl and reverse cowgirl. They then slide right into spoons before going in cowgirl for a little before he lifts her again, this time on to ottoman, for missionary. He pops after this and she swallows. Hottest scene on disc. \n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:746e3899cba4383cbeb1039774659e4b48403131","amp;dn":"Teen+Cum+Dumpsters+3+%28xvid%29+-+swallow%2C+Lela+Star%2CMindy+Main","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"746e3899cba4383cbeb1039774659e4b48403131","infoHashBuffer":{"type":"Buffer","data":[116,110,56,153,203,164,56,60,190,177,3,151,116,101,158,75,72,64,49,49]},"announce":[],"urlList":[]}}