{"title":"Red Garland Trio - Groovy (XRCD) (FLAC)","uid":7028060,"size":231976874,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:748b66dbb81be8123881827829c54f9f1d7289b4&amp;dn=Red+Garland+Trio+-+Groovy+%28XRCD%29+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tiddler222","files":11,"time":1329092384,"description":"\nRecorded between December 1956 and August 1957. This release 1998 on JVC.\n\nReview by Michael G. Nastos(AMG)\nRed Garland\\'s third recording as a leader has him playing very well, somewhat energetic and more inclusive in his direction to span the mainstream jazz palate beyond the cool exterior he emanates. The title might be a bit deceptive, for this is not a project where soul-jazz or early boogaloo influences turned jazzmen into groovemeisters - it\\'s a swinging groove. With bassist Paul Chambers and drummer Art Taylor, Garland has all the support he needs to wing it in a variety of directions. Recorded in that most legendary year of jazz, 1957, Garland is coming into his own in a more confident way, buoyed by his association at the time with Miles Davis. Chambers is flawless in his support role, and on this recording deserves a close listen, especially for students of the acoustic upright. They immediately dig in on the opener \\&quot;C Jam Blues,\\&quot; with Garland at his heartiest during his bridge solo, they agree in the affirmative during the entirety of the hard bop take of \\&quot;Will You Still Be Mine?,\\&quot; and repeat but modify the melody ÃƒÂ  la \\&quot;Cool Blues\\&quot; in an adept display of artistry for \\&quot;Hey Now.\\&quot; Of course Garland has to play a ballad or two, as on \\&quot;Willow Weep for Me,\\&quot; luscious with chord sequences, and really reflects the influence of Erroll Garner in that chiming, two-handed sustenato style for Garner\\'s \\&quot;Gone Again.\\&quot; It is said that by the third recording, most musicians should have their style down pat and begin attempting to take the music to a higher level. You really hear that in this recording, which was a springboard to making Red Garland one of the most revered and respected jazz pianists of the modern era. \n\nRed Garland - Piano\nPaul Chambers - Bass\nArt Taylor - Drums\n\n01. C Jam Blues   \n02. Gone Again   \n03. Will You Still Be Mine?    \n04. Willow Weep For Me   \n05. What Can I Say, Dear    \n06. Hey Now  \n\n \n\n","torrent":{"xt":"urn:btih:748b66dbb81be8123881827829c54f9f1d7289b4","amp;dn":"Red+Garland+Trio+-+Groovy+%28XRCD%29+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"748b66dbb81be8123881827829c54f9f1d7289b4","infoHashBuffer":{"type":"Buffer","data":[116,139,102,219,184,27,232,18,56,129,130,120,41,197,79,159,29,114,137,180]},"announce":[],"urlList":[]}}