{"title":"Cream - Wheels Of Fire (1968)  SHM-SACD 2010","uid":9823325,"size":3484260957,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:74b75d5935573c859897ff1f8d1baaacbad5287c&amp;dn=Cream+-+Wheels+Of+Fire+%281968%29++SHM-SACD+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sidmal","files":-1,"time":1395726307,"description":"\nCream - Wheels Of Fire (1968) [Japanese Limited SHM-SACD 2010 # UIGY-9042]\n PS3 Rip | ISO | SACD DSD64 2.0 &gt; 1-bit/2.8224 MHz | 80:09 minutes | Scans included | 3,24 GB\n \n Features the 2010 DSD mastering based on Japanese original analog tape. Reissue features the high-fidelity SHM-SACD format (fully compatible with standard SACD player, but it does not play on standard CD players). DSD Transferred by Manabu Matsumura.\n\n\n If Disraeli Gears was the album where Cream came into their own, its successor, Wheels of Fire, finds the trio in full fight, capturing every side of their multi-faceted personality, even hinting at the internal pressures that soon would tear the band asunder. A dense, unwieldy double album split into an LP of new studio material and an LP of live material, it's sprawling and scattered, at once awesome in its achievement and maddening in how it falls just short of greatness. It misses its goal not because one LP works and the other doesn't, but because both the live and studio sets suffer from strikingly similar flaws, deriving from the constant power struggle between the trio. Of the three, Ginger Baker comes up short, contributing the passable &quot;Passing the Time&quot; and &quot;Those Were the Days,&quot; which are overshadowed by how he extends his solo drum showcase &quot;Toad&quot; to a numbing quarter of an hour and trips upon the Wind &amp; the Willows whimsy of &quot;Pressed Rat and Warthog,&quot; whose studied eccentricity pales next to Eric Clapton's nimble, eerily cheerful &quot;Anyone for Tennis.&quot; In almost every regard, Wheels of Fire is a terrific showcase for Clapton as a guitarist, especially on the first side of the live album with &quot;Crossroads,&quot; a mighty encapsulation of all of his strengths. Some of that is studio trickery, as producer Felix Pappalardi cut together the best bits of a winding improvisation to a tight four minutes, giving this track a relentless momentum that's exceptionally exciting, but there's no denying that Clapton is at a peak here, whether he's tearing off solos on a 17-minute &quot;Spoonful&quot; or goosing &quot;White Room&quot; toward the heights of madness. But it's the architect of &quot;White Room,&quot; bassist Jack Bruce, who, along with his collaborator Peter Brown, reaches a peak as a songwriter. Aside from the monumental &quot;White Room,&quot; he has the lovely, wistful &quot;As You Said,&quot; the cinematic &quot;Deserted Cities of the Heart,&quot; and the slow, cynical blues &quot;Politician,&quot; all among Cream's very best work. And in many ways Wheels of Fire is indeed filled with Cream's very best work, since it also captures the fury and invention (and indulgence) of the band at its peak on the stage and in the studio, but as it tries to find a delicate balance between these three titanic egos, it doesn't quite add up to something greater than the sum of its parts. But taken alone, those individual parts are often quite tremendous.  \n\n\nTracklist:\n\n 01 - White Room\n 02 - Sitting On Top Of The World\n 03 - Passing The Time\n 04 - As You Said\n 05 - Pressed Rat And Warthog\n 06 - Politician\n 07 - Those Were The Days\n 08 - Born Under A Bad Sign\n 09 - Deserted Cities Of The Heart\n 10 - Crossroads (Live At The Fillmore)\n 11 - Spoonful (Live At The Fillmore)\n 12 - Traintime (Live At The Fillmore)\n 13 - Toad (Live At The Fillmore)\n\n DSD Transferred from analogue master tapes by Manabu Matsumura (Universal Studio Mastering\n","torrent":{"xt":"urn:btih:74b75d5935573c859897ff1f8d1baaacbad5287c","amp;dn":"Cream+-+Wheels+Of+Fire+%281968%29++SHM-SACD+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74b75d5935573c859897ff1f8d1baaacbad5287c","infoHashBuffer":{"type":"Buffer","data":[116,183,93,89,53,87,60,133,152,151,255,31,141,27,170,172,186,213,40,124]},"announce":[],"urlList":[]}}