{"title":"Physics and Music - Gleb Aflinov","uid":7402310,"size":28475129,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:75131367646a5d68e8324c8c792d8e3c059e269b&amp;dn=Physics+and+Music+-+Gleb+Aflinov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"damitr","files":1,"time":1341148176,"description":"We now come to Physics and Music by Gleb Anfilov. \n\nThe book takes us through the history of music, and the science behind it. Anfilov tells about development of various musical instruments, and also what possible future developments might take place. For example he says (p. 265):\n\n    So, sooner or later musical instruments will come which are controllable, probably, even by the subconscious desire of the artist. Man will inject his will and thoughts into the responsive machine which will &quot;be an extension of his fingers and nerves.&quot; Isn't that fantastic? Instead of being a slave of the machine, man is becoming its almighty master.\n    Looking further ahead, we can see with our mind's eye machines which reproduce musical thoughts, that internal music which every person hears when his or her &quot;very soul is singing&quot;. We can imagine thought-controlled computers composing all sorts of music.\n\nThough many of the contents may seem 'dated' to some people, the book remains a very good read for a refreshing view on the subject of music.\n\n    From the primitive reed pipe to modern music &quot;written&quot; by computers is quite a journey. Here, in informal text and about a score of plates, is a story that takes the teenage layman on this interesting trip.\n\n    The younger reader, like a good musicologist, follows the steps in the evolution of the most important instruments that make up today's symphony orchestra, and the development of music itself (scales, modes, keys, and temperaments).\n\n    Physics and music is also a source, although, of necessity a modest one, of information about the music research that has been underway in the Soviet Union, especially in the scientific manufacture of the violin, and in electrophonic and synthetic music. This why the foreign reader might think of a degree of &quot;bias&quot; on the part of the author. Yet, it gives him an insight into what is going on in a country that has given the world quite a number of great composers.\n\nThe book was translated from the Russian by  Boris Kuznetsov and was first published by Mir in 1966\n\nRealsed by mirtitles.org\n\n\nContents 7\n\n1 The Orchestra in the Making 9\n2 How Sound Is Produced 61\n3 Rivals of Stradivarius 82\n4 Voice Analysis 112\n5 Tones Created by the Ear 125\n6 The History of Tuning 138\n7 Music from Electricity 152\n8 The Wonders of Sound Recording 181\n9 Dr. Sholpo's Dream 201\n10 The Composer as a Painter 2\n11 Music from the Computer 243\n12 Physics and Music 258\n\n\nIndex 267","torrent":{"xt":"urn:btih:75131367646a5d68e8324c8c792d8e3c059e269b","amp;dn":"Physics+and+Music+-+Gleb+Aflinov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75131367646a5d68e8324c8c792d8e3c059e269b","infoHashBuffer":{"type":"Buffer","data":[117,19,19,103,100,106,93,104,232,50,76,140,121,45,142,60,5,158,38,155]},"announce":[],"urlList":[]}}