{"title":"Inside Star Trek","uid":7972707,"size":63059539,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:75202170174b495b5d56389dbf9defdde58fe863&amp;dn=Inside+Star+Trek&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"davidamorse1701","files":19,"time":1356900614,"description":"Gene Roddenberry: &quot;I think one fan comment we got quite often during the third year was; 'How come Captain Kirk gets a new girl every week?'&quot;\n\nWilliam Shatner:  &quot;Well, he uses up the old one!&quot;  \nThis is another merchandising/audio oddity that demonstrates just how much of a phenomenon Star Trek reruns had become, almost ten years after it originally aired on network television. In '76, Trek creator Gene Roddenberry recorded an all-talk, long-playing album about the creation of the television series and its impact on both his life and on popular culture. It included interviews with William Shatner, DeForest Kelly and science fiction author Isaac Asimov, a discussion of the character of Spock, with input from Mark Lenard, in-character as Sarek, and was spiced-up with plenty of authentic sound effects from the show. It also featured one of the best recordings/arrangements of the Trek theme I've ever heard.\n\n&quot;I lost the argument. Questor did not get the girl. But I remember driving home that night, I was kind of happy. I was saying 'You know, in your whole writing career how many times will you get an opportunity to create a whole new area of intolerance?'&quot; \nPart of the album was made up of a recording of Roddenberry talking before a live audience. If I recall correctly, it may have been one of the college lectures that he was doing at the time. Aside from Star Trek, he also spoke about his then-recent efforts to launch a new sci-fi pilot, The Questor Tapes.\n\nIt's been many years since I've spun this record. I still have it buried somewhere with my other old LPs. It was released on CD in 1999 with some additional tracks. and here it is for your enjoyment.","torrent":{"xt":"urn:btih:75202170174b495b5d56389dbf9defdde58fe863","amp;dn":"Inside+Star+Trek","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75202170174b495b5d56389dbf9defdde58fe863","infoHashBuffer":{"type":"Buffer","data":[117,32,33,112,23,75,73,91,93,86,56,157,191,157,239,221,229,143,232,99]},"announce":[],"urlList":[]}}