{"title":"Rob Zombie - The Sinister Urge [24 bit FLAC] vinyl","uid":8338785,"size":1653904620,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:753546248793581f4c50e7fb712d6b09467eeb1f&amp;dn=Rob+Zombie+-+The+Sinister+Urge+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"24.96","files":-1,"time":1365035759,"description":"  Rob Zombie - The Sinister Urge (2001) [24 bit FLAC] vinyl\n\n  Released: 2001\n  Source: 069493147 1 / US\n  Genre: Pop/Rock\n  Style: Industrial\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 192,000 Hz\n\n  A1. Sinners Inc. 1:17 \n  A2. Demon Speeding 3:44 \n  A3. Dead Girl Superstar 2:28 \n  A4. Never Gonna Stop (The Red, Red Kroovy) 3:09 \n  A5. Iron Head 4:11 \n  A6. (Go To) California 3:24 \n  B1. Feel So Numb 3:53 \n  B2. Transylvanian Transmissions Pt. 1 1:09 \n  B3. Bring Her Down (To Crippletown) 3:59 \n  B4. Scum Of The Earth 2:55 \n  B5. House Of 1000 Corpses \n\n  Hard rock's brightest shock rocker avoids the sophomore slump on the fun and energetic The Sinister Urge. Zombie's trademark growl is still in fine form, roaring over the 11 tracks with his unique blend of acid-throated venom. But most interesting are the directions he tries to bring to his familiar sound, which he has been cultivating since the hardcore punk days of White Zombie. &quot;Never Gonna Stop (The Red, Red Kroovy)&quot; is the most apparent example of this, a song that borders on pop with its groovy handclaps and acoustic guitars. But not to be worried, the chorus kicks back into classic Zombie, complete with sampled crowd chants and his trademark &quot;yeah.&quot; &quot;Going to California&quot; has a similar vibe, albeit darker and with a Welcome to My Nightmare-era Alice Cooper showbiz quality to it. But when it comes time to rock out, Zombie is more than ready. &quot;Dead Girl Superstar&quot; is probably the best of the bunch, raging along at lightning speed and featuring an awesome guest appearance by Slayer guitarist Kerry King. &quot;Iron Head&quot; is also quite good, matching Zombie's bark with guest singer Ozzy Osbourne's trademark banshee wail over a swaggering beat and chugging riff. And finally there is &quot;House of 1000 Corpses,&quot; the theme from the film Zombie directed that apparently offended Universal Studios so much that they refused to release it. The song is a nice departure for him, like a Leonard Cohen song filtered through Violator-era Depeche Mode. It is the slow burn of this last track that shows the most promise; after years of making good heavy metal, he finally expands the boundaries of his own sound. Few metal musicians kept their sound fresh for as long as Zombie, and this album is no exception. This may not win any new fans, but anyone who enjoyed his old material will probably find this to be a welcome addition to their collection. Listen for the bonus track, &quot;Unholy Three,&quot; about a minute after the last track ends.","torrent":{"xt":"urn:btih:753546248793581f4c50e7fb712d6b09467eeb1f","amp;dn":"Rob+Zombie+-+The+Sinister+Urge+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"753546248793581f4c50e7fb712d6b09467eeb1f","infoHashBuffer":{"type":"Buffer","data":[117,53,70,36,135,147,88,31,76,80,231,251,113,45,107,9,70,126,235,31]},"announce":[],"urlList":[]}}