{"title":"The Children's Blizzard By David Laskin (Epub,Mobi) Gooner","uid":9779267,"size":1164121,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:761dd341e9fc9a7ffd3c50a585fc09c7d436710d&amp;dn=The+Children%27s+Blizzard+By+David+Laskin+%28Epub%2CMobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1395079458,"description":"Paperback: 336 pages\nPublisher: Harper Perennial; 3rd edition (October 11, 2005)\nLanguage: English\nISBN-10: 0060520760\nISBN-13: 978-0060520762\n\nThe gripping story of an epic prairie snowstorm that killed hundreds of newly arrived settlers and cast a shadow on the promise of the American frontier.\n\nJanuary 12, 1888, began as an unseasonably warm morning across Nebraska, the Dakotas, and Minnesota, the weather so mild that children walked to school without coats and gloves. But that afternoon, without warning, the atmosphere suddenly, violently changed. One moment the air was calm; the next the sky exploded in a raging chaos of horizontal snow and hurricane-force winds. Temperatures plunged as an unprecedented cold front ripped through the center of the continent.\n\nBy Friday morning, January 13, some five hundred people lay dead on the drifted prairie, many of them children who had perished on their way home from country schools. In a few terrifying hours, the hopes of the pioneers had been blasted by the bitter realities of their harsh environment. Recent immigrants from Germany, Norway, Denmark, and the Ukraine learned that their free homestead was not a paradise but a hard, unforgiving place governed by natural forces they neither understood nor controlled.\n\nWith the storm as its dramatic, heartbreaking focal point, The Children's Blizzard captures this pivotal moment in American history by tracing the stories of five families who were forever changed that day. Drawing on family interviews and memoirs, as well as hundreds of contemporary accounts, David Laskin creates an intimate picture of the men, women, and children who made choices they would regret as long as they lived. Here too is a meticulous account of the evolution of the storm and the vain struggle of government forecasters to track its progress.\n\nThe blizzard of January 12, 1888, is still remembered on the prairie. Children fled that day while their teachers screamed into the relentless roar. Husbands staggered into the blinding wind in search of wives. Fathers collapsed while trying to drag their children to safety. In telling the story of this meteorological catastrophe, the deadliest blizzard ever to hit the prairie states, David Laskin has produced a masterful portrait of a tragic crucible in the settlement of the American heartland.\n\nBiography\nDavid Laskin was born in New York in 1953 and educated at Harvard College and New College, Oxford. For the past twenty-five years, Laskin has written books and articles on a wide range of subjects including history, weather, travel, gardens and the natural world. His most recent book, The Children's Blizzard, won the Washington State Book Award and the Midwest Booksellers' Choice Award for Nonfiction. Laskin's other titles include Braving the Elements: The Stormy History of American Weather, Partisans: Marriage, Politics and Betrayal Among the New York Intellectuals, A Common Life: Four Generations of American Literary Friendship and Influence, and Artists in their Gardens (co-authored with Valerie Easton). A frequent contributor to The New York Times Travel Section, Laskin also writes for the Washington Post, the Seattle Times, and Seattle Metropolitan. He and his wife Kate O'Neill, the parents of three grown daughters, live in Seattle with their two sweet old dogs.","torrent":{"xt":"urn:btih:761dd341e9fc9a7ffd3c50a585fc09c7d436710d","amp;dn":"The+Children%27s+Blizzard+By+David+Laskin+%28Epub%2CMobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"761dd341e9fc9a7ffd3c50a585fc09c7d436710d","infoHashBuffer":{"type":"Buffer","data":[118,29,211,65,233,252,154,127,253,60,80,165,133,252,9,199,212,54,113,13]},"announce":[],"urlList":[]}}