{"title":"Carson M.D., Ben","uid":8312902,"size":6347888,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76e135f550626206630aef2fb886fb09b0aae146&amp;dn=Carson+M.D.%2C+Ben&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Paulybus","files":-1,"time":1364516541,"description":"Publication Date: January 22, 2013\nWhat is America becoming? Or, more importantly, what can she be if we reclaim a vision for the things that made her great in the first place? In America the Beautiful, Dr. Ben Carson helps us learn from our past in order to chart a better course for our future. From his personal ascent from inner-city poverty to international medical and humanitarian acclaim, Carson shares experiential insights that help us understand ... what is good about America ... where we have gone astray ... which fundamental beliefs have guided America from her founding into preeminence among nations Written by a man who has experienced America's best and worst firsthand, America the Beautiful is at once alarming, convicting, and inspiring. You'll gain new perspectives on our nation's origins, our Judeo-Christian heritage, our educational system, capitalism versus socialism, our moral fabric, healthcare, and much more. An incisive manifesto of the values that shaped America's past and must shape her future, America the Beautiful calls us all to use our God-given talents to improve our lives, our communities, our nation, and our world.\n\n\nEnjoy the book, and as always, if you like it, please support the author and buy a copy. We really could use this guy right now!","torrent":{"xt":"urn:btih:76e135f550626206630aef2fb886fb09b0aae146","amp;dn":"Carson+M.D.%2C+Ben","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76e135f550626206630aef2fb886fb09b0aae146","infoHashBuffer":{"type":"Buffer","data":[118,225,53,245,80,98,98,6,99,10,239,47,184,134,251,9,176,170,225,70]},"announce":[],"urlList":[]}}