{"title":"Sexually Broken--Pro BODYBUILDER Helpless!  Ashley Starr  Matt W","uid":7763264,"size":896244648,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:76fdb1e71b8aebeb79510c4c6b97a9b767d71c90&amp;dn=Sexually+Broken--Pro+BODYBUILDER+Helpless%21++Ashley+Starr++Matt+W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":1,"time":1351292929,"description":"Professional BODYBUILDER Helpless! Her HUGE clit captured and bound, made to cum over and over! | Ashley Starr | Matt Williams\n            \nOctober 26, 2012\n\n\nMP4 only.\n\n\nWelcome professional bodybuilder Ashley Starr to Sexually \nBroken. This muscle bound beautiful girl has huge nipples and \na monsterous clit. Wait to you see her deep throat, you will \nbe a fan.\n\nFor her first scene we were not going to take any chances, we \nsecure her spread using strong metal and vintage leather cuffs \nfrom the INSEX collection. Ashley is completely helpless, her \nstrength and muscles can do nothing to free her. This is a \nfeeling she is not use to at all. She normally dominates and \ncontrols men. Not the the other way around.\n\nWe start by applying suction cups to her nipples. Her huge \nnipples are pulled painfully into the cups, growing bigger and \nbigger. She moans in pain, but takes it. We then flog her hard \nmuscular body, her 12 pack gets most of the attention, however \nwe take time to abuse and hit her huge swollen clit. \n\nAshley's clit is amazingly huge, so we add another suction cup \nto it. We suck her clit up into the tube making it 3x larger \nand then tie it off with bailing twine. We bind each nipple \nand tie all three together. Pulling her nipples tight to her \nclit.\n\nAshley is suffering, she struggles to get free but is held in \ncheck. We hood her, blindfold her and push an inflatable gag \ninto her mouth. We pump up the gag, and now her mouth is \ncompletely violated and filled. Now we can attack her clit and \nlisten to her muffled screaming. We use different vibrators, \nand she struggles in vain as we make her cum again and again. \nThere is nothing in this world she can do to stop herself from \ncumming. We own her sexually, and deep down this powerful \nwomen knows it. It scares her that we have this power over \nher. As she is thinking that very thing she cums again, then \nagain. How much can that body take? We will find out....\n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/10_26astarr2/SexuallyBroken-Ashley-Starr-Matt-Williams-Professional-BODYBUILDER-Helpless-Her-HUGE-clit-captured-and-bound-made-to-cum-over-and-over%20.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/10_26astarr2/SexuallyBroken-Ashley-Starr-Matt-Williams-Professional-BODYBUILDER-Helpless-Her-HUGE-clit-captured-and-bound-made-to-cum-over-and-over%20.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n","torrent":{"xt":"urn:btih:76fdb1e71b8aebeb79510c4c6b97a9b767d71c90","amp;dn":"Sexually+Broken--Pro+BODYBUILDER+Helpless%21++Ashley+Starr++Matt+W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76fdb1e71b8aebeb79510c4c6b97a9b767d71c90","infoHashBuffer":{"type":"Buffer","data":[118,253,177,231,27,138,235,235,121,81,12,76,107,151,169,183,103,215,28,144]},"announce":[],"urlList":[]}}