{"title":"Prince and The Revolution - Raspberry Beret","uid":4728161,"size":153399300,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:775f7ebb8dbe471d9e3c53bfbc11a16556d412d0&amp;dn=Prince+and+The+Revolution+-+Raspberry+Beret&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":5,"uploader":"2nafish","files":-1,"time":1234859781,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Raspberry Beret&quot; is the first U.S. (and second UK) single from Prince and The Revolution's 1985 album, Around the World in a Day. The sound was completely different from any previous Prince track, incorporating Middle-Eastern finger-cymbals, stringed instruments, and even a harmonica on the extended version. The song was also more in the pop vein than ever before, though the 12-inch single and video of the song feature a funky intro. Although the song was originally recorded in 1982, Prince drastically reworked it with The Revolution to give it more of an international sound. The string section was: Novi Novog on violin, Suzi Katayama and David Coleman on cello. Wendy and Lisa provided backing vocals, and the rest of the song was performed by Prince. The song's lyrics are said to be about Prince's one-time girlfriend and former member of both Vanity 6 and Apollonia 6, singer Susan Moonsie. The song has several notable features including its use of finger cymbals and flanger effect. The song tells of a teenage romance and first sexual experience with a girl who wears the titular hat. The video for the song - Prince's first since his short-lived &quot;ban&quot; on music videos - was also significant, displaying Prince's new short haircut, and The Revolution vaguely resembling Gypsies or hippies. The song quickly became a fan favorite, and a staple in nearly every Prince tour. The extended version was included on Ultimate in 2006. While this song reached #2 on the Billboard Hot 100 in the US, it only reached #25 on the UK Singles Chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:775f7ebb8dbe471d9e3c53bfbc11a16556d412d0","amp;dn":"Prince+and+The+Revolution+-+Raspberry+Beret","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"775f7ebb8dbe471d9e3c53bfbc11a16556d412d0","infoHashBuffer":{"type":"Buffer","data":[119,95,126,187,141,190,71,29,158,60,83,191,188,17,161,101,86,212,18,208]},"announce":[],"urlList":[]}}