{"title":"West End Motel - Only Time Can Tell (2012) [mp3@320]","uid":7833951,"size":73803393,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:77b2fa8f53b7bb076fb3e8185c6d1a2ef5be0c35&amp;dn=West+End+Motel+-+Only+Time+Can+Tell+%282012%29+%5Bmp3%40320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"qculfj","files":9,"time":1353147367,"description":"01. Burn It Down 03:40\n02. El Myr 03:20\n03. Witch Is Dead 04:43\n04. If I Only Had Tomorrow 04:37\n05. Bite 04:21\n06. Forgiveness 03:31\n07. Only Time Can Tell 03:41\n08. Valentine 02:20\n\n\nAlbum Review\n\nWhile Brent Hinds' main gig, the wildly ambitious progressive sludge act Mastodon, might seem like a bottomless creative outlet for the guitarist, man cannot live on metal alone. Branching out into just about every corner of the music world, Hinds' first full-length outing with his West End Motel project, Only Time Can Tell, feels like a musical pilgrimage, giving the axe-man a chance to explore his more theatrical side with a collection of songs that feels heavily influenced by the genre-bending work of Tom Waits and Nick Cave. Adding a sense of darkness and drama to the sounds of early rock and doo wop, the album presents a take on rock &amp; roll's past that feels stripped of its innocence. Injecting this kind of music with a sense of foreboding gives the album a kind of uncanny valley feeling, like a David Lynch film where everything seems so pure, but you can feel in your spine that something terrible is lurking just out of sight. Though this total departure from Mastodon's sound is one that suits Hinds surprisingly well, it's a distant enough relative from his day job that any fans hoping for some more spacy prog thrills are going to have a rude awakening. What Only Time Can Tell will do is pleasantly surprise anyone who might've balked at the album because of its metal lineage, presenting the skeptical with a collection of songs that wouldn't feel out of place on David Byrne's Luaka Bop label, making West End Motel the perfect delivery vector to expose a whole new audience to one of the most far-out minds to break into the mainstream in recent years.\n\nBiography\n\nFormed: Atlanta, GA\nGenre: Rock\nYears Active: '10s\n\nA diversion from the world of prog metal, West End Motel finds Mastodon guitarist Brent Hinds exploring the sounds of early rock &amp; roll with a project that, while not as heavy as his other work, is no less ominous. Much like the &quot;doom-wop&quot; outfit Mister Heavenly, West End Motel delivers a classic sound with a dark underbelly that keeps listeners on edge. Hinds debuted the band on the 2011 split Brent Hinds Presents: Fiend Without a Face &amp; West End Motel, a double EP with his metal-rockabilly hybrid, Fiend Without a Face. The band made its full-length debut with Only Time Can Tell, which was released by Warner in the fall of 2012.","torrent":{"xt":"urn:btih:77b2fa8f53b7bb076fb3e8185c6d1a2ef5be0c35","amp;dn":"West+End+Motel+-+Only+Time+Can+Tell+%282012%29+%5Bmp3%40320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77b2fa8f53b7bb076fb3e8185c6d1a2ef5be0c35","infoHashBuffer":{"type":"Buffer","data":[119,178,250,143,83,183,187,7,111,179,232,24,92,109,26,46,245,190,12,53]},"announce":[],"urlList":[]}}