{"title":"Willful Blindness: Why We Ignore the Obvious ","uid":7860056,"size":2133472,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77c8b5d4586964fa312f030636604b8e0f21ee5d&amp;dn=Willful+Blindness%3A+Why+We+Ignore+the+Obvious+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1353902883,"description":"Willful Blindness: Why We Ignore the Obvious at Our Peril by Margaret Heffernan\n\nDoubleday Canada | 2011 | ISBN: 0385669003, 0802719988 | English | 304 pages | EPUB \n\nMargaret Heffernan argues that the biggest threats and dangers we face are the ones we don't see--not because they're secret or invisible, but because we're willfully blind. A distinguished businesswoman and writer, she examines the phenomenon and traces its imprint in our private and working lives, and within governments and organizations, and asks: What makes us prefer ignorance? What are we so afraid of? Why do some people see more than others? And how can we change?\n\nCovering everything from our choice of mates to the SEC, Bernard Madoff's investors, the embers of BP's refinery, the military in Afghanistan, and the dog-eat-dog world of subprime mortgage lenders, this provocative book demonstrates how failing to see--or admit to ourselves or our colleagues--the issues and problems in plain sight can ruin private lives and bring down corporations. Heffernan explains how willful blindness develops before exploring ways that institutions and individuals can combat it. In the tradition of Malcolm Gladwell and Nassim Nicholas Taleb, Margaret Heffernan's Willful Blindness is a tour de force on human behavior that will open your eyes.","torrent":{"xt":"urn:btih:77c8b5d4586964fa312f030636604b8e0f21ee5d","amp;dn":"Willful+Blindness%3A+Why+We+Ignore+the+Obvious+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77c8b5d4586964fa312f030636604b8e0f21ee5d","infoHashBuffer":{"type":"Buffer","data":[119,200,181,212,88,105,100,250,49,47,3,6,54,96,75,142,15,33,238,93]},"announce":[],"urlList":[]}}