{"title":"Microsoft Silverlight 4 and SharePoint 2010 Integration {BBS}","uid":6618430,"size":15492659,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:783624fb5fd1479d97b65b44e583cfa6c4db0c9c&amp;dn=Microsoft+Silverlight+4+and+SharePoint+2010+Integration+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1313884429,"description":"This is a practical book with step-by-step guidelines to integrate Silverlight 4 applications in a SharePoint 2010 Server environment. This book focuses on the integration of the two technologies and is not a primer for any of the individual technologies. It offers clear examples to successfully perform the most important integration tasks. If you are an application developer who wants to implement Silverlight 4 applications within a SharePoint 2010 environment, this book is for you. We assume that the reader has prior knowledge of Silverlight and SharePoint 2010 and this book focuses more on the integration of Silverlight with SharePoint 2010.\nAbout the Author\n\nGastÃƒÂ³n C. Hillar\n\nGastÃƒÂ³n C. Hillar has been working with computers since he was eight. He began programming with the legendary Texas TI-99/4A and Commodore 64 home computers in the early 80s.\n\nHe has a Bachelor's degree in Computer Science in which he graduated with honors and he also has an MBA (Master in Business Administration) in which he graduated with an outstanding thesis. He has worked as a developer, an architect, and project manager for many companies in Buenos Aires, Argentina. Now, he is an independent IT consultant and a freelance author looking for new adventures around the world. He also works with electronics (he is an electronics technician). He is always researching about new technologies and writing about them. He owns an IT and electronics laboratory with many servers, monitors, and measuring instruments.\n\nHe has written two additional books for Packt Publishing, C# 2008 and 2005 Threaded Programming: Beginner's Guide and 3D Game Development with Microsoft Silverlight 3: Beginner's Guide.\n\nHe contributes to Dr. Dobb's Go Parallel programming portal ddj.com/go-parallel/ and he is a guest blogger at Intel Software Network software.intel.com/.\n\nIn 2009, he was awarded an IntelÃ‚Â® Black Belt Software Developer award.\n\nHe is the author of more than 40 books in Spanish about computer science, modern hardware, programming, systems development, software architecture, business applications, balanced scorecard applications, IT project management, the Internet, and electronics.\n\nHe lives with his wife, Vanesa and his son, Kevin. When not tinkering with computers, he enjoys developing and playing with wireless virtual reality devices and electronics toys with his father, his son, and his nephew Nico.\n\n\n\n\n# Paperback: 336 pages\n# Publisher: Packt Publishing (July 26, 2010)\n# Language: English\n# ISBN-10: 184968006X\n# ISBN-13: 978-1849680066","torrent":{"xt":"urn:btih:783624fb5fd1479d97b65b44e583cfa6c4db0c9c","amp;dn":"Microsoft+Silverlight+4+and+SharePoint+2010+Integration+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"783624fb5fd1479d97b65b44e583cfa6c4db0c9c","infoHashBuffer":{"type":"Buffer","data":[120,54,36,251,95,209,71,157,151,182,91,68,229,131,207,166,196,219,12,156]},"announce":[],"urlList":[]}}