{"title":"Rocco's Perfect Slaves (NEW 2013 Evil Angel) [DVDRip]","uid":9007962,"size":3374605419,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:787010a9d322358a373246da2b48b4e8cf54b164&amp;dn=Rocco%27s+Perfect+Slaves+%28NEW+2013+Evil+Angel%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"chkm8te","files":1,"time":1381071143,"description":"Rocco's Perfect Slaves (NEW 2013 Evil Angel) [DVDRip]\n\nBlance Bradburry, Rocco Siffredi, Kid Jamaica, Omar Galanti, Marika Hase, Leyla Black, Samantha Bentley, Chelsey Lanette, Samia Duarte, Daisy Hot, Yanick Shaft\n\nThis is a new line, all about girls who to be submissive. This is probably the kind of sex where I am my best. Samia Durarte is absolutely incredible. Daisy Hot was surrealistic. Samantha Bentley is probably the most submissive girl I ever met in my life. -Rocco Sifredi\n\nIn 'Rocco's Perfect Slaves,' infamous director/stud Rocco Siffredi showcases seven beautiful sluts - willing playthings with a taste for perverse discipline, they're eager to prove themselves worthy of their master. Rocco and his well-hung crew of brutal bosses show no mercy on the submissive stunners that dare enter his filthy domain. Rocco, glamorous blonde Blanche Bradburry and lovely, fishnet-clad brunette Samia Duarte enjoy a rough, nasty threesome of anal ramming, butthole licking, throat fucking and ass-to-mouth cocksucking. Next, Japanese cutie Marica Hase and petite blonde vixen Leyla Black meet dirty hypnotist Omar Galanti during a photo shoot in the snow. Afterward, Leyla and Marica warm each other up with some lesbian licking and share Omar's gigantic cock. Their session of foot worship/toe sucking, rim jobs and nasty ass-to-mouth flavor climaxes in a messy cum facial. Adorable, young model Daisy Hot visits Rocco for some rock climbing training. She seduces the director and assistant Kid Jamaica, eagerly sucking their massive black and white cocks. Daisy offers up her tender holes in a nasty interracial anal three-way. In the final scene, Officer Chelsey Lanette is a sexy blonde cop that gets anally dominated by brunette glamour girl Samantha Bentley and her hugely hung husband, Yanick Shaft (formerly Ian Scott). True perfection requires struggle and pain. 'Rocco's Perfect Slaves' are the hardest working girls in show business!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=mkgiq6eh1sjm89in517w.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=mkgiq6eh1sjm89in517w.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=nm129vxs5cjm1sj70lyd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=nm129vxs5cjm1sj70lyd.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:787010a9d322358a373246da2b48b4e8cf54b164","amp;dn":"Rocco%27s+Perfect+Slaves+%28NEW+2013+Evil+Angel%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"787010a9d322358a373246da2b48b4e8cf54b164","infoHashBuffer":{"type":"Buffer","data":[120,112,16,169,211,34,53,138,55,50,70,218,43,72,180,232,207,84,177,100]},"announce":[],"urlList":[]}}