{"title":"TSAHAL_DVD_1994_LANZMANN","uid":14725724,"size":6061433982,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:787395212d8f671a128c3c744a9f2bd849e1410b&amp;dn=TSAHAL_DVD_1994_LANZMANN&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"captainhadd0ck","files":3,"time":1464558583,"description":"TSAHAL (1994)\r\n\r\nDirected and written by Claude Lanzmann\r\n\r\nRipped from 2 DVD edition. Also includes 2008 Claude Lanzmann interview with Ehud Barak\r\n\r\nPlease note: This version has German subtitles baked in. The dialogue is a mix of English, Hebrew and French. The Hebrew is translated into English by an offscreen translator. If anyone has a version with English subtitles, please upload!\r\n\r\nFormat: 720 x 544\r\n\r\nRuntime: 5 hours 14 minutes\r\n\r\n\r\n**** IMDB REVIEW ****\r\n\r\nThis is a rare opportunity in film. At approx. 5 hours it may be a bit much for the average viewer, the premise is a documentary on the Israeli Defense Forces (IDF=Tsahal) but really it is about unfolding more aspects of Israeli self and identity. For the filmmaker, the project goes back to Shoah and Pourqouis Israel the latter of which I have written about here.\r\n\r\nIt is a rare opportunity not so much for what you learn about the army. Yes, it is one of the most rigorously trained armed forces in the world, had to be. Yes, the army is so pervasive in everyday life that almost every single Israeli prime minister's career can be traced back to the military and war. The current one, Netanyahu, was a special ops commando. \r\n\r\nArmed duty is a matter of both pride and necessity for Israeli youth, accepted without complaint. I have experience with both the army in general and tanks up close, having served in both the infantry and the technician corps in an advanced base factory—enough to tell the Israelis are professional and committed. There's no rah-rah, not that we see anyway.\r\n\r\nLanzmann has largely avoided emphasis, in this as in the previous Pourquois Israel, on the outright crazy Zionists, though a zealot settler is interviewed. He has once more marginalized Palestinians, which may be explained as being closer to the Israeli experience—we see them pass through checkpoints, Gaza kids as they throw rocks but those are passing glimpses.\r\n\r\nSo watch this to be informed. How does the military commander of Gaza drive through hostile streets, fast or slow?\r\n\r\nEven better, inhabit the life. Let the film watch you for a while. What is it you see of you? Is it judgement? Appreciation? For me, the meandering voices of officers as they relate past experiences of war or strategy—among them two later prime ministers, Barak and Sharon then still generals in the army—began to phase out after a while, the lingering shots of landscape remained. Israel is a beautiful country, peculiar as defined by abstractions.\r\n\r\nSand dunes, barbed wire, aerial views of the sea or planted fields surrounded by desert. Ugly high-rises of the new Jewish settlers of the West Bank. The drive through desolate Gaza City from behind armor-plated glass.\r\n\r\nThe self attempts control of the elements in both what it builds and what stories it tells, both framing reality—some of it recorded on tape or film, some of it remembered, some of it reasoned to be so. Some of these views will last, others come to pass","torrent":{"xt":"urn:btih:787395212d8f671a128c3c744a9f2bd849e1410b","amp;dn":"TSAHAL_DVD_1994_LANZMANN","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"787395212d8f671a128c3c744a9f2bd849e1410b","infoHashBuffer":{"type":"Buffer","data":[120,115,149,33,45,143,103,26,18,140,60,116,74,159,43,216,73,225,65,11]},"announce":[],"urlList":[]}}