{"title":"Superman - Birthright","uid":5092930,"size":129766204,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:78cba7216afee4a50c254e747b43b3f720197be6&amp;dn=Superman+-+Birthright&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brodahisou","files":-1,"time":1253297684,"description":"Superman: Birthright is a twelve-issue comic book limited series published by DC Comics in 2003 and 2004, written by Mark Waid and drawn by Leinil Francis Yu.\n\nOriginally, this was meant to be more of an &quot;ultimate&quot; version of Superman, showcasing his origin and updating him for the 21st Century. Soon after, it was decided to make the series canon, and thus it replaced John Byrne's The Man of Steel series as Superman's canonical origin story. However, DC stated that Birthright didn't remove The Man of Steel, but both were Superman's origin story. This editorial position lasted until 2006.\n\nThe project was given to Mark Waid with the original request to give readers an &quot;Ultimate Superman&quot;, to redefine Superman for the 21st century, a series that anyone on Earth can pick up and get in on the Superman story.  By comparison to other origin retellings, Waid wanted some differences. His Superman has a lack of infallibility, as he points that it is not Superman but Clark Kent as readers are supposed to relate to. Doing this made Waid avoid a &quot;Clark-is-dull&quot; trap as, by making Clark get chewed by the boss, whose dry cleaning gets lost, who longs to connect and be accepted, made the character a touchstone. Another difference was having Africa in the origin so, as Waid has it, helps establish Kal-El/Clark as a citizen of the world, laying important ground, and making him a journalist and not a typist.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:78cba7216afee4a50c254e747b43b3f720197be6","amp;dn":"Superman+-+Birthright","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78cba7216afee4a50c254e747b43b3f720197be6","infoHashBuffer":{"type":"Buffer","data":[120,203,167,33,106,254,228,165,12,37,78,116,123,67,179,247,32,25,123,230]},"announce":[],"urlList":[]}}