{"title":"Five Golden Hours (VHS) (letterbox) [1961] Ernie Kovacs","uid":6461789,"size":900523487,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:791ed4774c58f656a288fe011c7a707c99ddb602&amp;dn=Five+Golden+Hours+%28VHS%29+%28letterbox%29+%5B1961%5D+Ernie+Kovacs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1307798826,"description":" &lt;a href=&quot;http://bayimg.com/OaiBKAADj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/OaiBKAADj&lt;/a&gt;\n\nFive Golden Hours (1961) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0054877/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0054877/&lt;/a&gt;\n\nFunny man Ernie Kovacs remains best remembered for his television work, which influenced everyone from Monty Python to David Letterman, but he also appeared in about ten feature films throughout the 1950s and early '60s. Supposedly his personal favorite of the bunch was Five Golden Hours (1961), an offbeat and charming black comedy made in England and Italy. Ostensibly a British production, it was directed by an Italian, Mario Zampi, who in his career mostly worked in England. \n\nKovacs plays a professional pallbearer who is also a good-hearted con man, taking advantage of grieving widows for his own gain, thus allowing him to live in style. But he gets more than he bargained for in the form of beautiful and wealthy widow Cyd Charisse, who knows how to play people herself. The title comes from a scheme whereby Kovacs makes money for Charisse by using other widows' money to play the stock markets in New York and Rome, taking advantage of the five-hour time difference to game the system. \n\nGeorge Sanders pops up as another con artist Kovacs meets when he is sent to an asylum after feigning insanity. &quot;I know from one look at you that your trouble was debts,&quot; Sanders tells Kovacs. &quot;I have the same disease myself.&quot; (In real life, Kovacs had his own financial problems. For years he did not pay income taxes out of a philosophical opposition to them, and the IRS had finally come calling, charging him with hundreds of thousands in back taxes.) \n\nAs biographer Diana Rico pointed out in her book Kovacsland, Five Golden Hours was the one movie in Kovacs' career in which he was able to play a fully rounded character who exists at the center of the story. The film also allows him to display some subtle and complex acting, as in the scene where &quot;he plays both himself, drunk, and his greedy alter ego, with whom he struggles over the idea of killing all the widows for their money.&quot; In another scene he pretends to resist a widow's desire to invest her money with him &quot;while simultaneously trying every wile in his power to get her to do it.&quot; \n\nThe picture was released in Europe in the spring of 1961, where it generally got good notices, and in America in the fall, where it generally did not. The New York Times complained that the British type of humor on display would have been better suited to someone like Alec Guinness than the brash Kovacs, and that a lighter touch would have been preferable. Only one actor (Sanders) and one scene (the &quot;hilarious&quot; reading of a will) received praise. The London Times, on the other hand, called the film &quot;an excellent black joke.&quot; \n\nAfter Five Golden Hours, Kovacs made one more feature, Sail a Crooked Ship (1961), and some TV appearances before his death in January 1962 in an L.A. car accident, just a few days shy of his 43rd birthday. He had been gearing up for a leading role in It's a Mad, Mad, Mad, Mad World (1963) -- a part ultimately played by Sid Caesar. \n\nDirector: Mario Zampi\nScreenplay: Hans Wilhelm\nCinematography: Christopher Challis\nArt Direction: Ivan King\nMusic: Stanley Black\nFilm Editing: Bill Lewthwaite\nCast: Ernie Kovacs (Aldo Bondi), Cyd Charisse (Baroness Sandra), George Sanders (Mr. Bing), Kay Hammond (Martha), Dennis Price (Raphael), Clelia Matania (Rosalia), John Le Mesurier (Doctor Alfieri), Finlay Currie (Father Superior), Reginald Beckwith (Brother Geronimo), Avice Landone (Beatrice).\nBW-90m. Letterboxed. \n\n","torrent":{"xt":"urn:btih:791ed4774c58f656a288fe011c7a707c99ddb602","amp;dn":"Five+Golden+Hours+%28VHS%29+%28letterbox%29+%5B1961%5D+Ernie+Kovacs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"791ed4774c58f656a288fe011c7a707c99ddb602","infoHashBuffer":{"type":"Buffer","data":[121,30,212,119,76,88,246,86,162,136,254,1,28,122,112,124,153,221,182,2]},"announce":[],"urlList":[]}}