{"title":"(2008) Russia - A Journey with Jonathan Dimbleby [BBC]","uid":5936453,"size":7465697420,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:79b652c59c876b39aa1f3068e5eba34258f245af&amp;dn=%282008%29+Russia+-+A+Journey+with+Jonathan+Dimbleby+%5BBBC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"sldscrl","files":-1,"time":1288983884,"description":"&quot;Here is a solid documentary series about today's Russia in a genre that often disappoints. Travel documentaries have a hard time slaloming between the complex issues of the countries they talk about, going in depth with the more delicate issues, and they look too much like travel advertising trips with some more information about local foods, or interviews with eccentric individuals met on the road. With its five one-hour installments, with a road covering many thousands of kilometers between Karelia in the West to the Pacific in the far East, and also zigzagging between the Polar Circle and the hot Southern borders, the documentary presented by Jonathan Dimbleby succeeds to meet the most interesting places in Russia and gets to screen a full mosaic of people who are not only authentic but also interesting and representative for the various classes, nations, ideas that build today's Russia. It is over all the candid look at the toughest issues this huge country faces, and of the issues that concern the rest of the world that is different in this documentary. Dimbleby while admiring Russia's renaissance as an economic power, and while falling in love with the genuine friendship and warmness of its peoples, is also concerned by the loss of influence of the democratic movements and by the fact that a majority of Russians seem to consider more important Russia getting back its world power status even at the expense of individual freedom. Not avoiding the complex national and political issues is one important quality of a well-written and well-filmed documentary that provides one of the most complete images of contemporary Russia that I have seen recently.&quot;\n\n-- http://www.imdb.com/title/tt1336584/\t","torrent":{"xt":"urn:btih:79b652c59c876b39aa1f3068e5eba34258f245af","amp;dn":"%282008%29+Russia+-+A+Journey+with+Jonathan+Dimbleby+%5BBBC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79b652c59c876b39aa1f3068e5eba34258f245af","infoHashBuffer":{"type":"Buffer","data":[121,182,82,197,156,135,107,57,170,31,48,104,229,235,163,66,88,242,69,175]},"announce":[],"urlList":[]}}