{"title":"Rush - Exit... Stage Left (resequenced and expanded by }{eywood)","uid":9073499,"size":697001744,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7a422a14d30d5436969408d4afaabe58b4cb8f95&amp;dn=Rush+-+Exit...+Stage+Left+%28resequenced+and+expanded+by+%7D%7Beywood%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"}{eywood","files":25,"time":1382242379,"description":"Rush\nExit...Stage Left\nresequenced and expanded by }{eywood\n\n\nExit Stage Left. One of the best live albums I've ever heard, up there with KISS Alive, the Peter Frampton thing and Unleashed in the East. But like Unleashed in the East it was an incomplete representation of Rush's show at that time. Thanks to the DVD release with the same title and the bonus tracks added to the 2012 release of 2112 a great deal more of it is now available to us. I have taken the CDs and DVD and combined them, changing the order to that of the setlist for the Moving Pictures tour, but with slight vaiation to account for a couple extra songs that were on the CD from the Permanent Waves tour. Consequently the &quot;Closer to the Heart&quot;/&quot;Beneath Between &amp; Behind&quot; medley caused me to move &quot;Closer...&quot; from its proper place in the set after &quot;Red Barchetta&quot; to a much earlier point in the set. &quot;Jacob's Ladder&quot; and &quot;A Passage To Bangkok&quot; are also from the PW tour, not having been played on the MP tour. I also managed to restore a bit of Geddy's dialogue.\n\nI've remastered the whole thing so the three sources sound alike, and giving it some low end that I always felt ESL lacked. In a few places it sounds a bit compressed due to bass boosting an already compressed file, but that's the price I pay for doing these things.  For the 2112 tracks I used phase cancellation to isolate the giutar track from the mix and alter its place in the stereo field to more closely match the sound of it on the ESL album.  I also added some reverb for the same reason.\n\nAll in all this sounds a lot more like a real Rush show that the original release did.\n\n01 2112 Overture\n02 The Temples of Syrinx\n03 Freewill\n04 Limelight\n05 Closer To The Heart\n06 Beneath, Between &amp; Behind\n07 Jacob's Ladder\n08 A Passage To Bangkok\n09 YYZ\n10 Broon's Bane\n11 The Trees\n12 Xanadu\n13 The Spirit OF Radio\n14 Red Barchetta\n15 Tom Sawyer\n16 Vital Signs\n17 By-Tor And The Snow Dog\n18 In The End\n19 In The Mood\n20 2112 Finale\n21 La Villa Strangiato\n\n\nas far as the editing goes, the 2112 stuff is from the expanded 2112. Most of the material from the CD is here, but the beginning of &quot;Closer to the Heart&quot; is from the DVD (the edit back to the CD version is in the middle of the word &quot;philosophers&quot; as the drums come in). The end medley from &quot;By-Tor...&quot; through &quot;2112&quot; is from the DVD, as are various bits of dialogue and audience noise throughout.\n\nMore to come. Enjoy!","torrent":{"xt":"urn:btih:7a422a14d30d5436969408d4afaabe58b4cb8f95","amp;dn":"Rush+-+Exit...+Stage+Left+%28resequenced+and+expanded+by+%7D%7Beywood%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a422a14d30d5436969408d4afaabe58b4cb8f95","infoHashBuffer":{"type":"Buffer","data":[122,66,42,20,211,13,84,54,150,148,8,212,175,170,190,88,180,203,143,149]},"announce":[],"urlList":[]}}