{"title":"Love to Eternity [DivX-ITA-MP3]","uid":4136027,"size":737470464,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7a8869bb0501e45cd589d78c5d85fc100ae03aea&amp;dn=Love+to+Eternity+%5BDivX-ITA-MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"circlensess","files":1,"time":1208271814,"description":"Plot Outline: Liza slowly replaces Melampo, Giorgio&amp;#039;s dog. While she accepts it, Giorgio forces her to wear collars and leashes.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0068868/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0068868/&lt;/a&gt;\n\nAlso Known As:\nCagna, La (Italy) \nLove to Eternity (UK) \nMelampo\n\n*** This comment may contain spoilers ***\n\nLa Cagna- The bitch- the Italian title- shows the underlying idea of the film. Liza is on a yacht anchored by an island. She quarrels with her boat-mates, dives in the water and swims ashore. Eventually her friends dump her bags on shore and sail away. Giorgio- an illustrator for comics- is already on the island, with his beloved dog Melampo, and rescues her. They have sex and- after she has rejected the choice of rejoining her friends- Liza returns to Giorgio on the island. The trouble is that Giorgio talks to and shows affection to Melampo, not Liza. So Liza befriends Melampo, takes him swimming and lets him drown. As he buries Melampo, Liza confesses to Giorgio. She puts Melampo&amp;#039;s collar round her neck and imitates a dog. Giorgio treats her like his dog.\n\nWhat next, though? It&amp;#039;s a nice idea, but you don&amp;#039;t make films with ideas. You could end the film here of course, but it wouldn&amp;#039;t be a very long film and there&amp;#039;s a lot of time yet to fill in. There&amp;#039;s an episode where the French Foreign Legion land and beat up and arrest a deserter and that&amp;#039;s all. The story has to expand and leave the island. What actually happens is that we learn a lot about Giorgio and not much about Liza- or anyone else- and what we learn about Giorgio isn&amp;#039;t very interesting. He has a very reasonable wife, except for her habit of attempting to kill herself. He has an intellectual friend who drinks a lot. He did a cartoon strip about Spartacus. He has an adolescent son. He has a daughter who eats nothing but carrots and loves her cat the way Giorgio loved Melepampo. Eventually Liza fetches Giorgio. They go back to the island where their boat drifts away in a storm. They don&amp;#039;t try to get help and eventually, we must infer, they starve to death. Perhaps the whole film is Giorgio&amp;#039;s fantasy. Perhaps it is Liza&amp;#039;s fantasy. Undoubtedly, there&amp;#039;s a point where the film abandons reality and realism, but we don&amp;#039;t know- or care- where. Indeed, one of the problems with &quot;fantastic&quot; directors like Ferreri is that their imagination doesn&amp;#039;t go to their camera work. The ideas are fantastic, perhaps, but they are depicted with literal-minded dreariness. Compare Ferreri&amp;#039;s use of the camera with Ophuls, Cocteau, Tarkovsky, Scorsese...The imagining is done with when the filming starts.\n","torrent":{"xt":"urn:btih:7a8869bb0501e45cd589d78c5d85fc100ae03aea","amp;dn":"Love+to+Eternity+%5BDivX-ITA-MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a8869bb0501e45cd589d78c5d85fc100ae03aea","infoHashBuffer":{"type":"Buffer","data":[122,136,105,187,5,1,228,92,213,137,215,140,93,133,252,16,10,224,58,234]},"announce":[],"urlList":[]}}