{"title":"Japanese Castles AD 250-1540","uid":11774299,"size":25472839,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7aa86bced9e18c71f022fbf57b174087f4aa65a6&amp;dn=Japanese+Castles+AD+250-1540&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427209885,"description":"Renowned expert Stephen Turnbull examines the castles built in Japan, from the first primitive fortifications in the Yayoi Period (300 BC-AD 250) through to the first proper castles which began to be developed with the rise to power of the Yamato Court, the first emperors of Japan in around AD 250. Examining the close ties that early Japanese dynasties had to both China and Korea, Turnbull assesses how Japanese defensive architecture betrays these influences.\n\nAlso examined is the effect that the terrain in Japan had on fortifications - from the early reliance on earthworks and palisades and the development of wooden and earth castles, often sited on the top of the mountains, into more elaborate stone constructions in the 15th century. Finally, the emergence of the stone towers that are so characteristic of samurai is investigated, as is the gradual adaptation of Japanese castles to accommodate the introduction of firearms. With previously unpublished photographs from the author's private collection and full-color artwork, including detailed cutaways, this is an essential guide to the fascinating development of Japanese castles","torrent":{"xt":"urn:btih:7aa86bced9e18c71f022fbf57b174087f4aa65a6","amp;dn":"Japanese+Castles+AD+250-1540","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aa86bced9e18c71f022fbf57b174087f4aa65a6","infoHashBuffer":{"type":"Buffer","data":[122,168,107,206,217,225,140,113,240,34,251,245,123,23,64,135,244,170,101,166]},"announce":[],"urlList":[]}}