{"title":"Pretenders/Learning To Crawl [2CD's][1984][2015][320KBPS][DE]","uid":11836753,"size":365825202,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7abfd62a2d70ff2dbdb2b553118442fde0bccf28&amp;dn=Pretenders%2FLearning+To+Crawl+%5B2CD%27s%5D%5B1984%5D%5B2015%5D%5B320KBPS%5D%5BDE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LameDuck69","files":41,"time":1429770232,"description":"Pretenders - Learning To Crawl [2 CD's][1984][2015][DE]\n\n\n\nDisc 1:\n-------\n\n01. Middle Of The Road  \n02. Back On The Chain Gang  \n03. Time The Avenger  \n04. Watching The Clothes  \n05. Show Me  \n06. Thumbelina  \n07. My City Was Gone  \n08. Thin Line Between Love And Hate  \n09. I Hurt You  \n10. 2000 Miles \n\n\n\nDisc 2:\n-------\n\n01. Fast Or Slow (That's The Law)\n02. Money (Live)\n03. Time The Avenger (Live)\n04. Boys Get Spanked (Live)\n05. My City Was Gone (Live)\n06. Tequila\n07. I Hurt You (Demo)\n08. When I Change My Life (Demo)\n09. Ramblin' Rob (Demo)\n10. Watching The Clothes (Demo)\n-------------------------------------\n**320 KBPS CBR\n**Cover Art\n-------------------------------------\nThe Pretenders are an English-American rock band formed in Hereford, England, in March 1978. The original band comprised initiator and main songwriter Chrissie Hynde (lead vocals, rhythm guitar), James Honeyman-Scott (lead guitar, backing vocals, keyboards), Pete Farndon (bass guitar, backing vocals), and Martin Chambers (drums, backing vocals, percussion). Following the drug-related deaths of Honeyman-Scott and Farndon, the band has experienced numerous subsequent personnel changes, with Hynde as the only consistent member, and Chambers returning after an absence of several years.\n--------------------------------------------------------------------------------\nLearning to Crawl is the Pretenders' third album, released in 1984 after a two-year hiatus, during which time James Honeyman-Scott and Pete Farndon both died of drug overdoses.\n\nAfter Farndon's dismissal from the band and Honeyman-Scott's death, Chrissie Hynde and Martin Chambers initially recruited Rockpile's Billy Bremner and Big Country's Tony Butler to fill in a caretaker line-up of the band in 1982. Bremner played guitar and Butler played bass on the band's September 1982 single &quot;Back on the Chain Gang/My City Was Gone&quot;, both sides of which were later included on Learning to Crawl. As the album sessions got under way, Bremner, Graham Parker's bass player Andrew Bodnar, and Paul Carrack (formerly of Squeeze, Ace and Roxy Music) played guitar, bass and piano respectively for the track &quot;Thin Line Between Love and Hate&quot;.\n\nFinally, Robbie McIntosh (guitar) and Malcolm Foster (bass) were recruited to join Hynde and Chambers, and the band was now officially a quartet. It was this line-up that recorded the rest of the tracks featured on Learning to Crawl.\n\nThe November 1983 single &quot;2000 Miles/Fast or Slow (The Law's the Law)&quot; was the newly reconstituted foursome's first release, followed shortly by the full Learning to Crawl album in January 1984.\n\nThe album's title of &quot;Learning to Crawl&quot; was given in honor of Chrissie Hynde's then-newborn daughter, Natalie Rae Hynde. She was learning to crawl at the time that Chrissie was trying to determine a name for the album.\n--------------------------------------------------------------------------------\n\nPersonnel:\n\n\nChrissie Hynde: rhythm guitar, lead vocals, harmonica\n\nMartin Chambers: drums, vocals, lead vocals on &quot;Fast or Slow&quot;\n\nRobbie McIntosh: lead guitar, backing vocals\n\nMalcolm Foster: bass guitar, backing vocals\n\n\n\nAdditional Personnel:\n\n\nBilly Bremner: lead guitar on &quot;Back on the Chain Gang&quot; and &quot;My City Was Gone&quot;, rhythm guitar and vocals on &quot;Thin Line Between Love and Hate&quot;\n\n\nTony Butler: bass guitar on &quot;Back on the Chain Gang&quot; and &quot;My City Was Gone&quot;\n\nAndrew Bodnar: bass guitar and vocals on &quot;Thin Line Between Love and Hate&quot;\n\nPaul Carrack: piano and vocals on &quot;Thin Line Between Love and Hate&quot;","torrent":{"xt":"urn:btih:7abfd62a2d70ff2dbdb2b553118442fde0bccf28","amp;dn":"Pretenders%2FLearning+To+Crawl+%5B2CD%27s%5D%5B1984%5D%5B2015%5D%5B320KBPS%5D%5BDE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7abfd62a2d70ff2dbdb2b553118442fde0bccf28","infoHashBuffer":{"type":"Buffer","data":[122,191,214,42,45,112,255,45,189,178,181,83,17,132,66,253,224,188,207,40]},"announce":[],"urlList":[]}}