{"title":"Automated Nanohandling by Microrobots - Sergej Fatikow","uid":15446366,"size":9228371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7acdc366ea1e975debcda624b7d4c5e268671783&amp;dn=Automated+Nanohandling+by+Microrobots+-+Sergej+Fatikow&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1469890129,"description":"Automated Nanohandling by Microrobots - Sergej Fatikow (Springer, 2008).pdf\r\n\r\nThe rapid development of nanotechnology has created a need for advanced nanohandling tools and techniques. One active branch of research in this area focuses on the use of microrobots for automated handling of micro- and nanoscale objects. Automated Nanohandling by Microrobots presents work on the development of a versatile microrobot-based nanohandling robot station inside a scanning electron microscope (SEM). The SEM serves as a powerful vision sensor, providing a high resolution and a high depth of focus, allowing different fields of application to be opened up. The pre-conditions for using an SEM are high-precision, user-friendly microrobots which can be integrated into the SEM chamber and equipped with application-specific tools. Automated Nanohandling by Microrobots introduces an actuation principle for such microrobots and presents a new robot design. The book also introduces the concept of the robot station inside an SEM, along with the station’s control system. Different aspects of this research field regarding the hardware and software implementation of the system components, including the sensory feedback for automated nanohandling, are discussed in detail. Images of the robot and its end-effector, as well as of the objects to be handled, are used as visual feedback by the automatic control system of the robot station. Extensive applications of the microrobot station for nanohandling, nano-characterisation and nanostructuring are provided, together with the experimental results. In addition, the use of an atomic force microscope as a nanohandling robot is investigated. Based upon the Microrobotics course for students of computer sciences and physics at the University of Oldenburg, Automated Nanohandling by Microrobots provides the practicing engineer and the engineering student with an introduction to the design and applications of robot-based nanohandling devices. Those unfamiliar with the subject will find the text, which is complemented throughout by the extensive use of illustrations, clear and simple to understand","torrent":{"xt":"urn:btih:7acdc366ea1e975debcda624b7d4c5e268671783","amp;dn":"Automated+Nanohandling+by+Microrobots+-+Sergej+Fatikow","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7acdc366ea1e975debcda624b7d4c5e268671783","infoHashBuffer":{"type":"Buffer","data":[122,205,195,102,234,30,151,93,235,205,166,36,183,212,197,226,104,103,23,131]},"announce":[],"urlList":[]}}