{"title":"ParaNorman.2012.DVDRip.XviD.Greek.Audio.avi","uid":7927138,"size":602624544,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7b299d8ff03e871733997995e58da60d23ea6b31&amp;dn=ParaNorman.2012.DVDRip.XviD.Greek.Audio.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1355606164,"description":"In the small New England town of Blithe Hollow, Massachusetts, a boy named Norman Babcock is able to speak with the dead, including his late grandmother and various ghosts in town. Unfortunately, almost no one among the living believes his ability is genuine and he is isolated emotionally from his family while being ridiculed and bullied by most of his peers for his seemingly strange abilities.\n\nHowever, Norman makes a friend with Neil Downe, an eccentric overweight boy who is bullied himself and finds Norman's earnest admission as a medium an intriguing part of a kindred spirit. During rehearsal of a school play commemorating the town's witch execution of 300 years ago, Norman has a harrowing vision of the town's past and being pursued as a witch by the town's citizenry. Afterward, the boys are confronted by Norman's estranged and seemingly deranged uncle Mr. Prenderghast who tells his nephew that the vision is a sign that he soon must take up his regular ritual to protect the town.\n\nNorman refuses to take him seriously, but soon has another vision during the school play, creating a public spectacle of himself which leads to his embarrassed parents unjustly grounding him. Now completely despondent and isolated, Norman is confronted by the ghost of the recently deceased Prenderghast in the restroom who tells him that the ritual must be performed with a special book before sundown that day, before departing for the afterlife. After some consideration, Norman sets off to Prenderghast's residence to retrieve the book. Believing that Neil would not truly understand his situation, he drives him away. He arrives at the graves of the town's ancestors/founders, including Judge Hopkins, who were supposedly cursed by the witch they condemned, but finds the book is merely a collection of fairy tales.","torrent":{"xt":"urn:btih:7b299d8ff03e871733997995e58da60d23ea6b31","amp;dn":"ParaNorman.2012.DVDRip.XviD.Greek.Audio.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b299d8ff03e871733997995e58da60d23ea6b31","infoHashBuffer":{"type":"Buffer","data":[123,41,157,143,240,62,135,23,51,153,121,149,229,141,166,13,35,234,107,49]},"announce":[],"urlList":[]}}