{"title":"Okhlos-SKIDROW","uid":15594314,"size":1388284320,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7c023e9d92057cf47cd066469fd6b184c0e99481&amp;dn=Okhlos-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Itanium2","files":2,"time":1471548894,"description":"Okhlos\r\n(c) Devolver Digital\r\n\r\n18-08-2016......Release Date - Protection...............Nothing\r\nAction.............Game Type - Disk(s)....................1 DVD\r\n\r\nRELEASE NOTES\r\n\r\nSqueeze into your toga and slide on your sandals to rally the angry\r\nmobs of Okhlos and bring down the oppressive god of mythological\r\nGreece Your beloved people will not longer stand for the abuse from\r\ntheir deities and take up arms against them and taking down anything\r\nand everything in their path. Topple the beastly minotaur, bring down\r\nsacred temples, and confront the almighty Olympians themselves while\r\nrecruiting and balancing your unruly mob with warriors, peasants,\r\nslaves and even livestock in their quest for freedom from Mount\r\nOlympus It's total anarchy in the birthplace of democracy\r\n\r\nThe people are angry and have united behind the noble philosophers to\r\ndo their bidding to take down the soldiers, mythical beasts and temples\r\nunder the control of the twelve vile gods.\r\n\r\nCarefully recruit your followers from warriors, peasants, slaves and\r\nbeasts of burden and unlock special units or swap units for one of 100\r\nlegendary heroes to upgrade the mob and increase their savagery. Wield\r\nthe power of Heracles, Leonidas, Pandora, and Socrates to turn your\r\nmischievous gang into a formidable army\r\n\r\nEvery campaign against the gods is different with changes to heroes,\r\nmonsters, and bosses - and even the mob itself - each time you and your\r\nfollowers set out for battle. Traverse eight procedurally generated\r\nGreek cities and never fight through the same world twice\r\n\r\nMake your way through all manner of beasts, warriors, and demi-gods to\r\narrive at the feet of the maleficent Olympians and unleash the power of\r\nthe people in epic boss battles set against ancient ruins before they\r\nwere ancient\r\n\r\nNOTE:\r\n\r\nThis is the Okhlos: Olympus Edition with all the bonus content\r\n\r\nINSTALL NOTES\r\n\r\n1. Unpack the release\r\n2. Mount or burn image\r\n3. Install\r\n4. Play the game\r\n5. Support the companies, which software you actually enjoy","torrent":{"xt":"urn:btih:7c023e9d92057cf47cd066469fd6b184c0e99481","amp;dn":"Okhlos-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c023e9d92057cf47cd066469fd6b184c0e99481","infoHashBuffer":{"type":"Buffer","data":[124,2,62,157,146,5,124,244,124,208,102,70,159,214,177,132,192,233,148,129]},"announce":[],"urlList":[]}}