{"title":"Fatigue Limit in Metals - Claude Bathias","uid":14762329,"size":5454107,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7cab1b5115b9d47e9689725f1f34468763c53701&amp;dn=Fatigue+Limit+in+Metals+-+Claude+Bathias&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1464854502,"description":"Fatigue Limit in Metals - Claude Bathias (Wiley-ISTE, 2014).pdf\r\n\r\nISBN 9781848214767\r\n\r\nIs there a fatigue limit in metals? This question is the main focus of this book.\r\nWritten by a leading researcher in the field, Claude Bathias presents a thorough and authoritative examination of the coupling between plasticity, crack initiation and heat dissipation for lifetimes that exceed the billion cycle, leading us to question the concept of the fatigue limit, both theoretically and technologically.\r\nThis is a follow-up to the Fatigue of Materials and Structures series of books previously published in 2011.\r\nContents\r\n\r\n1. Introduction on Very High Cycle Fatigue.\r\n2. Plasticity and Initiation in Gigacycle Fatigue.\r\n3. Heating Dissipation in the Gigacycle Regime.\r\n\r\nAbout the Authors\r\n\r\nClaude Bathias is Emeritus Professor at the University of Paris 10-La Defense in France. He started his career as a research engineer in the aerospace and military industry where he remained for 20 years before becoming director of the CNRS laboratory ERA 914 at the University of Compiègne in France. He has launched two international conferences about fatigue: International Conference on the Fatigue of Composite Materials (ICFC) and Very High Cycle Fatigue (VHCF).\r\n\r\nThis new, up-to-date text supplements the book Fatigue of Materials and Structures, which had been previously published by ISTE and John Wiley in 2011. A thorough review of coupling between plasticity, crack priming, and thermal dissipation for lifespans higher than a billion of cycle has led us to question the concept of fatigue limit, from both the theoretical and technological point of view. This book will address that and more","torrent":{"xt":"urn:btih:7cab1b5115b9d47e9689725f1f34468763c53701","amp;dn":"Fatigue+Limit+in+Metals+-+Claude+Bathias","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cab1b5115b9d47e9689725f1f34468763c53701","infoHashBuffer":{"type":"Buffer","data":[124,171,27,81,21,185,212,126,150,137,114,95,31,52,70,135,99,197,55,1]},"announce":[],"urlList":[]}}