{"title":"Dixon of Dock Green - series 1 (BBC)","uid":6602083,"size":158158334,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7cb8a2893700ba729afde05b80abfbb537229fbc&amp;dn=Dixon+of+Dock+Green+-+series+1+%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fakeplastictrousers2","files":8,"time":1313246209,"description":"Dixon of Dock Green\n\nFrom BBC Radio 4 Extra. Dramatised by Sue Rodwell; Based on original screenplays by Ted Willis; Full-cast dramatisation starring David Calder and David Tennant.\n\nEpisode 1: London Pride\n\nGeorge Dixon is showing new boy Andy Crawford the ropes on the beat of Dock Green. To PC Crawford's surprise, Dixon is prepared to bend the rules in order to arrest one of a gang of safebreakers.\n\nEpisode 2: Needle in a Haystack\n\nA baby's life is in danger when some pep pills go missing and Dixon causes a stir at home when he offers PC Crawford the spare room.\n\nEpisode 3: Crawford's First Pinch\n\nSome unsavoury postcards turn up on the Dock Green beat and the link to a recent spate of bicycle thefts makes Andy desperate to notch up his first arrest.some unsavoury postcards turn up on the dock green beat and the link to a recent spate of bicycle thefts makes andy desperate to notch up his first arrest.\n\nEpisode 4: Dixie\n\nWhen things go missing from the Dixon household Doris, the downtrodden girl from next door, is exposed as a petty thief. But it's Mary Dixon who comes to her rescue, against George's wishes, and who earns the admiration of Andy Crawford.\n\nEpisode 5: Rock, Rattle and Roll\n\nWhen a fanatical Spurs fan has his prized football rattle stolen, an FA cup tie provides the perfect excuse for a weekend away in Blackpool for Andy and Mary.\n\nEpisode 6: Roaring Boy\n\nMary and Andy have some exciting news for George but George is nowhere to be found - and on the other side of Dock Green a desperate young man with a gun is on the run.","torrent":{"xt":"urn:btih:7cb8a2893700ba729afde05b80abfbb537229fbc","amp;dn":"Dixon+of+Dock+Green+-+series+1+%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cb8a2893700ba729afde05b80abfbb537229fbc","infoHashBuffer":{"type":"Buffer","data":[124,184,162,137,55,0,186,114,154,253,224,91,128,171,251,181,55,34,159,188]},"announce":[],"urlList":[]}}