{"title":"ARIA_GIOVANNI.iso","uid":4303186,"size":7048724480,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7d760102afbae151fa199b2b10377e229ca69494&amp;dn=ARIA_GIOVANNI.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"fordman460","files":1,"time":1216413279,"description":"\n\n\n\n\n\n\nMr. BubbleGirls says. &quot;This is a completely new unabridged edit of Aria&amp;#039;s Video!!! I met Aria in San Diego back before she became a big adult star. Believe it or not, she came to me from an Ad I had in the paper looking for models. She had never done any nude modeling at all either for stills or video. But it was clear she loved showing off her body. I shot her several times. First in a small stills set in my downtown studio as an Audition. Later, I shot her twice more both for stills and video. Once in another studio and once at a hotel. I found Aria to be very open and willing to try everything I asked. She did a fisting scene, played with herself and came several times, and even did a peeing scene. She never did anal and I missed my opportunity to shoot her doing boy/girl but this sexy superstar went on after this video to become hugely popular and you will never see her do the nasty things she did for me anywhere else. Her video starts out with a shaving scene during which Aria gets hot enough to start playing with herself. After she has come Aria lubes up her voluptious body with baby oil. She lubes her pussy and then proceeds to shove her entire hand inside herself. COMPLETE FISTING!!! She works it completely in and out for several minutes. Following this scene she gets up and rubs lotion on herself. She gets excited and lays down to play with herself again. She has a violent shaking orgasm! Next we see Aria in a chair wearing a sexy floral dress with no panties. She begins to rub herself and then must get undressed. She plays using her fingers then pulls out a vibrator which she uses till she orgasms hard. She shakes and screams with excitement. The next scene is Aria humping a large clear dildo. She mounts it to a table and fucks it till her legs give way. Then takes it to a chair and uses two hands to pump it vigorously in and out of her eager pussy. The next scene is Aria peeing in the bathtub. She really gets off on peeing for the camera. She pees all over herself and way up into the air. In Aria&amp;#039;s final scene she takes a bubble bath. She plays around for a while then takes out a dildo and fucks herself again! If you are a big Aria fan you will love this video. The video is now longer and less compressed than before so the image quality is higher as well.&quot; \n\nThe ISO will fit on a single sided dual layer DVD. ","torrent":{"xt":"urn:btih:7d760102afbae151fa199b2b10377e229ca69494","amp;dn":"ARIA_GIOVANNI.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d760102afbae151fa199b2b10377e229ca69494","infoHashBuffer":{"type":"Buffer","data":[125,118,1,2,175,186,225,81,250,25,155,43,16,55,126,34,156,166,148,148]},"announce":[],"urlList":[]}}