{"title":"Efofex FX Graph 5.002.0","uid":7699298,"size":14890368,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7e127b439299a8e7cedbe75a69956a4e207cd442&amp;dn=Efofex+FX+Graph+5.002.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1349461152,"description":"\nMost graphing packages offer powerful features but they are difficult to learn, difficult to teach and difficult to use. Many schools spend more time teaching students how to use the program rather than actually using it. FX Graph is different - it is dead simple. So simple that secondary students will be using it to solve problems within minutes of first seeing it.\n\nAs a quick example, think how long it would take you to draw this graph, with the annotations, in your current graphing package. In FX Graph 4 it takes seconds. FX Graph finds all the points of interest and displays them automatically as you move your mouse around the screen. One click and the annotation is added to the graph. Does simplicity limit versatility? Not with FX Graph 3. FX Graph has a large number of capabilities - far more than we can show you here.\n\nWhat's Wrong With Other Graphing Packages?\n\nMost graphing packages have their individual strengths but we have identified six common faults.\nFault\nFX Graph 4\nSetting axes is too difficult. Students find it near impossible to set suitable axes for graphs. FX Graph makes setting axes about as easy as it can be - it can even be totally automatic. Axes that would take minutes to create with other graphing packages can be created in seconds.\nEntering functions is too difficult. There are too many &quot;tricks&quot; to learn. FX Graph uses Efofex's equation technology. Equations are entered as the student sees them. There are very few &quot;tricks&quot; to learn.\nFinding Points of Interest (maxima, minima, intercepts, asymptotes, point discontinuities, points of intersection, points of inflection) is too difficult. FX Graph automatically calculates all points of interest and displays them when the mouse is close. There is nothing to learn - just move the mouse.\nAnnotating graphs - adding labels to important points is too difficult or impossible. FX Graph allows you to add comprehensive annotations to graphs with a simple click. When FX Graph AUTOMATICALLY displays an important point, ONE CLICK will turn it into a permanent annotation.\nThe graphs the package draws do not look like the ones you draw. FX Graph will let you draw graphs exactly the way you want them. Our international focus means that just about every option is available.\nThe packages are too complex and overwhelming - especially for younger students. FX Graph is designed to be simple to use with a very small learning curve. Thirteen year old, average students will be using it to graph functions in minutes. Eighteen year old, talented students will not find it limiting.","torrent":{"xt":"urn:btih:7e127b439299a8e7cedbe75a69956a4e207cd442","amp;dn":"Efofex+FX+Graph+5.002.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e127b439299a8e7cedbe75a69956a4e207cd442","infoHashBuffer":{"type":"Buffer","data":[126,18,123,67,146,153,168,231,206,219,231,90,105,149,106,78,32,124,212,66]},"announce":[],"urlList":[]}}