{"title":"Cooke-IRA &amp; Ethnic Cleansing in Ulster Today(1997)","uid":4640353,"size":339572,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ecdf48d90610c6a253c38e0e3686badb48b0730&amp;dn=Cooke-IRA+%26+Ethnic+Cleansing+in+Ulster+Today%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1231695088,"description":"This is Ronald Cooke's amazing book The IRA and Ethnic Cleansing in Ulster Today (1997) which exposes the one-sided coverage of religious and political conflict in Ireland with an emphasis on the Protestant faction and its relation to IRA terrorism. The North of Ireland has been subjected to unbelievable pressures for the past thirty years. These have come from the Irish Republican Army (IRA) which is represented politically by Sinn Fein. They have also come from the Irish-Americans and the government of the Republic of Ireland (Eire) and from the Roman Catholic clergy. The international news media for the most part have failed to do justice to the Ulster Protestant side in this whole struggle. As of this writing, CNN is reporting on the confrontations in Ulster during the past few days. After giving a few details about the disturbances they only interviewed several Irish-Americans in New York. It is certainly noteworthy to recognize the fact that not one Ulster person, or anyone sympathetic to the Ulster side, was ever interviewed. The US news media may not intend to give such a one-sided picture, but much of the news reporting on Ulster comes across as if over one million Protestants either do not exist or have any democratic rights whatsoever. This brief study looks at this struggle from the side of the Ulster Protestant as they have been virtually ignored in the US. However, in recent days there are encouraging signs that at least some members of the US news media are beginning to take a closer look at the violence of the IRA and those who support them. While today our eyes are set mostly on the conflict in the Middle East, The IRA and Ethnic Cleansing in Ulster Today reminds us that there exists another &quot;holy&quot; war that has been almost forgotten or at least one-sidedly presented to the world. 100 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:7ecdf48d90610c6a253c38e0e3686badb48b0730","amp;dn":"Cooke-IRA+%26+Ethnic+Cleansing+in+Ulster+Today%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ecdf48d90610c6a253c38e0e3686badb48b0730","infoHashBuffer":{"type":"Buffer","data":[126,205,244,141,144,97,12,106,37,60,56,224,227,104,107,173,180,139,7,48]},"announce":[],"urlList":[]}}