{"title":"Doom Patrol v2","uid":4168777,"size":976880140,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7f2db2cbac5a602cc7ce5cf7f4635be6bab53242&amp;dn=Doom+Patrol+v2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gilgamesh07","files":97,"time":1209748082,"description":"By request from the forums.\n\nThis torrent contains DC comics&amp;#039; Doom Patrol v2 in its entirety.\n\n(pruned from wikipedia)\n\nThe Doom Patrol is a fictional superhero team appearing in publications from DC Comics. The original Doom Patrol first appeared in My Greatest Adventure #80 (June 1963). Writers Bob Haney and Arnold Drake and artist Bruno Premiani created the team. The Doom Patrol has since appeared in multiple incarnations.\n\nThe first Doom Patrol consisted of super-powered misfits, whose &quot;gifts&quot; caused them alienation and trauma. The series was canceled in 1968, and Drake killed the team off in the final issue, Doom Patrol #121 (September-October 1968).\n\nThe relaunch, written by Kupperberg and illustrated by artist Steve Lightle, later replaced by a young Erik Larsen after issue 5, showed a more superheroic version of the Doom Patrol. It included new members who were hired to the team: the magnetically-empowered strong-girl Lodestone; Karma, whose psychic power made sure that anyone trying to attack him would wind up falling over themselves; and Scott Fischer, whose body generated phenomenal quantities of heat focussed through his hands, requiring him to wear protective gloves at all times. Most were not particularly interested in a heroic life. Lodestone stayed for the sense of security; Karma stayed there because it helped him hide from the law. Only Scott Fischer wanted to be a superhero in the traditional sense, and he was rather naive about the real world. After issue 18 and the events of the Invasion miniseries, Kupperberg left the series. DC Comics gave Grant Morrison the task of writing the book\nstarting with issue #19. Kupperberg agreed to help Morrison by writing out characters Morrison did not want to use. Celsius and Scott Fischer died before issue #19 (Celsius was killed in an explosion in DC Comics&amp;#039; &quot;Invasion!&quot; event, and Scott Fischer (already suffering from a recurrence of childhood leukemia) was the only known active superhero casualty of the Dominators&amp;#039; gene-bomb (also in &quot;Invasion!&quot;); Karma left the team as he was still on the run from the law (he would eventually become a member of the Suicide Squad and die on his first mission with them in the &quot;War of the Gods&quot; crossover event); the Negative Spirit left Negative Woman&amp;#039;s body; and Lodestone plunged into a coma, where she would remain for the first half of Morrison&amp;#039;s run on the book. Tempest gave up fieldwork to become the team&amp;#039;s physician. Conversely, Morrison picked up a throw-away character from DP #14, who was slipped into the art on the last page of #18 to set up Morrison&amp;#039;s use, Dorothy Spinner, an ape-faced girl with powerful &quot;imaginary friends.&quot; The new writer introduced some new characters to the team, including the multiple personality-afflicted Crazy Jane; and sentient roadway Danny the Street.\n\nMorrison used DC&amp;#039;s Invasion crossover to restart the book. He took the Doom Patrol, and superhero comic books in general, to places they had rarely been, incorporating bizarre secret societies, elements of Dada, surrealism, and the cut-up technique pioneered by William S. Burroughs and Brion Gysin. He also borrowed the ideas of Jorge Luis Borges and Heinrich Hoffmann. Morrison and artist Richard Case turned the title around, and the series quickly gained a cult following, but some derided it as incomprehensible. The original creator Arnold Drake, disagreed, maintaining that Morrison&amp;#039;s was the only subsequent run to reflect the intent of the original series.\n\nMorrison left the book with issue #63, and Rachel Pollack took over writing the book the next issue. Pollack&amp;#039;s first issue was also the first under the new Vertigo imprint of DC Comics (although the trade paperback edition of Morrison&amp;#039;s work does bear the imprint, the original issues did not). Returning characters for Rachel Pollack&amp;#039;s run included Cliff Steele, Niles Caulder (kept alive by the nanobots, but reduced to a disembodied head, usually kept on a tray filled with ice), and Dorothy Spinner. Pollack&amp;#039;s run had Dorothy as a primary member of the Patrol; she brought her imaginary friends to her aid in combat. Overall, Pollack&amp;#039;s run dealt with issues such as the generation gap, humanity, identity, transgenderism, bisexuality, and borrowed elements from Judaism and Kabbalah in the last few issues. The angel Akatriel is used as a major character in the last four issues.\n\nThe first story arc of her run was called Sliding In The Wreckage. Cliff&amp;#039;s computer brain started to malfunction, and he regressed into flashbacks from previous storylines. Dorothy was haunted by African spirits while dealing with living alone in the real world. The Chief was given a new body by Will Magnus, but to atone for his sins, Caulder ripped his head off the body and was kept in cryogenic storage. Meanwhile, the entire Earth had been suffering from random outbreaks of weirdness, contributed by the arrival of something called &quot;The Book of Ice.&quot; A government agency known as the Builders, similar to the Men from N.O.W.H.E.R.E., were trying to stop the outbreak, which was apparently linked to a race of shapeshifters known as the Teiresias. As the Chief was kept in cryogenic state, he appeared in the land of the Teiresias as a face carved in a mountain. They warned him that his arrival in this world was causing the craziness in the real world. Throughout the storyline, little people with backwards letters for heads had been seen altering people. These people were apparently older version of nanomachines, referred to as &quot;nannos.&quot; At the DP HQ Builder agents attacked and in the craziness, two of the Teiresias approached Dorothy with a new brain for Cliff, but to insert it she needed the Chief&amp;#039;s expertise. In the Teiresias world, nannos &quot;repaired&quot; the Chief so he could live as a severed head. After his awakening, the craziness seemed to stop, and Dorothy, Cliff, and the Chief each realized that they needed to be together.\n\nThe team relocated to Violet Valley&amp;#039;s Rainbow Estates, a house haunted by ghosts of those who died in sexual accidents. There, three new members joined. The Bandage People, George and Marion, who were once two workers for the Builders but managed to escape; and the Inner Child, a manifestation of the ghosts&amp;#039; purity and innocence. Another later newcomer of the team was Kate Godwin, aka Coagula, one of the first transsexual superheroes. A one-time ally of the team called the Identity Addict, who could become different superheroes by shedding his/her skin like a lizard, integrated him/herself back into the team while using the False Memory identity to change the team&amp;#039;s memories, until he/she was kicked out by Dorothy.\n\nVillains that the team fought, besides the Builders, included the Fox and the Crow, two animal spirits whose feud Dorothy and Cliff were subsequently pulled into; the Master Cleaner, a being with a human fetus inside a bubble for a head who began &quot;cleaning&quot; the world by stripping it down to nothing and replacing the stolen items, including people, with a paper ticket; and a group of Hassidic healers who called themselves the False Healers and their leader, the Rabbi of Darkness.\n\nToward the end of the series, Cliff Steele&amp;#039;s brain became entirely robotic, until Dorothy Spinner used her imaginary friends to &quot;repair&quot; it. The Chief would later die after trying to enter the Sephirot or Tree of Life.\n\nA new artist, Ted McKeever, took over the artwork for the final 13 issues. Pollack continued writing the title until its cancellation with issue #87, in February 1995.\n\nThanks to the scanners and the varied original sources.\n\nPlease seed. Please enjoy.\n","torrent":{"xt":"urn:btih:7f2db2cbac5a602cc7ce5cf7f4635be6bab53242","amp;dn":"Doom+Patrol+v2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f2db2cbac5a602cc7ce5cf7f4635be6bab53242","infoHashBuffer":{"type":"Buffer","data":[127,45,178,203,172,90,96,44,199,206,92,247,244,99,91,230,186,181,50,66]},"announce":[],"urlList":[]}}