{"title":"Love Systems - Social Circle Mastery","uid":9659722,"size":1031379195,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7f69f1f6478af6d5b1c6a30ee1a182cc5f596384&amp;dn=Love+Systems+-+Social+Circle+Mastery&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sususa","files":6,"time":1393254376,"description":"Social Circle Mastery\n\nHow would your life be different, if you could:\nMeet a consistent stream of beautiful women without ever having to feel awkward or do a &quot;cold approach&quot; again.\nBreak into any clique or social circle you wanted, and rise to the top?\nTurn &quot;Friends&quot; (and &quot;Let's Just Be Friends&quot;) into girlfriends and friends with benefits, or get your ex-girlfriend back?\nBe the alpha male of any group?\nHave friends who regularly introduce you to beautiful women and give you access to elite social and professional opportunities?\nFor the first time, these skills are within ANY man's reach. \n\nA few years ago, two of the world's top pickup artists, by the names of Braddock and Mr M, developed a series of techniques to break into any social group and rise to the top. \n\nAt first they did this to get access to the most beautiful women. Then they realized they were onto something much more powerful - a complete system to get exactly the kind of social life you want. \n\nThey began sharing their system at sold-out Social Circle Mastery seminars in London, Los Angeles, and New York (where they lived). But at $1,200 plus travel costs, these were out of reach for most men. \n\n(In fact, for the last couple years there's been a big online petition asking them to record one of these famous seminars and sell it on DVD) \n\nThey went one better. No longer limited by how much someone could learn in a single seminar, they loaded the Social Circle Mastery Home Study Course with books, DVDs, audio, quickstart guides, on-screen directions, exclusive bonuses, and more.\n","torrent":{"xt":"urn:btih:7f69f1f6478af6d5b1c6a30ee1a182cc5f596384","amp;dn":"Love+Systems+-+Social+Circle+Mastery","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f69f1f6478af6d5b1c6a30ee1a182cc5f596384","infoHashBuffer":{"type":"Buffer","data":[127,105,241,246,71,138,246,213,177,198,163,14,225,161,130,204,95,89,99,132]},"announce":[],"urlList":[]}}