{"title":"The Cholesterol Conspiracy by Russell Smith (PDF)","uid":10445659,"size":86419873,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7fec9039aaa7829be66f85fa67aaff44d32708a6&amp;dn=The+Cholesterol+Conspiracy+by+Russell+Smith+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Blood-Wiper","files":1,"time":1403915190,"description":"If you are willing to question the conventional information presented in the mainstream press concerning diet, fat and cholesterol this is your book. If you've wondered how the currently recommended diet, high in carbohydrates, many of which are basically the least nutritionally dense foods out there, could possibly be right. If you have wondered how cholesterol, a necessary precursor to most of our bodies' hormones and a sustance that our own liver manufacters in amounts of upwards of 2000 mg. a day could possibly be bad, read this book. But be patient, it is quiet ponderous. Extensively footnoted, it takes all of the so called studies of the last 40 years and carefully analyzes the data, presenting a case which the American people have not heard, that is, that dietary cholesterol and saturated fat are not the cause of coronary heart disease and that basically the American Heart Association and others have literally misled the public. Please,if you are open minded read this book. The truth deserves to be heard. ","torrent":{"xt":"urn:btih:7fec9039aaa7829be66f85fa67aaff44d32708a6","amp;dn":"The+Cholesterol+Conspiracy+by+Russell+Smith+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fec9039aaa7829be66f85fa67aaff44d32708a6","infoHashBuffer":{"type":"Buffer","data":[127,236,144,57,170,167,130,155,230,111,133,250,103,170,255,68,211,39,8,166]},"announce":[],"urlList":[]}}