{"title":"Mountains - Centralia (2013) [FLAC]","uid":8046420,"size":403761488,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:80b530e9ba21932fe19a6721853a235c0f78682f&amp;dn=Mountains+-+Centralia+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1358759641,"description":"\n  Mountains - Centralia (2013) [FLAC]\n\n  Released: 2013\n  Duration: 1:06:31\n  Genre: Electronic\n  Style: Ambient, Experimental\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps \n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front \n\n  01 Sand\n  02 Identical Ship\n  03 Circular C\n  04 Tilt\n  05 Propeller\n  06 Liana\n  07 Living Lens\n\n  It's not an attempt at a weak pun to say that Brooklyn-based electro-acoustic droners Mountains have always had a unique majesty to their sound. Where some of their peers deal in gooey synths, oozing electronic bubblings, and generally messy stews of texture, Mountains' sole members Koen Holtkamp and Brendon Anderegg have always turned in instrumental music so metered, deliberate, and precise it comes off almost zen-like. The duo's sound reaches the rare space between surefootedness and a nearly telepathic ability to play off of each other's weavings of electronic bubbles and plaintive acoustic sounds. With Centralia, Mountains reach their creative apex with a set of tracks so layered and meticulously composed they best the already stellar density of all previous work. \n\n  Minutes into opening track &quot;Sand,&quot; textural shifts come and go like sped-up film footage of traffic moving through a busy city. Gentle electric guitar gives way to washes of analog synth and rickety rattlesnake rhythmic pulses before blooming into an enormous middle section and gently settling into a final three minutes of languid strings. The song's movements flow incredibly naturally, avoiding the pitfalls of either overly long improvisation or would-be &quot;epic&quot; compositional rock. This state of organically shifting movements is the album's biggest strength. The contemplative dance between acoustic guitar and uneasy synth on &quot;Circular C&quot; grows out of minimal low-range keyboard arpeggios and drifts into a segment of acoustic piano notes processed until they sound like birds cawing in the jungle. &quot;Tilt&quot; leans on the pastoral modes of U.K. folk to build its repetitive mantra, but recedes into a bed of field recordings for its final minutes. \n\n  The attention to composition and ever-unfolding layers plays out to its heights in album centerpiece &quot;Propeller.&quot; The tracks' 20-plus minutes wash by meditatively, with stereo-panned textures and lazy electric guitar softly mutating into laser beams of e-bowed guitar and a gorgeously eviscerating synth meltdown. The dust clears and the song fades out in a storm of white noise that first sounds harsh but eventually takes on the sound of gentle rain. Much like the entire album, the lengthy song progresses carefully and once it's done, it feels like no time has passed at all. Mountains take their craft to a new level with Centralia. While all of their previous albums had their unique mesh of precision and exploration, never have they sounded as inspired and detailed. It's an album so well-made it easily tricks the ear into hearing its endless layers and shifts as a singular glowing whole. Much like the best of Eno's ambient work, Centralia is captivating without demanding attention, instead letting the listener wander into its web on their own.","torrent":{"xt":"urn:btih:80b530e9ba21932fe19a6721853a235c0f78682f","amp;dn":"Mountains+-+Centralia+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80b530e9ba21932fe19a6721853a235c0f78682f","infoHashBuffer":{"type":"Buffer","data":[128,181,48,233,186,33,147,47,225,154,103,33,133,58,35,92,15,120,104,47]},"announce":[],"urlList":[]}}