{"title":"Cinch 1.0.6 Precracked","uid":6628194,"size":1687339,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:8199021ed360e1a3e7a8f875c5dc70248ec6e570&amp;dn=Cinch+1.0.6+Precracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"havoc5289","files":-1,"time":1314230916,"description":"Cinch gives you simple, mouse-driven window management by defining the left, right, and top edges of your screen as 'hot zones'. Drag a window until the mouse cursor enters one of these zones then drop the window to have it cinch into place. Cinching to the left or right edges of the screen will resize the window to fill exactly half the screen, allowing you to easily compare two windows side-by-side (splitscreen). Cinching to the top edge of the screen will resize the window to fill the entire screen (fullscreen). Dragging a window away from its cinched position will restore the window to its original size.\n\nTips\n-Drag windows by the title bar for best results.\n-Cinch works best with single monitor systems as the edge between monitors is difficult to cinch to, but it can be done. Here is a trick to make it easier.\n-If you have Spaces enabled, holding a window on the edge of the screen for too long will activate a Space change which may interfere with using Cinch. You will quickly get used to the timing, but you can also change the delay with this handy trick.\n\nVersion 1.0.6 provides support for Mac OSX 10.7 (Lion)\n\nPrecracked (NOTE: I did not crack this, I found it in the internet at a hard to find place so I uploaded it here to make it available to those who use TPB)\n\n","torrent":{"xt":"urn:btih:8199021ed360e1a3e7a8f875c5dc70248ec6e570","amp;dn":"Cinch+1.0.6+Precracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8199021ed360e1a3e7a8f875c5dc70248ec6e570","infoHashBuffer":{"type":"Buffer","data":[129,153,2,30,211,96,225,163,231,168,248,117,197,220,112,36,142,198,229,112]},"announce":[],"urlList":[]}}