{"title":"New York City Ballet Workout 1","uid":6669387,"size":686650452,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:81e64ec4c792a3a57bb3a432d720352c6a95b69e&amp;dn=New+York+City+Ballet+Workout+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NuclearPixie","files":-1,"time":1315816836,"description":"Do you envy ballet dancers their long, lean bodies and graceful, elegant movements? This beautifully produced exercise video was developed by Peter Martins and the New York City Ballet with the New York Sports Club. First you watch the rippling muscles of four gorgeous ballet dancers (two men and two women) performing warm-up moves to classical ballet music. Martins uses ballet terminology in his cuing and no technique is taught, so it's look-and-follow if you have no previous ballet training. Next you get down on a mat for slow lower-body stretches. A difficult abdominal series is next, followed by &quot;floor barre&quot; exercises to tone the thighs and buttocks while still using the abdominals. After introducing moves to strengthen the back and upper body, Martins runs through a series of standing exercise segments using various ballet movements to strengthen the legs and postural muscles. The workout is divided into 17 short sections, which may give it a disjointed feeling if you're used to more continuity. At the end is a bonus sequence with profiles of the four performers, all dancers with the New York City Ballet. We get to watch them performing, practicing, and eating. One dancer makes the point that ballet is very athletic, but because it's supposed to look ethereal, the hard work stays hidden from the audience. If you love ballet (even just watching it), you'll enjoy this workout. ","torrent":{"xt":"urn:btih:81e64ec4c792a3a57bb3a432d720352c6a95b69e","amp;dn":"New+York+City+Ballet+Workout+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81e64ec4c792a3a57bb3a432d720352c6a95b69e","infoHashBuffer":{"type":"Buffer","data":[129,230,78,196,199,146,163,165,123,179,164,50,215,32,53,44,106,149,182,158]},"announce":[],"urlList":[]}}