{"title":"super mp3 recorder pro 6.2","uid":3375427,"size":2276849,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:81edffe7a5885973e1c87cb0b33914f8adc5f947&amp;dn=super+mp3+recorder+pro+6.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GLDMadMax","files":2,"time":1125152056,"description":"Super Mp3 Recorder Professional, the powerful recorder, editor and player, makes a complete recording studio of your computer.  With the recorder you can record voice from microphone, internet streaming audio, or music played by Winamp, Windows Media Player, Quick Time, Real Player, Flash, games, etc. Super Mp3 Recorder Pro is able to automatically detect the recording formats your sound card supports and then set the application's parameters for the best possible performance. The recordings can be saved as .mp3, .wav, .wma, .vqf and .ogg files. What makes Super Mp3 Recorder Pro more powerful is its editing feature. It can edit audio files as you desire by cutting, copying, pasting, trimming and various DSP effects. Another useful feature is recording schedule which enables automatic recording, that is, Super Mp3 Recorder Pro starts and stops recording at any time you want.\n\nSuper Mp3 Recorder Pro has a Voice Activation System with which you can choose to skip silent passages, or stop the recording after a certain amount of silence. This option is especially useful when you're recording streaming audio and net congestion temporarily stops the stream. Instead of having a big blank spot in your recording, Super Mp3 Recorder Pro will just pause and wait for the signal to reappear. \n\nSystem Requirement:\n\nWindows 98, ME, 2000, XP or 2003 Server\nFull-duplex sound card is also required.","torrent":{"xt":"urn:btih:81edffe7a5885973e1c87cb0b33914f8adc5f947","amp;dn":"super+mp3+recorder+pro+6.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81edffe7a5885973e1c87cb0b33914f8adc5f947","infoHashBuffer":{"type":"Buffer","data":[129,237,255,231,165,136,89,115,225,200,124,176,179,57,20,248,173,197,249,71]},"announce":[],"urlList":[]}}