{"title":"Gregory Benford - Across The Sea Of Suns (Galactic Center #2)","uid":11600708,"size":195389507,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:825fc821328fdf9fac8675ae97ce89f0d1135276&amp;dn=Gregory+Benford+-+Across+The+Sea+Of+Suns+%28Galactic+Center+%232%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":1,"time":1417342786,"description":"Gregory Benford - Across The Sea Of Suns (Galactic Center #2)\n\nAcross the Sea of Suns is a 1984 hard science fiction novel by Gregory Benford. It is the second novel in his Galactic Center Saga, and continues to follow the scientist Nigel Walmsley, who encountered a machine extraterrestrial in the previous book, In the Ocean of Night aboard an expeditionary spaceflight to find other life. Eventually Nigel discovers evidence of the major conflict in the galaxy. \n\nRadio astronomy in 2021 reveals planetary life near a red dwarf. Earth repurposes a colony that was to be stationed at a Lagrange point, converting it into Lancer, a Bussard ramjet interstellar based on an alien craft found in the Mare Marginis, sending it to investigate.\nIt arrives in 2061, finding primitive nomads broadcasting with electromagnetic organs. The transmission is a 50s radio show--a signal those dubbed the EMs consider best to reply to Earth with. A orbiting satellite is discovered, from when a meteor shower destroyed EM civilization a million years past.\nOn Earth, international commerce halts when mysterious spaceships drop sea creatures dubbed Swarmers &amp; Skimmers. They multiply. Swarmers attack.\nThe expedition's 1st contacts go poorly. Attempts to enter the more interesting of two satellites prompts retaliation with weapons that kill most of the crew involved. The attempt to contact the EMs on Isis doesn't go well either. EMs are confused by a human on the surface. They'd been expecting a reply from Earth itself. In the confusion, they attempt to simultaneously broadcast their elaborate summary of their history &amp; to see the messenger. Unfortunately, all their transmissions cook the communications specialist alive. A standby team misinterprets this tragic incident as a deliberate attack &amp; massacres the EMs.\nNigel works with mathematicians to interpret the transmissions. Analysis reveals their technologically advanced civilization had attracted the attention of machines, perishing in a prolonged bombardment. The bombardment of asteroids cracked open the planetary crust, altering the ecosphere. The EMs altered their bodies to use silicon &amp; transistors for a nervous system. The watching satellite is programmed to react to high tech, not inbuilt organic features so the EMs were able to broadcast their message for help.\nNo sooner has some genuine two-way communication been established than orders come to move onto a new system where Skimmers &amp; Swarmers may've come from. They occupy themselves en route analysing reports from the far-flung space probes: everywhere except Earth that traces could be found, anomalies like other watchers abound.\nWalmsley theorizes that a machine-based race was responsible for the anomalies. Swarmers represent a 1st-strike at Earth which had thus far eluded the machines' attempts to kill it, since the assigned Watcher-satellite was destroyed by the Mare Marginis wreck. His theories are generally disregarded as too speculative. The consensus is that Watchers are a common form of weaponry left over from when biological races suicide, the Swarmer invasion simply a grab for a relatively unspoiled world.\nAt the next system a moon like Ganymede is found with a Watcher orbiting. Initially it's taken as a disproof of Walmsley's Rule that watchers occur around any decimated world that once harbored technologically advanced life, but Ted, the de facto leader who's always disliked Walmsley, attempts to covertly force him into hibernation until the return to Earth. Walmsley breaks out part-way thru the medical preparations, escaping to the moon in a submersible. Avoiding the Lancer's pursuers, he discovers a much-reduced sapient civilization that had links to the EMs before the Watcher came. The Watcher prevents them from ever reaching the surface &amp; from developing much technology, but it cannot kill them. They're protected by ten kilometres of ice.\nDuring the standoff, nine year old news comes from Earth that the Swarmers have begun land invasions. The tense superpowers suspect each other, escalating into a nuclear war. The machines send their flotilla against Earth when the defences are denuded, destroyed or depleted.\nThis grim news galvanizes the crew to action. They agree to reactivate the fusion drive &amp; turn the plume on the Watcher. This cripples it, but its retaliation does more damage to Lancer, destroying the drive","torrent":{"xt":"urn:btih:825fc821328fdf9fac8675ae97ce89f0d1135276","amp;dn":"Gregory+Benford+-+Across+The+Sea+Of+Suns+%28Galactic+Center+%232%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"825fc821328fdf9fac8675ae97ce89f0d1135276","infoHashBuffer":{"type":"Buffer","data":[130,95,200,33,50,143,223,159,172,134,117,174,151,206,137,240,209,19,82,118]},"announce":[],"urlList":[]}}