{"title":"The Remains - Same (1966) MP3@320","uid":9633873,"size":62395167,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:82a2938626288253093a9335892026b2d6f50746&amp;dn=The+Remains+-+Same+%281966%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AaronVincent","files":11,"time":1392822343,"description":"Most 1960s garage rock obsessives collect singles rather than albums for a good reason: While plenty of snarling teenagers could come up with two decent songs at a stretch, a precious few seemed able to brainstorm a dozen tunes without reaching to the bottom of the barrel or resorting to covers of other people's hits. But there were exceptions to this rule, among them the Sonics, the Litter, and, especially, the Remains, who never enjoyed much success on the national charts but were fabled heroes in their home town of Boston. the Remains' 1966 album for Epic is a classic, packed with great songs from singer/guitarist Barry Tashian, bassist Vern Miller, and pianist Bill Briggs, and boasting exciting, fiery performances, and if the full firepower of their legendary live shows didn't always come through on tape, even the album's weakest moments made clear the Remains were tougher, smarter, and tighter than the vast majority of their competition. The Remains is mid-'60s American rock &amp; roll at it's best, and you don't have to own any paisley clothing to enjoy it.","torrent":{"xt":"urn:btih:82a2938626288253093a9335892026b2d6f50746","amp;dn":"The+Remains+-+Same+%281966%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82a2938626288253093a9335892026b2d6f50746","infoHashBuffer":{"type":"Buffer","data":[130,162,147,134,38,40,130,83,9,58,147,53,137,32,38,178,214,245,7,70]},"announce":[],"urlList":[]}}