{"title":"Minecraft - Pocket Edition v0.15.0 alpha2 premium mods [apkpita]","uid":14636885,"size":45916958,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:82f3d3cdaaaa546e23a28f7b01ab9ee4d8448a9d&amp;dn=Minecraft+-+Pocket+Edition+v0.15.0+alpha2+premium+mods+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tiropitaki","files":2,"time":1463464082,"description":"Minecraft Pocket Edition - differs practically with nothing from the computer version therefore its admirers will find many familiar details in mobile option. It is amazing with special, unique retrostyle. All events in this world are extremely simple and casual. It is the game, where graphics and other technical features aren't so important as process. After all it opens a mass of interesting opportunities which leave nobody indifferent. In this game the user independently builds his own computer world by means of various blocks. \r\n\r\nIt isn't so simple, you have only elementary details complicating process and doing it more intriguing. \r\n\r\nCreating the Universe, it is possible to use different types of blocks carrying out different functions and having different properties. Using blocks, it is possible to build everything that your soul wishes, including: castles and palaces, roads and bridges, and even stadiums for golf. The game has pleasant postscoring: there’s no habitual music, but sounds of steps and all movements are very accurate. The game is played by means of a virtual joystick in the left part of the screen. To operate the review, it is necessary to slide a finger on the screen. To put a block, it is necessary to choose it in the menu, which is in the bottom of the screen, and to tap at the place where you want to put a block. It is very easy to break blocks too. For this purpose, it is enough to hold a finger on the block which needs to be broken. There will be a round indicator there. Speed of destruction depends on durability of the chosen block. In the game there is a multiplayer on Wi-Fi.\r\n\r\nOur latest free update includes a new Story Mode Skin Pack! Don one of 27 new skins and try your hand at our free Story Mode-themed map: http://aka.ms/storymodemap. Assemble a team of adventurers and see how long you can survive!\r\n\r\nExplore randomly generated worlds and build amazing things from the simplest of homes to the grandest of castles. Play in creative mode with unlimited resources or mine deep into the world in survival mode, crafting weapons and armor to fend off the dangerous mobs.\r\n\r\nCraft, create, and explore alone, or with friends on mobile devices or Windows 10.\r\n\r\nVersion v0.15.0 alpha2 is not officially released with a changelog yet. \r\n\r\nmod1: \r\nUnlocked premium skins \r\n\r\nmod2: \r\n1. Unlocked premium skins \r\n2. No damage mod \r\n3. Unlimited breath \r\n4. Max Inventory Size \r\n5. 1 hit kill with weapons \r\n6. Infinite furnace fire \r\n7. Max score \r\n8. Indestructible Tools\r\n\r\nRequirements: Android OS 2.3 and up","torrent":{"xt":"urn:btih:82f3d3cdaaaa546e23a28f7b01ab9ee4d8448a9d","amp;dn":"Minecraft+-+Pocket+Edition+v0.15.0+alpha2+premium+mods+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82f3d3cdaaaa546e23a28f7b01ab9ee4d8448a9d","infoHashBuffer":{"type":"Buffer","data":[130,243,211,205,170,170,84,110,35,162,143,123,1,171,158,228,216,68,138,157]},"announce":[],"urlList":[]}}