{"title":"Mu Fei - Xiao cheng zhi chun aka Spring in a Small Town (1948)","uid":5431630,"size":733921903,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:83120bce33101b4a3928d21fa6115da95ac04660&amp;dn=Mu+Fei+-+Xiao+cheng+zhi+chun+aka+Spring+in+a+Small+Town+%281948%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"lllTgolll","files":4,"time":1268440570,"description":"Mu Fei - Xiao cheng zhi chun aka Spring in a Small Town (1948)\n\n[img]http://people.cohums.ohio-state.edu/denton2/courses/c505/temp/springtownposter.jpg[/img]\n\nSynopsis: Produced in 1948 prior to the Communist takeover in China, Spring in a Small Town is a lyrical depiction of the intense psychological rivalry between two friends for the love of one woman. Directed by Fei Mu and based on a short story by Li Tianji, the film dramatizes the emotional entanglement of four people, conveying an intense eroticism that is powerful and haunting. Dai Liyan (Shi Yu), and his wife Zhou Yuwen, magnificently portrayed by the alluring Wei Wei, live in his old family house with Liyan's teenage sister, Dai Xiu (Zhang Hongmei) and the family servant Lao Huang (Cui Chaoming). Because of Liyan's tuberculosis, they are forced to sleep in separate rooms. Yuwen is a loyal and devoted wife but is bored and prefers to spend her time embroidering or going for solitary walks along the top of the crumbling city wall.\n\nJonathan Rosenbaum wrote:\n\n...1948 masterpiece Spring in a Small City by Fei Mu, widely considered the nation's greatest film by Mandarin speakers but tragically neglected by almost everyone else.\n\nNotes: \n\nLi Tianji's short story Springtime in a Small Town was first adapted for the screen by director Fei Mu in 1948. The film was produced by the Wenhua Film Company in Shanghai, one of the two important production companies formed by left-leaning film-makers in the city to spearhead a post-war revival in Chinese cinema. Wenhua specialised in making sophisticated comedies and social dramas and brought in such talents as the novelist Eileen Chang, the playwright Cao Yu and the brilliant stage actor Shi Hui. But Fei Mu's film (nowadays generally known as Spring in a Small Town) stood apart from other Wenhua productions in both tone and form. Fei created a chamber drama to express his ambivalent feelings about the present and his forebodings about China's future. He made use of some daring innovations in film language, and drew exceptional performances from Li Wei as the visitor Zhang Zhichen and from the truly remarkable Wei Wei as the frustrated wife Yu Wen.\n\nFor more than three decades, Fei Mu's Spring in a Small Town was a forgotten film. Fei Mu moved to Hong Kong soon after making it, and died there in 1951. He was later reviled as a &quot;rightist&quot; by the apparatchiks who wrote the official history of Chinese film for the Communist Party, and none of his films was deemed important.\n\nThis picture began to change only in the early 1980s, when the China Film Archive re-opened (like other institutions, it had been closed down during the Cultural Revolution) and made a new print from the original negative of Spring in a Small Town. The film quickly found a new and admiring audience. Many Chinese critics - especially in Hong Kong and Taiwan - consider it the greatest Chinese film ever made.\n\nFei Mu has since been honoured with a retrospective at the Hong Kong International Film Festival. Stanley Kwan's film Actress (aka Centre Stage, 1991), a bio-pic about the 1930s star Ruan Lingyu, features Fei Mu as a character and goes out of its way to rehabilitate his reputation as a man and as an artist. And critic Wong Ain-Ling has edited a comprehensive (Chinese-language) study of Fei Mu's life and work, published in Hong Kong.\n\nScreens:\n[img]http://i290.photobucket.com/albums/ll275/lllTgolll/snapshot20100312151859.jpg[/img]\n[img]http://i290.photobucket.com/albums/ll275/lllTgolll/snapshot20100312151826.jpg[/img]\n[img]http://i290.photobucket.com/albums/ll275/lllTgolll/snapshot20100312151849.jpg[/img]\n[img]http://i290.photobucket.com/albums/ll275/lllTgolll/snapshot20100312151921.jpg[/img]\n\nRip Specs :\nFile.......:Xiaocheng Zhichun (Spring in a Small Town) (1948) DVDRip (SiRiUs sHaRe).avi\nFile Size..:699 MB (or 716,652KB)\n\nVideo\n----------------\nCodec Name......: DivX 5.0\nBitrate.........:944 kb/s\nFrames/Second...:29.971\nResolution......:640x480 (1.33:1)\nLength..........:1h 33m 16s (167704 fr.)\n\nAudio\n----------------\nCodec Name......:MP3\nStream Info.....:48kHz 96kb/s 2ch\nLanguage........:Mandarin\n\nExtra Info\n----------------\nSubtitles.......:English .srt\n\n*********************************** FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'\t\t","torrent":{"xt":"urn:btih:83120bce33101b4a3928d21fa6115da95ac04660","amp;dn":"Mu+Fei+-+Xiao+cheng+zhi+chun+aka+Spring+in+a+Small+Town+%281948%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83120bce33101b4a3928d21fa6115da95ac04660","infoHashBuffer":{"type":"Buffer","data":[131,18,11,206,51,16,27,74,57,40,210,31,166,17,93,169,90,192,70,96]},"announce":[],"urlList":[]}}