{"title":"Doctor Who - Season 09 - (1972) - 26 Episodes","uid":9084515,"size":2192922565,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8320a8c91a54b887b995927127af32f6524846d7&amp;dn=Doctor+Who+-+Season+09+-+%281972%29+-+26+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bnaron","files":26,"time":1382468509,"description":"The ninth season of British science fiction television series Doctor Who began on 1 January 1972 with Day of the Daleks, and ended with The Time Monster. Jon Pertwee continues his role as the Third Doctor, as does Katy Manning playing Jo Grant. Roger Delgado returns to play The Master in The Sea Devils and The Time Monster. Nicholas Courtney, John Levene and Richard Franklin continue their roles of Brigadier Lethbridge-Stewart, Sergeant Benton and Captain Mike Yates respectively. Alan Bennion makes his second of three appearances in the series playing an Ice Warrior. In this, his second appearance, he portrays Lord Izlyr in The Curse of Peladon.\n\nThe first serial, Day of the Daleks, saw the return of the Daleks for the first time since Season 4's The Evil of the Daleks in 1967. This was also the first time that the Daleks had been seen in color in the television series (they had been in color in the two films starring Peter Cushing produced in the mid-1960s).\n\n1.  Day of the Daleks - Four Episodes\n\n    Synopsis: Rebels from a future Earth conquered by the Daleks\n    travel to the 20th Century to change the course of history.\n\n2.  The Curse of Peladon - Four Episodes\n\n    Synopsis: The Doctor and Jo land on the planet Peladon,\n    where they have to contend with an ancient royal curse.\n\n3.  The Sea Devils - Six Episodes\n\n    Synopsis: The Third Doctor and Jo visit the Master in\n    his island prison and encounter the Sea Devils,\n    cousins of the Silurians.\n\n4.  The Mutants - Six Episodes\n\n    Synopsis: On the colony world of Solos, something is\n    transforming the solonian population, turning them\n    into hideous mutants.\n\n5.  The Time Monster - Six Episodes\n\n    Synopsis: The Third Doctor and Jo investigate the\n    workings of the TOMTIT machine, and what secret power\n    is locked within the crystal of Kronos? \n","torrent":{"xt":"urn:btih:8320a8c91a54b887b995927127af32f6524846d7","amp;dn":"Doctor+Who+-+Season+09+-+%281972%29+-+26+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8320a8c91a54b887b995927127af32f6524846d7","infoHashBuffer":{"type":"Buffer","data":[131,32,168,201,26,84,184,135,185,149,146,113,39,175,50,246,82,72,70,215]},"announce":[],"urlList":[]}}