{"title":"The Cambridge Ancient History Vol 03, Part 02 - The Assyrian and","uid":6572884,"size":24695768,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83610f7a09d7a136f479cb2b11b3e14c4716aa3e&amp;dn=The+Cambridge+Ancient+History+Vol+03%2C+Part+02+-+The+Assyrian+and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1312049811,"description":"The Assyrian and Babylonian Empires and other States of the Near East, from the Eighth to the Sixth Centuries B.C.\nSeries: The Cambridge Ancient History, Volume 3, Part 2\nEdited by: John Boardman, I. E. S. Edwards, N. G. L. Hammond, E. Sollberger and C. B. F. Walker\nPublication Date: 1991\nHardback ISBN-10 0521227178, Hardback ISBN-13 9780521227179\nDigital Object Identifier (DOI): 10.1017/CHOL9780521227179\n\nOverview:\nThe Cambridge Ancient History Volume III Part 2 carries on the history of the Near East from the close of Volume III Part 1 and covers roughly the same chronological period as Volume III Part 3. During this period the dominant powers in the East were Assyria and then Babylonia. Each established an extensive empire which was based on Mesopotamia, and each in turn fell largely through internal strife. Assyrian might was reflected in the imposing palaces, libraries and sculptures of the Assyrian kings. Babylonian culture was outstanding in literature, mathematics and astronomy, and the great buildings of Nebuchadnezzar II surpassed even those of the Assyrian kings. Israel and Judah suffered at the hands of both imperial powers, Jerusalem being destroyed and part of the population deported to Babylon; and Egypt was weakened by an Assyrian invasion. The Phoenicians found a new outlet in colonising and founded Carthage. A number of small, vigorous kingdoms developed in Asia Minor, while from the north and north east the Scythian nomadic tribes pressed down upon Turkey and the Danube valley, but found their match in the Thracian tribes which held south-eastern Europe and parts of western Turkey. The burials of the chieftains of both peoples were remarkable for the great wealth of offerings.","torrent":{"xt":"urn:btih:83610f7a09d7a136f479cb2b11b3e14c4716aa3e","amp;dn":"The+Cambridge+Ancient+History+Vol+03%2C+Part+02+-+The+Assyrian+and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83610f7a09d7a136f479cb2b11b3e14c4716aa3e","infoHashBuffer":{"type":"Buffer","data":[131,97,15,122,9,215,161,54,244,121,203,43,17,179,225,76,71,22,170,62]},"announce":[],"urlList":[]}}