{"title":"Abrosoft FantaMorph Deluxe 5.1.6 Multilanguage","uid":6471489,"size":14351267,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:837901e3dc611f5b5f05fbcc59eace977b698737&amp;dn=Abrosoft+FantaMorph+Deluxe+5.1.6+Multilanguage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1308154864,"description":"Abrosoft FantaMorph Deluxe 5.1.6 Multilanguage\n\nWith Abrosoft FantaMorph, creating fantastic image morphs and warp movies has never been easier and faster! You can do everything a professional animation director does to create amazing images and animations. FantaMorph supports most image formats including BMP, JPEG, TIFF, PNG, GIF, TGA, PCX, and even professional 32-bit with alpha formats. Exporting to Image Sequence, AVI, Animated GIF, Flash, Screen Saver, Standalone EXE and other formats are supported. You can crop, rotate, flip, adjust color, add caption or some cool effects for the source images and the final movie, all with FantaMorph's built-in tools, without having to go to any additional software.\n\nFantaMorph takes advantage of hardware acceleration, and the rendering speed easily goes up to several hundred FPS (Frames Per Second). The high speed makes it possible to play final effects in real time without exporting to a file. The new interface with skin is cool in looks, streamlined in function, and a joy to work with! The Pro/Deluxe edition supports creating multiple morph, which makes it a breeze to create long movies with multiple source images. You can also find some advanced tools like Feature Curve, Shape Curve, Track Curve, Camera, etc. in Pro/Deluxe to create professional, gorgeous and exciting morphing effects.\n\nMain features:\nÃ‚Â» The fastest rendering engine, fully supports OpenGL hardware acceleration\nÃ‚Â» Real-time preview, real-time playing\nÃ‚Â» Imports/Exports 32-bit image with alpha formats: BMP, TIFF, PNG, TGA\nÃ‚Â» Export as Image Sequence, AVI, Animated GIF, Flash, HTML, Screen Saver and EXE\nÃ‚Â» Morph more than two source images in a single project\nÃ‚Â» Crop, rotate or flip, adjust color, add caption or filters for source images and movie\nÃ‚Â» Professional morphing control tools: Feature/Shape/Track curve and Camera\nÃ‚Â» Creates amazing effects with Background, Mask, Foreground, Transition, Light and Sound\nÃ‚Â» Print source images, preview and frame sequence, supports print preview\nÃ‚Â» Automatically detect facial features and place key dots on appropriate positions\nÃ‚Â» Compose a virtual face with multiple real faces\n\nHome Page - http://www.fantamorph.com/\n","torrent":{"xt":"urn:btih:837901e3dc611f5b5f05fbcc59eace977b698737","amp;dn":"Abrosoft+FantaMorph+Deluxe+5.1.6+Multilanguage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"837901e3dc611f5b5f05fbcc59eace977b698737","infoHashBuffer":{"type":"Buffer","data":[131,121,1,227,220,97,31,91,95,5,251,204,89,234,206,151,123,105,135,55]},"announce":[],"urlList":[]}}