{"title":"Users C# La GuÃƒÂ­a Total Del Programador - Diego Ruiz","uid":6196567,"size":96546810,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:840c849e539fca507ba28fb07d5062642fff1ffc&amp;dn=Users+C%23+La+Gu%C3%83%C2%ADa+Total+Del+Programador+-+Diego+Ruiz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chusca","files":3,"time":1298466335,"description":"Revista Users - C# La GuÃƒÂ­a Total Del Programador. C# es un lenguaje de programaciÃƒÂ³n moderno que combina la potencialidad de C, C++ y Java, con la agilidad y la velocidad para el desarrollo propios de Visual Basic. Sin dudas, es el lenguaje mÃƒÂ¡s importante de la plataforma .NET. Fue diseÃƒÂ±ado para crear sistemas en el mundo actual, donde la necesidad de comunicarse con otras aplicaciones y servicios mediante una red de in... more Ã‚Â»formaciÃƒÂ³n ?como Internet? es moneda corriente, donde conviven bases de datos de distintos fabricantes, donde los sistemas son construidos a partir de componentes locales o remotos, y donde se requieren soluciones integrales para diversos tipos de plataformas. Con C# podremos crear sistemas de una gran diversidad, simples o complejos; aplicaciones de consola, de escritorio o para la Web; programas para computadoras personales o para dispositivos mÃƒÂ³viles. Y con este libro en sus manos,usted descubrirÃƒÂ¡ los conceptos teÃƒÂ³ricos y prÃƒÂ¡cticos referidos a este lenguaje, para luego introducirse en el desarrollo de aplicaciones para escritorio, programaciÃƒÂ³n de librerÃƒÂ­as y componentes, creaciÃƒÂ³n de aplicaciones para la Web, y programaciÃƒÂ³n de juegos con Managed DirectX. Esta obra, pensada tanto para quienes reciÃƒÂ©n se inician en el mundo de la programaciÃƒÂ³n como para quienes provengan de otros lenguajes, es la puerta de entrada a la plataforma de desarrollo que ningÃƒÂºn programador puede dejar de conocer.\n\n\n\n","torrent":{"xt":"urn:btih:840c849e539fca507ba28fb07d5062642fff1ffc","amp;dn":"Users+C%23+La+Gu%C3%83%C2%ADa+Total+Del+Programador+-+Diego+Ruiz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"840c849e539fca507ba28fb07d5062642fff1ffc","infoHashBuffer":{"type":"Buffer","data":[132,12,132,158,83,159,202,80,123,162,143,176,125,80,98,100,47,255,31,252]},"announce":[],"urlList":[]}}