{"title":"Douglas Adams - The Salmon of Doubt","uid":5290061,"size":169013386,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:84a16a9ff1153042ab5fc1f2564855a58b9f45fa&amp;dn=Douglas+Adams+-+The+Salmon+of+Doubt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ill88eagle","files":-1,"time":1263868166,"description":"Douglas Adams - The Salmon of Doubt\nNarrated by Simon Jones with contributions by Stephen Fry, Richard Dawkins and Christopher Cerf.\n12 MP3's @ 48 kbps\n\nWikipedia: \n\nThe Salmon of Doubt: Hitchhiking the Galaxy One Last Time is a posthumous collection of previously unpublished material by Douglas Adams. It consists largely of essays about technology and life experiences, but its major selling point is the inclusion of the incomplete novel on which Adams was working at the time of his death, The Salmon of Doubt (from which the collection gets its title, a reference to the Celtic myth of the Salmon of Wisdom). English editions of the book were published in the USA and UK in May 2002, exactly one year after the author's death.\n\nThe original intention of The Salmon of Doubt was a Dirk Gently novel. Adams commented that some of the ideas he developed in Salmon of Doubt were not really working within a Dirk Gently framework. Those ideas would have been salvaged, undergoing necessary changes on the way, and put into a sixth Hitchhiker's book; as he thought that the last book in the series, Mostly Harmless, was a very bleak book and wanted to finish on a slightly more upbeat note.\n\nThe plot, set a few weeks after the events in The Long Dark Tea-Time of the Soul, involves Dirk Gently refusing to help find the missing half of a cat, receiving large amounts of money from an unknown client, and then flying to the United States. Dirk pays a visit to Kate Schechter (who had first appeared in The Long Dark Tea-Time of the Soul) and tells her that prior to the potential client, he had been so bored that he had started a habit of dialling his own phone number and discovered he'd answered his own calls. A faxed summary reprinted before the text mentions travelling &quot;through the nasal membranes of a rhinoceros, to a distant future dominated by estate agents and heavily armed kangaroos.&quot;\n\nThe version in the published book is the strongest content from several unfinished drafts that were written.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Salmon_of_Doubt&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Salmon_of_Doubt&lt;/a&gt;","torrent":{"xt":"urn:btih:84a16a9ff1153042ab5fc1f2564855a58b9f45fa","amp;dn":"Douglas+Adams+-+The+Salmon+of+Doubt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84a16a9ff1153042ab5fc1f2564855a58b9f45fa","infoHashBuffer":{"type":"Buffer","data":[132,161,106,159,241,21,48,66,171,95,193,242,86,72,85,165,139,159,69,250]},"announce":[],"urlList":[]}}