{"title":"MEXICO - Mushroom Ceremony Of Mazatec Indians Of Mexico","uid":4409168,"size":60001104,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:84a5d87eda40f3dd2ca5cadfee4a718220786374&amp;dn=MEXICO+-+Mushroom+Ceremony+Of+Mazatec+Indians+Of+Mexico&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starinar","files":20,"time":1222128686,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC.\nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY!\n\n\n\nMushroom Ceremony Of Mazatec Indians Of Mexico 1957\n\nArtist: Shaman woman Maria Sabina\n\nFolkways Records FR 8975, this is a US pressing of the impossible \nto find &quot;Mushroom Ceremony Of the Mazatec Indians Of Mexico&quot; This \nrecording, made by Gordon Wasson in 1956, attempts to chronicle a \nreligious ceremony involving the ingestation of psychedelic mushrooms \nby Indians who are attempting to communicate with the Divine Spirit. \nLots of wild, hallucinatory chanting and the like, which might even \nappeal to fans of phonetic sound poems or dadaist utterings. Another \nunusual historical document that only Folkways would have released. \n\nThe originals came out in 1957 with a blue cover and this press has \nthe tan cover from 1966.\n\n&quot;HERE IS A SHAMANIC PERFORMANCE COMPLETE. DR WASSON, A PIONEER IN THE \nSTUDY OF THE ROLE OF MUSHROOMS IN RELIGIOUS RITUAL, GIVES US A TRANSCRIPTION \nOF AN AUTHENTIC &quot;CONSULTATION&quot; OF THE SACRED MUSHROOM, IN SOUND. THE OCCASION \nWAS THE ILLNESS OF A YOUTH. THE MUSHROOM, THROUGH THE MOUTH OF MARIA SABINA, \nA FEMALE SHAMAN, DECREED THAT THE BOY MUST DIE. HE HEARD THE BAD NEWS AND DIED \nDAYS LATER. DR. WASSON TAPED THE ENTIRE VELADA. DR. WASSON IS ABLE TO PROVE \nTHAT THE WORDS AND UNDOUBTEDLY THE CHANT ARE PRE-CORTES, GOING BACK FOR MANY \nCENTURIES. NOTHING LIKE THIS RECORD HAS BEEN DONE FOR THE NEW WORLD; IT IS \nRIVALED IN THE OLD WORLD ONLY BY THE VEDIC CHANTS OF INDIA&quot;. \n\nRecorded by V. P. &amp; R. G. Wasson in Huautla de JimÃƒÆ’Ã‚Â©nez, in the Mazatec Mountains \nin the northern corner of the Stateof Oaxaca, July 21, 1956.\n\nFebruary 20, 2007\n\nQuality: 192Kbps","torrent":{"xt":"urn:btih:84a5d87eda40f3dd2ca5cadfee4a718220786374","amp;dn":"MEXICO+-+Mushroom+Ceremony+Of+Mazatec+Indians+Of+Mexico","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84a5d87eda40f3dd2ca5cadfee4a718220786374","infoHashBuffer":{"type":"Buffer","data":[132,165,216,126,218,64,243,221,44,165,202,223,238,74,113,130,32,120,99,116]},"announce":[],"urlList":[]}}