{"title":"Dio_-_Dios_Inferno_the_Last_in_Live-2CD-1998-MCA_int","uid":8046929,"size":149590602,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:854367f0dbc9636a2ecd3545756d5840e3199d27&amp;dn=Dio_-_Dios_Inferno_the_Last_in_Live-2CD-1998-MCA_int&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"RoffeTheCoolMan","files":27,"time":1358729818,"description":"METAL CLASSICS ARCHIVE\nP R E S E N T S\n+            Dio - Dios Inferno The Last In Live              +\nRelease Information\nRelease Date.Jan-12-2013    Encoder......L3.97 -V2 --vbr-new\nGenre........Heavy Metal    Graber.......EAC\nYear.........1998           Khz/Bitrate..44,1/ Br\nRipper.......anthem         Songs........cd1: 10 cd2: 8\nCovers.......Yes            Url... www.ronniejamesdio.com\nRelease Notes\nArtist : Dio                           Rating : You Decide!\nAlbum  : Dios Inferno The Last In Live abel  : SPV\nDescription :\nOne aspect of the live CD that is often ignored\nis it's function as a testimonial to the\nartist's ability to put on a great show. It is\nnot a substitute for being at the concert, nor\ndoes it contain the visual aspect that a DVD\nwould, but it is a piece of history preserved\nfor the sake of those who could not view the\ntour in question. In the field of putting on a\ngreat show, Dio has never waivered, even as he\nenters his 60s he is still going on as strong as\never.\nHowever, even the greatest of performances can\nbe tainted if the play itself is not of the\nhighest caliber, and here lies the flaw in this\nalbum. This is taken from the trough of Dio's\nfall from significance in the realm of music\n(before the resurgence that occurred with\nMagica's release), the Angry Machines tour. As\nsuch, we have two tracks from Dio's weakest\nrelease, accompanied by an overloaded collection\nof early work from the first 2 studio albums and\nRonnie's past work with Rainbow.\nAlthough all parties in question perform well,\nthe lack of anything new or fresh on here is\nquite disappointing, though not unexpected. If\nyou replaced the Angry Machines songs and\n&quot;Jesus, Mary and the Holy Ghost&quot; with songs from\nthe Sacred Heart album, you would have the exact\nsame set list that can be found on the Sacred\nHeart video. All of this screams out a single\nmessage, Dio is considered a has been and thus\nis limited to playing only the classics.\nOne advantage to this CD, however, is that\nbecause of Tracey G's radically different\napproach to soloing and his highly dark sound we\nget a radically different take on many of the\nolder Dio material. &quot;Holy Diver&quot; and &quot;Heaven and\nHell&quot; sound much more doom oriented than on any\nother live compilation containing these\nclassics. &quot;The Last in Line&quot; has a more agitated\nsounding solo, probably because it's a difficult\nsolo to pull off so Tracey retailored it to fit\nhis own style.\nOut of all the material covered on here, the\nmaterial off the &quot;Holy Diver&quot; and &quot;Last in Line&quot;\nalbums are the strongest. The two best songs on\nhere are &quot;Straight through the Heart&quot; and &quot;We\nRock&quot;. By contrast, the Rainbow material and\n&quot;Heaven and Hell&quot; are performed quite poorly.\n&quot;Man on the Silver Mountain&quot; is played way too\ndamn fast, and up until Doug Aldrich joined the\nband for the Killing the Dragon tour, they never\nlived up to the dramatic studio version of\nHeaven and Hell.\nThe newer stuff is a mixed bag, owing mainly to\ninconsistencies between the 2 albums that Tracey\nG had played on before hand. &quot;Jesus, Mary, and\nthe Holy Ghost&quot; is a stand up performance, well\nworthy of being the opener of the show. &quot;Double\nMonday&quot; is not bad, it's one of the less\ndisjointed and confused songs off of Angry\nMachines. &quot;Hunter of the Heart&quot; is an utter bore\nfest, owing completely to it just being a lousy\nsong. You could have Tony Iommi play this song\nand it would still suck.\nIn conclusion, I can't really give this live\nalbum a strong recommendation because of the\nlarge number of alternatives out there,\nparticularly in the video format. The release\nonto DVD of footage from the tours of the first\ntwo albums would be preferrable to this,\nalthough more recent fans of Dio should probably\npick up &quot;Evil or Divine&quot; on DVD. This CD may\nfind a home with core Dio fans who liked Tracey\nG's playing style, but it's recommended audience\nis not large by any standard.\nRelease Tracklist\n- CD1                                        [     ]\n-                                            [     ]\n01 - Intro                                      [01:37]\n02 - Jesus, Mary And The Holy Ghost             [03:28]\n03 - Straight Through The Heart                 [05:48]\n04 - Dont Talk To Strangers                    [06:03]\n05 - Holy Diver                                 [05:00]\n06 - Drum Solo                                  [04:02]\n07 - Heaven And Hell                            [07:30]\n08 - Double Monday                              [03:18]\n09 - Stand Up And Shout                         [04:09]\n10 - Hunter Of The Heart                        [05:16]\n-                                            [     ]\n- CD2                                        [     ]\n-                                            [     ]\n01 - Mistreated                                 [10:12]\n02 - Guitar Solo                                [03:39]\n03 - TheLast In Line                            [06:54]\n04 - Rainbow In The Dark                        [04:56]\n05 - Mob Rules                                  [03:37]\n06 - Man On The Silver Mountain                 [02:11]\n07 - Long Live RockNRoll                      [04:14]\n08 - We Rock                                    [05:41]\nTotal Length : [87:35 minn\nGreetings To:\nToo all people who contributes to make this\narchive of good music in a exceptional conditions","torrent":{"xt":"urn:btih:854367f0dbc9636a2ecd3545756d5840e3199d27","amp;dn":"Dio_-_Dios_Inferno_the_Last_in_Live-2CD-1998-MCA_int","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"854367f0dbc9636a2ecd3545756d5840e3199d27","infoHashBuffer":{"type":"Buffer","data":[133,67,103,240,219,201,99,106,46,205,53,69,117,109,88,64,227,25,157,39]},"announce":[],"urlList":[]}}