{"title":"Robin Trower - King Biscuit  Greatest Hits Live (2003) [FLAC]","uid":8353118,"size":487671026,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:85c5c52353aa9a22f6a8e87959a4842080e82485&amp;dn=Robin+Trower+-+King+Biscuit++Greatest+Hits+Live+%282003%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1365403287,"description":"\n\n\nRobin Trower\nKing Biscuit Flower Hour\nArchive Series Greatest Hits Live (2003)\n\n\n\n\n\nallmusic.com...\n\nOne of the best features about the King Biscuit Flower Hour CDs is that none of the titles in its Greatest Hits Live series is dressed up in any way. These are shows recorded and presented as they were performed, warts and all. This Robin Trower date, recorded in 1977 at the New Haven Coliseum, is a case in point. The balances are off on the sound and some of the levels are in the red, but too damn bad because the performance here is frighteningly raw, passionate, and on. Compared to Trower's officially released live album, this one blows it away. The song selection is terrific in that it opens with one of his most underrated classics, &quot;Lady Love,&quot; which is as much a hard R&amp;B tune as it is a rocker, and then slips through the most important tracks from Bridge of Sighs while touching on For Earth Below and introducing material from In City Dreams and Caravan to Midnight -- his two most underrated records. On &quot;Somebody Calling,&quot; Trower proves there's more to him than Hendrix flash; there's a real rhythm section that can funk it up as hard as Jeff Beck did on &quot;Superstition.&quot; The Trower power trio is augmented here by bassist Rusty Allen, freeing the late James Dewar up to concentrate on being the tough soul singer he was. By this time, Bill Lordan had replaced Reg Isidore on drums and the unit gelled, turning blues, psychedelic hard rock, and funk into a massive wall of melodic noise. Check the gritty funk of &quot;Falling Star,&quot; the rollicking &quot;Too Rolling Stoned,&quot; played in overdrive, the dreamy floating textures in &quot;Smile,&quot; and the screaming blues-rock of &quot;Fool &amp; Me.&quot; From here, Trower kicks into three more from Bridge of Sighs, including the title track, &quot;Day of the Eagle,&quot; and &quot;Little Bit of Sympathy.&quot; The set ends with &quot;Further on Up the Road,&quot; with everything turned up to ten and bleeding through the channels on the PA, and it makes not one whit of difference. If anything, it makes this live album feel live. This is a burning performance, inspired as it gets with all of the excesses and mistakes left in. Highly recommended. \n\n\n\nAudio Quality:\t\tFlac (Lossless)\nAudiochecker:\t     \t99.83% CDDA\nLabel:\t\t\tKing Biscuit Entertainment\nCatalog:\t\t40003 \n\nAudio-Info:\n\n\n01.Lady Love\n02.Somebody Calling\n03.Falling Star\n04.Too Rolling Stoned\n05.Smile\n06.Daydream\n07.The Fool And Me\n08.Bridge Of Sighs\n09.Day Of The Eagle\n10.Little Bit Of Sympathy\n11.Messin' The Blues\n12.Further On Up The Road\n\n\n\n\n\n\n\n\n\nThanks for Seeding\nEnjoy...\n","torrent":{"xt":"urn:btih:85c5c52353aa9a22f6a8e87959a4842080e82485","amp;dn":"Robin+Trower+-+King+Biscuit++Greatest+Hits+Live+%282003%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85c5c52353aa9a22f6a8e87959a4842080e82485","infoHashBuffer":{"type":"Buffer","data":[133,197,197,35,83,170,154,34,246,168,232,121,89,164,132,32,128,232,36,133]},"announce":[],"urlList":[]}}