{"title":"New World Order - The Final Solution","uid":4523845,"size":291454683,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:85cb0f022590eb3a63483cc7d954e0eb116bc95a&amp;dn=New+World+Order+-+The+Final+Solution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"andoroo","files":-1,"time":1227278922,"description":"There is something very wrong with our world.\n\nIn the ensuing years since the attacks upon new yorks world trade center on september 11th 2001 our societies have gone down very different paths to what the people of the world had hoped to see ushered in with the new millenium. Now there is a sense of forboding that encompasses the globe. A sense that all is not quite right, that some unseen malaise exist like a deeper undercurrent that flows just below the surface of everyday affairs.\n\nThough we are constantly told of all the problems that we face, concerns over global terrorism, famine, disease, global warming, and global warfare it has become apparent to many that below the surface problems we are repeatedly shown by the media, another problem does indeed exist. Such feelings are being expressed by a great many people, and these feelings are justified for this earth and indeed humanity itself, does indeend face a massive threat. It is not the threat of global terrorism or the threat of war. It is not the threat of environmental disaster or global warming. It is something more sinister, something that lies within.\n\nDifferent people blame different groups or conspiracies for these problems. Club of Rome, The Bilderbergers, Freemasons, Bohemian Club... some say Zionists, or the Vatican Conspiracy, some say skull and bones ...and the list goes on. Well the truth is, that all of the above sources are in fact involved, each in its own way and each one carries out specific tasks. Zionism for example is merely one of the most visible arms of the octopus because it is they who carry out most of the worlds terrorism, but Zionism is merely one skin of the onion, as is the Bilderberg Group, Bohemian Club, or any other group. All these organizations are interlinked, to one controlling body at top now widely known as the Illuminati. I covered a great deal about how the whole system is put together and how most of it functions in the Big Picture series which I posted on my youtube channel, and a good deal about the zionist arm of the illuminati who, it would appear, were the true force behind the 911 attacks, is also covered in a 3rd party series I post on my youtube channel entitled 911 missing links. 911 missing links maybe seen as an attack against jews by some but I think it contains relevent and pertinent information concerning the true perpetrators of the 911 attacks which is why I posted it. Zionism however, as I previously said, is merely one layer of the illuminati onion which encompasses all manner of secret societies. Zionism is merely one part. You can think of Zionism as like the &quot;special ops division&quot; of the illuminati which, in turn, has offshoots such as the MOSSAD &amp; CIA, organizations whose sole purpose is to undermine governments and create instability and who control all global drug and human traffic trading and who also control all other terrorist organizations down the food chain such as Al Qaeda. Al Qaeda by the way is an organization which is wholly invented and is actually nothing more than a database consisting of a list of names of Mujahadeen trained in terrorism by the CIA in the late 1970's. The words Al Qaeda literally translates to &quot;the Database&quot; in Arabic. Do not make the mistake of thinking organizations like the CIA &amp; MOSSAD are the good guys, because they are most definitely not. They are anything but.\n\nAll the world is a stage and everything of importance that occurs on it, is planned to happen that way and it is through this Illuminati system of intertwining secret societies that the entire world is ultimately run. The vital control centers of this mechanism are the three illuminati city states, all of which are seperate self governing states within host countries. The first is The City of London, which is the Center for Monetary Control, The second is Washintons District of Columbia which is the Center for Military Control and the 3rd is Vatican city which is the center for spiritual Control. Each City State is a completely seperate, self governed and sovereign state within an external sovereign country. Each has its own laws, its own news services and infrastructure, each pays no taxes to the sovereign country in which it is located and each has its own flag. The flag of each bears 3 Stars signifying the 3 city states. Each city also has its own obelisk as the bloodline that controls the world can be clearly traced back to ancient egypt. These are the three Illuminati Control Centers of the world. It is from these three centers that control over all aspects of the world is achieved.\n\nSo then, who are the controllers and why? Why are they doing this to the human race? When these people already control all the money and all the resources and already start wars and famines at whim, why take it any further? What else is there to gain?\n\nWell... heres where explanations are decidedly more difficult because even the Illuminati themselves say there is another unseen hand that controls even them, and who this hidden hand may actually belong to, well, that will have to remain the subject of another video but suffice to say for now that the reality is this. The reality that we live in, what we perceive as being reality, is Not reality. We create what we perceive to be reality with our emotions and our intent. Those who control the human race know this and so do many other cultures. and the evidence to support such an argument being a true, is in fact, quite literally, everywhere.\n\nWe as westerners think we are more advanced than other races because we have flashy cars, mobile phones and plasma TV's but these are all merely trinkets. They are nothing more than baubles and beads designed to distract you from the real power in the universe. A power that we are all connected to. This connection with the greater power is now becoming more pronounced and more and more people are waking up everyday as we approach the line of the galactic ecliptic and the frequency of earth and everyone and everything rises accordingly.\n\nThe power elite know this. They know that the frequency of this planet and of our entire solar system is rising and so they are combatting this rising of frequency and wakening of deeper human awareness with a virtual sensory onslaught, TV, sex, utterly meaningless celebrity gossip, more and more baubles and beads and more and more by promoting an atmosphere of fear. Wars, terrorism, the myth of global warming, food shortages, gas shortages, avian flu, anything they can think of to produce negative energy and a climate of fear, stress, hatred and intolerance and to a certain degree, they have succeeded.\n\nUntil now.\n\nFor now, people are beginning to wake up.\n\nThis message therefore goes out as a hope, as a challange and as a calling. It goes out as a calling to everyone and also as a calling to every Police officer and to all military personel as a reminder to them that the job of the police is not one of blind enforcement of law but is rather to protect and serve the public, not of protection and servitude to corrupt politicians, just as the role of the military is the protection of their nation, not protection of the nations politicians. If the politicians enact legislation or issue decrees that oppress the rights of the people or are not in the best interests of the people in promoting freedom and the right of each individual to the personal pursuit of happiness, then it is the politicians who sought to enact such laws who should be arrested and not the people who disregard them. The people are sovereign, NOT the government. the government is the servant of the people, not vice versa.\n\nOf course waking some of these police officers maybe somewhat of a challenge if not impossible because it is highly likely that many of them have already been chipped. It is extremely easy to control the emotional state of any person who has been implanted with a microchip. The human body is nothing more than a biological computer. All actions, feelings and emotions are detected by the brain as electrical impulses. Placing a microchip inside someones body allows the computer to to interfered with by an external source similar to a trojun horse program on a home pc. No intelligent or thinking individual should ever allow themslves to be microchipped. No matter how &quot;convenient' it is made to appear to entice you. To allow your self to be chipped is to place your life and your very thoughts and emotions into the hands of another whom you do not know. And this is not science fiction it is actual fact.\n\nIn recent decades experiments with microchips were carried out on animals with great success. Scientists were easily about to invoke extremes of emotion ranging from extreme contentment to violent anger in this cat for example with a simple change of frequency. This technology to control emotions does exist, it is not some fantasy and it is very likely that it is due to such technology that we are recently witnessing such wanton agression from police officers whos actual job it is, is to protect and serve, rather than to harrass and intimidate such as they appear to be concentrating on now.\n\nIt must be clearly understood by all that there are only two true emotions.\n\nLove and Fear.\n\nAll other emotions stem from these two base emotions. Love is a much faster vibration that fear and love has been proven to actually physically affect human DNA and allow more centers for coding. This is what makes true evolution possible and this is the knowledge the elite desperately want to keep from the people because People who live in love evolve to higher consciousness and awareness and power over them is lost.\n\nThis is part of the &quot;hidden knowledge&quot; held by organizations like the illuminati. This is why western society and modern religions such as Christianity have striven so hard to wipe out &quot;paganism&quot;. In fact Modern Religious institutions were so fearful of the message contained within Paganism and deemed it such a threat to their hegemony that the practice of it was punishable by death. But you can ask even a small child from some obscure village in the Andes and soon realise that they all know this information but it has been hidden from the west.\n\nIt is important now through all of the problems we face, to approach the world with only love in your heart. This can sometimes be difficult to do. When faced with the truth about our world and the attrocities that are being carried out in our names by our governments, Do you feel outrage? Do you feel anger? It is quite natural to feel such emotions when faced with this information and quite fine that you do because such anger and outrage is born from love and empathy for your fellow man. Or do you feel hatred at the perpetrators? Hatred is a bad thing and though it is hard, you must not allow yourself to fall into such a trap. Hatred is a very negative emotion and negativity can only ever produce more negativity. And the people who are carrying out this madness in the world want you to hate them. They dont care who your hatred is directed at, even if it is directed at them, just so long as you hate something or someone. They just want the negative energy to keep flowing. Do not hate your enemies. George W Bush is a genocidal maniac, but dont hate him for it, love him and pity him for being so misguided. Dont hate him and show anger born from hatred or blood lust. Hatred empowers your enemies against you and such demonstrations only provoke retaliation.\n\nIn attempting to deal with the NWO many talk of an armed uprising but that is not the way. They WANT an armed uprising, you MUST see that and so you must NOT give them that. An armed uprising will only result in Martial Law and the NWO will never be defeated with weapons. They have technology to deafeat any armed uprising that you cannot even imagine. The whole issue needs to be approached with a state of love. When I say its important to appraoch things in a state of love, Im not talking about the touchy feely &quot;lets all be passive and wear flowers in our hair&quot; kind of love. Im talking about real love, empathy and understanding for all people and all life. An understanding that there IS no division among the peoples of the world, These divisions are an illusion created by the elite in order to divide us. Ignore them. There is no division, there is no &quot;other&quot; there is only one. We are one. No people in any country want war. Only leaders and bankers want war so DONT GIVE IT TO THEM!\n\nMany people think that the problems are unique to their country, for example many Americans may claim the issues of 911 to be an internal problem, but such is not the case because the conspiracy we are dealing with here is very old and very well thought out and the problem is indeed a global one. Much of the controlling influences are actually European, it just seems internal to many Americans because its more active there, and this is not to say anything against the American people at all, it is more active in America at this particular time because it is in Americas district of columbia that lies the Illuminati center for military control. That is why it is so important for the American people to act immediatedly to restore their constitution. Should this not be achieved it will spell very bad times ahead indeed, not just for america but for the entire globe because there is no where to escape from the NWO, there is no where to run, no country one could move to and no chance of setting up any alternate societies in some place that will remain unaffected. Their influence across the earth is all pervasive.\n\nThe only real way to defeat the NWO and stop the fscist malaise that is creeping across our earth is to address the root cause of the problem. To cut the head off the snake. And that problem is the global monetary system and those who control it because the meglomanics who are creating this mayhem in the world are, and have always been the criminal banking elite consisting of families such as the Rockefellers and the Rothschilds and this can be amply proven. These people have trampled on the entire human race, they have sold us out, in more ways than you may ever believe. The Rothschild family alone has managed to horde over one half of the earths entire wealth in the last 300 years by means of lies and deception and has the blood of quite literally millions on the hands. The goal of these elite international criminals is to microchip the entire population of earth and to eliminate those who rests to total control over humanity can be placed in their hands. These are extremely sick and ruthless people who care nothing for anyone who is not part of their club. What is needed to fix the problems is a global revolution of the people, but it does not need to be a bloody battle, in fact not a single shot even needs to be fired. All that is required is for people to wake up and stop going along with the system. Stop agreeing with what is being done to the world and its people. For just one week even, stand up and say no, we wont do this any more. Get yourself a supply of food and stay home, for a week. Dont go out and be a 'consumer&quot;. Dont watch TV, dont go to work, dont buy any gas, dont buy alchohol or go shopping at all. Just do enough to keep the essential sevices operating. Can you imagine what the elite would do and what could be achieved with just one week of global non compliance? One week of global non compliance by the people would bring the entire Global elite to their knees and utterly defeat their new world order in on fell swoop. Then if people forgot all about what the TV told them was right and helped each other instead of profitting from each other in order to by more useless trinkets the entire system of slavery and control would come crashing down like a house of cards. The only power that the ruling elite have over the peoples of the world is the power we ourselves grant to them. All that is needed to fix it and stop the NWO in its tracks is for the people of the world to stand united in an act of Non Violent, Non compliance. A simple case of No Sir, we will not do this any more.\n\nIts that simple.\n\nThe malaise that is creeping across our world must be dealt with by the people, and dealt with very quickly. A unity of human spirit in a atitude of global non violent, non compliance is all that is required to win the battle and it needs to be done quickly while the people still have the opportunity to deal with the situation in a peaceful manner.\n\nYour first reaction will most likely be to feel anger and resentment towards the maker of this film. This is an understandable reaction because this film is suggesting you to consider the possibility that you may have been wrong about the view you have of this world. But do not feel anger because you have this view only because you have been lied to, but again, to even admit this much to yourself is to admit you have been duped, and our societies have carefully trained us to view any such realization as an afront against the ego, rather than an enlightening of spirit or a freeing of mental shackles. But the fact remains that the only power the ruling elite have over the people is the power the people themselves grant to them.\n\nAll I can ask is that you each stop and look inside yourself and realise the true power and true potential that each of you holds within. &lt;a href=&quot;\nhttp://www.thecrowhouse.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thecrowhouse.com&lt;/a&gt;","torrent":{"xt":"urn:btih:85cb0f022590eb3a63483cc7d954e0eb116bc95a","amp;dn":"New+World+Order+-+The+Final+Solution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85cb0f022590eb3a63483cc7d954e0eb116bc95a","infoHashBuffer":{"type":"Buffer","data":[133,203,15,2,37,144,235,58,99,72,60,199,217,84,224,235,17,107,201,90]},"announce":[],"urlList":[]}}