{"title":"Houdini Club Magic Mysteries series (Books 1-4)","uid":10320212,"size":33184332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85e7057764e5797528c23270b4708feb206488d5&amp;dn=Houdini+Club+Magic+Mysteries+series+%28Books+1-4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":4,"time":1402298375,"description":"\nby David A. Adler\n\nAdler was born in New York City, New York. He graduated from Queens College in 1968 with a bachelor's degree in economics and education. For the next nine years, he worked as a mathematics teacher for the New York City Board of Education, while taking classes towards a master's degree in marketing, a degree he was awarded by New York University in 1971. \n\nIn that same year, a question from his then-three-year-old nephew inspired Adler to write his first story, A Little at a Time, subsequently published by Random House in 1976. Adler's next project, a series of math books, drew on his experience as a math teacher. In 1977, he created his most famous character, Cam Jansen, originally featured in Cam Jansen and the Mystery of the Stolen Diamonds, which was published that year.\n\nGenre: YA | Children's Fiction | Mystery\n\n\nOnion Sundaes #1\nIllus. in black-and-white. When a crime wave hits the Super Big 'N' Super Friendly Supermarket, it's up to Herman &quot;Houdini&quot; Foster--magician, near-genius, ten-year-old kid--and his cousin, Janet Perry, to stop it. But can they solve the case of the shopping cart crook before their ice cream melts?\n\nWacky Jacks #2\nIllus. in black-and-white. Super-sleuths Herman &quot;Houdini&quot; Foster and his cousin, Janet Perry, discover a mystery at school, and cards are not the only things to vanish. Has Houdini's skill in making things disappear transferred to the classroom pet? Instructions for the &quot;Wacky Jacks&quot; card trick are included.\n\nLucky Stars #3\nThere's some clever &quot;borrowing&quot; going on at the local library. Are things disappearing by magic, or is there pilferage in the stacks? Super-sleuths Houdini and Janet must follow the paper trail to solve the literary mystery in the latest Houdini Club Magic Mystery. Includes a brand-new magic trick!\n\nMagic Money #4\nSomething strange is happening at the mall! Can Herman &quot;Houdini&quot; Foster--a ten-year-old magician and near-genius--and his cousin, Janet crack the case? Young mystery mavens and aspiring magicians won't be able to put down this easy-to-read, hard-to-solve whodunit! Includes step-by-step instructions for a thrilling magic trick.","torrent":{"xt":"urn:btih:85e7057764e5797528c23270b4708feb206488d5","amp;dn":"Houdini+Club+Magic+Mysteries+series+%28Books+1-4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85e7057764e5797528c23270b4708feb206488d5","infoHashBuffer":{"type":"Buffer","data":[133,231,5,119,100,229,121,117,40,194,50,112,180,112,143,235,32,100,136,213]},"announce":[],"urlList":[]}}