{"title":"American Still Life - The Jim Beam Story and the Making of the W","uid":4683840,"size":1430041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86143397c57970ca6b6eb7a484ac181423b71a9a&amp;dn=American+Still+Life+-+The+Jim+Beam+Story+and+the+Making+of+the+W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1233166544,"description":" &lt;a href=&quot;http://www.image-upload.net/images/s86ufq3607s86uppq6yk.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/s86ufq3607s86uppq6yk.jpeg&lt;/a&gt;\n\nF. Paul Pacult &quot;American Still Life: The Jim Beam Story and the Making of the World's #1 Bourbon&quot;\nWiley | 2003-08-15 | ISBN: 0471444073 | 256 pages | PDF\n\n\nThe untold story of the world's premier bourbon and the family that made it #1\n\nAmerican Still Life tells the intertwined true stories of America's favorite whiskey and the family dynasty that produces it to this very day. Jim Beam is the world's top-selling bourbon whiskey, with sales of over five million cases per year. Not a day has passed in the 207 years of Jim Beam's existence when a Beam family member has not been master distiller. Dedicated to quality, and dedicated to the family legacy, the Beams have shepherded their particularly American spirit to the top of their industry. And they've done it in an industry beset by challenges, from government regulation and prohibition, to changing consumer tastes, to fierce new global competition. By creating a brand of unparalleled quality and consistency, and by tying the success of their product with the good name of the family, the Beams have established a lasting legacy as perhaps one of the greatest family business dynasties in American history. Not just a simple history of &quot;America's native spirit&quot; (so named by an act of Congress in 1964) or a simple family history, American Still Life is a story of business success based on quality and attention to detail, constant innovation, revolutionary branding and advertising, and adaptation to the business environment.\n\nF. Paul Pacult (Walkill, NY) is recognized the world over as his generation's most accomplished and respected authority on beverage alcohol. He has written for many magazines, including Playboy, Wine and Spirits, Connoisseur, Whisky, Drink, Men's Journal, Cheers, Country Inns, Travel and Leisure, Bon Appetit, Decanter, and Food and Wine. Among his many accomplishments, he has hosted and coproduced two syndicated talk-radio programs and served as the primary expert on whiskey, beer, and wine for the History Channel documentary America Drinks: History in a Glass.","torrent":{"xt":"urn:btih:86143397c57970ca6b6eb7a484ac181423b71a9a","amp;dn":"American+Still+Life+-+The+Jim+Beam+Story+and+the+Making+of+the+W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86143397c57970ca6b6eb7a484ac181423b71a9a","infoHashBuffer":{"type":"Buffer","data":[134,20,51,151,197,121,112,202,107,110,183,164,132,172,24,20,35,183,26,154]},"announce":[],"urlList":[]}}