{"title":"Only-Fools-And-Horses-complete series three aac mp4 by winker@ki","uid":6077763,"size":3752920945,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:862e0408c5943d2a5c46dbb71bcb5ed0c112035f&amp;dn=Only-Fools-And-Horses-complete+series+three+aac+mp4+by+winker%40ki&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alanwatson","files":-1,"time":1293964569,"description":"The entire third series of John SullivanÃ‚Â´s popular comedy, featuring the wheeling and dealing of Del and Rodney Trotter on the streets of Peckham.\n\nHomesick: Lugging the shopping up those 12 flights of stairs is proving too much for Grandad, so the doctor recommends a new council bungalow for the Trotter dynasty. Over to Rodney, the new chairman of the housing committee...\n\nHealthy Competition: RodneyÃ‚Â´s decided to go it alone and leave PeckhamÃ‚Â´s own multinational conglomerate - TrotterÃ‚Â´s Independent Trading. By the end of the week heÃ‚Â´s already cornered the market in used lawn mower engines and with Mickey Pearce as his Financial Director, the skyÃ‚Â´s the limit...\n\nFriday The 14th: Del, Rodney and Grandad are Cornwall-bound to BoycieÃ‚Â´s cottage and a spot of salmon poaching. Should be a doddle of a weekendÃ‚Â´s jolly, if you leave out the bit about the mad-axe-salmon-fisherman-killer whoÃ‚Â´s just escaped from the local institute, that is...\n\nYesterday Never Comes: DelÃ‚Â´s into art dealing in a big way, especially when it involves a Ã‚Â´posh tartÃ‚Â´ like the glamorous Miranda. Has she really been wooed by his tequila sunsets or are her motives rather more mercenary...?\n\nMay The Force Be With You: A ripple of panic runs through the NagÃ‚Â´s Head. DelÃ‚Â´s old school enemy Slater is back in town, hell bent on revenge and brandishing his police badge...\n\nWanted: Watch out! Peckham PouncerÃ‚Â´s about! Alias Rodney Trotter...? Surely there must be some mistake? Try telling that to Rodders, LondonÃ‚Â´s most wanted criminal...\n\nWhoÃ‚Â´s A Pretty Boy?: Move over Leonardo! The Trotter decorating business is on the roll again. This time theyÃ‚Â´re just doing a favour for Denzil. Their instructions are simple enough: donÃ‚Â´t eat the fruit or turn on the TV and stay out of the kitchen. So whatÃ‚Â´s happened to Busby, the canary?\n\nThicker Than Water: Ã‚Â´Tis certainly the season to be jolly and itÃ‚Â´s Grand Marnier and grapefruit all round when Del and RodneyÃ‚Â´s dad comes back to the fold after 18 years. Until he begins to cast doubt on DelÃ‚Â´s filial integrity, that is...","torrent":{"xt":"urn:btih:862e0408c5943d2a5c46dbb71bcb5ed0c112035f","amp;dn":"Only-Fools-And-Horses-complete+series+three+aac+mp4+by+winker%40ki","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"862e0408c5943d2a5c46dbb71bcb5ed0c112035f","infoHashBuffer":{"type":"Buffer","data":[134,46,4,8,197,148,61,42,92,70,219,183,27,203,94,208,193,18,3,95]},"announce":[],"urlList":[]}}