{"title":"The Pretenders - Get Close (1986) [2013_HDTracks 24-192]","uid":11823198,"size":1778469402,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:867946baa964dd920cc8c81ee3303a899f0c3e12&amp;dn=The+Pretenders+-+Get+Close+%281986%29+%5B2013_HDTracks+24-192%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sidmal","files":14,"time":1429317455,"description":"The Pretenders - Get Close (1986/2013)\n FLAC (tracks) 24-bit/192 kHz | Time - 45:03 minutes | 1,74 GB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Get Close is the fourth album by rock group The Pretenders, released in 1986. The album contains the band's two biggest Mainstream Rock Tracks chart hits, &quot;Don't Get Me Wrong&quot; and &quot;My Baby&quot;, both of which reached #1.\n\n\n In the first edition of the Pretenders, Chrissie Hynde was a smart and streetwise rock &amp; roller with just enough maturity to make something of what life had shown her by her mid-twenties -- and she had the rough-and-tumble band to match for her first two albums. The second version of the group cast her as an unwitting but unbowed survivor, determined to move on and keep rocking despite the deaths of two of her bandmates, and the tough, no-nonsense approach of her new collaborators on Learning to Crawl reflected her attitude. Released in 1986, Get Close marked the debut of the Pretenders' Mark Three, and on this album listeners are introduced to Chrissie Hynde, Mature Professional Musician with a band to match. Get Close is never less than solid as a work of craft, and guitarist Robbie McIntosh, drummer Blair Cunningham, and bassist T.M. Stevens deliver tight and emphatic performances throughout, but they also sound like what they are -- journeymen musicians who bring their chops to their projects while leaving their personalities at the door. While Hynde always dominated the Pretenders, by this time it was obvious that this was fully her show, and if she felt less like rocking and more like exploring her emotions and thoughts about parenthood on midtempo pop tunes, no one in the group was going to prod her into doing otherwise; the presence of a large number of additional session players further buffs away any of Get Close's potential sharp edges. Despite all this, Hynde's voice is in great form throughout, and when she gets her dander up, she still has plenty to say and good ways to say it; &quot;How Much Did You Get for Your Soul?&quot; is a gleefully venomous attack on the musically unscrupulous; &quot;Don't Get Me Wrong&quot; is a superb pop tune and a deserved hit single; and the Motown-flavored &quot;I Remember You&quot; and the moody &quot;Chill Factor&quot; suggest she'd been learning a lot from her old soul singles. But after three great albums from the Pretenders, Get Close sounded good but not especially striking, and its hit-and-miss approach, with a few great songs surrounded by lesser material, was something Hynde's fans would find themselves getting used to over the group's next few releases.  \n\n\nTracklist:\n\n 01 - My Baby\n 02 - When I Change My Life\n 03 - Light Of The Moon\n 04 - Dance\n 05 - Tradition Of Love\n 06 - Don't Get Me Wrong\n 07 - I Remember You\n 08 - How Much Did You Get For Your Soul?\n 09 - Chill Factor\n 10 - Hymn To Her\n 11 - Room Full Of Mirrors","torrent":{"xt":"urn:btih:867946baa964dd920cc8c81ee3303a899f0c3e12","amp;dn":"The+Pretenders+-+Get+Close+%281986%29+%5B2013_HDTracks+24-192%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"867946baa964dd920cc8c81ee3303a899f0c3e12","infoHashBuffer":{"type":"Buffer","data":[134,121,70,186,169,100,221,146,12,200,200,30,227,48,58,137,159,12,62,18]},"announce":[],"urlList":[]}}