{"title":"Bhagavadgita - Song Of God","uid":3521623,"size":1485357,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86e9ec2d662650338540a1a82cfdd87047b1c6ff&amp;dn=Bhagavadgita+-+Song+Of+God&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cybernerd","files":4,"time":1157828391,"description":"The Gita addresses the discord between the senses and the intuition of cosmic order. It speaks of the Yoga of equanimity, a detached outlook. The term Yoga covers a wide range of meanings, but in the context of the Bhagavad Gita, describes a unified outlook, serenity of mind, skill in action, and the ability to stay attuned to the glory of the Self (Atman), which is of the same essence as the basis of Being (Brahman). According to Krishna, the root of all suffering and discord is the agitation of the mind caused by selfish desire. The only way to douse the flame of desire is by simultaneously stilling the mind through self discipline and engaging oneself in a higher form of activity. \n\nHowever, abstinence from action is regarded as being just as detrimental as extreme indulgence. According to the Bhagavad Gita, the goal of life is to free the mind and intellect from their complexities, and to focus them on the glory of the Self, by dedicating one&amp;#039;s actions to the divine. This goal can be achieved through the Yogas of meditation, action, devotion and knowledge. The Gita describes the best Yogi as one who constantly comtemplates God. \n\nAlbert Einstein \nWhen I read the Bhagavad-Gita and reflect about how God created this universe everything else seems so superfluous. \n\nMahatma Gandhi \nThe Bhagavad-Gita calls on humanity to dedicate body, mind and soul to pure duty and not to become mental voluptuaries at the mercy of random desires and undisciplined impulses. \n\nDr. Albert Schweizer \nThe Bhagavad-Gita has a profound influence on the spirit of mankind by its devotion to God which is manifested by actions. \n\nCarl Jung \nThe idea that man is like unto an inverted tree seems to have been current in by gone ages. The link with Vedic conceptions is provided by Plato in his Timaeus in which it states...&quot; behold we are not an earthly but a heavenly plant.&quot; This correlation can be discerned by what Krishna expresses in chapter 15 of Bhagavad-Gita. \n\nHerman Hesse \nThe marvel of the Bhagavad-Gita is its truly beautiful revelation of lifes wisdom which enables philosophy to blossom into religion. \n\nVivekananda \nThe secret of karma yoga which is to perform actions without any fruitive desires is taught by Lord Krishna in the Bhagavad-Gita. \n\nRalph Waldo Emerson \nThe Bhagavad-Gita is an empire of thought and in its philosophical teachings Krishna has all the attributes of the full-fledged montheistic deity and at the same time the attributes of the Upanisadic absolute. \n\nParamahamsa Yogananda \nThe Bhagavad-Gita is where God Himself talks to His devotee Arjuna. \n\nRudolph Steiner \nIn order to approach a creation as sublime as the Bhagavad-Gita with full understanding it is necessary to attune our soul to it. \n\nAdi Sankara \nFrom a clear knowledge of the Bhagavad-Gita all the goals of human existence become fulfilled. Bhagavad-Gita is the manifest quintessence of all the teachings of the Vedic scriptures. \n\nAldous Huxley \nThe Bhagavad-Gita is the most systematic statement of spiritual evolution of endowing value to mankind. It is one of the most clear and comprehensive summaries of perennial philosophy ever revealed; hence its enduring value is subject not only to India but to all of humanity. \n\n &lt;a href=&quot;\nhttp://www.bhagavad-gita.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bhagavad-gita.org&lt;/a&gt;  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/gita&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/gita&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.asitis.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.asitis.com&lt;/a&gt; \n","torrent":{"xt":"urn:btih:86e9ec2d662650338540a1a82cfdd87047b1c6ff","amp;dn":"Bhagavadgita+-+Song+Of+God","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86e9ec2d662650338540a1a82cfdd87047b1c6ff","infoHashBuffer":{"type":"Buffer","data":[134,233,236,45,102,38,80,51,133,64,161,168,44,253,216,112,71,177,198,255]},"announce":[],"urlList":[]}}