{"title":"Mariah Carey - Butterfly Tour live Tokyo Dome","uid":14864713,"size":2265656844,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:86ff18827c31b264efbe8bd0c858319d732f9438&amp;dn=Mariah+Carey+-+Butterfly+Tour+live+Tokyo+Dome&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"cociello","files":1,"time":1465528270,"description":"The Butterfly World Tour was the third concert tour by American singer-songwriter Mariah Carey. The tour promoted Carey's album at the time, Butterfly (1997), and included songs from several of her previous albums. The tour visited Asia, Australia and the United States, with rehearsals taking place in December 1997. Starting on January 11, 1998 the tour spanned five shows in Asia, six in Australia, and one in Hawaii, US. Throughout the tour, Carey varied hairstyles and outfits, as well as song selections. The Butterfly World Tour was very successful; the four dates at Japan's largest stadium, Tokyo Dome, sold out in under one hour, equaling over 200,000 tickets, breaking the previous record she held at the stadium for show sell-outs.[1]\r\n\r\nThe tour was recorded in VHS format, and was titled Around the World. The video featured live performances of Carey at different worldwide venues including New York, Japan, Hawaii and Brisbane. Other scenes are included in the video such as a conversation between Carey and Brenda K. Starr prior to her performance of &quot;I Still Believe&quot;. Prior to the performances in Australia, a scene of Carey swimming with dolphins is shown. Additionally, Olivia Newton-John makes a cameo appearance during their joint performance of Newton-John's song, &quot;Hopelessly Devoted to You&quot;. The video was commercially successful, being certified platinum in the United States by the Recording Industry Association of America (RIAA) and gold in Brazil by the Associação Brasileira dos Produtores de Discos (ABPD)","torrent":{"xt":"urn:btih:86ff18827c31b264efbe8bd0c858319d732f9438","amp;dn":"Mariah+Carey+-+Butterfly+Tour+live+Tokyo+Dome","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86ff18827c31b264efbe8bd0c858319d732f9438","infoHashBuffer":{"type":"Buffer","data":[134,255,24,130,124,49,178,100,239,190,139,208,200,88,49,157,115,47,148,56]},"announce":[],"urlList":[]}}