{"title":"Manon.of.the.Spring.1986.DVDRip.Xvid-TBMs","uid":4524615,"size":734099621,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:870a18ff52d300c8dda8fee7bb5d797de63d5585&amp;dn=Manon.of.the.Spring.1986.DVDRip.Xvid-TBMs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"circlensess","files":3,"time":1227303451,"description":"Manon.of.the.Spring.1986.DVDRip.Xvid-TBMs\n &lt;a href=&quot;\nhttp://91.196.126.51/posters/870a18ff52d300c8dda8fee7bb5d797de63d5585MANON_OF_THE_SPRING.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://91.196.126.51/posters/870a18ff52d300c8dda8fee7bb5d797de63d5585MANON_OF_THE_SPRING.jpg&lt;/a&gt;\n\nManon des sources (1986)\nDirector: Claude Berri\nCast: Yves Montand, Daniel Auteuil, Emmanuelle Be'art, Hippolyte Girardot\nGenre: Drama / Romance\nYear of Production: 1986\nCountry: Italy / France / Switzerland\nLanguage: French\nRuntime: 113 min\nSubtitles: English\n\nPlot: In a rural French village an old man and his only remaining relative are successful flower growers using water from a spring on an adjoining property they now own. The grown-up daughter of the previous owner still lives in the hills as a goatherd and comes to realise that not only these two but the whole village knew of the existence of the spring when her father was desperately trying to water his crops. An accident with one of the goats leads her by chance to the source of the spring and the possibility of a terrible revenge.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0091480/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0091480/&lt;/a&gt;\n\nA worthy sequel\n\nFollowing the death of her father, Manon (Emmanuelle Beart) has remained in the farm house tending goats. Galinette (Auteuil) and his uncle Cesar (Montard) have greatly prospered from the fresh spring water and their carnations grow well. Galinette begins to turn towards ideas of love and steadily falls for the distant Manon. Meanwhile she has discovered the treachery that once befell her father and begins her plan to uncover the culprits.\n\nThis follows on from the open-ended story of &quot;Jean de Florette&quot;. Time has passed and Manon is now a beautiful young woman. This film will satisfy those who felt the bleak ending of the first film was not satisfying. This sees those who acted in greed receive their deserves. As a conclusion to the story it is satisfactory - the film begins quite relaxed and is quite humorous throughout. However the &quot;punishment&quot; of both Galinette and Cesar is moving. Cesar's fate is particularly impacting and you feel sorry for him and his greediness.\n\nThe performances are not as strong as before. In the first film both Montard and Auteuil had set characters to play. Here they are less set and act out their roles rather than their characters. Beart is good as Manon, but she is too different in heart from the angel of the first - it's understandable why she has changed but where she was since the last film is not clear, it's unlikely that her mother would have left her at the farm or that she would have let her leave to return. But this is a minor complaint over a moving tale of deserves. I would say this rather than revenge - because both Galinette and Cesar bring their pains upon themselves.\n\nMy only problem with this is that it follows the story of the first film. However to me the first film was more about human nature (greed &amp; hope specifically) rather than the story of the farmland and the spring. Although the end of Jean de Florette was bleak it was perhaps understandable that things should end that way. That said this is a good conclusion to the story if that's what you want - although as a further look at human nature it doesn't convince as well as the first did.\n\nManon des Sources is a good film that has all the visual beauty of the first film and continues the strong emotive story - as a pair of films they are an excellent piece of work. However for me, the first film is so strong in all areas that it leaves too much for the second to live up to.\n\nA moving sequel that almost manages to live up to what went before.","torrent":{"xt":"urn:btih:870a18ff52d300c8dda8fee7bb5d797de63d5585","amp;dn":"Manon.of.the.Spring.1986.DVDRip.Xvid-TBMs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"870a18ff52d300c8dda8fee7bb5d797de63d5585","infoHashBuffer":{"type":"Buffer","data":[135,10,24,255,82,211,0,200,221,168,254,231,187,93,121,125,230,61,85,133]},"announce":[],"urlList":[]}}