{"title":"Letting Go (Surrender Trilogy #1) Maya Banks epub","uid":13146721,"size":396822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88123812893cd504cc4517934cd46069dd2a3809&amp;dn=Letting+Go+%28Surrender+Trilogy+%231%29+Maya+Banks+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DYanna","files":3,"time":1452030248,"description":"Letting Go (Surrender Trilogy #1) by Maya Banks epub\r\n\r\nJosslyn found perfection once, and she knows she'll never find it again. Now widowed, she seeks the one thing her beloved husband couldn't give her. Dominance. Lonely and searching for an outlet for her grief and wanting only a brief taste of the perfection she once enjoyed, she seeks what she's looking for at an exclusive club that caters to people indulging in their most hedonistic fantasies. She never imagined that what she'd find is the one man who'd long been a source of comfort and secret longing. Her husband's best friend.\r\n\r\nDash has lived in an untenable position for years. In love with his best friend's wife and unwilling to act on that attraction. He'd never betray his best friend. And so he's waited in the wings, offering Joss unconditional support and comfort as she works past her grief, hoping for the day when he can offer her more.\r\n\r\nWhen he finds her in a club devoted to the darker edges of desire, he's furious because he thinks she has no idea what she's getting herself into. Until she explains in detail what it is she wants. What she needs. As realization sets in, he is gripped by fierce, unwavering determination. If she wants dominance, he is the only man who will introduce her to that world. He is the only man who will touch her, cherish her...love her. And the only man she'll ever submit to","torrent":{"xt":"urn:btih:88123812893cd504cc4517934cd46069dd2a3809","amp;dn":"Letting+Go+%28Surrender+Trilogy+%231%29+Maya+Banks+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88123812893cd504cc4517934cd46069dd2a3809","infoHashBuffer":{"type":"Buffer","data":[136,18,56,18,137,60,213,4,204,69,23,147,76,212,96,105,221,42,56,9]},"announce":[],"urlList":[]}}