{"title":"Noam Chomsky at Bir Zeit University - 5.24.2010 [theArchit3kt]","uid":5613396,"size":233346342,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8816768e449f3e7f4b842f70851808ad4da12258&amp;dn=Noam+Chomsky+at+Bir+Zeit+University+-+5.24.2010+%5BtheArchit3kt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"theArchit3kt","files":-1,"time":1275973879,"description":"Noam Chomsky at Bir Zeit University\n\nRunning Time: 1h 55min 49sec\nDate: 5/24/2010\nVideo Codec: MPEC-4, 320:240 (4:3), 1008kbps, 23,9 fps\nAudio Codec: mp3, stero, 96 kbps\n\n\nChomsky delivered his lecture to Bir Zeit University via video link from Amman [AFP]\nThe Israeli government has said it made a &quot;big mistake'' by barring Noam Chomsky, an American academic and political activist, from entering the occupied West Bank earlier this week. The interior ministry said on Tuesday that a low-level border clerk had wrongfully denied him entry, and that he was now free to enter. &quot;He should have been allowed in, it was a big mistake,&quot; Sabine Haddad, a spokeswoman for the ministry, told the Associated Press news agency. &quot;The clerk for some reason thought there was an issue of letting him in so denied him access. If he wants to come to the border he will be allowed in.&quot; Chomsky was barred by Israeli immigration officials as he attempted to cross the Allenby Bridge from Jordan on Sunday. The Jewish-American linguistics professor, who frequently speaks out against Israeli policy in the occupied Palestinian territories, had been scheduled to give a lecture at Bir Zeit University in the West Bank. And despite Haddad's statement, Chomsky said there was no &quot;official&quot; guarantee he would be allowed in and so decided to give the lecture by video link from Amman, Jordan's capital, on Tuesday. About 100 students attended the video link lecture at Bir Zeit University near the city of Ramallah. Chomsky said he was told during his interrogation at the border that &quot;Israel does not like what you say&quot;. The academic said preventing him from entering the West Bank was &quot;tantamount to boycotting Bir Zeit University&quot;.\nChomsky, who opposes a general boycott of Israel, told Israel's Haaretz newspaper that Israel's behaviour reminded him of South Africa in the 1960s, which thought it could counter its international pariah status through better public relations.\n\n[Text Source: AlJazeera - Middle East News]\n\nEXTRA:\nNoam Chomsky speaks about his hours-long wait and subsequent denial of entry\nDetails: 2min 55sec, on AlJazerra\nLink:\n________________________________________________________\n\n\nYou find all my torrents and a lot of other stuff on:\n &lt;a href=&quot;\nhttp://thearchit3kt.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thearchit3kt.blogspot.com/&lt;/a&gt;\n\n\n\n..I wish you all the best and thanks a lot to everybody who helps seeding..\n..theArchit3kt..\n\n\n!! keep torr3nts alive !!","torrent":{"xt":"urn:btih:8816768e449f3e7f4b842f70851808ad4da12258","amp;dn":"Noam+Chomsky+at+Bir+Zeit+University+-+5.24.2010+%5BtheArchit3kt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8816768e449f3e7f4b842f70851808ad4da12258","infoHashBuffer":{"type":"Buffer","data":[136,22,118,142,68,159,62,127,75,132,47,112,133,24,8,173,77,161,34,88]},"announce":[],"urlList":[]}}