{"title":"The Pretenders - Don't Get Me Wrong [Top of the Pops, 10-23-1986","uid":9758798,"size":177108992,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8868993659a95da9b88ad578e15c56b829713be1&amp;dn=The+Pretenders+-+Don%27t+Get+Me+Wrong+%5BTop+of+the+Pops%2C+10-23-1986&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1394780744,"description":"The Pretenders - Don't Get Me Wrong [Top of the Pops, 10-23-1986].VOB\n\n\nHQ very rare promo performance music video from a promo DVD. &quot;Don't Get Me Wrong&quot; is a song released by the pop-rock group The Pretenders. It was the first single taken from the group's 1986 album, Get Close. It can also be found on the band's The Singles album, released in 1987.\n\nIn the US, &quot;Don't Get Me Wrong&quot; became the group's second Top 10 hit on the Billboard Hot 100 chart, peaking at #10. Their first Top 10 pop hit, &quot;Back on the Chain Gang&quot;, had reached #5 in 1983. &quot;Don't Get Me Wrong&quot; also spent three weeks atop the Billboard Album Rock Tracks chart in November 1986. In the UK, the song also peaked at #10 in the UK Singles Chart.\n\nHynde stated in the VH1 Story Tellers series that she got the inspiration for the chorus' melody while on a British Airways flight. The airline's distinct &quot;tone&quot; jingle, which was played at certain times in the flight (for announcements from the pilot, seatbelt attention, etc.) had the same series of tones/notes as the chorus: DON'T- GET- ME- WRONG.\n\nThe song features a jangly guitar sound and an emphasis on melody. Hynde's lyrics contain literary and scientific references in addition to the more relationship-based subject matter typical for pop music. The song was covered by British pop singer Lily Allen for BBC Radio 1's 40th anniversary celebrations in 2007 and was released on the subsequent compilation album.\n\nThe Pretenders are an English-American rock band formed in Hereford, England, in March 1978. The original band comprised initiator and main songwriter Chrissie Hynde (lead vocals, rhythm guitar), James Honeyman-Scott (lead guitar, backing vocals, keyboards), Pete Farndon (bass guitar, backing vocals), and Martin Chambers (drums, backing vocals, percussion). Following the drug-related deaths of Honeyman-Scott and Farndon, the band has experienced numerous subsequent personnel changes, with Hynde as the only consistent member, and Chambers returning after an absence of several years.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Don%27t_Get_Me_Wrong&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Don%27t_Get_Me_Wrong&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/fAlfOAaFK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/fAlfOAaFK&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 6000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:03:44\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:8868993659a95da9b88ad578e15c56b829713be1","amp;dn":"The+Pretenders+-+Don%27t+Get+Me+Wrong+%5BTop+of+the+Pops%2C+10-23-1986","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8868993659a95da9b88ad578e15c56b829713be1","infoHashBuffer":{"type":"Buffer","data":[136,104,153,54,89,169,93,169,184,138,213,120,225,92,86,184,41,113,59,225]},"announce":[],"urlList":[]}}