{"title":"Emile Habiby - Secret Life of Saeed, the Ill-Fated Pessoptimist","uid":8919371,"size":1417607,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88a9693bae09e3eb54264bf2626645b399a8bc12&amp;dn=Emile+Habiby+-+Secret+Life+of+Saeed%2C+the+Ill-Fated+Pessoptimist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1379215567,"description":"Emile Habiby - The Secret Life of Saeed, the Ill-Fated Pessoptimist (Readers International, 1985). 169 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nThis contemporary classic, the story of a Palestinian who becomes a citizen of Israel, combines fact and fantasy, tragedy and comedy. Saeed is the comic hero, the luckless fool, whose tale tells of aggression and resistance, terror and heroism, reason and loyalty that typify the hardships and struggles of Arabs in Israel. An informer for the Zionist state, his stupidity, candor, and cowardice make him more of a victim than a villain; but in a series of tragicomic episodes, he is gradually transformed from a disaster-haunted, gullible collaborator into a Palestinian -- no hero still, but a simple man intent on survival and, perhaps, happiness.\n\n\nabout the author (from wikipedia):\n\nImil (Emile) Shukri Habibi (1922 - 1996) was a Palestinian writer of Arabic expression and a communist politician, son of a Christian family.\n\nHabibi's work, harshly critical of Israel, has nonetheless been coopted into Israeli cultural streams and, in 2005, he was voted the 143rd-greatest Israeli of all time, in a poll by the Israeli news website Ynet to determine whom the general public considered the 200 Greatest Israelis. Most Palestinians would reject his labelling as an 'Israeli' author.\n\nHabibi began writing short stories in the 1950s, and his first story, &quot;The Mandelbaum Gate&quot; was published in 1954.\n\nIn 1972 he resigned from the Knesset in order to write his first novel: The Secret Life of Saeed the Pessoptimist, which became a classic in modern Arabic literature. The book depicts the life of an Palestinian, employing black humour and satire. It was based on the traditional anti-hero Said in Arab literature. In a playful way it deals with how it is for Arabs to live in the state of Israel, and how one who has nothing to do with politics is drawn in to it. \n\nHe followed this by other books, short stories and a play. His last novel, published in 1992, was Saraya, the Ogre's Daughter.\n\nIn 1990, Habibi received the Al-Quds Prize from the PLO. In 1992, he received the Israel Prize for Arabic literature.","torrent":{"xt":"urn:btih:88a9693bae09e3eb54264bf2626645b399a8bc12","amp;dn":"Emile+Habiby+-+Secret+Life+of+Saeed%2C+the+Ill-Fated+Pessoptimist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88a9693bae09e3eb54264bf2626645b399a8bc12","infoHashBuffer":{"type":"Buffer","data":[136,169,105,59,174,9,227,235,84,38,75,242,98,102,69,179,153,168,188,18]},"announce":[],"urlList":[]}}