{"title":"Knitting For Peace: Make the World a Better Place One Stitch at ","uid":11365204,"size":13083287,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8998ca5f90729d9c87544eb2c8a068a786e4417c&amp;dn=Knitting+For+Peace%3A+Make+the+World+a+Better+Place+One+Stitch+at+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1415036782,"description":"All across America, people are knitting for peace. In yarn shops and private homes, churches and synagogues, schools and even prisons, they meet on weekday evenings or weekend afternoons to knit afghans for refugees, mittens for the homeless, socks for soldiers, or preemie caps for AIDS babies. The tradition goes back as far as Martha Washington, who spearheaded knitting efforts for the soldiers of the Revolutionary War, and has seen a recent flourishing in what is nowadays called ?charity knitting,? ?community knitting,? or ?knitting for others.? And whether it's for world peace, community peace, or peace of mind, today's various causes have the common goal of knitting the world into a better place one stitch at a time. Knitting for Peace is an exceptional book that celebrates the long heritage of knitting for others. It tells the stories of 28 contemporary knitting-for-peace endeavors, and features patterns for easy-to-knit charity projects such as hats, socks, blankets, and bears, plus a messenger bag emblazoned with the Knitting for Peace logo. Enlivened by anecdotal sidebars and quotations from both knitters and peacemakers, this inspiring book also includes everything readers need to know to start their own knitting-for-peace groups","torrent":{"xt":"urn:btih:8998ca5f90729d9c87544eb2c8a068a786e4417c","amp;dn":"Knitting+For+Peace%3A+Make+the+World+a+Better+Place+One+Stitch+at+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8998ca5f90729d9c87544eb2c8a068a786e4417c","infoHashBuffer":{"type":"Buffer","data":[137,152,202,95,144,114,157,156,135,84,78,178,200,160,104,167,134,228,65,124]},"announce":[],"urlList":[]}}