{"title":"Android Games Pack~DiBYA","uid":6474319,"size":2846012679,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:89b8c9fdd456e0402e0a215fb326b6143ed089b6&amp;dn=Android+Games+Pack%7EDiBYA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DibyaTPB","files":108,"time":1308262082,"description":"Android Games Pack [Other/2011]\n\nAndroid Games Pack - collection of the most popular games platform\nAndroid. Pack includes games with different themes: logic, arcade,\nracing simulators, RPG. Most games in this package are compatible with\ndifferent versions of smart phones, and some of them have several installers.\n\n3 Kingdoms TD- is the classic Tower Defence with new gameplay. You and your hero to go to the Battle of the Three Kingdoms.\n\nAngry Birds- a puzzle video game developed by Rovio Mobile, in which a player using a slingshot to shoot birds\n\nArmored Defense Lite (Beta)- military arcade with excellent graphics.\n\nAssassin's Creed- All known game Assassin's Creed. In this game you can develop the patience and skill to accumulate skills.\n\nAstral Commander- Space arcade game, in which, controlling robots, you must build towers to repel an enemy attack\n\nAvatar 3D- The game will take you to interesting and fascinating world that is beyond your imagination.\n\nBebbled Lite- an exciting and beautiful puzzle game for Android. You need to find and remove the balls from the playing field a similar color\n\nBurning Tires 3D- In this mobile racing with fantastic graphics, you are invited to ride on the most dangerous places on the planet\n\nCrystal Defenders- addictive game in style turrets\n\nDante THE INFERNO- video games in the genre of slasher with elements of role-playing game\n\nDark Area Lite 3D- Lite version of the 3D first-person shooter for powerful handheld device.\n\nDynamoKid Touch- arcade classic character toys\n\nEA FIFA 10- an excellent 3D football from Electronic Arts is now on Android\n\nEuropean War- Strategic toy. Expands its forces on land and at sea, dive into Europe 19 centuries\n\nFarm Tower- arcade on the physics of which you need to help safely descend from the high towers baby animals\n\nForest Runner- a game about the conqueror of the jungle\n\nFruit Pirate (3D)- cuts fruits and earn points.\n\nGT Racing Motor Academy- one of the real and the most realistic racing simulators.\n\nGuitar Hero 5 Mobile- Famous console game Guitar Hero is now on your Android\n\nGun Bros 3D- real 3D-action game in which (as befits the genre), you have to destroy the hordes of enemies in a non-stop\n\nHalf-Life- a video game in the genre of sci-fi first-person shooter.\n\nHaypi Kingdom- the massive online game about the Middle Ages\n\nHero Of Sparta- a great game from GameLoft in 3D. Superb graphics and gameplay. You'll fight with mythical creatures\n\nHexDefense- camoya arcade and a saturated genre of Tower Defense games to Android\n\nJewellust- beautiful puzzle game for Android\n\nLabyrinth Full- a classic game where you control a steel ball by tilting a wooden labyrinth.\n\nLeap Sheep!- Fun arcade game where you have to jump over a flock of sheep over the fence.\n\nMajesty Fantasy Kingdom Sim- a huge magical world in which it is YOU have the honor to become the head of a small fairy-tale kingdom.\n\nMath Scramble- a puzzle game in which you want to make mathematical examples\n\nModern CombatSandstorm- clone of the Call of Duty on your smartphone. You'll play an American soldier, your goal unichnozhit terrorists.\n\nMr.Wiener- logic puzzle\n\nModern Combat Black Pegasus HD 2- Modern Combat 2: Black Pegasus improves gameplay first Modern Combat\n\nNOVA- To protect each other, space refuge together in an alliance, which was named Near Orbit Vanguard Alliance\n\nNeed for Speed Shift - the famous race from the developers of the company EA Games.\n\nPaper Toss- office fun.\n\nPeeping Tom- do not give spying eyes of the girl washable.\n\nPlateau - an entertaining puzzle game in which you want to move the ball so that the lines are not crossed.\n\nPrince of Persia- The legendary Prince of Persia series is now in your smartphones android\n\nPro Evolution Soccer 2011- an excellent football simulator with 3D graphics and running with G-Sensor\n\nReal Football 2011- 3D GameLoft football from now on Android\n\nReckless Racing - combines a classic racing gameplay with good graphics environment.\n\nShrek Kart - miles of fun racing with Shrek and his friends\n\nSingularity - 3D space shooter\n\nSkies of Glory - Ruthless dogfights in the skies during World War II.\n\nSlice It- we cut a finger with a knife as a variety of shapes\n\nSmackTalk!- Deal with the hamster\n\nSpace War HD- classic Invaders for Android\n\nSpeedX 3D- you have to shoot on three-dimensional tunnel, dodging obstacles.\n\nSplinter cell Conviction- Sensational shooter is now on the Android OS\n\nSuper Dynamite Fishing - blast fishing on Android.\n\nTetris For Android- a good Tetris for Android smartphones with high-quality graphics\n\nThe Last Defender HD- modern warfare, you are the rocket launcher and destroy armored vehicles\n\nThe Sims 3- The famous life simulator Sims 3 is now on Android!\n\nTile Storm Lite (3D) - a beautiful puzzle game for the android with beautiful 3D graphics\n\nTom Clancy's HAWX - simulator with spectacular graphics platform android\n\nTreasures of Montezuma 2- is a colorful and addictive puzzle game in the style of &quot;three in a row&quot;\n\nTurboFly 3D - futuristic racing for Android\n\nWARP - in this game you have to save our planet from meteorites\n\nWar2 - War online\n\nWild West Sheriff - Western, the problem is not getting to shoot bandits in the other\n\nWinds of Steel - one of the best flight simulation for Android\n\nWorms 2010 - a classic comic war game returns to mobile. Get a platoon of worms with powerful weapons and attack the enemy\n\nX Construction- arcade game for Android Building bridges and inspect them for strength to passing on his train\n\nXeno Tactic II Lite- qualities of the game for Android, which is necessary to defend your base from enemy invasion\n\nYumsters - Yumsters! Settle them in my phone - and you always forget about boredom!\n\nZuma's Revenge - the legendary Zuma returned.","torrent":{"xt":"urn:btih:89b8c9fdd456e0402e0a215fb326b6143ed089b6","amp;dn":"Android+Games+Pack%7EDiBYA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89b8c9fdd456e0402e0a215fb326b6143ed089b6","infoHashBuffer":{"type":"Buffer","data":[137,184,201,253,212,86,224,64,46,10,33,95,179,38,182,20,62,208,137,182]},"announce":[],"urlList":[]}}