{"title":"Corrosion Monitoring In Nuclear Systems: Research &amp; Applications","uid":6543180,"size":12957057,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89edbdc529d23b478ec7c69019dfe9c6c37ec3bb&amp;dn=Corrosion+Monitoring+In+Nuclear+Systems%3A+Research+%26+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"theLEAK","files":-1,"time":1310763653,"description":"Corrosion remains one of the key issues affecting the performance and availability of nuclear power plants. Therefore, reliable in-plant corrosion monitoring methods are essential both for the future operation of existing plants and to ensure the safety of future nuclear waste disposal systems. In two parts, this book was stimulated by a workshop organised by EFC Working Party 4 on Nuclear Corrosion and the European Cooperative Group on Corrosion Monitoring of Nuclear Materials (EGC-COMON).\n\nThe first part deals mainly with research into the detection of stress corrosion crack initiation in nuclear power plant environments (essentially high temperature water at 300 ) by various methods, particularly the electrochemical noise technique but also including the electrochemical impedance, acoustic emission and direct current potential drop methods. The second part addresses the goal to develop in-situ techniques and includes examples of the application of electrochemical corrosion potential monitoring. This book will be of particular interest to scientists and engineers concerned with the mitigation of corrosion in nuclear power plants and the long-term storage of radioactive waste.","torrent":{"xt":"urn:btih:89edbdc529d23b478ec7c69019dfe9c6c37ec3bb","amp;dn":"Corrosion+Monitoring+In+Nuclear+Systems%3A+Research+%26+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89edbdc529d23b478ec7c69019dfe9c6c37ec3bb","infoHashBuffer":{"type":"Buffer","data":[137,237,189,197,41,210,59,71,142,199,198,144,25,223,233,198,195,126,195,187]},"announce":[],"urlList":[]}}