{"title":"C# Async Fundamentals LiveLessons","uid":9687646,"size":1065716928,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8ada2294443b4044a9746cbafe307b027748a4b8&amp;dn=C%23+Async+Fundamentals+LiveLessons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"antignor","files":19,"time":1393807322,"description":"C# Async Fundamentals LiveLessons\n---------------------------------\n\nOverview\n\nC# Async Fundamentals LiveLessons provides developers with a practical introduction to Async and is a one-stop-shop to get you on the road to programming asyncronously.\n\nDescription\n\nAs one of the most important new feature in the C# language, Async is an integral part of the Windows Runtime library. Developers will need to use the async / await features in most, if not all, of their upcoming development efforts. With async methods baked into more and more of the underlying libraries, developers will need strong skills around these features.\n\nIn this video training, C# expert and bestselling author Bill Wagner teaches the basics of C# async and await, and the Task Asynchronous Programming Model. Lesson 1 provides the basis for putting async and await into practice in your daily development efforts. All the remaining Lessons are designed to take you through a series of common mistakes developers make using async and await.\n\nIn Lesson 2 &quot;Sync over Async&quot;, you'll examine where sync over async can creep into an application, and learn how to remove to ensure you don't suffer from its effects. In Lesson 3 you'll explore the perils of async void methods, an issue at the heart of the C# compiler team. In Lesson 4 he'll get you up-to-speed on techniques to ensure that you avoid forcing async methods to run serially. In Lesson 5 you'll learn techniques for unit testing async methods.\n\nAnd to tie it all together, Lesson 6 will recap the fundamental practices and the implementation of async and await.\n\nAbout the Instructor\n\nBill Wagner has spent his entire career in the software industry, spanning both technical and business roles. Bill's technical time is spent between curly braces, primarily with C#. He's the author of the bestselling &quot;Effective C#&quot;, now in its second edition, and &quot;More Effective C#&quot;. His articles have appeared in MSDN Magazine, the C# Developer Center, Visual C++ Developer's Journal, Visual Studio Magazine, ASP.NET ,Pro, .NET Developer's Journal and more. He's written hundreds of technical articles and actively blogs on technical and business topics. Bill is also a Microsoft Regional Director.\n\nHe spent eight years as a self-employed consultant before co-founding SRT Solutions with Dianne Marsh. Over the past decade, SRT Solutions has grown into a premier software development company, amassing 4 FastTrack awards (2011, 2010, 2008, 2007), the Michigan 50 Companies to Watch award (2011), and making the Inc 500/5000 list (2011 and 2012). Bill was also awarded Automation Alley's Emerging Technology Leader award in 2011.After a successful exit from SRT Solutions, Bill now spends his time helping developers improve their skills.\n\nSkill Level\n\nThis topic should be of interest to anyone developing using the C# language. This includes Windows Server, Windows 8, Windows Phone, MonoDroid, and Mono Touch developers at the following skill level:\n\n    Beginner\n    Intermediate\n\nWhat You Will Learn\n\n    Learn to avoid the sync over async anti-pattern.\n    Learn how to ensure that you can recover from errors in async tasks.\n    Learn to structure async code for better responsiveness.\n    Learn how to construct unit tests for async code.\n    Learn how to construct async APIs that express clarity to your users.\n\nWho Should Take This Course\n\n    Developers looking for a practical introduction to C# async\n\nCourse Requirements\n\n    Some experience with C# programming.\n    A passing familiarity with async /await features is helpful.\n\nTable of Contents\n\nLesson 1: Overview of the syntax and the TAP programming model\n\nLesson 2: Sync Over Async\n2.1 Lab Review\n2.2 Task.Wait blocking API\n2.3 IAsyncResult.GetResults Blocking API\n2.4 Task.Result Blocking API\n2.5 The Payoff of Responsiveness\n\nLesson 3: Async Void\n3.1 Did my task finish?\n3.2 Removing Async Void code smell\n3.3 Review of app behavior changes\n\nLesson 4: Async Serial Tasks\n4.1 Await results, not task launch\n4.2 Searching for unnecessary awaits\n4.3 ConfigureAwait and Context affinity\n4.4 When APIs need the UI context\n\nLesson 5: Unit Testing Async Methods\n5.1 Testing logic and the fast path\n5.2 Testing the slow path and task completion order\n5.3 Testing for failed tasks\n\nLesson 6: Putting what you've learned about Async to practice\n\n\nCopyright 2014\nEdition: 1st\nISBN-10: 0-321-94013-X\nISBN-13: 978-0-321-94013-1\n\n &lt;a href=&quot;\nhttp://www.informit.com/store/c-sharp-async-fundamentals-livelessons-video-training-9780321940131&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.informit.com/store/c-sharp-async-fundamentals-livelessons-video-training-9780321940131&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8ada2294443b4044a9746cbafe307b027748a4b8","amp;dn":"C%23+Async+Fundamentals+LiveLessons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ada2294443b4044a9746cbafe307b027748a4b8","infoHashBuffer":{"type":"Buffer","data":[138,218,34,148,68,59,64,68,169,116,108,186,254,48,123,2,119,72,164,184]},"announce":[],"urlList":[]}}