{"title":"Randall Bramblett - The Bright Spots [2013][FLAC]","uid":8630343,"size":377277062,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8d245ee0eb91efd127d5748730163d66711c1e62&amp;dn=Randall+Bramblett+-+The+Bright+Spots+%5B2013%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":15,"time":1372617068,"description":"Artist: Randall Bramblett\nRelease: The Bright Spots\nReleased: 2013\nLabel: New West\nCatalog#: PROMO CD\nFormat: FLAC / Lossless\n[color=blue]Country: USA\nStyle: rock\n\n1. Roll 3:21\n2. Every Saint 5:14\n3. 'Til The Party's All Gone 5:07\n4. My Darling One 4:54\n5. Whatever That Is 4:25\n6. John The Baptist 5:19\n7. Shine 4:52\n8. Trying To Steal A Minute 5:58\n9. Detox Bracelet 4:24\n10. You Bring Me Down 4:51\n11. All Is Well 5:07\n12. Rumbling Bridge 4:40\n\nThroughout Randall Bramblett's long, storied career as a sideman and as a solo artist, he has doggedly mined the sources of his earliest inspirations -- soul, R&amp;B, blues, and roots rock -- for the lessons they teach about creative expression. As a result, his albums have always moved a little deeper, a little wider, and have taken enough chances with those forms that he's too mercurial to pin down -- he's a marketing person's nightmare, but a real music fan's (and musician's) delight. The Bright Spots, his ninth offering, is at once his loosest and most adventurous studio recording. Bramblett raised $30,000 in a Kickstarter campaign to fund the recording. Seven tunes were recorded with his longtime band and some friends at drummer, co-producer, and engineer Gerry Hansen's studio near Bramblett's home in Athens, Georgia, while the remainder were done with a smaller group in Nashville. The different lineups and locations add a varied, very live-from-the-floor feel (which in fact most of these cuts were), despite the fact that Hansen and Bramblett took some real chances in post-production. One example is on the smoking, midtempo gospel blues &quot;Every Saint,&quot; with its canny loop of Pygmy children splashing around in a creek as both intro and backdrop. There are some popping, funky rockers, including opener &quot;Roll,&quot; with its stinging guitars, wailing B-3, and punchy horns. The grimy, psych-tinged, gospelized groove of &quot;John the Baptist&quot; (with a killer baritone sax by Tom Ryan and spacy Coral electric sitar by Davis Causey) is a real standout. &quot;Whatever That Is&quot; is swampy, Rhodes-fueled blues, while &quot;Trying to Steal a Minute&quot; is a steamy, nocturnal, suffocatingly close, shuffling funk blues with throbbing bass, big hypnotic shuffling drums, and layered washes of keyboards and guitar. The loop-drenched blues funk in &quot;You Bring Me Down&quot; is forceful for Betsy Franck's gospel wail soaring above the musical fray. The finest moments here are the ballads. Bramblett seems to have been listening to the Mercury-era Rod Stewart records when he wrote the gorgeous love song &quot;My Darling One.&quot; The tender, shimmering, poetic &quot;Detox Bracelet,&quot; with its lithe keyboards and skittering hi-hat, is his own startling, unique invention. Throughout the record, Bramblett's dusky, soulful voice inhabits his words as if what is portrayed by them is happening in real time, and while the considerable hooks help him there, it's his poignant lyrics that bring him the rest of the way into the center. In this latter area, he's as good -- and as deep -- as virtually anybody. The Bright Spots, while immediately recognizable as a Bramblett album, doesn't sound like anything else in his catalog. It's bold, inventive, colorful, and at times profound.","torrent":{"xt":"urn:btih:8d245ee0eb91efd127d5748730163d66711c1e62","amp;dn":"Randall+Bramblett+-+The+Bright+Spots+%5B2013%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d245ee0eb91efd127d5748730163d66711c1e62","infoHashBuffer":{"type":"Buffer","data":[141,36,94,224,235,145,239,209,39,213,116,135,48,22,61,102,113,28,30,98]},"announce":[],"urlList":[]}}