{"title":"Cowboy Copas - Settin' Flat On Ready - Bear Family CD (2008)","uid":11694160,"size":349161427,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8dc73c5ce05b4f434e0fd63a528dec3d29fcb761&amp;dn=Cowboy+Copas+-+Settin%27+Flat+On+Ready+-+Bear+Family+CD+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"bonnie335","files":61,"time":1423647625,"description":"Cowboy Copas - Settin' Flat On Ready - Gonna Shake This Shack Tonight - Bear Family CD (2008)\n\n\nWith his unique blend of honky-tonk, Western swing, country boogie, and proto-rockabilly, Cowboy Copas was a huge influence on everyone from Johnny Cash to Waylon Jennings. SETTIN' FLAT ON READY captures Copas at his finest, from the Leadbelly-goes-Nashville chug of &quot;Alabam&quot; to the (literal) gallows humor of the shuffling &quot;Hangman Boogie.&quot; With 34 songs and a 40-page booklet, this collection makes the ideal introduction to Copas's work. \n\n2008 release coinciding with the 45th Anniversary of this Country star's death. With a career dating back to the late '30s, Lloyd 'Cowboy' Copas was one of country music's great stylists. After signing with King Records in 1946, Copas rose to prominence with a string of hit singles, his distinctive high baritone voice grabbing nickels in jukeboxes across the Southeast and Midwest. Though most of his records were pure, unadulterated Country, Copas showed a versatility that few singers could match. He recorded with Elliot Lawrence's big band and later cut some edgy Rockabilly. This single-disc collection culls the best of Copas's upbeat tracks for King, along with scarce material from his short-lived stints with Dot. 34 tracks. Bear Family","torrent":{"xt":"urn:btih:8dc73c5ce05b4f434e0fd63a528dec3d29fcb761","amp;dn":"Cowboy+Copas+-+Settin%27+Flat+On+Ready+-+Bear+Family+CD+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc73c5ce05b4f434e0fd63a528dec3d29fcb761","infoHashBuffer":{"type":"Buffer","data":[141,199,60,92,224,91,79,67,78,15,214,58,82,141,236,61,41,252,183,97]},"announce":[],"urlList":[]}}