{"title":"Passepartout 2008-04-20 - Storia di una famiglia per bene - Phil","uid":4151113,"size":238708736,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8de1c5835f7ac5f074b51ca799c39d809f906d99&amp;dn=Passepartout+2008-04-20+-+Storia+di+una+famiglia+per+bene+-+Phil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"signo","files":1,"time":1208950561,"description":"Ferrara, cittÃƒ  delle &quot;cento meraviglie&quot; come la definÃƒÂ¬ Filippo De Pisis, un insieme urbanistico monumentale impareggiabile, dal fascino quasi misterioso. Non a caso fu la cittÃƒ  di De Chirico e di CarrÃƒ , che diedero vita alla pittura metafisica. L&amp;#039;apparenza fisica della realtÃƒ  veniva rappresentata con modalitÃƒ  che andavano al di lÃƒ  dell&amp;#039;esperienza dei sensi.\n\nPassepartout questa settimana ricostruisce il percorso storico, estetico e politico che ha portato Ferrara al suo aspetto attuale. Una vicenda che corre parallelamente alla storia di una delle corti italiane che hanno contraddistinto il Rinascimento, gli Estensi. Una storia costellata di grandi personalitÃƒ  come Borso d&amp;#039;Este, Ercole I, Alfonso I (che fu marito di Lucrezia Borgia), Francesco I, e artisti come CosmÃƒÂ© Tura, Francesco del Cossa o Ercole De Roberti.\n\nUn racconto che prende spunto dai luoghi piÃƒÂ¹ affascinanti della cittÃƒ : la Cattedrale e il suo Museo, Palazzo Schifanoia, il Castello Estense, lo Stanzino delle Duchesse, Palazzo dei Diamanti, dove una mostra, CosmÃƒÂ© Tura e Francesco del Cossa. L&amp;#039;arte a Ferrara nell&amp;#039;etÃƒ  di Borso d&amp;#039;Este, ÃƒÂ¨ un&amp;#039;occasione per proporre un quadro ben articolato sullo stile artistico in voga a Ferrara e sulle sue ereditÃƒ  e influssi anche sul contemporaneo, dalla metafisica di De Chirico al cavallo di Guernica di Picasso.  \n\nNel 1598 gli Estensi persero Ferrara che per volere di Papa Clemente VIII rientrÃƒÂ² sotto l&amp;#039;ingerenza diretta dello Stato della Chiesa. Poterono perÃƒÂ² continuare a manifestare il loro regno sui territori di Modena e di Reggio. Qui prosegue l&amp;#039;indagine di Philippe Daverio sulla famiglia.\n\nTra cinismo sanguinario da tagliagola e mecenatismo artistico, al pari dei Malatesta altri protagonisti del Rinascimento italiano sul versante adriatico, gli Estensi diedero vita a un&amp;#039;epopea da salotti buoni e raffinatezze chic. L&amp;#039;infilata di stucchi e decori nei saloni di Palazzo Ducale a Modena e le preziosissime collezioni della Galleria Estense sempre a Modena mostrano alla perfezione il progressivo e definitivo assestamento degli Estensi nell&amp;#039;alveo delle &quot;famiglie per bene&quot;.\n\nFonte:\n- [URL=http://www.passepartout.rai.it]Passepartout[/URL]","torrent":{"xt":"urn:btih:8de1c5835f7ac5f074b51ca799c39d809f906d99","amp;dn":"Passepartout+2008-04-20+-+Storia+di+una+famiglia+per+bene+-+Phil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8de1c5835f7ac5f074b51ca799c39d809f906d99","infoHashBuffer":{"type":"Buffer","data":[141,225,197,131,95,122,197,240,116,181,28,167,153,195,157,128,159,144,109,153]},"announce":[],"urlList":[]}}