{"title":"BurnInTest Professional edition 5.3(with serials)","uid":4250449,"size":4854852,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8e5d49ce1dd41f2269096a3f589fa128f1e7bb36&amp;dn=BurnInTest+Professional+edition+5.3%28with+serials%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"aoloffline","files":1,"time":1213983181,"description":" PassMark BurnInTest? is a software tool that allows all the major sub-systems of a computer to be simultaneously stress tested for endurance, reliability and stability.\n\n    * Assists in PC Troubleshooting and diagnostics.\n    * The best value professional burn-in tool on the market!\n    * Avoid delivering D.O.A. (Dead on Arrival) hardware to your customers.\n    * Dramatically reduce your burn in times with multithreaded simultaneous testing of components.\n    * Build your image as a supplier of quality systems.\n    * Avoid costly downtime, system rebuilds and lost data.\n    * Test the stability of a system after configuration changes or hardware upgrades (critical for overclocking).\n\nAnyone who has used computers for any period of time will understand the importance of having a stable system. The cost of a hardware failure can be enormous. If you are lucky your data will only become inaccessible while faulty components are replaced. If you&amp;#039;re unlucky you can lose your files completely or have them permanently corrupted. Even if you have good backups, you can still lose days of work returning the PC to its pre-failure state. In many cases the lost data can never be replaced and businesses can be brought to their knees, with the loss of documentation, customer details and financial records.\n\nBurnInTest - Main window\n\nWhat BurnInTest does is thoroughly exercise the hardware in a PC in a short period of time, in the same way as normal applications use a PC over a long period of time. This takes advantage of the fact that computer hardware tends to fail either very early in its life or after many thousands of hours of use. Typically BurnInTest should be used before a PC is put into service, as the failure of a computer that isn?t being used for a critical application and doesn?t have any critical data is much less damaging, (especially if it is still under warranty).\n\nBurnInTest will bring intermittent or hidden problems to the surface so that after a successfully run the computer can be used with a much higher level of confidence. BurnInTest can also be used by overclockers to verify system stability at high clock speeds.\n\nBurnInTest tests the CPU via mathematical operations and SIMD calculations, hard drives, RAM, CD-ROMs, CD burners, DVDs, sound cards, 2D graphics, 3D graphic, network connection, printers, video playback. If you have specialized hardware that BurnInTest does not test, you can even write your own test and integrate it with BurnInTest. PassMark has produced plugin tests for Keyboards, Dial up Modems and FireWire ports. This can all be done simultaneously as the application is multithreaded. The Professional version also has a number of additional features such as tape drive testing, USB port testing, USB 2.0 port testing, Serial and parallel port testing with the use of loop back plugs.\nAdditional Features\n\nThe application includes the following additional features:\n\n    * Online help &amp; PDF manual\n    * A customer style results certificate\n    * Support for printing results\n    * Logging of results to disk in user selectable levels of detail (in ASCII format &amp; HTML formats)\n    * Timed test runs that will stop automatically at the expiry of the selected time or after a number of test cycles.\n    * The ability to save your results to disk as log file.\n    * &amp;#039;Notes&amp;#039; and &amp;#039;Machine ID&amp;#039; fields for storing your own audit information along with the saved log file.\n    * Support for copying the results to other applications (eg. MS-Word) via a variety of image formats. (BMP, GIF, EMF)\n    * The ability to select the level of load placed on each component, via the setting of a duty cycle for each test.\n    * Counters that count the total number of operations performed.\n    * An easy to use point and click interface\n    * Can be run from a USB drive or CD (under Windows)\n    * Summary system information including CPU type, CPU speed &amp; Serial number.\n    * Temperature monitoring interface (with additional 3rd party Intel Active Monitor, HMonitor, MotherBoardMonitor and SpeedFan software)\n    * Laptop battery &amp; UPS monitoring interface (with additional BatteryMon software)\n    * Support for production line automation and detailed logging\n    * RAM testing beyond the 4GB barrier in Windows 2000, XP and Vista (up to 64GB of RAM)\n    * Printer testing using raw print files, or standard B&amp;W or color testing\n    * MP3, Midi and Wave file playback for sound card testing\n    * Testing of up to 20 hard and floppy disks simultaneously\n    * Testing of up to 20 CD/DVD drives simultaneously\n    * CD / DVD testing using specialized test CD/DVDs (or use the complementary CD-Maker software). CD burner testing\n    * Windows shutdown and cyclic reboot testing (with complementary Rebooter software)\n    * Scrolling &amp;#039;H&amp;#039;s for Electromagnetic Compliance (EMC) testing to ANSI standard C63.4-1992\n    * Video RAM testing\n    * Testing the playback of Videos\n    * Support for SMART hard disk parameter checking\n\nStandard or Professional Edition?\n\nThe two editions are identical except for the following additional features in the Professional Edition:\n\n    * If you have specialized hardware that BurnInTest does not test, you can even write your own tests and integrate them with BurnInTest Professional. PassMark has produced plugin tests for Keyboards, Dial up Modems and FireWire ports.\n    * Serial port loop back testing. Testing can be performed on up to 64 serial ports at the same time. Loop back plugs are required for this test.\n    * Parallel port loop back testing. Loop back plugs are required for this test.\n    * USB port testing using the PassMark USB Loop back plug or the PassMark USB 2.0 Loop back plug. Up to 10 USB ports can be simultaneously tested.\n    * Tape drive testing under Windows 2000, XP, 2003 and Vista.\n    * CPU affinity selection, for targeting testing to a single CPU. This can be useful in dual CPU or quad CPU systems.\n    * Advanced RAM testing with page locking and testing beyond the 4GB barrier in 32-bit Windows 2000, XP and Vista. (up to 64GB)\n    * Scrolling &amp;#039;H&amp;#039;s for Electromagnetic Compliance (EMC) testing to ANSI standard C63.4-1992\n    * Additional options for video card testing\n    * Testing on 64-bit (x64) versions of Windows using a native 64-bit version of BurnInTest Professional. The Standard Edition is 32bit only. The Pro edtion is 32bit and native 64bit. When you purhcase the 32bit edition of BurnInTest Pro, you get the 64bit edition for free. The same license key works in both packages.\n    * Running BurnInTest from a CD or USB drive.\n\n","torrent":{"xt":"urn:btih:8e5d49ce1dd41f2269096a3f589fa128f1e7bb36","amp;dn":"BurnInTest+Professional+edition+5.3%28with+serials%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e5d49ce1dd41f2269096a3f589fa128f1e7bb36","infoHashBuffer":{"type":"Buffer","data":[142,93,73,206,29,212,31,34,105,9,106,63,88,159,161,40,241,231,187,54]},"announce":[],"urlList":[]}}