{"title":"5 Steps to Intuitive Decision Making with Judith Orloff [MP4]","uid":11891799,"size":900017383,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8efcf2efa95d2727bcea8874eee52a8c464b3694&amp;dn=5+Steps+to+Intuitive+Decision+Making+with+Judith+Orloff+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"elessedilgirl","files":3,"time":1431015521,"description":"In this informative, lively video, Dr. Judith Orloff, author of Guide to Intuitive Healing, shares the five steps to intuitive decision making that she uses in her medical practice so everyone can learn them too. Dr. Orloff presents a revolutionary argument for the integration of intuition with classical forms of Western medicine. She passionately believes that the future of medicine lies in the &quot;the wedding of heart and mind.&quot; In her vigorous and caring voice, Dr. Orloff explains how intuition can be used to listen to our body's signals to make better decisions. This groundbreaking video, geared to health-care professionals and general audiences alike, legitimizes intuition as a dynamic therapeutic tool.\n\nStep 1: Notice Your Beliefs.\n\nYour beliefs set the stage for healing. Positive attitudes stimulate growth. Negative attitudes impede it. It's important to rid yourself of counterproductive attitudes that you may not even realize you have.\n\nStep 2: Be In Your Body.\n\nYour body is a complex and sensitive intuitive receptor. Most people in Western society are conditioned to live from the neck up, ignoring the rest of their body. This stance is counter-intuitive. You'll learn to shift that perspective-to enjoy your intellect but but also listen to your intuition when making decisions.\n\nStep 3: Sense Your Body's Subtle Energy.\n\nWe are composed of flesh and blood, but also of subtle energy. Chinese Medical Practitioners call it &quot;chi,&quot; a vital substance which penetrates the body and extends many feet beyond it. From an intuitive point of view, these energy fields have a significant effect on our health and can inform decision making. Thus, it s important that we learn to sense other people's energy--but not absorb it--so we can make good decisions about relationships.\n\nStep 4: Ask for Inner Guidance.\n\nWe each possess an intuitive voice that contains answers about good decisions. Because our intellect is often so loud, this voice often gets drowned out. It's essential that we learn to access the stillness within--though meditation, quiet contemplation, connecting with nature, and prayer in order to gain answers.\n\nStep 5: Listen To Your Dreams.\n\nIntuition is the language of dreams. Every ninety minutes each night during the REM stage of sleep, we dream. Dreams provide answers about health, relationships, career choices, any new direction.\n\nPart 1 - 42.37 min\nPart 2 - 43.50 min\n\nContainer: MP4\nVideo Codec: H264\nVideo Bitrate: 1268 / 1314 Kbps\nFramerate: 29.970 fps\nResolution: 640*480 (4:3)\nAudio codec: AAC\nAudio bitrate: 90.3 / 92.9 Kbps Variable, 44.1 Hz, 2 channels,\nLanguage: English","torrent":{"xt":"urn:btih:8efcf2efa95d2727bcea8874eee52a8c464b3694","amp;dn":"5+Steps+to+Intuitive+Decision+Making+with+Judith+Orloff+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8efcf2efa95d2727bcea8874eee52a8c464b3694","infoHashBuffer":{"type":"Buffer","data":[142,252,242,239,169,93,39,39,188,234,136,116,238,229,42,140,70,75,54,148]},"announce":[],"urlList":[]}}