{"title":"Larry McMurtry - Telegraph Days (retail epub &amp; azw3)","uid":10781017,"size":3859447,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:900b8078a9aa98a84baf1feae4e9f33b0bbbae44&amp;dn=Larry+McMurtry+-+Telegraph+Days+%28retail+epub+%26amp%3B+azw3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gratefuldawg77","files":2,"time":1408162539,"description":"&quot;Told in the voice of Nellie Courtright, a spunky, courageous, attractive young woman whose story this is in part, Telegraph Days is the big novel of the Western gunfighters that people have been hoping for years Larry McMurtry would write.&quot; &quot;When Nellie and her brother Jackson are unexpectedly orphaned by their father's suicide on his new and unprosperous ranch, they make their way to the nearby town of Rita Blanca, where Jackson manages to secure a job as a sheriff's deputy, while Nellie, ever resourceful, becomes the town's telegrapher.&quot; &quot;Together, they inadvertently put Rita Blanca on the map when young Jackson succeeds in shooting down all six of the ferocious Yazee brothers in a gunfight that brings him lifelong fame but which he can never repeat because his success came purely out of luck.&quot; Propelled by her own energy and common-sense approach to life, Nellie meets and almost conquers the heart of Buffalo Bill, the man she will love most in her long life, and goes on to meet, and witness the exploits of, Billy the Kid, the Earp brothers, and Doc Holliday. She even gets a ringside seat at the Battle at the O.K. Corral, the most famous gunfight in Western history, and eventually lives long enough to see the West and its gunfighters turned into movies.","torrent":{"xt":"urn:btih:900b8078a9aa98a84baf1feae4e9f33b0bbbae44","amp;dn":"Larry+McMurtry+-+Telegraph+Days+%28retail+epub+%26amp%3B+azw3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"900b8078a9aa98a84baf1feae4e9f33b0bbbae44","infoHashBuffer":{"type":"Buffer","data":[144,11,128,120,169,170,152,168,75,175,31,234,228,233,243,59,11,187,174,68]},"announce":[],"urlList":[]}}