{"title":"Ram Jam - Black Betty (1977)","uid":4692053,"size":41895321,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9014ef91be15e0753036e3cef038ba4ab1a37eba&amp;dn=Ram+Jam+-+Black+Betty+%281977%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Iron_Horse","files":3,"time":1233427914,"description":"Ram Jam - Black Betty (1977) Promo Video\n\nYear: 1977 / Type: MPEG File / Quality: VG\nLenght: 03:56 min / Video Size: 384 x 288 (4:3)\nIncluded: Lyrics and this Info\n\nRam Jam was an American 1970s rock band, best known for their 1977 Top 20 hit &quot;Black Betty&quot;.\nThe band members were Bill Bartlett (guitar), Pete Charles (drums), Myke Scavone (lead singer), and Howie Arthur Blauvelt (bass). Jimmy Santoro, who toured with the band in support of their debut album joined on guitar for the follow-up album. Bill Bartlett was formerly lead guitarist for bubblegum group The Lemon Pipers, while Blauvelt played with Billy Joel in two bands, The Hassles and El Primo.\n\nEarly days\nBartlett went on from the Lemon Pipers to form a group called Starstruck - originally including Steve Walmsley (bass) and Bob Nave (organ) from the Lemon Pipers - later replacing Walmsley with David Goldflies (who later played for years with Dickie Betts and Great Southern, and The Allman Brothers), David Beck (Eicher) was their pianist. While in Starstruck, Bartlett took Leadbelly's 59 second long &quot;Black Betty&quot;, composed music for it, then arranged it and recorded and released it on the group's own TruckStar record label. &quot;Black Betty&quot; became a regional hit, then was picked up by record producers in New York who formed a group around Bartlett called Ram Jam. They re-released the song and it became a hit nationally. The Ram Jam &quot;recording&quot; was actually the same one originally recorded by Starstruck, the band at that time composed of Bartlett, lead guitar and vocals, Tom Kurtz, rhythm guitar and vocals, David Goldflies, bass, David Fleeman on drums. The rest of the tracks on the first studio album containing &quot;Black Betty&quot; was played by the Ram Jam line-up, as well as the first tour backing up the single. The touring band included Jimmy Santoro on guitar as well as Bartlett. The song caused quite a stir with the NAACP and Congress of Racial Equality calling for a boycott due to the lyrics.\n\nDespite the controversy, the song reached number 18 on the singles chart in 1977 in the U.S. and top ten in the United Kingdom and Australia, while the Ram Jam album reached the U.S. Top 40. It was a huge hit in The Netherlands, reaching number 4. Also, Ted Demme used the song in the soundtrack to his 2001 film, Blow, and it is often played between innings at Yankee Stadium. In July 2008, an excerpt of it was used in a dance routine on &quot;So You Think You Can Dance.&quot;\n\nIn 2006 the University of New Hampshire administration controversially banned the playing of Ram Jam's &quot;Black Betty&quot; at UNH Hockey games. UNH Athletic Director Marty Scarano explained the reason for the decision: &quot;UNH is not going to stand for something that insults any segment of society&quot;\n\nRead More: http://en.wikipedia.org/wiki/Ram_Jam   &lt;a href=&quot; http://en.wikipedia.org/wiki/Black_Betty&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Black_Betty&lt;/a&gt;","torrent":{"xt":"urn:btih:9014ef91be15e0753036e3cef038ba4ab1a37eba","amp;dn":"Ram+Jam+-+Black+Betty+%281977%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9014ef91be15e0753036e3cef038ba4ab1a37eba","infoHashBuffer":{"type":"Buffer","data":[144,20,239,145,190,21,224,117,48,54,227,206,240,56,186,74,177,163,126,186]},"announce":[],"urlList":[]}}