{"title":"Metallica Ride the Lightning 24 Bit Vinyl Pack","uid":9545032,"size":2195696871,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:90356589c8edeec6b0057a39820bdfb5b3979109&amp;dn=Metallica+Ride+the+Lightning+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1391115231,"description":"\n  Metallica Ride the Lightning 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Thrash Metal, Hard Rock\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 kbps\n  Bit Depth: 24 \n  Sampling Rate: 96,000 Hz\n\n  Two Versions\n\n  Universal 45 RPM (EU)\n  Megaforce MRI 769 (US)\n  \n  Kill 'Em All may have revitalized heavy metal's underground, but Ride the Lightning was even more stunning, exhibiting staggering musical growth and boldly charting new directions that would affect heavy metal for years to come. Incredibly ambitious for a one-year-later sophomore effort, Ride the Lightning finds Metallica aggressively expanding their compositional technique and range of expression. Every track tries something new, and every musical experiment succeeds mightily. The lyrics push into new territory as well -- more personal, more socially conscious, less metal posturing. But the true heart of Ride the Lightning lies in its rich musical imagination. There are extended, progressive epics; tight, concise groove-rockers; thrashers that blow anything on Kill 'Em All out of the water, both in their urgency and the barest hints of melody that have been added to the choruses. Some innovations are flourishes that add important bits of color, like the lilting, pseudo-classical intro to the furious &quot;Fight Fire with Fire,&quot; or the harmonized leads that pop up on several tracks. Others are major reinventions of Metallica's sound, like the nine-minute, album-closing instrumental &quot;The Call of Ktulu,&quot; or the haunting suicide lament &quot;Fade to Black.&quot; The latter is an all-time metal classic; it begins as an acoustic-driven, minor-key ballad, then gets slashed open by electric guitars playing a wordless chorus, and ends in a wrenching guitar solo over a thrashy yet lyrical rhythm figure. Basically, in a nutshell, Metallica sounded like they could do anything. Heavy metal hadn't seen this kind of ambition since Judas Priest's late-'70s classics, and Ride the Lightning effectively rewrote the rule book for a generation of thrashers. If Kill 'Em All was the manifesto, Ride the Lightning was the revolution itself.","torrent":{"xt":"urn:btih:90356589c8edeec6b0057a39820bdfb5b3979109","amp;dn":"Metallica+Ride+the+Lightning+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90356589c8edeec6b0057a39820bdfb5b3979109","infoHashBuffer":{"type":"Buffer","data":[144,53,101,137,200,237,238,198,176,5,122,57,130,11,223,181,179,151,145,9]},"announce":[],"urlList":[]}}