{"title":"Lou Christie - The Complete Co &amp; Ce/Roulette Recordings (199","uid":8681794,"size":350482503,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:90fc1750d84064015657ded006a06350d27851f7&amp;dn=Lou+Christie+-+The+Complete+Co+%26amp%3B+Ce%2FRoulette+Recordings+%28199&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":36,"time":1373720723,"description":"This is the same torrent that was uploaded to Demonoid in September 2008.\n\n\nLou Christie - The Complete Co &amp; Ce/Roulette Recordings (1998)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41H4YYYK5KL._SL500_AA240_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41H4YYYK5KL._SL500_AA240_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 8 page booklet.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio from All Music:\n\nWhile Lou Christie's shrieking falsetto was among the most distinctive voices in all of pop music, he was also one of the first solo performers of the rock era to compose his own material, generating some of the biggest and most memorable hits of the mid-1960s. Born Lugee Alfredo Giovanni Sacco in Glen Willard, Pennsylvania on February 19, 1943, he won a scholarship to Moon Township High School as a teen; there he studied music and vocal technique, later joining a group dubbed the Classics. Between 1959 and 1962, in collaboration with a variety of Pittsburgh-area bands, he cut a series of records for small local labels, adopting the stage name Lou Christie along the way. Eventually he made the acquaintance of Twyla Herbert, a classically trained musician and self-proclaimed mystic some 20 years his senior; they became songwriting partners, and in 1962 penned &quot;The Gypsy Cried,&quot; which he recorded on two-track in his garage. The single became a local phenomenon, and was eventually licensed for national release by the Roulette label, peaking at number 24 on the pop charts in 1963.\n\nAfter relocating to New York and landing session work as a backing vocalist, Christie wrote and recorded a follow-up, &quot;Two Faces Have I&quot;; it landed in the Top Ten, but shortly after its release he began a two-year stint in the Army. He returned to action in 1966, picking up right where he left off with his biggest hit yet -- the lush, chart-topping &quot;Lightnin' Strikes.&quot; Christie's next smash, 1966's &quot;Rhapsody in the Rain,&quot; was notorious for being among the more sexually explicit efforts of the period. After brief stays with Colpix and Columbia, he next moved to the Buddah label, scoring one last Top Ten hit in 1969 with &quot;I'm Gonna Make You Mine.&quot; Drug problems plagued Christie during the early 1970s, and after getting clean at a London rehab clinic, he dropped out of music, working variously as a ranch hand, offshore oil driller and carnival barker; by the 1980s, he was making the occasional appearance on oldies package tours, and in 1997 issued Pledging My Love, his first new material in over a quarter-century.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:aifoxqw5ldfe~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:aifoxqw5ldfe~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nAlthough he had made some good, and interesting, doo-wop records around his native Pittsburgh, this 21-track collection is where the career of Lou Christie begins in earnest. Still working out of Pittsburgh with his collaborator/mentor Twyla Herbert, the majority of these sides have a homegrown, small-label session feel to them, even if they were almost all simultaneously issued for national consumption on the Roulette imprint. Christie's otherworldly falsetto wails on the two big hits here (&quot;The Gypsy Cried&quot; and &quot;Two Faces Have I&quot;), which need no introduction, but his trademarked sound is equally at home and just as fine on B-sides and album filler like &quot;Red Sails In the Sunset,&quot; &quot;Tears On My Pillow,&quot; &quot;Tonight I Fell In Love&quot; and &quot;When You Dance.&quot; The previously unreleased version of the rocker &quot;Money&quot; yields a quirky take to the standard, but everything on here is vintage and prime Lou Christie, a true song stylist who just happened to also write a solid third of the material compiled here. An important, but often neglected, chapter in rock &amp; roll's history that deserves a wider hearing.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:fcfoxqrjldhe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:fcfoxqrjldhe&lt;/a&gt;\n\nReviews and for sale here: &lt;a href=&quot; http://www.amazon.com/dp/B000007TK3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000007TK3&lt;/a&gt;\n\nTrack List:\n\n01. The Gypsy Cried\n02. Red Sails In The Sunset\n03. Two Faces Have I\n04. All That Glitters Isn't Gold\n05. Stay\n06. Tears On My Pillow\n07. Have I Sinned\n08. Summer Snow\n09. When You Dance\n10. Money (That's What I Want)\n11. Tonight (I Fell In Love)\n12. To Be Loved (Forever)\n13. How Many Teardrops\n14. Mr. Tenor Man\n15. You And I (Have A Right To Cry)\n16. Shy Boy\n17. It Can Happen\n18. There They Go\n19. Maybe You'll Be There\n20. You May Be Holding My Baby\n21. Outside The Gates Of Heaven\n","torrent":{"xt":"urn:btih:90fc1750d84064015657ded006a06350d27851f7","amp;dn":"Lou+Christie+-+The+Complete+Co+%26amp%3B+Ce%2FRoulette+Recordings+%28199","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90fc1750d84064015657ded006a06350d27851f7","infoHashBuffer":{"type":"Buffer","data":[144,252,23,80,216,64,100,1,86,87,222,208,6,160,99,80,210,120,81,247]},"announce":[],"urlList":[]}}