{"title":"ExploitedCollegeGirls - Shane (Out Of His League)","uid":12916572,"size":1032998681,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:914522ae8a2797fae602de7019ce1899a8e7fd75&amp;dn=ExploitedCollegeGirls+-+Shane+%28Out+Of+His+League%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"feeldabyte","files":1,"time":1449355126,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/rn6l3 \nhttp://imgkiss.com/image/rnFII\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nThis week's ExCoGi shoot could be our best ever: we've got a cute 18 year old girl next door with a perfect set of perky little titties, a tight young pussy that gets so wet it drips, and an innocent smile that oozes sexiness and seduction. This girl is a living sex doll and not only does she know it, she revels in it. For once Jay could actually be out of his league! As soon as you see Shane's mischievous smile you'll understand why Jay can't keep his hands off of her and why there's so much Behind The Scenes this week. Her 18 year old tits are cute and perky and she can hardly keep her hands away from them as she's getting fucked. Her sun kissed skin is nearly flawless and begging to be felt up. Usually when you comment on a girl's smile you are doing it as an excuse. Like hey, she's a chub but she's got a great smile (we're looking at you Adele) but in Shane's case it's just one more adorable thing about her, she's always grinning that sexy grin of hers. Before the shoot gets started, Jay tries to get to know Shane a little better. She's a fairly normal 18 year old girl from Flyover County, USA but even as Jay tries to interview her, he's as captivated as you will be and can't help but detour the shoot into a bit of car head and then more BTS head when they get to the location and finally a full on BTS sex scene that is as good as anything in the whole shoot, aside from the lazy lighting. Eventually Shane manages to step away to touch up her make up and the shoot starts, but not before some hilarious bathroom talk as Shane explains what a slut she's proud to be. After the chit chat, Jay starts off fingering her and if you can manage to take your eyes off her pretty O face, you'll notice right away that Shane's pussy is already soaked and it's no surprise when Jay brings her to her first orgasm after just a few minutes. You can really tell Shane is loving every minute of the shoot, she's extremely vocal through it all. After trying every position he can think of and even going for some surprise anal (surprise, he fails), Jay finally decides he can't hold back and unleashes a load across her face that she tries to catch in her mouth. She fails, but it's the thought that counts and what she doesn't get drips down her chin and onto her tits and thighs.\r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:914522ae8a2797fae602de7019ce1899a8e7fd75","amp;dn":"ExploitedCollegeGirls+-+Shane+%28Out+Of+His+League%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"914522ae8a2797fae602de7019ce1899a8e7fd75","infoHashBuffer":{"type":"Buffer","data":[145,69,34,174,138,39,151,250,230,2,222,112,25,206,24,153,168,231,253,117]},"announce":[],"urlList":[]}}