{"title":"Uranium stock investing - Interesting reports (Stockinterview, C","uid":3655761,"size":26244268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91ce2a8fd487b2a3dd0b18ed1d84b034eb36368f&amp;dn=Uranium+stock+investing+-+Interesting+reports+%28Stockinterview%2C+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"goodguy","files":1,"time":1175766794,"description":"Investing in the uranium market is hot nowadays. I&amp;#039;ve collected a few &quot;hard to find&quot; reports for you download and read for yourself.\n\n\nName: Investing in the great uranium bull market\nProvider: www.stockinterview.com\nRelease date: Sept 2006\nFile type: pdf\nSize: 9832 kb, 302 pages\n\nReport summary/background:\nThe complete reference guide to uranium mining stock investing. All the important information you need to know about uranium, uranium mining and the nuclear fuel cycle. Find out how to invest in uranium mining stocks to participate in the Great Uranium Bull Market. Find out more about the serious companies developing their uranium properties for production, and those who are exploring in some of the more promising areas. Find out how to choose a uranium stock and how to rate its prospects. Includes a complete uranium mining stocks directory and glossary of specialized terms.\n\n\n******************************************************************************************\nName: 2007 - Uranium equities\nProvider: www.cormark.com (formerly Sprott Securities)\nRelease date: Feb 14, 2007\nFile type: pdf\nSize: 3611 kb, 120 pages\n\nReport summary/background:\nThis report is provided as a supplement to Cormark?s fourth uranium conference. Our attempt is to provide the investor with a general overview of the companies participating and to provide updated valuations for those companies under active coverage.\n\nUnlike our previous three uranium conferences we have expanded our reach to include those companies that we feel have quality assets, management and projects but are not currently covered by Cormark Securities.\n\n******************************************************************************************\n\nName: 2007 - Uranium equities\nProvider: www.rcresearch.com.au\nRelease date: March 2007\nFile type: pdf\nSize: 3986 kb, 34 pages\n\n\nThis report covers exploration and development companies ? most are active in established uranium districts globally, including the Gawler Craton (Olympic Dam uranium mine) and the Frome Embayement (Beverley and Honeymoon) in South Australia, Arnheim (Ranger, Jabiluka) to Westmoreland in northern Australia, the Athabasca Basin in Canada (McClean Lake, McArthur River), the Great Divide Basin in Wyoming, USA and the Damara Orogen, Namibia (Rossing, Langer Heinrich). Stock opportunities exist on a number of fronts: Where to take exposure depends on your risk preference.","torrent":{"xt":"urn:btih:91ce2a8fd487b2a3dd0b18ed1d84b034eb36368f","amp;dn":"Uranium+stock+investing+-+Interesting+reports+%28Stockinterview%2C+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91ce2a8fd487b2a3dd0b18ed1d84b034eb36368f","infoHashBuffer":{"type":"Buffer","data":[145,206,42,143,212,135,178,163,221,11,24,237,29,132,176,52,235,54,54,143]},"announce":[],"urlList":[]}}