{"title":"King Crimson - Lizard (40th Anniversary Series) [CD + DVD-A]","uid":5259609,"size":6209415000,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:91fcbd69d15ced7ab23fb28e3c7705b7b529a23a&amp;dn=King+Crimson+-+Lizard+%2840th+Anniversary+Series%29+%5BCD+%2B+DVD-A%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"tjs001","files":50,"time":1262651163,"description":"CONTENT: FULL IMAGE OF THE CD [WV/LOSSLESS] + DVD-A [DVD9] + SCANS\n* YOU CAN DOWNLOAD ONLY THE CD OR THE DVD-A, JUST CHOOSE THE FOLDER\n* NOT MY RIP\n\nLizard, King Crimson's third studio album &amp; second release of 1970, was, like its predecessor In the Wake of Poseidon, the product of a studio band. It was also the first Crimson album for which Robert Fripp provided all of the music. Remarkably self-contained &amp; sounding somewhat atypical for a King Crimson album - even by the standards of a band that rarely sounded similar from album to album, Lizard is an often overlooked &amp; under-appreciated gem from their early years. Certainly at the time of release, anyone expecting an extension of the soundscapes introduced &amp; explored on the band's earlier two albums was in for a surprise. \n\nLizard featured a lighter, more delicate sound than the earlier albums - an approach perhaps necessitated by an extended instrumental lineup. The expanded range of instruments allowed for intricately interwoven instrumental passages - with Fripp's guitar &amp; Tippett's piano pleasingly to the fore - and this combination, along with the prominence afforded to Mel Collins &amp; the guest players on the album's main title suite, led some to believe that Fripp was guiding Crimson towards the world of jazz &amp; away from rock altogether. But such claims were misguided. Crimson was, as ever, seeking to expand the vocabulary of rock music &amp; Lizard was, in some ways, the band's most ambitious album to date. \n\nAs this lineup never toured, very little of the material was performed live &amp; Lizard remained a product of the studio environment &amp; the musicians who performed on it (amongst other things, Lizard includes a beautiful Jon Anderson cameo). \n\nLizard's standalone nature makes it difficult even to compile in context next to Crimson's other material - with only Bolero featuring on the box sets covering Crimson's extensive history. Lizard remains a fascinating, intriguing album - an album only a band called King Crimson could make - even if it was a very different King Crimson to that which had gone before or would come after. \n\nNow completely remixed from the original multitrack recording tapes by Steven Wilson for 5.1 Surround Sound &amp; featuring a new stereo mix from the same source tapes by Robert Fripp &amp; Steven Wilson, Lizard finally reveals its true beauty. \n\nSteven Wilson - &quot;I've always felt that if presented in the right way, I could make a case for this being the most experimental rock record ever made. It's extraordinary what they're doing on this album. In terms of fusing free-jazz with progressive rock for me there's almost no parallel.&quot; \n\nPersonnel: \n\nRobert Fripp: guitar, mellotron &amp; devices \nMel Collins: saxes &amp; flute \nGordon Haskell: bass &amp; vocals \nAndy McCulloch: drums \nPeter Sinfield: words \nwith Robin Miller: oboe &amp; cor anglais \nMark Charig: cornet \nNick Evans: trombone \nKeith Tippett: Piano \nJon Anderson: vocal \n\nPlease note, all the King Crimson DVD-As are Region 0 NTSC and should play on all players worldwide.\n\nTracks\nCD: \n1. Cirkus \n2. Indoor Games \n3. Happy Family \n4. Lady of the Dancing Water \n5. Lizard \n\nBonus tracks: \n6. Lady of the Dancing Water (alt. Mix) \n7. Bolero (Frame by Frame remix) \n8. Cirkus (studio run through) \n\nDVD-A: \n\nLizard - Album DVD-A Lossless Surround Sound, DTS 5.1 Surround Sound \n\nLizard - Album original mix - High Resolution Stereo \n\nLizard - Album new mix - High Resolution Stereo \n\n3 Bonus tracks in \nHigh Resolution Stereo.","torrent":{"xt":"urn:btih:91fcbd69d15ced7ab23fb28e3c7705b7b529a23a","amp;dn":"King+Crimson+-+Lizard+%2840th+Anniversary+Series%29+%5BCD+%2B+DVD-A%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91fcbd69d15ced7ab23fb28e3c7705b7b529a23a","infoHashBuffer":{"type":"Buffer","data":[145,252,189,105,209,92,237,122,178,63,178,142,60,119,5,183,181,41,162,58]},"announce":[],"urlList":[]}}