{"title":"Bigger Than the Game - Restitching a Major League Life [EPUB]","uid":9879886,"size":416931,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:924f0923c42ed6ae7aa08903dc49c02f41549f64&amp;dn=Bigger+Than+the+Game+-+Restitching+a+Major+League+Life+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AtomTPB","files":1,"time":1396530555,"description":"Pages: 320 pages\nPublisher: Citadel (February 25, 2014)\nLanguage: English\nISBN-10: 0806534877\nISBN-13: 978-0806534879\n\n\n\n\nOld demons together with new enemies and a season ending-- possibly career ending-- injury look to knock Hayhurst out of baseball forever. \n\nIsolated from his family, broken, and branded a traitor by his teammates for writing inside the locker room, Hayhurst finds himself at a crossroads: should he continue down the spiral of depression and prescription drug abuse he's falling into, or seek psychological help at the risk of being labeled a &quot;head case&quot; by an industry biased against that which it cannot quantify?\n\nOr maybe Hayhurst just needs to show them all how much fun being a head case can be? In a crazy world of injured athletes, autograph-seeking nuns, angry wrestlers, and trainers with a taste for torture, Hayhurst learned lessons about the game--and himself--that were not in any rulebook. \n\nLike all of Hayhurst's writing on baseball, Bigger Than The Game tells a story about what lies beneath the often gilded uniform of the professional player in the honest, often hilarious, and self effacing way Hayhurst has become so renown for--even while exploring often shunned topics like the rampancy of prescription drug abuse among major league athletes, the stigma of depression among athletes, and the damning consequences of violating the codes of the locker room. \n\nBigger Than The Game is Hayhurst's most compelling book to date and is a must read for those who truly wish to know what their favorite player goes through when they break.","torrent":{"xt":"urn:btih:924f0923c42ed6ae7aa08903dc49c02f41549f64","amp;dn":"Bigger+Than+the+Game+-+Restitching+a+Major+League+Life+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"924f0923c42ed6ae7aa08903dc49c02f41549f64","infoHashBuffer":{"type":"Buffer","data":[146,79,9,35,196,46,214,174,122,160,137,3,220,73,192,47,65,84,159,100]},"announce":[],"urlList":[]}}