{"title":"Smuggler Nation - How Illicit Trade Made America (Epub, Mobi) Go","uid":9664602,"size":5773992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92d423210131027542088311d651aacae5ee69a6&amp;dn=Smuggler+Nation+-+How+Illicit+Trade+Made+America+%28Epub%2C+Mobi%29+Go&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1393354098,"description":"Smuggler Nation: How Illicit Trade Made America by Peter Andreas\n\n\nFormat: mobi/epub\nGenre: History/United States\nPrint Length: 472 pages\nRelease Date: 14 February 2013\n\nAmerica is a smuggler nation. Our long history of illicit imports has ranged from West Indies molasses and Dutch gunpowder in the 18th century, to British industrial technologies and African slaves in the 19th century, to French condoms and Canadian booze in the early 20th century, to Mexican workers and Colombian cocaine in the modern era. Contraband capitalism, it turns out, has been an integral part of American capitalism.\n\nAs Peter Andreas demonstrates in this provocative and fascinating account, smuggling has played a pivotal and too often overlooked role in America's birth, westward expansion, and economic development, while anti-smuggling campaigns have dramatically enhanced the federal government's policing powers. The great irony, Andreas tells us, is that a country that was born and grew up through smuggling is today the world's leading anti-smuggling crusader.\n\nIn tracing America's long and often tortuous relationship with the murky underworld of smuggling, Andreas provides a much-needed antidote to today's hyperbolic depictions of out-of-control borders and growing global crime threats. \n\nFar from being a new and unprecedented danger to America, the illicit underside of globalization is actually an old American tradition. As Andreas shows, it goes back not just decades but centuries. And its impact has been decidedly double-edged, not only subverting U.S. laws but also helping to fuel America's evolution from a remote British colony to the world's pre-eminent superpower.\n\nAuthor:\n\nPeter Andreas is a professor in the Department of Political Science and the Watson Institute for International Studies at Brown University. He was previously an Academy Scholar at Harvard University, a Research Fellow at the Brookings Institution, and an SSRC-MacArthur Foundation Fellow on International Peace and Security. Andreas has written numerous books, published widely in scholarly journals and policy magazines, presented Congressional testimony, written op-eds for major newspapers, and provided frequent media commentary.","torrent":{"xt":"urn:btih:92d423210131027542088311d651aacae5ee69a6","amp;dn":"Smuggler+Nation+-+How+Illicit+Trade+Made+America+%28Epub%2C+Mobi%29+Go","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92d423210131027542088311d651aacae5ee69a6","infoHashBuffer":{"type":"Buffer","data":[146,212,35,33,1,49,2,117,66,8,131,17,214,81,170,202,229,238,105,166]},"announce":[],"urlList":[]}}