{"title":"So you want to be a journalist?","uid":4648775,"size":2372093,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92e5b0aa24c606d552836bcbeed68d3d2eed432b&amp;dn=So+you+want+to+be+a+journalist%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Megan00","files":2,"time":1231972111,"description":"This book is a practical, hands-on guide to the world of journalism, particularly for the beginner. It contains step-by-step instructions on writing for the news media, and practical advice and suggestions on all facets of reporting. It covers the basic skills involved in finding information, interviewing, writing news and feature material, research and investigation, basic subbing, layout and design, the essentials of grammar, the law, and ethical and professional behaviour. The book uses numerous examples to demonstrate its points. It relies almost exclusively on the excellent work of student reporters to show what young people can achieve, despite not having the resources of large news organisations behind them. The book also highlights the efforts of some of the hundreds of students who have worked with the author over many years to produce fine examples of writing and reporting in the very best traditions of journalism. \n\nBook Description\nThis book is a practical, hands-on guide to the world of journalism, particularly for the beginner. It contains step-by-step instructions on writing for the news media, and practical advice and suggestions on all facets of reporting. It relies almost exclusively on the excellent work of student reporters to demonstrate points. \n\n See all Editorial Reviews \n\n--------------------------------------------------------------------------------\nProduct Details\nPaperback: 368 pages \nPublisher: Cambridge University Press; 1 edition (October 29, 2007) \nLanguage: English ","torrent":{"xt":"urn:btih:92e5b0aa24c606d552836bcbeed68d3d2eed432b","amp;dn":"So+you+want+to+be+a+journalist%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92e5b0aa24c606d552836bcbeed68d3d2eed432b","infoHashBuffer":{"type":"Buffer","data":[146,229,176,170,36,198,6,213,82,131,107,203,238,214,141,61,46,237,67,43]},"announce":[],"urlList":[]}}