{"title":"[FemaleAgent] Barra Brass, Rassy (Horny blonde MILF finishes cas","uid":11814988,"size":781724080,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:938c9b3e538869c446ed4aa70a3e7c16e6d15a34&amp;dn=%5BFemaleAgent%5D+Barra+Brass%2C+Rassy+%28Horny+blonde+MILF+finishes+cas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"chkm8te","files":1,"time":1429050734,"description":"[FemaleAgent] Barra Brass, Rassy (Horny blonde MILF finishes casting with a mouthful of cum / f1297 / 04.14.2015)\n\nRassy (35 mins). I love men who work out and Rassy had the body of a man who liked to take care of himself. He was sculpted from hours in the gym and it showed. I couldn't wait to get this man inside me. He currently worked as a construction worker and wanted to get back into modelling as he had done a few shoots when he was a young man of 18. When I explained that he could earn his entire months current wage for just one day of shooting adult erotica his eyes lit up. I had him hooked, now I just had to reel him in. I asked if he thought he could do it and he replied that he didn't know, so I offered him to the chance to do a camera test with me. Even the fact he had a girlfriend did not stop this stud replying with an instant yes and the casting was on. We moved to the couch and I drew his beautiful cock out of his pants and into my mouth. After some foreplay where he showed his finger fucking skills, I noticed he had gone soft. I thought we would have some issues then but with some careful coaxing from me he was soon rock hard and ready to fuck. I jumped on his cock in cowgirl and reverse and his length filled me up beautifully. He certainly had the stamina and sent waves of pleasure as he drove his cock in and out of me. I love being fucked from behind and when he started powering into me I the doggy position my body convulsed with pleasure as my orgasm hit me. I wanted to see his cumshot now but I wanted it all inside my mouth. I sucked his cock and stroked his balls until he shot his load deep inside my sticky mouth. I dribbled it out over his cock and sent him off to the shower. What a beautiful start to a beautiful day.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=66bgxwj7ldh9u8onbm2q.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=66bgxwj7ldh9u8onbm2q.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=atae3kxzkohizdujscj7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=atae3kxzkohizdujscj7.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:938c9b3e538869c446ed4aa70a3e7c16e6d15a34","amp;dn":"%5BFemaleAgent%5D+Barra+Brass%2C+Rassy+%28Horny+blonde+MILF+finishes+cas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"938c9b3e538869c446ed4aa70a3e7c16e6d15a34","infoHashBuffer":{"type":"Buffer","data":[147,140,155,62,83,136,105,196,70,237,74,167,10,62,124,22,230,209,90,52]},"announce":[],"urlList":[]}}