{"title":"Muddy Waters &quot;Live&quot; at Mister Kelly's - 1971 - MP3 @ 3","uid":8500803,"size":104049988,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9482299242a1354248cfa35c807a872fa1bebf1c&amp;dn=Muddy+Waters+%26quot%3BLive%26quot%3B+at+Mister+Kelly%27s+-+1971+-+MP3+%40+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GK2nist","files":10,"time":1369290671,"description":"Hey Folks,\n\nThis is a vinyl extract of the great LP &quot;Muddy Waters 'Live' at Mister Kelly's recorded in 1971. \n\nThe extract has been made with Audacity and is in MP3@320. You may hear some noises in the recording due to the age of the original vinyl.\n\nIf you like it, please seed it.\n\n\nAbout the album :\n\nMuddy Water Live (At Mr. Kelly's) shows precisely how fortuitous Muddy Waters' history with Chess Records was -- with the notable exception of Bo Diddley's Beach Party, the company tended to record its top artists in concert very late or, more often, not at all; Howlin' Wolf got one concert album in so late in his career that he was merely a shadow of the legend he'd established for himself; and the label's resident blues harp virtuosi Little Walter and Sonny Boy Williamson II were never captured in concert. Muddy was luckier -- this album, recorded during two June 1971 gigs at one of Chicago's top clubs, was the third full-length concert release of his career; and he had a decade of life and music still in front of him and remained very much the embodiment of his own legend. The core of the band that would work with him for the rest of the 1970s was already with him, and the man himself was in excellent form -- in voice and on slide guitar -- aided by Sammy Lawhorn and Pee Wee Madison. There might not be the same sense here of a career-second-wind-in-progress that there was with his later live album for Johnny Winter's Blue Sky label -- the performance is powerful and confident, more than bold and celebratory -- but on &quot;Strange Woman,&quot; &quot;Blow Wind Blow,&quot; and &quot;Country Boy,&quot; for example, the effect of hearing a master of the blues virtuoso band in action is overpowering. His takes on Williamson's &quot;Nine Below Zero,&quot; T-Bone Walker's &quot;Stormy Monday Blues,&quot; John Lee Hooker's &quot;Boom, Boom,&quot; and Jimmy Reed's &quot;You Don't Have To Go,&quot; all reconfigured to Muddy's own style, are also worth hearing. There might have been more flash on the later Winter-produced sides, but this disc is not to be ignored, and not just by Chess completists -- it's a hell of a lot more essential than Electric Mud, and heralds the superb Indian summer of Muddy's history at Chess, during which he recorded Can't Get No Grindin' and The Woodstock Album. \n\nSource : http://www.allmusic.com/album/muddy-waters-live-at-mr-kellys-mw0000089700","torrent":{"xt":"urn:btih:9482299242a1354248cfa35c807a872fa1bebf1c","amp;dn":"Muddy+Waters+%26quot%3BLive%26quot%3B+at+Mister+Kelly%27s+-+1971+-+MP3+%40+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9482299242a1354248cfa35c807a872fa1bebf1c","infoHashBuffer":{"type":"Buffer","data":[148,130,41,146,66,161,53,66,72,207,163,92,128,122,135,47,161,190,191,28]},"announce":[],"urlList":[]}}