{"title":"Fall of Giants (The Century Trilogy) - Ken Follett.pdf","uid":5905739,"size":3765854,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94b00303e1f3dfce6966fd75f160c0371e4d9445&amp;dn=Fall+of+Giants+%28The+Century+Trilogy%29+-+Ken+Follett.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Be_Intrepid","files":-1,"time":1287857322,"description":"Ken Follett's World Without End was a global phenomenon, a work of grand historical sweep, beloved by millions of readers and acclaimed by critics. Fall of Giants is his magnificent new historical epic. The first novel in The Century Trilogy, it follows the fates of five interrelated families-American, German, Russian, English, and Welsh-as they move through the world-shaking dramas of the First World War, the Russian Revolution, and the struggle for women's suffrage. \n\nThirteen-year-old Billy Williams enters a man's world in the Welsh mining pits...Gus Dewar, an American law student rejected in love, finds a surprising new career in Woodrow Wilson's White House...two orphaned Russian brothers, Grigori and Lev Peshkov, embark on radically different paths half a world apart when their plan to emigrate to America falls afoul of war, conscription, and revolution...Billy's sister, Ethel, a housekeeper for the aristocratic Fitzherberts, takes a fateful step above her station, while Lady Maud Fitzherbert herself crosses deep into forbidden territory when she falls in love with Walter von Ulrich, a spy at the German embassy in London... \n\nThese characters and many others find their lives inextricably entangled as, in a saga of unfolding drama and intriguing complexity, Fall of Giants moves seamlessly from Washington to St. Petersburg, from the dirt and danger of a coal mine to the glittering chandeliers of a palace, from the corridors of power to the bedrooms of the mighty. As always with Ken Follett, the historical background is brilliantly researched and rendered, the action fast-moving, the characters rich in nuance and emotion. It is destined to be a new classic. \n\nIn future volumes of The Century Trilogy, subsequent generations of the same families will travel through the great events of the rest of the twentieth century, changing themselves-and the century itself. With passion and the hand of a master, Follett brings us into a world we thought we knew, but now will never seem the same again.","torrent":{"xt":"urn:btih:94b00303e1f3dfce6966fd75f160c0371e4d9445","amp;dn":"Fall+of+Giants+%28The+Century+Trilogy%29+-+Ken+Follett.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94b00303e1f3dfce6966fd75f160c0371e4d9445","infoHashBuffer":{"type":"Buffer","data":[148,176,3,3,225,243,223,206,105,102,253,117,241,96,192,55,30,77,148,69]},"announce":[],"urlList":[]}}