{"title":"Intravitreal Injections [PDF] [StormRG]","uid":10564165,"size":45603920,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:957724d931050f4a780720f0fe1fccf850064570&amp;dn=Intravitreal+Injections+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0xmovva","files":-1,"time":1405496992,"description":"Author: Salman Waqar, Jonathan C Park, Michael D Cole\nPaperback: 110 pages\nPublisher: World Scientific Publishing Company; 1 edition (May 7, 2014)\nLanguage: English\nISBN-10: 9814571458\nISBN-13: 978-9814571456\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nIntravitreal injections (injections into the eye) are a new form of treatment for various conditions such as age-related macular degeneration, diabetic eye disease and vascular eye problems. The use of these injections has become so widespread that most departments around the world (and particularly in the U.K) do not have enough doctors to meet the service provision demands of an ever increasing number of patients. Many departments have trialed training ophthalmic nurse practitioners as a solution and the number of such specifically trained nurses is set to rise exponentially in the future. This book is meant to be an easy to carry A5 handbook detailing all that an ophthalmic nurse practitioner needs to know about performing the procedure. It is hoped that the book will also be of benefit to trainee ophthalmologists learning the procedure.\nAs this is an emerging area of expertise in ophthalmology, currently there exists no other books on the topic. The readers will benefit from having a single resource detailing all that they need to know about the procedure. This means that nurses will not have to cross reference multiple complicated ophthalmic textbooks. As an A5 handbook, it will be easy to carry and reference in clinics. It is deliberately meant to be concise (around 100 pages), thus concentrating only on the core knowledge required.","torrent":{"xt":"urn:btih:957724d931050f4a780720f0fe1fccf850064570","amp;dn":"Intravitreal+Injections+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"957724d931050f4a780720f0fe1fccf850064570","infoHashBuffer":{"type":"Buffer","data":[149,119,36,217,49,5,15,74,120,7,32,240,254,31,204,248,80,6,69,112]},"announce":[],"urlList":[]}}