{"title":"Andre Gide - Corydon (pdf)","uid":8650582,"size":1727595,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95d8aa9d9b6b5ef1d39537ff46163f02b4198cdc&amp;dn=Andre+Gide+-+Corydon+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373087207,"description":"Andre Gide - Corydon (Farrar, Straus and Co., 1950). 220 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. \n\n\nA classic of &quot;gay apologetics&quot; by the great French novelist.\n\ndescription:\n\nConsidered by Gide to be the most important of his books, this slim, exquisitely crafted volume consists of four dialogues on the subject of homosexuality and its place in society. \n\nPublished anonymously in bits and pieces between 1911 and 1920, Corydon first appeared in a signed, commercial edition in France in 1924 and in the United States in 1950, the year before Gide's death. The present edition features the impeccable translation of the Pulitzer Prize-winning poet Richard Howard. \n\nIn spirited dialogue with his bigoted, boorish interviewer, Corydon marshals evidence from naturalists, historians, poets, and philosophers to support his contention that homosexuality pervaded the most culturally and artistically advanced civilizations, from Greece in the age of Pericles to Renaissance Italy and England in the age of Shakespeare. Although obscured by later critics, literature and art from Homer to Titian proclaim the true nature of relationships between such lovers as Achilles and Patrocles--not to mention Virgil's mythical Corydon and his shepherd, Alexis. The evidence, Corydon suggests, points to heterosexuality as a socially constructed union, while the more fundamental, natural relation is the homosexual one. \n\n&quot;My friends insist that this little book is of the kind which will do me the greatest harm,&quot; Gide wrote of his Corydon. In these pages, contemporary readers will find a prescient and courageous treatment of a topic that has scarcely become less controversial.","torrent":{"xt":"urn:btih:95d8aa9d9b6b5ef1d39537ff46163f02b4198cdc","amp;dn":"Andre+Gide+-+Corydon+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95d8aa9d9b6b5ef1d39537ff46163f02b4198cdc","infoHashBuffer":{"type":"Buffer","data":[149,216,170,157,155,107,94,241,211,149,55,255,70,22,63,2,180,25,140,220]},"announce":[],"urlList":[]}}