{"title":"Glenn Beck - The Christmas Sweater (Audiobook)","uid":4503136,"size":104185085,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9612940f73637b4d0e62d8ab71c723b2a61837c4&amp;dn=Glenn+Beck+-+The+Christmas+Sweater+%28Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pbp69","files":29,"time":1226482042,"description":"#1 New York Times bestselling author and renowned radio and television host Glenn Beck delivers an instant holiday classic about boyhood memories, wrenching life lessons, and the true meaning of the gifts we give to one another in love.\n\nWe weren't wealthy, we weren't poor -- we just were. We never wanted for anything, except maybe more time together....\n\nWhen Eddie was twelve years old, all he wanted for Christmas was a bike. Although his life had gotten harder -- and money tighter -- since his father died and the family bakery closed...Eddie dreamed that somehow his mother would find a way to have his dream bike gleaming beside their modest Christmas tree that magical morning.\n\nWhat he got from her instead was a sweater. &quot;A stupid, handmade, ugly sweater&quot; that young Eddie left in a crumpled ball in the corner of his room.\n\nScarred deeply by the realization that kids don't always get what they want, and too young to understand that he already owned life's most valuable treasures, that Christmas morning was the beginning of Eddie's dark and painful journey on the road to manhood. It will take wrestling with himself, his faith, and his family -- and the guidance of a mysterious neighbor named Russell -- to help Eddie find his path through the storm clouds of life and finally see the real significance of that simple gift his mother had crafted by hand with love in her heart.\n\nBased on a deeply personal true story, The Christmas Sweater is a warm and poignant tale of family, faith and forgiveness that offers us a glimpse of our own lives -- while also making us question if we really know what's most important in them.     -Amazon.com\n\n\n\n\n\n\n\n\n\n\np.s. this is the first torrent i have ever made, so please be gentle ;)","torrent":{"xt":"urn:btih:9612940f73637b4d0e62d8ab71c723b2a61837c4","amp;dn":"Glenn+Beck+-+The+Christmas+Sweater+%28Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9612940f73637b4d0e62d8ab71c723b2a61837c4","infoHashBuffer":{"type":"Buffer","data":[150,18,148,15,115,99,123,77,14,98,216,171,113,199,35,178,166,24,55,196]},"announce":[],"urlList":[]}}