{"title":"JavaScript For Kids For Dummies - Chris Minnick","uid":12781403,"size":12426273,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96482c14283f505dbc3f4919734a9a6fe7533362&amp;dn=JavaScript+For+Kids+For+Dummies+-+Chris+Minnick&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1447792094,"description":"Have big dreams? Kick start them with JavaScript!\r\n\r\nIf we've learned one thing from the Millennial generation, it's that no one is too young to make history online. JavaScript For Kids For Dummies introduces pre-teens and early teens alike to the world of JavaScript, which is an integral programming language that drives the functionality of websites and apps. This informative, yet engaging text guides you through the basics of coding with JavaScript, and is an essential resource if you want to expand your technology skills while following easy, step-by-step instructions. Through small, goal-oriented projects, you learn key coding concepts, while actually creating apps, games, and more. This hands-on experience, coupled with the presentation of ideas in a simple style, allows you to both learn and retain JavaScript fundamentals.\r\n\r\nJavaScript has been heralded as 'the programming language of the web,' and many kids are interested in learning how to use it; however, most schools don't offer coding classes at this level, and most families can't afford the high cost of coding classes through a summer camp. But this can't stop you from developing your JavaScript coding skills! This fun text is all you need to get started on your JavaScript journey.\r\n\r\nExplore the basics of JavaScript through the creation of a calculator app\r\nDeepen your understanding of HTML, arrays, and variables by building a grocery shopping app\r\nLearn conditional logic through the development of a choose your own adventure game\r\nDiscover loops and strings by creating a lemonade stand app and MadLibs-style game\r\n \r\nJavaScript For Kids For Dummies brings pre-teens and early teens into the world of coding by teaching them one of the key Web design languages","torrent":{"xt":"urn:btih:96482c14283f505dbc3f4919734a9a6fe7533362","amp;dn":"JavaScript+For+Kids+For+Dummies+-+Chris+Minnick","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96482c14283f505dbc3f4919734a9a6fe7533362","infoHashBuffer":{"type":"Buffer","data":[150,72,44,20,40,63,80,93,188,63,73,25,115,74,154,111,231,83,51,98]},"announce":[],"urlList":[]}}