{"title":"Carl Zimmer - Parasite Rex","uid":4809548,"size":647515,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:969b4dffbfad624c21b67e19b65f5d1145470366&amp;dn=Carl+Zimmer+-+Parasite+Rex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"iornix","files":-1,"time":1238287154,"description":"IMAGINE A WORLD WHERE parasites control the minds of their hosts, sending them to their destruction.\n\nIMAGINE A WORLD WHERE parasites are masters of chemical warfare and camouflage, able to cloak themselves with their hosts' own molecules.\n\nIMAGINE A WORLD WHERE parasites steer the course of evolution, where the majority of species are parasites.\n\nWELCOME TO EARTH.\n\nFor centuries, parasites have lived in nightmares, horror stories, and in the darkest shadows of science. Yet these creatures are among the world's most successful and sophisticated organisms. In Parasite Rex, Carl Zimmer deftly balances the scientific and the disgusting as he takes readers on a fantastic voyage. Traveling from the steamy jungles of Costa Rica to the fetid parasite haven of southern Sudan, Zimmer graphically brings to life how parasites can change DNA, rewire the brain, make men more distrustful and women more outgoing, and turn hosts into the living dead.\n\nThis thorough, gracefully written book brings parasites out into the open and uncovers what they can teach us about the most fundamental survival tactics in the universe.\n\nParasite rex: inside the bizarre world of nature's most dangerous creatures\nBy Carl Zimmer\nEdition: illustrated\nPublished by Simon &amp; Schuster, 2000\nISBN 074320011X, 9780743200110\n298 pages\n\nAmazon.com Review\nMany books provoke a visceral reaction, but few really make you itch. Science writer Carl Zimmer's Parasite Rex does just that, provoking a deliciously creepy sense of paranoia in the reader as it explores a long-misunderstood realm of science. While entomologists love to announce that there are more species of insects than all other animals combined, few parasitologists choose to trump that by reminding us that &quot;parasites may outnumber free-living species four to one.&quot; That figure is based on the multicellular chauvinism of the 19th century, which excludes bacteria and fungi from consideration (athlete's foot, anyone?), but Zimmer looks at the E. coli in our guts as well as the worms, flukes, mites, and other critters that earn a healthy living at our expense--and the expense of our domesticated plants and animals.\n\nThe author traveled to Africa to see firsthand the effects of sleeping sickness and river blindness. He learned from physicians and researchers that the parasites that wreak so much havoc are much more than the simple degenerates we've taken them for. Their complex adaptations to their environments--us--are as lovely and awe-inspiring as any eye or wing. The examples of hormonal and other behavioral control of hosts, causing changes in feeding habits and other life essentials, are chilling when personalized. Zimmer knows his subject well, and his writing, while robust and affecting, never descends to the all-too-easy gross-out. You wouldn't expect to find respect for a tapeworm, but Parasite Rex will show you how beautiful Earth's truly dominant life forms are. --Rob Lightner\n\nFrom Publishers Weekly\nOne of the year's most fascinating works of popular science is also its most disgusting. From tapeworms to isopods to ichneumon wasps, &quot;parasites are complex, highly adapted creatures that are at the heart of the story of life.&quot; Zimmer (At the Water's Edge) devotes his second book to the enormous variety of one- and many-celled organisms that live on and inside other animals and plants. The gruesome trypanosomes that cause sleeping sickness had nearly been routed from Sudan when the country's civil war began: now they're back. Costa Rican researcher Daniel Brooks has discovered dozens of parasites, including flies that lay eggs in deer noses: &quot;snot bots.&quot; And those are only the creatures from the prologue. Zimmer discusses how the study of parasites began, with 19th-century discoveries about their odd life cycles. (Many take on several forms in several generations, so that a mother worm may resemble her granddaughter, but not her daughter.) He looks at how parasites pass from host to host, and how they defeat immune systems and vice versa. Many parasites alter their hosts' behavior: Toxoplasma makes infected rats fearless, thus more likely to be eaten by cats, who will then pick up the microbe. Quantifiable &quot;laws of virulence&quot; lead parasites to become nasty enough to spread, yet not so nasty as to wipe out all their hosts. And eons of coevolution can affect both partners: howler monkeys may avoid violent fights because screwworms can render the least scratch fatal. Two final chapters address parasites in human medicine and agriculture. Not only are parasites not all bad, Zimmer concludes in this exemplary work of popular science, but we may be parasites, tooDand we have a lot to learn from them about how to manage earth, the host we share. Illus. (Sept.)","torrent":{"xt":"urn:btih:969b4dffbfad624c21b67e19b65f5d1145470366","amp;dn":"Carl+Zimmer+-+Parasite+Rex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"969b4dffbfad624c21b67e19b65f5d1145470366","infoHashBuffer":{"type":"Buffer","data":[150,155,77,255,191,173,98,76,33,182,126,25,182,95,93,17,69,71,3,102]},"announce":[],"urlList":[]}}