{"title":"Antony and The Johnsons - The crying light [mp3-320-2009]","uid":4599369,"size":94810978,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:96b2bbc0c4d6b5d61fcab8e77fb143faf7c3c7cd&amp;dn=Antony+and+The+Johnsons+-+The+crying+light+%5Bmp3-320-2009%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"trfkad","files":-1,"time":1230134014,"description":"1. Her Eyes Are Underneath The Ground\n2. Epilepsy Is Dancing\n3. One Dove\n4. Kiss My Name\n5. The Crying Light\n6. Another World\n7. Daylight And The Sun\n8. Aeon\n9. Dust And Water\n10. Everglade \n\n\nTitle: The Crying Light\nArtist: Antony and the Johnsons\nStore Date: 20 jan 2009\nUpload Date: 24 dec 2008\nLabel: Secretly Canadian\nGenre: Rock\nCover: front\nBitrate: 320 kb/s, joint stereo\n\n\nThe Crying Light is the highly anticipated full-length follow-up to I Am a Bird Now. Here, Antony shifts the thematic focus and explores his relationship with the elemental and natural world, and the intimacy of the Johnsons' sound is enveloped by subtle symphonic arrangements. The first moments of Her Eyes Are Underneath the Ground set the stage, conjuring an animist world with enigmatic lyrics, painterly clarinet lines, and a lilting piano that cradles the listener over a menacing quarry of strings. The spiraling waltz of &quot;Epilepsy Is Dancing&quot; and the joyful ricochets of Kiss My Name are to follow. The record's centerpiece, Another World traces despair in the face of a vanishing landscape. The hypnotic vocal on &quot;Dust and Water&quot; unfurls like smoke, and the track Everglade, co-arranged with Nico Muhly, concludes the album. Here Antony realizes that his ...Limbs (have) stopped Crying for Home... and falls into a musical reverie that seems inspired in its sense of pastoral abandon by the legendary Butoh dancer Kazuo Ohno, whose eerie portrait graces the cover of The Crying Light . Antony and the Johnsons' music bridges the gap between avant-classical music and the blues, and Antony and his band have sold out performances from Carnegie Hall to the Apollo. The Crying Light may become one of those albums that becomes emblematic of its time, a reflection of the momentous changes that we are facing, within each of our private worlds as well as collectively, and how we are summoning the courage to start moving through them.\n","torrent":{"xt":"urn:btih:96b2bbc0c4d6b5d61fcab8e77fb143faf7c3c7cd","amp;dn":"Antony+and+The+Johnsons+-+The+crying+light+%5Bmp3-320-2009%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96b2bbc0c4d6b5d61fcab8e77fb143faf7c3c7cd","infoHashBuffer":{"type":"Buffer","data":[150,178,187,192,196,214,181,214,31,202,184,231,127,177,67,250,247,195,199,205]},"announce":[],"urlList":[]}}