{"title":"Dolly Parton - The Encore Collection (1997) MP3 320","uid":6327371,"size":84542155,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9728fd8b344314b106e6c001bb8d423074bcb7c8&amp;dn=Dolly+Parton+-+The+Encore+Collection+%281997%29+MP3+320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1303155918,"description":"Dolly Parton\nThe Encore Collection (1997)\n\n\nIt's difficult to find a country performer who has moved from country roots to international fame more successfully than Dolly Parton. Her autobiographical single &quot;Coat of Many Colors&quot; shows the poverty of growing up one of 12 children on a run-down farm in Locust Ridge, TN. At 12 years old she was appearing on Knoxville television; at 13 she was recording on a small label and appearing on the Grand Ole Opry. Her 1967 hit &quot;Dumb Blonde&quot; (which she's not) caught Porter Wagoner's ear, and he hired Parton to appear on his television show, where their duet numbers became famous. By the time her &quot;Joshua&quot; reached number one in 1970, Parton's fame had overshadowed the boss', and she had struck out on her own, though still recording duets with him. During the mid-'70s, she established herself as a country superstar, crossing over into the pop mainstream in the early '80s, when she smoothed out the rough edges in her music and began singing pop as well as country. In the early '80s, she also began appearing in movies, most notably the hit 9 to 5. Though her savvy marketing, image manipulation -- her big, dumb blond stage persona is an act -- extracurricular forays into film, and her flirtations with country-pop have occasionally overshadowed her music, at her core Parton is a country gal and a tremendously gifted singer/songwriter. Among her classics are &quot;Coat of Many Colors,&quot; &quot;Jolene,&quot; &quot;Kentucky Gambler,&quot; &quot;I Will Always Love You,&quot; &quot;But You Know I Love You,&quot; and &quot;Tennessee Homesick Blues,&quot; and they give a hint to why her contribution to bringing country music to a wide audience, not only in America but throughout the world, cannot be underestimated. \n\n\nFormat:\t\t\tMp3\nBit Rate:\t\t320 kbps\nContains:\t\tAlbum Art &amp; ID Tags\nM3U Playlist:\t\tYes\nGenre:\t\t\tCountry\n\n\nTrack List:\n\n\n01.Starting All Over Again\n02.Single Women\n03.It's All Wrong, But It's All Right\n04.Working Girl\n05.But You Know I Love You\n06.Old Flames (Can't Hold A Candle To You)\n07.Baby I'm Burnin'\n08.God Won't Get You\n09.The House Of The Rising Sun\n10.Potential New Boyfriend\n\n\n\n\n\n\n\n\n\n\n              ****Support the artists &amp; buy it if you like it.****\n\n                  ****Enjoy &amp; please don't forget to seed!****\n\n\n\n\n","torrent":{"xt":"urn:btih:9728fd8b344314b106e6c001bb8d423074bcb7c8","amp;dn":"Dolly+Parton+-+The+Encore+Collection+%281997%29+MP3+320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9728fd8b344314b106e6c001bb8d423074bcb7c8","infoHashBuffer":{"type":"Buffer","data":[151,40,253,139,52,67,20,177,6,230,192,1,187,141,66,48,116,188,183,200]},"announce":[],"urlList":[]}}