{"title":"Greg Lastowka - Virtual Justice. The New Laws of Online Worlds [","uid":10413394,"size":5805387,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:976eadf34ed6a83d45ed9e5c5b1adc13b2bde1c4&amp;dn=Greg+Lastowka+-+Virtual+Justice.+The+New+Laws+of+Online+Worlds+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403565537,"description":"Description\nProduct Details\nBook Title: Virtual Justice: The New Laws of Online Worlds\nBook Author: Greg Lastowka\nPaperback: 240 pages\nPublisher: Yale University Press (November 22, 2011)\nLanguage: English\nISBN-10: 0300177747\nISBN-13: 978-0300177749\n\n===================================================================================\nBook Description\nPublication Date: November 22, 2011 | ISBN-10: 0300177747 | ISBN-13: 978-0300177749\nTens of millions of people today are living part of their life in a virtual world. In places like World of Warcraft, Second Life, and Free Realms, people are making friends, building communities, creating art, and making real money. Business is booming on the virtual frontier, as billions of dollars are paid in exchange for pixels on screens. But sometimes things go wrong. Virtual criminals defraud online communities in pursuit of real-world profits. People feel cheated when their avatars lose virtual property to wrongdoers. Increasingly, they turn to legal systems for solutions. But when your avatar has been robbed, what law is there to assist you? In &quot;Virtual Justice&quot;, Greg Lastowka illustrates the real legal dilemmas posed by virtual worlds. Presenting the most recent lawsuits and controversies, he explains how governments are responding to the chaos on the cyberspace frontier. After an engaging overview of the history and business models of today's virtual worlds, he explores how laws of property, jurisdiction, crime, and copyright are being adapted to pave the path of virtual law. Virtual worlds are becoming more important to society with each passing year. This pioneering study will be an invaluable guide to scholars of online communities for years to come.\n\n===================================================================================\nReview\n&quot;For anyone interested in virtual worlds or massively multiplayer online games, this book will be fascinating on so many levels. Appealing, beautifully-written and chock-full of insight, &quot;Virtual Justice&quot; sets out the laws for brand new territories, creating the maps that we need to navigate these remarkable places. Of value to everyone--lawyers, laypeople, regulators, thinkers--Lastowka gives us the definitive account of the laws of the virtual worlds.&quot;--Dan Hunter, Professor of Law &amp; Director, Institute for Information Law &amp; Policy, New York Law School and Co-founder of Terra Nova blog\n\n===================================================================================\nAbout the Author\nGreg Lastowka is a professor of law at Rutgers University.\n===================================================================================","torrent":{"xt":"urn:btih:976eadf34ed6a83d45ed9e5c5b1adc13b2bde1c4","amp;dn":"Greg+Lastowka+-+Virtual+Justice.+The+New+Laws+of+Online+Worlds+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"976eadf34ed6a83d45ed9e5c5b1adc13b2bde1c4","infoHashBuffer":{"type":"Buffer","data":[151,110,173,243,78,214,168,61,69,237,158,92,91,26,220,19,178,189,225,196]},"announce":[],"urlList":[]}}