{"title":"Dizzy Gillespie  In Redondo(jazz)(avi)[rogercc]","uid":6821220,"size":918805650,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:97972d1186e420fb090fd484a52eb9e76561534a&amp;dn=Dizzy+Gillespie++In+Redondo%28jazz%29%28avi%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":1,"time":1321394069,"description":"DIZZY GILLESPIE IN REDONDO\nRecorded: 1986\nFormat:avi\n\nGary Keys' 1986 film capturing Dizzy Gillespie and band live in Redondo Beach, CA. The trumpeter/bandleader is in great form, leading his crack band through classics from various parts of his career. Filmed in Gary Keys signature style, with lots of closeups of the players, capturing all of the impish comedy and good times of the elder statesman of jazz.\n\nTracklist:\n1. Be Bop [9:15]\n2. Kush [17:33]\n3. Birks Works [10:54]\n4. I'm Hard of Hearing Mama [18:02]\n5. Jazz America [3:49]\n\nJohn Birks &quot;Dizzy&quot; Gillespie, along with Charlie Parker, ushered in the era of Be-Bop in the American jazz tradition. He was born in Cheraw, South Carolina, and was the youngest of nine children. He began playing piano at the age of four and received a music scholarship to the Laurinburg Institute in North Carolina. Most noted for his trademark &quot;swollen cheeks&quot;, Gillespie admitted to copying the style of trumpeter Roy Eldridge early in his career. He replaced Eldridge in the 'Teddy Hill' Band after Eldridge's departure. He eventually began experimenting and creating his own style which would eventually come to the attention of Mario Bauza, the Godfather of Afro-Cuban jazz who was then a member of the Cab Calloway Orchestra. Joining Calloway in 1939, Gillespie was fired after two years when he cut a portion of Calloway's buttocks with a knife after Calloway accused him of throwing spitballs (the two men later became lifelong friends and often retold this story with great relish until both of their deaths). Although noted for his on- and off-stage clowning, Gillespie endured as one of the founding fathers of the Afro-Cuban &amp;/or Latin Jazz tradition. Influenced by Bauza, known as Gillespie's musical father, he was able to fuse Afro-American jazz and Afro-Cuban rhythms to form a burgeoning CuBop sound. Always a musical ambassador, he toured Africa, the Middle East and Latin America under the sponsorship of the US State Department. Quite often he returned, not only with fresh musical ideas, but with musicians who would eventually go on to achieve world renown. Among his proteges and collaborators are 'Chano Pozo', the great Afro-Cuban percussionist; Danilo PÃƒÂ©rez, a master pianist and composer originally from Panama; Arturo Sandoval, trumpeter, composer and music educator originally from Cuba; Mongo SantamarÃƒÂ­a, an Afro-Cuban conguero, bonguero and composer; David Sanchez, saxophonist and composer; Chucho ValdÃƒÂ©s, an Afro-Cuban virtuoso pianist and composer; and Bobby Sanabria, a Bronx, NY-born Nuyorican percussionist, composer, educator, bandleader and expert in the Afro-Cuban musical tradition. Indeed, many Latin jazz classics such as &quot;Manteca&quot;, &quot;A Night in Tunisia&quot; and &quot;Guachi Guaro [Soul Sauce]&quot; were composed by Gillespie and his musical collaborators. With a strong sense of pride in his Afro-American heritage, he left a legacy of musical excellence that embraced and fused all musical forms, but particularly those forms with roots deep in Africa such as the music of Cuba, other Latin American countries and the Caribbean. Additionally, he left a legacy of goodwill and good humor that infused jazz musicians and fans throughout the world with a genuine sense of jazz's ability to transcend national and ethnic boundaries--for this reason, Gillespie was and is an international treasure.\n\nGeneral\nComplete name              : H:\\Dizzy Gillespie\nFormat                           : AVI\nFile size                        : 876 MiB\nDuration                         : 59mn 38s\nOverall bit rate                 : 2 054 Kbps\n\nVideo\nID                               : 0\nFormat                           : MPEG-4 Visual\nCodec ID                         : FMP4\nBit rate                         : 1 912 Kbps\nWidth  x Height           : 720 x 648 pixels\nDisplay aspect ratio             : 1.111\nFrame rate                       : 29.970 fps\n\nAudio\nID                               : 1\nFormat                           : MPEG Audio Version 1 Layer 3\nMode                             : Joint stereo\nDuration                         : 59mn 38s\nBit rate                         : 128 Kbps Constant\nChannel(s)                       : 2 channels\n","torrent":{"xt":"urn:btih:97972d1186e420fb090fd484a52eb9e76561534a","amp;dn":"Dizzy+Gillespie++In+Redondo%28jazz%29%28avi%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97972d1186e420fb090fd484a52eb9e76561534a","infoHashBuffer":{"type":"Buffer","data":[151,151,45,17,134,228,32,251,9,15,212,132,165,46,185,231,101,97,83,74]},"announce":[],"urlList":[]}}