{"title":"Twentieth-Century American Fiction on Screen(pdf){Zzzzz}","uid":11394139,"size":2583299,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97cd008b109ea31764e08bbe82e67dbd6c8206c2&amp;dn=Twentieth-Century+American+Fiction+on+Screen%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415319244,"description":"The essays in this 2007 collection analyse major film adaptations of twentieth-century American fiction, from F. Scott Fitzgerald's The Last Tycoon to Toni Morrison's Beloved. During the century, films based on American literature came to play a central role in the history of the American cinema. Combining cinematic and literary approaches, this volume explores the adaptation process from conception through production and reception. The contributors explore the ways political and historical contexts have shaped the transfer from book to screen, and the new perspectives that films bring to literary works. In particular, they examine how the twentieth-century literary modes of realism, modernism, and postmodernism have influenced the forms of modern cinema. Written in a lively and accessible style, the book includes production stills and full filmographies. Together with its companion volume on nineteenth-century fiction, the volume offers a comprehensive account of the rich tradition of American literature on screen.\n\nPublisher: Cambridge University Press (March 19, 2007)\nLanguage: English\nISBN-10: 0521542308\nISBN-13: 978-0521542302\n\nEditorial Reviews\n\nReview\n&quot;Informative and well organized, this collection of essays on literary film adaptations looks beyond the theory of fidelity and privileging to aspects of narratology, intertextuality, and reading theory...Full of interesting insights, this collection could serve as either supplemental reading or stand-alone text on the historical aspects of film adaptations of 20th-century literature...Recommended.&quot;\n- A. F. Winstead, Our Lady of the Lake University, Choice\n\nBook Description\nThe essays in this 2007 collection analyse major adaptations of twentieth-century American fiction. Written in a lively and accessible style, the book includes production stills and full filmographies. Together with its companion volume on nineteenth-century fiction, the volume offers a comprehensive account of the rich tradition of American literature on screen","torrent":{"xt":"urn:btih:97cd008b109ea31764e08bbe82e67dbd6c8206c2","amp;dn":"Twentieth-Century+American+Fiction+on+Screen%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97cd008b109ea31764e08bbe82e67dbd6c8206c2","infoHashBuffer":{"type":"Buffer","data":[151,205,0,139,16,158,163,23,100,224,139,190,130,230,125,189,108,130,6,194]},"announce":[],"urlList":[]}}