{"title":"xxx classic- The Seduction of Lynn Carter 1974....FFF","uid":4247626,"size":732825600,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:97e53dd777ed322e76bde02937a0bcc1a28a6b07&amp;dn=xxx+classic-+The+Seduction+of+Lynn+Carter+1974....FFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"FatFuckFrank","files":1,"time":1213859400,"description":"IMDB review\n\nAnthony Spinelli is highly-regarded as one of the masters of the golden age of adult film-making, one of few directors who successfully mixed erotic sex acts, solid acting performances, decent production values and intelligent screenplays to create some of the best films of the porno chic movement. Yet THE SEDUCTION OF LYN CARTER remains extremely hard to find, and the only tape which was available, from Alpha Blue Archives, has just been discontinued! LYN CARTER is reminiscent of his later film, PORTRAIT OF SEDUCTION, but the performances here are so spot-on and the script so well-written that it easily excels over that film.\n\nAndrea True, future disco diva, stars as Lyn Carter, a happily-married housewife whose husband travels on business and leaves her alone in their spacious suburban home with their young son (who is never seen). Lyn lost her virginity to her husband and has never been with another man, so she is intrigued by the swarthy good looks and cocksure demeanor of Jamie Gillis as Sean, a dark-haired stranger she meets at her dentist&amp;#039;s office. A date for a drink leads to going back to his apartment, where she is roughly raped and defiled by Sean&amp;#039;s dark side of his split personality. But much to her horror and disgust, she finds herself continually drawn to return to his apartment and forced to endure every imaginable sex act as a sort of depraved &quot;sex education&quot; course. She finally reaches her breaking point, but when she reveals all to her husband in a tearful confession, she finds that her shoulder to cry on may not be the sensitive caring lover she has enjoyed all these years...\n\nAndrea True, who is rarely given any credit as one of the earliest porno stars and even less credit as an accomplished actress and singer, gives the performance of her career! If adult film awards were being given in 1974, there would be no question she would receive due honors. Even by mainstream film standards, she gives a truly gutwrenching portrayal and it is truly moving to watch her transform from a smiling fresh-faced wife and mother to a degraded and tortured soul. Jamie Gillis would build a career on both his performances as mean bastards and his uninhibited sex scenes. This is just another day in the life for him, but he&amp;#039;s such a cruel, heartless heel of a man in LYN CARTER. The film basically relies on the interplay and talent of True and Gillis, because there are only three other minor characters who act as able support. None of the sex is really that erotic, which is the point of the film. It&amp;#039;s not an uplifting film, but the fact that it&amp;#039;s so well-made and brilliantly acted keeps it fascinating throughout.\n\nA solid 10, a shining jewel of golden age adult film-making and even without the hardcore scenes, this could have easily been made as a serious melodrama.\n\nfor all your xxx classic needs go to\n\n\nwww.fatfuckfrank.org\n\n\nlater/FFF","torrent":{"xt":"urn:btih:97e53dd777ed322e76bde02937a0bcc1a28a6b07","amp;dn":"xxx+classic-+The+Seduction+of+Lynn+Carter+1974....FFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97e53dd777ed322e76bde02937a0bcc1a28a6b07","infoHashBuffer":{"type":"Buffer","data":[151,229,61,215,119,237,50,46,118,189,224,41,55,160,188,193,162,138,107,7]},"announce":[],"urlList":[]}}