{"title":"VICE on HBO Season One_ Winners &amp; Losers (Episode 5)[1080p]","uid":9823556,"size":620029193,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:98563848137f2fb7524dcb75be2e2d1b70b5d244&amp;dn=VICE+on+HBO+Season+One_+Winners+%26amp%3B+Losers+%28Episode+5%29%5B1080p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"enedois","files":-1,"time":1395732721,"description":"Segment 1: Mormon Lost Boys\n\nIn today's Fundamentalist Latter-Day Saints (FLDS) Church, many young men have been thrown out of their homes because of an edict allowing polygamist church elders to monopolize all the eligible young girls. These &quot;lost boys,&quot; few of whom have even an 8th-grade education, must adjust to a drastically different America than the one they grew up in. We travel to Utah to meet some of these young men and listen to their harrowing stories.\n\nSegment 2: The Fat Farms if Mauritania\n\nIronically, in one of the world's poorest countries, obesity is a sign of beauty and wealth. In the West African country of Mauritania, parents send their daughters to rural fattening camps, where they are force-fed over 15,000 calories a day in camel milk, figs, oiled breadcrumbs and couscous. VICE sends its skinniest correspondent to one of these camps to examine the impact of force-feeding on young women in a society that loves them so plump.\n\nSegment 3: Mumbai Slumscraper\n\nNowhere in the world is the collision of caste and future more apparent than in Mumbai, where more than half its residents live in slums sprawled in the shadow of billion-dollar, single-family skyscrapers. VICE travels to Mumbai's Dharavi slum, where over a million people live in abject poverty while billion-dollar single-family skyscrapers are being built on top of them.","torrent":{"xt":"urn:btih:98563848137f2fb7524dcb75be2e2d1b70b5d244","amp;dn":"VICE+on+HBO+Season+One_+Winners+%26amp%3B+Losers+%28Episode+5%29%5B1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98563848137f2fb7524dcb75be2e2d1b70b5d244","infoHashBuffer":{"type":"Buffer","data":[152,86,56,72,19,127,47,183,82,77,203,117,190,46,45,27,112,181,210,68]},"announce":[],"urlList":[]}}