{"title":"Jealous Gods and Chosen People The Mythology of the Middle East","uid":6257758,"size":7367170,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98824cb40b6613c7a36777686ae7df7180d00cd4&amp;dn=Jealous+Gods+and+Chosen+People+The+Mythology+of+the+Middle+East&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lionzbay","files":1,"time":1300639013,"description":"\nAuthor(s): David Leeming\nPublisher: Oxford University Press\nDate: 2004\nFormat: pdf\nLanguage: English\nISBN10: 0195147898\nPages: 1\n\nTeeming with gods, goddesses and heroes, the ancient Middle East served as the cradle of numerous mythologies that provided the religious, political and cultural foundations of civilizations from Egypt and Sumer to Palestine. In this helpful primer, Leeming (Myth: A Biography of Belief) summarizes the cultural and historical contexts in which various myths developed. He devotes the first section of his book to a brief chronological survey of the development of civilizations from prehistoric times through the Bronze and Iron Ages to the Crusades and finally the 20th century. He chronicles various features of the societies he examines, such as the Sumerians' invention of writing, the warlike nature of the Hyksos and the Hebrews' adaptation of Canaanite religion and ritual. In the book's second section, Leeming sketches each culture's mythologies, examining their pantheons of gods and heroes and retelling their major myths. Thus, in his chapter on Mesopotamia, Leeming introduces us to gods like Mardukwho killed the storm goddess Tiamat and chopped her into pieces, thus creating the earth-and heroes like Gilgamesh, whose divine birth and trip to the underworld provided later models for Moses and Jesus. Flood myths are common to all of these cultures, so Leeming retells the myth from the Mesopotamian Enuma Elish (which features Gilgamesh); the biblical book of Genesis, featuring Noah; and the Islamic tale starring Nuh, or Noah. Leeming's useful survey offers an introductory guide to tales that for centuries have influenced people's religion and culture. ","torrent":{"xt":"urn:btih:98824cb40b6613c7a36777686ae7df7180d00cd4","amp;dn":"Jealous+Gods+and+Chosen+People+The+Mythology+of+the+Middle+East","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98824cb40b6613c7a36777686ae7df7180d00cd4","infoHashBuffer":{"type":"Buffer","data":[152,130,76,180,11,102,19,199,163,103,119,104,106,231,223,113,128,208,12,212]},"announce":[],"urlList":[]}}