{"title":"George Bush: The Unauthorized Biography","uid":8795970,"size":3388942,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9893c22ef4ca631a7f0c0c9111c95fb7608e1552&amp;dn=George+Bush%3A+The+Unauthorized+Biography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KatSucks","files":1,"time":1376079285,"description":"This was released by TeamPhoneix awhile back.  I'm just coping the torrent over with the same hash.\n\nDescription: This is the groundbreaking classic expose of the Bush family, cited by all that followed it, yet still unmatched. Exhaustively documented by intensive search of dozens of archives and months of interviews with government insiders, this biography digs up all the dirt - frightening, gory, hilarious - on the Bush dynasty: how the Bushes made their fortune building up Hitler and the Nazi war machine; Iran-Contra; Zapata's Watergate burglars; the Reagan shooting; the 'war hero' story; the secret government; 'Eugenic' population reduction plans; Kissinger, China, and genocide in the Third World; Luring Iraq to attack Kuwait; The Bush Leveraged Buyout Mob, theft of a nation; Jupiter Island, Skull and Bones, and other power bases. Essential reading as long as this Anglo-American oligarchy directs American politics, the &quot;Unauthorised Biography&quot; is a vivid X-ray of the presidential dynasty, and the private forces dominating both major political parties.\n\nWritten by Webster Griffin Tarpley and Anton Chaitkin","torrent":{"xt":"urn:btih:9893c22ef4ca631a7f0c0c9111c95fb7608e1552","amp;dn":"George+Bush%3A+The+Unauthorized+Biography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9893c22ef4ca631a7f0c0c9111c95fb7608e1552","infoHashBuffer":{"type":"Buffer","data":[152,147,194,46,244,202,99,26,127,12,12,145,17,201,95,183,96,142,21,82]},"announce":[],"urlList":[]}}