{"title":"ABC What the Future Sounded Like DVB Xvid AC3 MVGroup.org","uid":8686939,"size":389922816,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:991405dcf81bcf5b4fba02897e8a532f7234d697&amp;dn=ABC+What+the+Future+Sounded+Like+DVB+Xvid+AC3+MVGroup.org&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MVGroup","files":-1,"time":1373822916,"description":"What the Future Sounded Like\n\nTechnology, Arts Documentary  published by ABC in 2006 - English narration \n \n \n \n \n&lt;!-- Themes: --&gt;\n\n\nInformation\n------------------------------\n\nFrom Dr Who to The Dark Side of the Moon to modern day dance music, the pioneering members of the Electronic Music Studios radically changed the sound-scape of the 20th century. Screening Tuesday 18 September at 10pm, What the Future Sounded Like tells the fascinating story of British electronic music.\n\nIn postwar Britain, musician and composer Tristram Cary was using materials left over from the war to experiment with electronic music. Uninhibited, anything went with regard to the sounds he invented. He also moonlighted as a composer for pop cult films like The Ladykillers and the seminal television series Dr Who.\n\nIn the 1960s an exiled Russian aristocrat Peter Zinovieff, borrowed money from his rich British wife to purchase two military grade computers. Costing as much as a house at the time, he used them specifically for his personal experiments in electronic music. But it was his collaboration with music engineer David Cockerell that helped revolutionise electronic music.\n\nBy the end of the 60s, Cary joined forces with Zinovieff and Cockerell to establish EMS (Electronic Music Studios). EMS was the most advanced computer-music facility in the world. They created incredible sounds for films about nuclear power reactors, adverts for early Olivetti computers and for the British Pavilion at the 1967 World Expo. Played back today this early electronic music still arouses wonder at its creation and power.\n\nEMS's great legacy is the VCS3, Britain's first synthesizer and rival of the American Moog. The VCS3 was a uniquely British invention used by some of the most popular artists of the time including: The Who, Pink Floyd, Roxy Music and David Bowie. Almost 30 years on, the VCS3 is still used by modern electronic artists like Aphex Twin and Radiohead.\n\nWhat the Future Sounded Like explores a lost chapter in music history, uncovering a group of passionate composers and innovators who harnessed technology and new ideas to re-imagine the boundaries of music and sound.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img155.imageshack.us/img155/3401/whatthefuturesoundedliknc1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img155.imageshack.us/img155/3401/whatthefuturesoundedliknc1.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\nVideo Codec: XviD MPEG-4 codec\nVideo Bitrate: 1771 KB/s\nVideo Aspect Ratio: 16:9\nVideo Resolution: 688 x 384\nAudio Codec: FAST Multimedia AG DVM (Dolby AC3)\nAudio BitRate: 192 KB/s (CBR)\nAudio Channels: 2 Ch\nRunTime: 00:27\nFramerate: 25 FPS\nNumber Of Parts: 1\nPart Size: 372 MB\nRipped by gavin63\nSubtitles: No TV Cap\nSource: DVB\n\nLinks\n------------------------------\n\n\n","torrent":{"xt":"urn:btih:991405dcf81bcf5b4fba02897e8a532f7234d697","amp;dn":"ABC+What+the+Future+Sounded+Like+DVB+Xvid+AC3+MVGroup.org","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"991405dcf81bcf5b4fba02897e8a532f7234d697","infoHashBuffer":{"type":"Buffer","data":[153,20,5,220,248,27,207,91,79,186,2,137,126,138,83,47,114,52,214,151]},"announce":[],"urlList":[]}}