{"title":"THE RIGHT STUFF Special Edition 2Dvd DISC1 Spanish,English+Subs","uid":3720776,"size":7489970315,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:99ebfe25a9148ef8bb80a2dcc3995b92ef858def&amp;dn=THE+RIGHT+STUFF+Special+Edition+2Dvd+DISC1+Spanish%2CEnglish%2BSubs+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"jousmari","files":16,"time":1182510445,"description":"SOLODVD ORG\n\nDirector: Philip Kaufman\n\nCast: Sam Shepard, Scott Glenn, Ed Harris, Dennis Quaid, Fred Ward, Barbara Hershey, Kim Stanley, Veronica Cartwright, Pamela Reed\n\nLength: 184 min\n\nVideo: 1.85:1 , 16:9\n\nLanguages: Dolby Digital 5.1: English, Spanish\n\nSubtitles: English, Spanish, Portuguese, Hebrew, Croatian, Czech, Greek, Hungarian, Polish, Turkish, English for deaf people\n\nSynopsis: Disc 1. The Film: Four Academy AwardsÂ®! Scott Glenn, Ed Harris, Sam Shepard and a stellar cast give soaring life to the glory years of AmericaÂ´s space program. From Tom WolfeÂ´s best seller. Deep in the desert during the 1950s, army test pilots courageously fought to break the sound barrier. These maverick men would stop at nothing to achieve winning speed. Led by their champion, Chuck Yeager (Sam Shepard), they caroused at the local watering hole while sharing tales of extreme sport and bravery--until the Russians successfully sent their Sputnik satellite into the skies, and the United States government panicked, quickly launching a space program of its own. In an effort to find the right men for the job, the government searched the desert and the seas, compiling a crew of daredevil space cowboys willing to do anything for the chance to represent America in the space race. After gruelling medical, physical, and psychological tests, seven men were left standing, led by American hero John Glenn (Ed Harris), test pilots Gordon Cooper (Dennis Quaid), Gus Grissom (Fred Ward), and Scott Carpenter (Charles Frank), and Navy man Alan Shepard (Scott Glenn). With the help of the media and the government, these men became overnight heroes, sacrificing their freedom and their families for the dream of space travel.\n\nDisc 2. The Extras: Docummentaries, Additional scenes\n\nOther features: Interactive Menus, Scene Access, Theatrical Trailer\n\n\nDvd9 Untouched.\n\nSOLODVD ORG","torrent":{"xt":"urn:btih:99ebfe25a9148ef8bb80a2dcc3995b92ef858def","amp;dn":"THE+RIGHT+STUFF+Special+Edition+2Dvd+DISC1+Spanish%2CEnglish%2BSubs+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99ebfe25a9148ef8bb80a2dcc3995b92ef858def","infoHashBuffer":{"type":"Buffer","data":[153,235,254,37,169,20,142,248,187,128,162,220,195,153,91,146,239,133,141,239]},"announce":[],"urlList":[]}}