{"title":"Soldiers - Heroes of World War II [GOG]","uid":7531085,"size":1547477925,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9ae9a2b9bc2600a5de8bf2e8f10f16e2adcff35e&amp;dn=Soldiers+-+Heroes+of+World+War+II+%5BGOG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sarhento_t","files":-1,"time":1344927151,"description":"Just found this torrent out in the wild, uploading it for the guys who appreciate this gem of a game :)\n\nOriginally uploaded to Demonoid but they are not around at the moment, more power!\n\n\n\nDescription from GOG.com:\n\n\n\nWhat's cool about it:\n\n\n    Lead your squad in epic battles of WW II\n    Control your soldiers using a wide range of orders and see them carry them out to the last detail\n    Use cunning and tactics against overwhelming enemy numbers\n\n\nOverview:\n\n\nSoldiers: Heroes of World War II drops you into the heart of the most intense WWII combat action. Take control of the most elite American, British, German, or Russian forces ever to impact on the war-zone. Up against overwhelming odds, you must complete your missions incorporating stealth, guile, speed and aggression.\n\n\nMission objectives include blowing railway tracks, kidnapping enemy officers and destroying convoys. Be warned that much of this activity will take place behind enemy lines!\n\n\nUse the fully interactive environment, tools and equipment around you to complete your objective, the way you want to complete it. Maximize the effectiveness of your squad by assigning tasks relevant to their individual skills. As long as you keep your men alive, you can do whatever it takes to secure victory, nothing is pre-set.\n\n\nIf flying bullets and knocking-down explosions are what you like the most, then this game will feel like home to you. Take the lead and crush your enemies. Take no prisoners! Victory is ours!\n\nThis game includes the official Map Editor. \n\n\n    Bonus content included for FREE:\n    manual (24 pages)\n    HD wallpaper\n    in-game soundtrack\n    2 avatars\n    7 artworks\n\n\n\nIF YOU REALLY ENJOY THIS GAME, CONSIDER BUYING TO SUPPORT DEVELOPERS AND PUBLISHERS","torrent":{"xt":"urn:btih:9ae9a2b9bc2600a5de8bf2e8f10f16e2adcff35e","amp;dn":"Soldiers+-+Heroes+of+World+War+II+%5BGOG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ae9a2b9bc2600a5de8bf2e8f10f16e2adcff35e","infoHashBuffer":{"type":"Buffer","data":[154,233,162,185,188,38,0,165,222,139,242,232,241,15,22,226,173,207,243,94]},"announce":[],"urlList":[]}}