{"title":"God of War (eBook from the game, but not the game)","uid":8810591,"size":2270187,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b359ac812f0412b228303cbb29f45b186c8c701&amp;dn=God+of+War+%28eBook+from+the+game%2C+but+not+the+game%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"livhre","files":-1,"time":1376447190,"description":"Format: ePub\n\nOffering deeper insights into the critically acclaimed God of WarÂ® franchise, this novel returns us to the dark world of ancient Greek mythology explored in the heart-pounding action of God of War I, the bestselling video game.\n \nA brutal warrior, Kratos is a slave to the gods of Olympus. Plagued by the nightmares of his past and yearning for freedom, the Ghost of Sparta would do anything to be free of his debt to the gods. He is on the verge of losing all hope when the gods give him one last task to end his servitude.\n\nHe must destroy Ares, the god of war.\n\nBut what chance does a mere mortal have against a god? Armed with the deadly chained Blades of Chaos, guided by the goddess Athena, and driven by his own insatiable thirst for vengeance, Kratos seeks the only relic powerful enough to slay Ares . . . a quest that will take him deep into the mysterious temple borne by the Titan Cronos!\n\nFrom the black depths of Hades to the war-torn city of Athens to the lost desert beyond, God of War sheds a brutal new light on the bestselling video game and on the legend of Kratos.\n\nFollow me on twitter: @livhre\nRequest books on twitter: @livhre\nPlease seed and rate the torrents I upload. ","torrent":{"xt":"urn:btih:9b359ac812f0412b228303cbb29f45b186c8c701","amp;dn":"God+of+War+%28eBook+from+the+game%2C+but+not+the+game%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b359ac812f0412b228303cbb29f45b186c8c701","infoHashBuffer":{"type":"Buffer","data":[155,53,154,200,18,240,65,43,34,131,3,203,178,159,69,177,134,200,199,1]},"announce":[],"urlList":[]}}