{"title":"2014 - The Year In Christian Music (Bundle 01)","uid":9544530,"size":2178448107,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9b706b4fd430fef8c2de99f366836cd48557f576&amp;dn=2014+-+The+Year+In+Christian+Music+%28Bundle+01%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"TorrentTracts","files":282,"time":1391105151,"description":"-----------------------------------------------------------------------\n2014 - THE YEAR IN CHRISTIAN MUSIC\n-----------------------------------------------------------------------\n\nSharing Christian Music here on The Pirate Bay has been something I've been faithfully, and aggressively doing since 2009.  Anyone who has followed me during that time knows I have long referred to it as a ministry.  Right or wrong, moral or immoral, agree or disagree with me my mindset or my approach, if people around the world can be killed, imprisoned, or beaten down for publicly acknowledging their faith in the Christ, Lord Jesus, then the least I can do is take a chance here.  Amen?\n\nAnd to that effect, dare I say, I think I've done a pretty good job of it.  I can't even begin to count the number of immeasurable hours I've put into this ministry.  From checking dozens of websites daily, to gathering the music, to organizing it, to fixing tags, to converting various formats into to MP3, to archiving it, to building a list of it for future reference, to torrenting it, to occasionally coming back and supporting those torrents when others who have downloaded it fail to do so themselves.\n\nBut, truth be told, I'm just not feeling it anymore.  I'm tired of people who share absolutely nothing here, coming out of the shadows for no other reason than to criticize my efforts.  There's always someone who thinks they can do the job better.  &quot;That's not Christian music.&quot;  &quot;That's a transcode.&quot;  &quot;That's not a high enough bit rate.&quot;  &quot;That album wasn't supposed to be released.&quot;  &quot;That song had swearing in it.&quot;  Oh my!  &quot;That musician is no longer considered a Christian because he's turned over to the dark side.&quot;  &quot;You are doing this wrong.  Do it like I would do it instead.  Because I know everything.&quot;\n\nAs I've said in my final post of 2013, &quot;In my hiatus, I'm sure those complainers will step up and share ten fold in my absence. Yeah right!&quot;  And even though I was obviously being sarcastic at the time, I see I was right.  Sadly, nobody showed up to carry the torch when I walked away in December for a little time off.  Sad indeed.  Because by my rough estimate, I had approximately 200 or so more releases to share for 2013.  And I simply didn't because I didn't want to deal with any of it anymore.\n\nI don't tell people how to praise the Lord.  I don't tell them how much they should tithe.  I don't tell them how often to pray.  I don't tell them where to pray.  I don't tell them how to pray.  I don't tell them when to go to Church.  I don't tell them how often to go to Church.  I don't tell them where to direct and focus their faithful works.  I don't tell them what ministries they should become involved in.  I don't tell them how to love God almighty.  That's all between them and Mr Yahweh.  Amen?  Just as my efforts here on The Pirate Bay are between me, and the same very God we all pray to.\n\nSo if anyone can do a better job than I have been doing, then please have at it.  I will gladly step down and let you take over.  In a heartbeat!  That way I can click on the &quot;download torrent&quot; button once, twice, or three times a month knowing my collection is near complete.  And all with absolute minimal effort on my part.  Sweet!  You can do all the work for me, and I can sit around and criticize you.  What a deal!\n\nOn that note, I've said this before ... Before I ever download any music, it is first represented to me as Christian content.  You may not agree with it.  I may not even agree with it.  As a matter of fact, probably since the 1990's or so, most of the time, I don't agree with it.  But it is my understanding that it's Christian.  And that's why I share it here.  So although I want to make everyone happy, I am reminded of Colossians 3:23,  &quot;And whatsoever ye do, do it heartily, as to the Lord, and not unto men.&quot;\n\nI will continue this thought in my Bundle #2 text...\n\n\n\nHARDCORE/METAL: A Sight To See, Akissforjersey, Any Given Day, Beware The Neverending, For Today, Monolith.  SINGER-SONGWRITER: Amy Stroup.  ALTERNATIVE: Anberlin, I Anthem, Nine Lashes.  ELECTRONIC: Capital Kings.  ROCK: Casting Crowns, The Fray, Kutless, TheKey, Underoath.  CONTEMPORARY: Colton Dixon, Grayson Kessenich, Justin Kintzel.  HIP-HOP/RAP: Da Bul Ike, Da GodChild, Davis Absolute, Dee Millz, DeRonte Polite, Je'kob, Mike Sarge, Oscar Urbina, Prominence, Roy Tosh, Various.  POP: Francesca Battistelli, Matt Gilman.  PRAISE &amp; WORSHIP: Hillsong, KXC.  BLUES: Leo Welch\n\nBundle #1 contains the following 38 releases...\n\n * A Sight To See - 2014 - Rebel - Single\n * Akissforjersey - 2014 - New Bodies\n * Amy Stroup - 2014 - Far From Yesterday - Single\n * Anberlin - 2014 - Icon\n * Any Given Day - 2014 - My Longest Way Home\n * Beware The Neverending - 2014 - Kamikaze - Single\n * Capital Kings - 2014 - Be A King - Single\n * Casting Crowns - 2014 - This Is Now - Single\n * Casting Crowns - 2014 - Thrive\n * Colton Dixon - 2014 - A Messenger - Expanded Edition\n * Da Bul Ike - 2014 - Down With The King\n * Da GodChild - 2014 - ChristLife Infinite, Vol 2\n * Davis Absolute - 2014 - Blend Tape, Vol 2 ThoughtPoet\n * Dee Millz - 2014 - Mr Impossible EP\n * DeRonte Polite - 2014 - Die Well\n * For Today - 2014 - Fight The Silence\n * Francesca Battistelli - 2014 - Write Your Story - Single\n * Fray, The - 2014 - Hurricane - Single\n * Grayson Kessenich - 2014 - There Is A Love - Single\n * Hillsong - 2014 - You Love Me - Single\n * I Anthem - 2014 - West Of Homeland\n * Je'kob - 2014 - Pocketless Souls II\n * Justin Kintzel - 2014 - Love Displayed - Single\n * Kutless - 2014 - In The City - Single\n * Kutless - 2014 - Rest - Single\n * KXC - 2014 - Singing Over Us - Single\n * KXC - 2014 - The Father's Love - Single\n * Leo Welch - 2014 - Sabougla Voices\n * Matt Gilman - 2014 - Sing Your Praises - Single\n * Mike Sarge - 2014 - Truth Cafe - With Emissary\n * Monolith - 2014 - Beyond Bermuda EP\n * Nine Lashes - 2014 - From Water To War\n * Oscar Urbina - 2014 - Finally\n * Prominence - 2014 - LeVe2\n * Roy Tosh - 2014 - The Revert\n * TheKey - 2014 - Hold On To Love - Single\n * Underoath - 2014 - Icon\n * Various - 2014 - Rappers 4 Christ\n\nFor Him,\nTorrentTracts, January 2014\n","torrent":{"xt":"urn:btih:9b706b4fd430fef8c2de99f366836cd48557f576","amp;dn":"2014+-+The+Year+In+Christian+Music+%28Bundle+01%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b706b4fd430fef8c2de99f366836cd48557f576","infoHashBuffer":{"type":"Buffer","data":[155,112,107,79,212,48,254,248,194,222,153,243,102,131,108,212,133,87,245,118]},"announce":[],"urlList":[]}}