{"title":"Flash Gordon (The new adventures) 1996 Cartoon","uid":9373762,"size":1526269792,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9b7cff53a2a602a09492c2413d47af4932da8460&amp;dn=Flash+Gordon+%28The+new+adventures%29+1996+Cartoon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Rafeweisz","files":51,"time":1387579984,"description":"Flash Gordon was an animated series produced in 1996. The series was in weekly syndication. 26 episodes were produced.\n\nFor this series, the dashing blond hero was regressed to his teenage years, and he employed a hoverboard. As in previous versions, he teamed up with Dale Arden (also a teen) and balding, bespectacled scientist Dr. Hans Zarkov.\n\nFlash's parents were American astronauts who got sucked into a dimensional hole just outside the Earth's atmosphere. The trans-dimensional portal was placed there by Ming the Merciless, dictator of the planet Mongo, who hoped to provide open access for his invading armies. In this series, Ming resembled and showed characteristics of a lizard and seemed to have a wife who was long dead. (It was implied in some episodes that she had gone to Earth).\n\nFlash, Dale, and Zarkov followed Flash's parents in their own space vehicle, rescuing them and closing the dimensional hole. Unfortunately, Flash and crew were stuck on the Mongo side. The earthlings discovered other nearby planets with anti-Ming factions and put together a loose coalition, determined to overthrow Mongo's dictator and return Flash, Dale, and Zarkov to their native planet.\nCast\n\n    Flash Gordon: Toby Proctor\n    Dale Arden: Lexa Doig\n    Dr. Hans Zarkov: Paul Shaffer\n    Other Voices: Lawrence Bayne, Tyrone Benskin, Rob Cohen, Shirley Douglas, Tracey Hoyt, Lorne Kennedy, Ray Landry, Julie Lemieux, Marjorie Malpass, Andy Marshall. \n\n\nVoices are in German.","torrent":{"xt":"urn:btih:9b7cff53a2a602a09492c2413d47af4932da8460","amp;dn":"Flash+Gordon+%28The+new+adventures%29+1996+Cartoon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b7cff53a2a602a09492c2413d47af4932da8460","infoHashBuffer":{"type":"Buffer","data":[155,124,255,83,162,166,2,160,148,146,194,65,61,71,175,73,50,218,132,96]},"announce":[],"urlList":[]}}