{"title":"[Evil Angel] Ts playground 3 (2013)","uid":13831506,"size":2192077414,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9d2471388d913caa9205fb49e8b4d803f7343d23&amp;dn=%5BEvil+Angel%5D+Ts+playground+3+%282013%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"distinc","files":5,"time":1457738827,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=2526608864\r\n \nhttp://imagedisco.net/?g=9088682397\r\n\r\n\r\n\r\nDescription:\r\n\r\nAnally motivated director Jay Sin focuses on the gender-bending world of she-males in his new &quot;TS Playground 3.&quot; It's full of gorgeous, feminine transsexuals taking on girls, guys and other trans folk, all in Jay's famously perverse, lighthearted style ... replete with sexy costumes, hard butt sex and anal gaping! Blonde teen Juliana Souza and brunette cutie Bruna Butterfly are hot Brazilian she-males. They wrap their full, Latina lips around each other's throbbing dick and share passionate sodomy. TS Andressa Alves, in corset and fishnets, spreads her meaty ass cheeks for a wicked date that leaves her anus gaping. Wearing skin-tight black latex, busty Gladys Adriane smears baby oil over her phat, juicy ass. She releases her huge cock and hungrily slurps Max Scar's boner while vigorously wanking her own shaft; Max reams her rump and creams her boobs. In a tight, zebra-print bodysuit and sporting dental braces, voluptuous blonde Jhenifer Dalbosco is one glamorous, slutty she-male. Latin stud Alex Victor ruthlessly screws her big ass and gets his own butt corn-holed before splattering Jhenifer with semen. Beautiful biological girl Roxy Raye joins sultry chick-with-dick Kelly Pierce and boy toy Mason Pierce in a kinky threesome that includes lewd double-blow jobs, daisy chain fucking and a double-pussy penetration! With 33 minutes of outtakes and fun behind-the-scenes footage, this is the perfect playtime for fans of luscious lady boys. &quot;TS Playground 3&quot; is serious, ass-wrecking recreation for adults!","torrent":{"xt":"urn:btih:9d2471388d913caa9205fb49e8b4d803f7343d23","amp;dn":"%5BEvil+Angel%5D+Ts+playground+3+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d2471388d913caa9205fb49e8b4d803f7343d23","infoHashBuffer":{"type":"Buffer","data":[157,36,113,56,141,145,60,170,146,5,251,73,232,180,216,3,247,52,61,35]},"announce":[],"urlList":[]}}