{"title":"As it is in heaven DVDRip Xvid Dutch subs","uid":4678723,"size":1123279660,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9d5ba518a80e4a4601fb2c691d68c50beda86e05&amp;dn=As+it+is+in+heaven+DVDRip+Xvid+Dutch+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KA66","files":1,"time":1232995251,"description":"Daniel DarÃƒÂ©us is een succesvolle internationaal bekende dirigent die aan de top meedraait. Maar hij is ook eenzaam, voelt zich slecht en is de uitputting nabij door het jachtige leven dat hij leidt. Na een lichamelijke en emotionele inzinking besluit Daniel zijn carriere abrupt te onderbreken en keert alleen terug naar Norrland, het dorpje in het hoge noorden van Zweden waar hij zijn jeugd heeft doorgebracht. Zijn komst maakt natuurlijk wel wat los want Daniel is wereldberoemd en dat maakt hem tot mikpunt van de nieuwsgierigheid van de inwoners van Norrland die hem met evenveel bewondering als argwaan ontvangen. Het duurt niet lang voordat Daniel gevraagd wordt om wat adviezen te geven aan het kleine locale kerkkoor dat iedere donderdag repeteert. Aanvankelijk ziet Daniel dat niet echt zitten. Hij komt immers voor zijn rust en wil de spotlights zoveel mogelijk vermijden. Maar Daniel kan niet weigeren en met tegenzin besluit hij dan maar een helpende hand te bieden. Als Daniel met het koor begint te werken herontdekt hij tot zijn grote verbazing zijn verloren gegane liefde voor muziek. Maar zijn werk met het koor vormt ook een flinke bedreiging voor het plaatsje en Daniel krijgt ook de nodige tegenstand te verwerken door de jaloerse priester en een gevaarlijke en gewelddadige vijand uit zijn verleden. Maar het is niet alleen kommer en kwel. Daniel maakt ook nieuwe vrienden, waaronder de lieve en gevoelige Lena, een vrouw die hem helpt zijn eigen onzekerheid, angsten en eenzaamheid te overwinnen. Het leven van Daniel en de levens van de inwoners van Norrland zullen nooit meer hetzelfde zijn.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0382330/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0382330/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:9d5ba518a80e4a4601fb2c691d68c50beda86e05","amp;dn":"As+it+is+in+heaven+DVDRip+Xvid+Dutch+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d5ba518a80e4a4601fb2c691d68c50beda86e05","infoHashBuffer":{"type":"Buffer","data":[157,91,165,24,168,14,74,70,1,251,44,105,29,104,197,11,237,168,110,5]},"announce":[],"urlList":[]}}