{"title":"The Call of Everest (gnv64)","uid":9469278,"size":23838720,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d631ba0d0b3d0d22d72cc284ad7b65bd077a749&amp;dn=The+Call+of+Everest+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gnv65","files":-1,"time":1389520440,"description":"The Call of Everest: The History, Science, and Future of the World's Tallest Peak \nby Conrad Anker, Bernadette Mcdonald, David Breashears and Broughton Coburn\nNational Geographic | May 2013 | ISBN-10: 1426210167 | ePUB | 186 pages | 22.7 mb\n\nGripping and sumptuous, this is the definitive book on the history, mystique, and science of Mount Everest, including how climate change is impacting the world's tallest mountain. \n In 1963, the American Mount Everest Expedition made mountaineering history. It was the first American venture to successfully scale the legendary peak and the first successful climb up the hazardous West Ridge (a climb so difficult no one has yet repeated it). In 2012, adventurer Conrad Anker led a National Geographic/The North Face team up the mountain to enact a legacy climb. Environmental changes and overcrowding led to challenges and disappointments, but yet the mountain maintains its allure. Now, steely-eyed Anker leads a team of writers in a book designed to celebrate the world's most famous mountain, to look back over the years of climbing triumphs and tragedies, and to spotlight what has changed--and what remains eternal--on Mount Everest. Telltale signs of Everest's current state, never-before-published photography, and cutting-edge science expose the world's tallest peak--its ancient meaning, its ever-present challenges, and its future in a world of disappearing ice.\n\nAbout the Authors\nCONRAD ANKER is famous for succeeding at death-defying ascents in the Himalaya and Antarctica. In 1999 he discovered George Mallory's body, the legendary British climber who disappeared on Everest.\nBERNADETTE MCDONALD is a prizewinning Canadian writer who has authored or contributed to eight books including National Geographic's Voices from the Summit and Extreme Landscape.\nMARK JENKINS writes about remote expeditions for National Geographic, Outside, Men's Health, Playboy, and many other magazines. His dispatches from Everest on the legacy climb will form part of this book's narrative.\n\nCONTENTS\nFOREWORD - EVEREST CALLS Thomas Hornbein\nCHAPTER 1 - THE MEANING OF EVEREST Conrad Anker\nCHAPTER 2 - THE BIRTH OF EVEREST David R. Lageson\nCHAPTER 3 - THE PEOPLE OF EVEREST Broughton Coburn\nCHAPTER 4 - THE NATURE OF EVEREST Alton C. Byers\nCHAPTER 5 - THE CLIMBERS OF EVEREST Bernadette McDonald\nCHAPTER 6 - THE AGONIES OF EVEREST Bruce D. Johnson\nCHAPTER 7 - ONE SEASON ON EVEREST Mark Jenkins\nCHAPTER 8 - THE FUTURE OF EVEREST David Breashears\nFURTHER READING\nCONTRIBUTORS\nIllustrations &amp; Text Credits","torrent":{"xt":"urn:btih:9d631ba0d0b3d0d22d72cc284ad7b65bd077a749","amp;dn":"The+Call+of+Everest+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d631ba0d0b3d0d22d72cc284ad7b65bd077a749","infoHashBuffer":{"type":"Buffer","data":[157,99,27,160,208,179,208,210,45,114,204,40,74,215,182,91,208,119,167,73]},"announce":[],"urlList":[]}}