{"title":"Sinclair QL documents manuals and magazines","uid":4636229,"size":310657990,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d9f2208d07833c0f839134ae2754d801a58dd9f&amp;dn=Sinclair+QL+documents+manuals+and+magazines&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"badaman_es","files":122,"time":1231561681,"description":"2009 is the year of the 25th anniversary of the QL. For several months\nin Sinclair QL Spanish Resources been preparing for this event a wide\ncollection of PDF material about the QL now put at your disposal.\n\nMore than 100 manuals, books and magazines (yes, in English) that have\ngone through the scanner with better or worse luck in terms of quality\nconcerns, but that insurance will be useful for the community because\nthis material years ago which has started to dwindle and unfortunately\nwe are increasingly less to keep alive the flame of QL.\n\nThe documents include:\n\nThe book &quot;The definitive handbook QL SuperBASIC&quot; by Jan Jones, the\ncreator of the QL programming language: The SuperBASIC. This is a book\npublished by McGraw Hill and was re-edited by Quanta later.\n\nIt also highlights the manual &quot;QL Technical Guide&quot; by Tony Tebby, with\nall the secrets on a QDOS programmer.\n\nThe manuals include also the &quot;QL Users Guide&quot; and the &quot;QL Service Manual&quot;.\n\nItems on the other hand is varied: Leguajes programming and compilers,\ntoolkits and extensions to the operating system, game manuals, manuals\nof many productivity programs, manuals on specific hardware, 5 books and\n12 issues of the journal QL World.\n\nAnd the thing does not end here, as we have several books and manuals in\npreparation.\n    \nDOWNLOADS:\n\nAll this documentation is available on the link:\nhttp://sinclairql.es/archivo/docs/docs.htm\n\nCONTRIBUTE:\n\nThe web, as always, is open to anyone who wants to contribute. If you\nhave any book, magazine or manual, contact us to tell the best way to\npass the documents to PDF.\n\nTo contact use the e-mail: sinclairql AT badared DOT com\n\nWe sincerely hope you enjoy learning with this material.\n\nHappy 25th anniversary!\n\nJavier Guerra (aka badaman)\nSinclair QL Spanish Resources\nhttp://sinclairql.es","torrent":{"xt":"urn:btih:9d9f2208d07833c0f839134ae2754d801a58dd9f","amp;dn":"Sinclair+QL+documents+manuals+and+magazines","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d9f2208d07833c0f839134ae2754d801a58dd9f","infoHashBuffer":{"type":"Buffer","data":[157,159,34,8,208,120,51,192,248,57,19,74,226,117,77,128,26,88,221,159]},"announce":[],"urlList":[]}}