{"title":"SUPER STREET FIGHTER IV ARCADE EDITION - COMPLEX - XBOX360 - REG","uid":6501966,"size":7258374748,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:9dae59a004c549e302929653fba92c11319c307c&amp;dn=SUPER+STREET+FIGHTER+IV+ARCADE+EDITION+-+COMPLEX+-+XBOX360+-+REG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"boobsman","files":75,"time":1309279147,"description":"The follow-up to the critically acclaimed Super Street Fighter IV will further redefine the fighting game genre with classic 2D Street Fighter fighting action, a host of new and returning characters, beefed up online modes, and more.\n\nSuper Street Fighter IV Arcade Edition features a roster of 39 characters such as Ryu, Chun-li, Juri, El Fuerte, and Rufus, while adding 4 new characters to the roster including classic combatants from previous Street Fighter games like Yun and Yang as well as the all-new Oni.\n\nBeyond characters, Super Street Fighter IV Arcade Edition adds all-new balancing as well as an enhanced Replay Channel.\n\nNew playable characters: Four new challengers enter the ring: Yun, Yang, Oni and Evil Ryu.\n\nUpdated character balancing: Features all new character balancing, further refining gameplay.\n\nReplay Follower: Be able to follow up to 5 separate player replays making it easier to find your favourite players' latest replay.\n\nMy Channel Advanced: Allows players to distribute their replay data to up to 50 players.\n\nElite Channel: Watch replay data from elite players who have a rating of 3000PP or more.\n\nAll playable SSFIV characters will be unlocked out of the box, including Yun &amp; Yang, Oni, and Evil Ryu.","torrent":{"xt":"urn:btih:9dae59a004c549e302929653fba92c11319c307c","amp;dn":"SUPER+STREET+FIGHTER+IV+ARCADE+EDITION+-+COMPLEX+-+XBOX360+-+REG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dae59a004c549e302929653fba92c11319c307c","infoHashBuffer":{"type":"Buffer","data":[157,174,89,160,4,197,73,227,2,146,150,83,251,169,44,17,49,156,48,124]},"announce":[],"urlList":[]}}