{"title":"The Cheat (1915)","uid":5062228,"size":577033062,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9ed250ce2cce0cec0b309acabc938e6f86bd2451&amp;dn=The+Cheat+%281915%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Willams","files":5,"time":1250761462,"description":"The Cheat (1915) \n\n\nThe Cheat (1915) is a drama film directed by Cecil B. DeMille, starring Fannie Ward, Sessue Hayakawa, and Jack Dean.\n\nIn 1993, the film has been selected for preservation in the United States National Film Registry.\n\nIn the film, Edith Hardy (Fannie Ward) steals charity money in order to invest it in stocks. When she loses the money, she turns to a wealthy Burmese man (Sessue Hayakawa) for a loan. He gives it to her, but when she later attempts to return it, he says the repayment he wants is her. When she resists, he brands her and declares her his property. Edith shoots him. Her husband Richard (Jack Dean) is blamed for the crime.\n\nOriginally, Hayakawa's character was described as a Japanese ivory merchant. Because Japan was an American ally at the time, and because Japanese-Americans protested the portrayal of a Japanese as a sinister sleaze, the title cards and the character's name were changed.\n\nThe film was remade in 1923 with George Fitzmaurice as director and Pola Negri and Jack Holt starring. In 1931 Paramount again remade The Cheat, with Broadway mogul George Abbott as director and starring Tallulah Bankhead.\n\nThis rip was taken from Karagarga. Thanks to firpo, the original uploader on KG. The torrent contains some posters of the film, and a external spanish subtitle. \n\nIMDB: 6.6/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0005078/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0005078/&lt;/a&gt;\n\n*****************************FREAKYFLICKS*****************************\n\nFreakyFlicks is a free and open community dedicated to preserving and\nsharing cinematic art in the digital era. Our goal is to disseminate\nsuch works of art to the widest audience possible through the channels\nprovided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played\nan exceptional role in the history of cinema and its progression in\nbecoming a great art. Films that are usually described as classic,\ncult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them\nand participate in our community. All you need do is include this tag\nin your upload and join us at the forum to announce your release.\n       \n \n            &lt;a href=&quot; http://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com&lt;/a&gt;\t\n\t\n\n*****************************FREAKYFLICKS*****************************\t\t","torrent":{"xt":"urn:btih:9ed250ce2cce0cec0b309acabc938e6f86bd2451","amp;dn":"The+Cheat+%281915%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ed250ce2cce0cec0b309acabc938e6f86bd2451","infoHashBuffer":{"type":"Buffer","data":[158,210,80,206,44,206,12,236,11,48,154,202,188,147,142,111,134,189,36,81]},"announce":[],"urlList":[]}}