{"title":"Snort Cookbook","uid":9156193,"size":4918267,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f9616df8828356c4f611f1ad9b26a032718a9d7&amp;dn=Snort+Cookbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cabrao","files":-1,"time":1383782330,"description":"If you are a network administrator, you're under a lot of pressure to ensure that mission-critical systems are completely safe from malicious code, buffer overflows, stealth port scans, SMB probes, OS fingerprinting attempts, CGI attacks, and other network intruders. Designing a reliable way to detect intruders before they get in is an essential--but often overwhelming--challenge. Snort, the defacto open source standard of intrusion detection tools, is capable of performing real-time traffic analysis and packet logging on IP network. It can perform protocol analysis, content searching, and matching. Snort can save countless headaches; the new Snort Cookbook will save countless hours of sifting through dubious online advice or wordy tutorials in order to leverage the full power of SNORT.\n\nEach recipe in the popular and practical problem-solution-discussion O'Reilly cookbook format contains a clear and thorough description of the problem, a concise but complete discussion of a solution, and real-world examples that illustrate that solution. The Snort Cookbook covers important issues that sys admins and security pros will us everyday, such as:\n\ninstallation\noptimization\nlogging\nalerting\nrules and signatures\ndetecting viruses\ncountermeasures\ndetecting common attacks\nadministration\nhoneypots\nlog analysis\nBut the Snort Cookbook offers far more than quick cut-and-paste solutions to frustrating security issues. Those who learn best in the trenches--and don't have the hours to spare to pore over tutorials or troll online for best-practice snippets of advice--will find that the solutions offered in this ultimate Snort sourcebook not only solve immediate problems quickly, but also showcase the best tips and tricks they need to master be security gurus--and still have a life.","torrent":{"xt":"urn:btih:9f9616df8828356c4f611f1ad9b26a032718a9d7","amp;dn":"Snort+Cookbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f9616df8828356c4f611f1ad9b26a032718a9d7","infoHashBuffer":{"type":"Buffer","data":[159,150,22,223,136,40,53,108,79,97,31,26,217,178,106,3,39,24,169,215]},"announce":[],"urlList":[]}}