{"title":"The Hands Off Manager - Steve Chandler and Duane Black.epub","uid":9576529,"size":2185837,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a090c46ee5003cf36576ccb4077c568d3ba6ce84&amp;dn=The+Hands+Off+Manager+-+Steve+Chandler+and+Duane+Black.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1391708887,"description":"The #1 reason cited in exit interviews for an employee quitting is &quot;my manager.&quot; Most managers and executives not only aren't aware of this obvious problem, but probably wouldn't know what to do about it if they did. Today's employees do not respond to the old hands-on, militaristic management styles. They are highly independent, individual professionals with their own fully developed ideas. Leaders and managers who try to micro-manage them will inevitably confront wide-spread disgruntlement, absenteeism, and turnover...and increase their own and their employees' stress levels. In The Hands-Off Manager, Chandler and Black offer a new vision for all managers. With stories, examples, and vibrant activities for the reader to practice, this book shows any manager--new or seasoned--how to coach and mentor employees rather than hover over their shoulders and goad them into action. In this system, each employee's strengths are honored and honed in a climate of partnership and mutual goal-setting. Chandler, whose 100 Ways to Motivate Others is a best-selling favorite with small and large businesses alike, has called The Hands-Off Manager &quot;my most original work to date&quot; because it finally solves the age-old problem of getting the best performance out of people without frustrating yourself and them. The Hands-Off Manager and its breakthrough content will take its place beside In Search of Excellence, The One Minute Manager, and Who Moved My Cheese? as an instant classic that will forever change the way we lead and manage.","torrent":{"xt":"urn:btih:a090c46ee5003cf36576ccb4077c568d3ba6ce84","amp;dn":"The+Hands+Off+Manager+-+Steve+Chandler+and+Duane+Black.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a090c46ee5003cf36576ccb4077c568d3ba6ce84","infoHashBuffer":{"type":"Buffer","data":[160,144,196,110,229,0,60,243,101,118,204,180,7,124,86,141,59,166,206,132]},"announce":[],"urlList":[]}}