{"title":"G.I. Joe Retaliation.avi","uid":8321088,"size":412051214,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a15e9bbd06a592ed61e8048feb16af0a2386577c&amp;dn=G.I.+Joe+Retaliation.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"globeplus","files":-1,"time":1364674126,"description":"* AVI XVID  * CAM  * 01H41M53S  * 640x400 * 20 frames  * Audio : mpga 4800Hz 128kb/s\n\n\n* Plot :\n\nThe G.I. Joes are framed for stealing nuclear warheads from Pakistan by Zartan (Arnold Vosloo) who is impersonating the President of the United States (Jonathan Pryce). The entire team is eliminated in a military strike with Duke (Channing Tatum) as one of the casualties. Roadblock (Dwayne Johnson), Flint (D.J. Cotrona) and Lady Jaye (Adrianne Palicki) are the only survivors.\n\nMeanwhile, Storm Shadow (Lee Byung-hun) and ex-Joe Firefly (Ray Stevenson) rescue Cobra Commander (Luke Bracey) from a penitentiary in Germany. Storm Shadow is injured during the escape and retreats to a temple in the Himalayas to recover. Upon learning that he is alive, the Blind Master (RZA), leader of the Arashikage Clan, sends Snake Eyes (Ray Park) and his apprentice Jinx (Elodie Yung), Storm Shadow's cousin, to capture Storm Shadow so he can answer for the murder of his uncle, the Hard Master.\n\nRoadblock, Flint, and Lady Jaye return to the United States where they set up a base of operations in a rundown gym. After Zartan announces that Cobra will replace the Joes as America's main protective unit, Lady Jaye deduces that someone is impersonating the President and Roadblock leads them to General Joseph Colton (Bruce Willis) who provides them with weapons and helps them infiltrate a fundraising event that the President will be attending, where Lady Jaye steals a sample of his DNA and confirms that he is Zartan. They escape after a brief confrontation with Firefly and Zandar (Matt Gerald), the head of the Presidential Detail and a member of Cobra.\n\n\n* enjoy...","torrent":{"xt":"urn:btih:a15e9bbd06a592ed61e8048feb16af0a2386577c","amp;dn":"G.I.+Joe+Retaliation.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a15e9bbd06a592ed61e8048feb16af0a2386577c","infoHashBuffer":{"type":"Buffer","data":[161,94,155,189,6,165,146,237,97,232,4,143,235,22,175,10,35,134,87,124]},"announce":[],"urlList":[]}}