{"title":"Fool Me Twice - Aaron Klein","uid":11707223,"size":2046545,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a190975b919fd2c3df00d0168a6433687b93b163&amp;dn=Fool+Me+Twice+-+Aaron+Klein&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1424179208,"description":"\n\nThis is the game changing book revealing the blueprint for a second term that President Obama and his progressive backers don't want you to know. Months of painstaking research into thousands of documents have enabled investigative journalists and New York Times bestselling authors Aaron Klein and Brenda J. Elliott to expose the secret template for Obama's next four years - the one actually created by Obama's own top advisers and strategists. Just as Obama concealed the true plans for his initial term behind rhetoric of ending partisan differences and cutting the Federal deficit, Obama's re-election theme of creating jobs conceals more than it reveals about his real agenda for a second term. All the main areas of domestic policy are covered - jobs, wages, health care, immigration overhaul, electoral reform, national energy policy. Each of the plans exposed seek to permanently remake America into a government-dominated socialist state. Here are just a few samples from dozens upon dozens of specific schemes unveiled herein: Detailed plans to enact single-payer health care legislation controlled by the Federal government regardless of any Supreme Court decision to overturn Obamacare; The recreation of a 21st century version of FDR's Works Progress Administration (WPA) program within the Department of Labor that would oversee a massive new bureaucracy and millions of new Federal jobs; Further gutting of the U.S. military in shocking ways, while using the savings for a new green stimulus program and the founding of a Federal green bank to fund so-called environmentally friendly projects; The vastly reduced resources of the U.S. Armed Forces will be spread even thinner by using them to combat global warming, fight global poverty, remedy injustice, bolster the United Nations and step up use of peacekeeping deployments; An expansive new amnesty program for illegal aliens linked with a reduction in the capabilities of the U.S. Border Patrol and plans to bring in untold numbers of new immigrants with the removal of caps on H-1B visas and green cards. Fool Me Twice is based on exhaustive research into the coming plans and presidential policies as well as the specific second term recommendations of the major progressive groups behind Barack Obama and the Democratic leadership - the organizations that help to craft the legislation and set the political and rhetorical agenda for the president and his allies. While many have general concerns about Obama's second-term ambitions, Fool Me Twice lays bare the devastating details of a second Obama presidency. If he wins re-election in 2012, the America of equal opportunity for all, Constitutionally-limited government, economic freedom and personal liberty will be but a distant memory.\n\n\nAbout the Author:\n Aaron Klein is an investigative journalist and Jerusalem bureau chief for WorldNetDaily.com. He is a regular on top American radio shows and appears frequently on Fox News Channel and Al Jazeera. He is the author of Schmoozing with Terrorists and The Late Great State of Israel, as well as the host of Aaron Klein Investigative Radio for New York's WABC, the largest radio talk station in the United States","torrent":{"xt":"urn:btih:a190975b919fd2c3df00d0168a6433687b93b163","amp;dn":"Fool+Me+Twice+-+Aaron+Klein","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a190975b919fd2c3df00d0168a6433687b93b163","infoHashBuffer":{"type":"Buffer","data":[161,144,151,91,145,159,210,195,223,0,208,22,138,100,51,104,123,147,177,99]},"announce":[],"urlList":[]}}