{"title":"Audible Rip - John Scalzi - Fuzzy Nation","uid":8155977,"size":134983391,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a1b5cf9dddef0449eabb34c576df4d2031ab98fb&amp;dn=Audible+Rip+-+John+Scalzi+-+Fuzzy+Nation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brianleb","files":73,"time":1361168942,"description":"Publisher's Summary\n\nIn John Scalzi's re-imagining of H. Beam Piper's 1962 sci-fi classic Little Fuzzy, written with the full cooperation of the Piper Estate, Jack Holloway works alone for reasons he doesn't care to talk about. On the distant planet Zarathustra, Jack is content as an independent contractor for ZaraCorp, prospecting and surveying at his own pace. As for his past, that's not up for discussion.\n\nThen, in the wake of an accidental cliff collapse, Jack discovers a seam of unimaginably valuable jewels, to which he manages to lay legal claim just as ZaraCorp is cancelling their contract with him for his part in causing the collapse. Briefly in the catbird seat, legally speaking, Jack pressures ZaraCorp into recognizing his claim, and cuts them in as partners to help extract the wealth.\n\nBut there's another wrinkle to ZaraCorp's relationship with the planet Zarathustra. Their entire legal right to exploit the verdant Earth-like planet, the basis of the wealth they derive from extracting its resources, is based on being able to certify to the authorities on Earth that Zarathustra is home to no sentient species. Then a small furry biped - trusting, appealing, and ridiculously cute - shows up at Jack's outback home. Followed by its family. As it dawns on Jack that despite their stature, these are people, he begins to suspect that ZaraCorp's claim to a planet's worth of wealth is very flimsy indeed and that ZaraCorp may stop at nothing to eliminate the fuzzys before their existence becomes more widely known. \n\n\nif you like it, buy it\n\nwww.scalzi.com","torrent":{"xt":"urn:btih:a1b5cf9dddef0449eabb34c576df4d2031ab98fb","amp;dn":"Audible+Rip+-+John+Scalzi+-+Fuzzy+Nation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1b5cf9dddef0449eabb34c576df4d2031ab98fb","infoHashBuffer":{"type":"Buffer","data":[161,181,207,157,221,239,4,73,234,187,52,197,118,223,77,32,49,171,152,251]},"announce":[],"urlList":[]}}