{"title":"Eastern Plays 2009 DVDRip Sonata Premiere","uid":8541540,"size":733899582,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a20987992207fc3e4019a243323574ecd0fff0ca&amp;dn=Eastern+Plays+2009+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"klinho","files":3,"time":1370397548,"description":"A man dealing with his demons tries to save his brother from being consumed by his own in this streetwise drama from Bulgaria. Christo (Christo Christov) is an artist struggling to hold onto his muse while he works in a furniture shop and wrestles with his addiction to alcohol and hard drugs. Christo has a younger brother named Georgi (Ovanes Torosian) who still lives with their emotionally abusive father (Ivan Nalbantov) and hangs out with a band of hard-drinking skinheads. One night, Christo goes on a bender after breaking up with his girlfriend, and while stumbling home he sees a gang of thugs beating up a Turkish man and his wife; he breaks up the fight but both he and the Turk are injured, the latter seriously enough to requite a stay in the hospital. While checking up on the man he rescued, Christo meets his daughter Isil (Saadet Isil Askoy) and is immediately smitten with her. However, he's crushed when she unexpectedly returns home to Turkey, and he's still carrying the secret that his brother was one of the skinheads who hurt Isil's dad. Eastern Plays proved to be the first and last film for actor Christo Christov; he was a friend of director Kamen Kalev, who wrote the role with Christov in mind, but died in an accident shortly after work was completed on the picture.\n\n\nLanguages: Bulgarian / Turkish / English\n\nSubs srt: Portuguese / English","torrent":{"xt":"urn:btih:a20987992207fc3e4019a243323574ecd0fff0ca","amp;dn":"Eastern+Plays+2009+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a20987992207fc3e4019a243323574ecd0fff0ca","infoHashBuffer":{"type":"Buffer","data":[162,9,135,153,34,7,252,62,64,25,162,67,50,53,116,236,208,255,240,202]},"announce":[],"urlList":[]}}