{"title":"Windows 7 Codec Pack v4.0.3","uid":7440733,"size":20575547,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a21d460e3e16a7f12e49597d8075933b626907e8&amp;dn=Windows+7+Codec+Pack+v4.0.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nzraj","files":2,"time":1342211009,"description":" .S_sSSs           sdSSSSSSSbs         .S_sSSs    \n.SS~YS%%b          YSSSSSSSS%S        .SS~YS%%b   \nS%S   `S%b                 S%S        S%S   `S%b  \nS%S    S%S                S&amp;S         S%S    S%S  \nS%S    S&amp;S               S&amp;S          S%S    d*S  \nS&amp;S    S&amp;S              S&amp;S           S&amp;S   .S*S  \nS&amp;S    S&amp;S             S&amp;S            S&amp;S_sdSSS   \nS&amp;S    S&amp;S            S*S             S&amp;S~YSY%b   \nS*S    S*S           S*S              S*S   `S%b  \nS*S    S*S         .s*S               S*S    S%S  \nS*S    S*S         sY*SSSSSSSP        S*S    S&amp;S  \nS*S    SSS        sY*SSSSSSSSP        S*S    SSS  \nSP                                    SP          \nY                                     Y           \n\n\nWindows 7 Codec Pack is a Windows codec package that includes most audio and video codecs, as well as filters and splitters you would need to play virtually all audio and video files on your system.\n\nThe most important thing when it comes to Windows 7 Codec Pack is the setup process that gives you the power to choose which components you wish to install.\n\nThere are two installation modes, easy and expert, and although most people choose the first one, it's better to go for the latter just to be able to pick the things you want from Windows 7 Codec Pack.\n\nIn addition, you should pay attention to every single step because the installer also attempts to drop an unnecessary toolbar that has nothing in common with Windows 7 Codec Pack. Not to mention that it attempts to change the default search engine and the homepage in your browser.\n\nAfterwards, you are prompted to choose the video codecs and filters, such as ffdshow, XviD Encoder and Flash FLV, the audio codecs and filters, including AC3Filter, LAV Audio, Lame MP3 and DivX Audio, but also some filters, splitters and extras.\n\nLast but not least, Windows 7 Codec Pack gives you the option to associate some popular audio and video formats with Windows Media Player 11 from the get go, including FLAC, FLV, OGG and MKV.\n\nWindows 7 Codec Pack indeed worked pretty smooth during our test and helped us open all audio and video files on the testing machine, without affecting quality by any means.\n\nAll in all, Windows 7 Codec Pack is just another effective codec pack. Don't forget to pay attention to the installer and you should be on the safe side.\n\n\n\n Enjoyyy!\n Seed and Keep Torrents Alive \n \n Safety &amp; Peace","torrent":{"xt":"urn:btih:a21d460e3e16a7f12e49597d8075933b626907e8","amp;dn":"Windows+7+Codec+Pack+v4.0.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a21d460e3e16a7f12e49597d8075933b626907e8","infoHashBuffer":{"type":"Buffer","data":[162,29,70,14,62,22,167,241,46,73,89,125,128,117,147,59,98,105,7,232]},"announce":[],"urlList":[]}}