{"title":"FTV Girls - Carli &amp; Jamie - Girls Day Out","uid":6023009,"size":275335008,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a2893b45286253abd0a14e5e8888e15dfe362b10&amp;dn=FTV+Girls+-+Carli+%26+Jamie+-+Girls+Day+Out&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"phatwarez","files":-1,"time":1291860131,"description":"FTV Girls - Carli &amp; Jamie - Girls Day Out\n\nJamie's Comments: Hi guys, make it my third year now posing for FTV, and I couldn't really come back this whole year because I had an exclusive contract with Penthouse.  They don't let you shoot video with anyone else.  It was a nice surprise that I was going to do a girl-girl with another hottie, in fact probably more my type, a young blonde by the name of Carli.  She's full of energy, and I like that.  Never a downer at any time.  I can't say I'm into oral sex or anything hardcore with any woman, but I do respect and enjoy 'playing' with a girl like her.  I'm picky allright, I want a girl with a nice figure and good smelling body.  It also helps if she's near my height, so I don't look like a giraffe next to her.  We did a lot of kissing in public places, pulled our breasts out and sucked &amp; squeezed them while all kinds of adults were watching.  But man, it was hot outside!  I got dehydrated real fast.  For Carli, nothing phases her.  She was all over me by the time we got to the water fountain and I knew she really had it in for me.  At least she is very light, has some really nice soft skin, and makes a shoot like this enjoyable.  When it was time for my orgasm, I had it, but the heat didn't make it easy for me to squirt.  I got a lot more of that later in the shoot, and had Carli see it since she never has experienced a girl-girl shoot with squirting before.\nCarli's Comments: This was so cool!  The photographer had promised me that we would start at a cafe where I can kiss and play with Jamie in a very public place.  Its totally my thing for sure!  What was soo cute was how a girl came up to us and left a note that she thought we were so beautiful and a special thing going for each other.  I bet she didn't know we were doing this in front of a camera!  I bet she wanted to join in.  She seemed cute but I didn't get a good view of her.  Then a guy came to us and basically wanted to pick us up, and just didn't want to leave!  We said we are lesbian lovers and don't care for guys but he just persisted.  He was also blocking the camera view.  So after kissing and playing with our breasts we headed to a water structure where we dipped our feet in and got each other wet!  Wow the water was cold!  At least its 100 degrees outside so we kept warm.  My jeans got soaking wet but I'm sure you guys don't mind!  Anyways the fun kept on going, I was kissing a hottie like Jamie, playing with her perfect boobs with nice big succable areolas and shooting another fun set on FTV!  The ending part I got to have a nice orgasm from Jamie's toy (wow was it powerful, it makes me jump when it hits my clit!), and she came afterwards too.  The photographer was expecting her to squirt then I guess she was so thirsty and dry that it didn't happen here.\n\nScreens (also in torrent):\n &lt;a href=&quot;\nhttp://kopimg.com/images/kopi_511_Carli_Jamie_Girls_Day_Ou.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kopimg.com/images/kopi_511_Carli_Jamie_Girls_Day_Ou.jpg&lt;/a&gt;\n\nFile Size ------- 262mb\nLength ---------- 34:56\nResolution ------ 640x480\nContainer ------- mkv\nVideo Codec ----- x264\nAudio Codec ----- mp3\nFrame Rate ------ 30\n\np h a t w a r e z . t k\nThanks to (anonymous) for the generous seedbox donation.","torrent":{"xt":"urn:btih:a2893b45286253abd0a14e5e8888e15dfe362b10","amp;dn":"FTV+Girls+-+Carli+%26+Jamie+-+Girls+Day+Out","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2893b45286253abd0a14e5e8888e15dfe362b10","infoHashBuffer":{"type":"Buffer","data":[162,137,59,69,40,98,83,171,208,161,78,94,136,136,225,93,254,54,43,16]},"announce":[],"urlList":[]}}