{"title":"The Son Also Rises (2014) by Gregory Clark, et al","uid":10003273,"size":11305361,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a28c4cedf5247cea77db828ac53f7eb5d5dc2af6&amp;dn=The+Son+Also+Rises+%282014%29+by+Gregory+Clark%2C+et+al&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1398014202,"description":"The Son Also Rises - Surnames and the History of Social Mobility (2014) by Gregory Clark, Neil Cummins, Yu Hao, Daniel Diaz Vidal, et al.pdf\n\nHow much of our fate is tied to the status of our parents and grandparents? How much does this influence our children? More than we wish to believe. While it has been argued that rigid class structures have eroded in favor of greater social equality, The Son Also Rises proves that movement on the social ladder has changed little over eight centuries. Using a novel technique--tracking family names over generations to measure social mobility across countries and periods--renowned economic historian Gregory Clark reveals that mobility rates are lower than conventionally estimated, do not vary across societies, and are resistant to social policies. The good news is that these patterns are driven by strong inheritance of abilities and lineage does not beget unwarranted advantage. The bad news is that much of our fate is predictable from lineage. Clark argues that since a greater part of our place in the world is predetermined, we must avoid creating winner-take-all societies.\n\nClark examines and compares surnames in such diverse cases as modern Sweden, fourteenth-century England, and Qing Dynasty China. He demonstrates how fate is determined by ancestry and that almost all societies--as different as the modern United States, Communist China, and modern Japan--have similarly low social mobility rates. These figures are impervious to institutions, and it takes hundreds of years for descendants to shake off the advantages and disadvantages of their ancestors. For these reasons, Clark contends that societies should act to limit the disparities in rewards between those of high and low social rank.\n\nChallenging popular assumptions about mobility and revealing the deeply entrenched force of inherited advantage, The Son Also Rises is sure to prompt intense debate for years to come.\n\n384 pages\nSeries: The Princeton Economic History of the Western World\nPublisher: Princeton University Press (February 23, 2014)\nLanguage: English\nISBN-10: 0691162549\nISBN-13: 978-0691162546","torrent":{"xt":"urn:btih:a28c4cedf5247cea77db828ac53f7eb5d5dc2af6","amp;dn":"The+Son+Also+Rises+%282014%29+by+Gregory+Clark%2C+et+al","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a28c4cedf5247cea77db828ac53f7eb5d5dc2af6","infoHashBuffer":{"type":"Buffer","data":[162,140,76,237,245,36,124,234,119,219,130,138,197,63,126,181,213,220,42,246]},"announce":[],"urlList":[]}}