{"title":"A Concise History of Modern Europe","uid":14319168,"size":175158115,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a2a65f6617530d77e71a20f8408570b4a6ae8578&amp;dn=A+Concise+History+of+Modern+Europe&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Beanhh123","files":20,"time":1460594862,"description":"Highlighting the key events, ideas, and individuals that have shaped modern Europe, this fresh and lively book provides a succinct history of the continent from the Enlightenment to the present. Drawing on the enduring theme of revolution, David S. Mason explores the causes and consequences of revolution: political, economic, and scientific; the development of human rights; and issues of European identity and integration. He deliberately avoids a detailed chronology of every country and time period by emphasizing the most crucial events in shaping contemporary Europe. Fourteen focused chapters address such topical issues as the Enlightenment; the French Revolution and Napoleon; the Industrial Revolution; the theories and impact of Marx and Darwin; the revolutions of 1848, 1917, and 1989; the unifications of Germany and Italy; European imperialism; the two World Wars; the Cold War and decolonization; and the evolution and expansion of the European Union. Any reader needing a broad overview of the sweep of European history since 1789 will find this book, published in a first edition under the title Revolutionary Europe, an engaging and cohesive narrative","torrent":{"xt":"urn:btih:a2a65f6617530d77e71a20f8408570b4a6ae8578","amp;dn":"A+Concise+History+of+Modern+Europe","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2a65f6617530d77e71a20f8408570b4a6ae8578","infoHashBuffer":{"type":"Buffer","data":[162,166,95,102,23,83,13,119,231,26,32,248,64,133,112,180,166,174,133,120]},"announce":[],"urlList":[]}}