{"title":"Byzantium's Balkan Frontier-A Political Study of the Northern Ba","uid":11469638,"size":2331042,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a30ba6019de9e282be30a74c3398157b031f995a&amp;dn=Byzantium%27s+Balkan+Frontier-A+Political+Study+of+the+Northern+Ba&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"interuniversal","files":-1,"time":1416068442,"description":"\nByzantium's Balkan Frontier-A Political Study of the Northern Balkans, 900-1204\n\nAuthor: Paul Stephenson\n\nISBN: 9780521027564\n\nPublisher: Cambridge University Press\n\nByzantium's Balkan Frontier is the first narrative history in English of the northern Balkans in the tenth to twelfth centuries. Where previous histories have been concerned principally with the medieval history of distinct and autonomous Balkan nations, this study regards Byzantine political authority as a unifying factor in the various lands which formed the empire's frontier in the north and west. It takes as its central concern Byzantine relations with all Slavic and non-Slavic peoples - including the Serbs, Croats, Bulgarians and Hungarians - in and beyond the Balkan Peninsula, and explores in detail imperial responses, first to the migrations of nomadic peoples, and subsequently to the expansion of Latin Christendom. It also examines the changing conception of the frontier in Byzantine thought and literature through the middle Byzantine period.\n\nAn objective appraisal of the early history of the Balkan peoples, including Serbs, Croatians and Albanians, when they were forming distinct identities\nAn important contribution to Byzantine history, integrating archaeological evidence and the latest textual analysis\nAn eastern perspective on the expansion of Latin Christendom and on the crusades","torrent":{"xt":"urn:btih:a30ba6019de9e282be30a74c3398157b031f995a","amp;dn":"Byzantium%27s+Balkan+Frontier-A+Political+Study+of+the+Northern+Ba","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a30ba6019de9e282be30a74c3398157b031f995a","infoHashBuffer":{"type":"Buffer","data":[163,11,166,1,157,233,226,130,190,48,167,76,51,152,21,123,3,31,153,90]},"announce":[],"urlList":[]}}