{"title":"Jonestown - Paradise lost [Discovery NL subs] XviD-MP3 ABR","uid":3929676,"size":548340938,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a38fd3e9cd6194a7d658ff867e01d1380306893e&amp;dn=Jonestown+-+Paradise+lost+%5BDiscovery+NL+subs%5D+XviD-MP3+ABR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Pharos2001","files":1,"time":1197378558,"description":"The People?s Temple, the cult that expired in the mass suicide and murder organized by Jim Jones, is often regarded as a cancer that 1960s utopianism wrought, a disease of idealism splintered and sent off course.\n\nSkip to next paragraph \n \nDavid Bloomer/History Channel\nStephan Jones, son of Jim Jones, in the History Channel documentary. \n\nDavid Bloomer/History Channel\nRick Roberts as Jim Jones in a scene from ?Jonestown: Paradise Lost.? \nBy the early 1970s Mr. Jones, then leading his movement out of San Francisco, had branded himself a Christian Socialist, advocating for the poor and racially oppressed. So respected was he within Northern California?s Democratic Party machine that Willie Brown, then a state assemblyman, once compared him to the Rev. Dr. Martin Luther King Jr. It was in 1977, after temple members started accusing Mr. Jones of abuse and the news media attention around him grew significantly less favorable, that he moved his followers to Jonestown in Guyana, where despite an operating mode of paranoid tyranny he permitted the formation of a commune basketball team.\n\nAmong its most impassioned players was Stephan Jones, one of Mr. Jones?s sons. His testimony, though all too brief, in ?Jonestown: Paradise Lost,? to be broadcast on the History Channel tonight, is reason enough to watch a documentary that would otherwise merely invite dim circumspection.\n\nHaving successfully battled his father to let the team leave the Jonestown compound and play a game in Guyana?s capital in the middle of November 1978, Stephan Jones survived the demise of his father?s ruinous experiment. \n\n?Jonestown: Paradise Lost? methodically clocks through the cult?s final days, when Representative Leo Ryan of California?s 11th District arrived in Guyana with reporters and family members of People?s Temple followers to investigate continued complaints about Mr. Jones?s mistreatment of his supplicants. Just as the group was to leave, Mr. Jones?s gunmen killed Mr. Ryan and the defectors he was taking back to the United States. Cult members killed themselves later that day.\n\nIf Stephan Jones, a trim man on the youthful side of middle age, is mesmerizing to watch, it is because he does not seem to carry the weight of ambivalence with him. He has never grieved for his father, he says dispassionately; he simply doesn?t see the point. ?I knew, I had known for a long time, that my father was nuts,? Mr. Jones says.\n\nOne thousand questions go unasked of him. In another instance, Mr. Jones says, ?Every hour of the day, Jim Jones knew he was a fraud.? At that moment it might have behooved the interviewer to prod with a gentle question like: ?Really? How did you know?? But such questions hang in the air like a dense fog.\n\nMr. Jones is not the only survivor who appears to tell his story, but what drives ?Paradise Lost? at the expense of an inquiring spirit is that hallmark of the contemporary television documentary: the re-enactment. It is one thing to recreate the signing of the Treaty of Ghent, but quite another to deploy the technique to depict events for which there are interesting living witnesses, not to mention archival footage (used only sparingly here).\n\nWhat is the purpose of casting an actor as Jim Jones? The effect, I can tell you, is a reminder that in our collective imagination all cult leaders end up looking like Elvis.\n\nJONESTOWN\n\nParadise Lost\n\n","torrent":{"xt":"urn:btih:a38fd3e9cd6194a7d658ff867e01d1380306893e","amp;dn":"Jonestown+-+Paradise+lost+%5BDiscovery+NL+subs%5D+XviD-MP3+ABR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a38fd3e9cd6194a7d658ff867e01d1380306893e","infoHashBuffer":{"type":"Buffer","data":[163,143,211,233,205,97,148,167,214,88,255,134,126,1,209,56,3,6,137,62]},"announce":[],"urlList":[]}}