{"title":"Grand Theft auto III v1.3 [mindcrasher]","uid":8775493,"size":9367514,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:a3f7521d4af17ff660d589314fbd6359bfd17c9d&amp;dn=Grand+Theft+auto+III+v1.3+%5Bmindcrasher%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mindcrasher","files":-1,"time":1375546421,"description":"In October 2001 in Liberty City, an ambitious criminal and thief named Claude robs a bank with his girlfriend and accomplice, Catalina. They are shown escaping from the Liberty City Bank along with another male accomplice as well as a getaway driver, Miguel, showing in front of the bank with a sports car. A gunshot from the alleyway is heard, indicating the male accomplice has been shot. Claude turns the corner only to find Catalina pointing two pistols at him. She tells him that she is ambitious and that he is just &quot;small time&quot; before shooting him and leaving him for dead. Catalina then escapes with Miguel. Although Claude survives the wound, he is arrested and sentenced to 10 years.\nAs he is transported in a prison truck over Callahan Bridge, the Colombian Cartels ambushes Claude's police convoy for a prisoner, inadvertently freeing Claude and a fellow prisoner, 8-Ball, in the process. Suddenly, a dropped bomb explodes, killing everyone but the duo and destroying a part of the bridge, isolating Portland Island from the rest of the city. 8-Ball leads Claude to a safehouse and introduces him to the Leone mafia crime family; Sex Club 7 owner Luigi Goterelli, Salvatore Leone, the Don of the family, his Capo Toni Cipriani and the Don's son Joey Leone. During work for the family, Claude finds himself fighting the Colombians, who are being led by Catalina in proliferating a new drug, &quot;SPANK&quot;. Meanwhile, Salvatore's trophy wife Maria, begins to take a liking to Claude. Salvatore grows suspicious and leads Claude to a death trap, but Maria saves him and they both flee to Staunton Island.\n\n\nIF YOU LIKE MY TORRENTS LOOK AT MY BRO'S TORRENTS \n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/ChivveZ/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/ChivveZ/&lt;/a&gt;","torrent":{"xt":"urn:btih:a3f7521d4af17ff660d589314fbd6359bfd17c9d","amp;dn":"Grand+Theft+auto+III+v1.3+%5Bmindcrasher%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3f7521d4af17ff660d589314fbd6359bfd17c9d","infoHashBuffer":{"type":"Buffer","data":[163,247,82,29,74,241,127,246,96,213,137,49,79,189,99,89,191,209,124,157]},"announce":[],"urlList":[]}}