{"title":"Boardwalk.Empire.S05E07.720p.HDTV.x264-KILLERS","uid":11250522,"size":1188883474,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a40cfc3729e22cc3b711e8a1f505748f652cfd9a&amp;dn=Boardwalk.Empire.S05E07.720p.HDTV.x264-KILLERS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Thhaque","files":3,"time":1413821706,"description":"[b]Boardwalk Empire\n\n[IMG]http://i.imgur.com/6tVFVza.jpg[/IMG]\n\nGenre: Drama, Family\nYear: 2014\nCountry: USA\nRuntime: 45 min\nProducer: Terence Winter\nCast: Anna Katarina, Steve Buscemi, Michael Pitt, Todd Fredericks, William Hill, Jack Huston\n\n.: Plot :.\nA bustling little city by the seashore, totally dependent upon money spent by tourists, Atlantic City's popularity rose in the early 20th century and peaked during Prohibition. The resort's singular purpose of providing a good time to its visitors-whether lawful or not-demanded a single mentality to rule the town. Success of the local economy was the only ideology, and critics and do-gooders weren't tolerated.\n\nBy 1900, a political juggernaut, funded by payoffs from gambling rooms, bars, and brothels, was firmly entrenched. For the next 70 years, Atlantic City was dominated by a partnership comprised of local politicians and racketeers. This unique alliance reached full bloom in the person of Enoch &quot;Nucky&quot; Johnson-the second of three bosses to head the Republican machine that dominated city politics and society.\n\nIn &quot;Boardwalk Empire&quot;, Nucky Johnson, Louis &quot;the Commodore&quot; Kuehnle, Frank &quot;Hap&quot; Farley, and Atlantic City itself spring to life in all their garish splendor. Author Nelson Johnson traces &quot;AC&quot; from its humble beginnings as Jonathan Pitney's seaside health resort, through the notorious backroom politics and power struggles, to the city's astonishing rebirth as an entertainment and gambling mecca where anything goes.\n\n&quot;Boardwalk Empire&quot; is a colorful, irresistible history of a unique city and culture. Here is proof positive that truth is stranger-and more compelling-than fiction.[/b]","torrent":{"xt":"urn:btih:a40cfc3729e22cc3b711e8a1f505748f652cfd9a","amp;dn":"Boardwalk.Empire.S05E07.720p.HDTV.x264-KILLERS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a40cfc3729e22cc3b711e8a1f505748f652cfd9a","infoHashBuffer":{"type":"Buffer","data":[164,12,252,55,41,226,44,195,183,17,232,161,245,5,116,143,101,44,253,154]},"announce":[],"urlList":[]}}