{"title":"Mr. Bean - It's Bean 20 years DVD 1 (7 subs)(thomaske) 2lions-T","uid":5886811,"size":4509945844,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a5d9c95c9e57d58e1b0dfecc4916e19c5f3c6930&amp;dn=Mr.+Bean+-+It%5C%27s+Bean+20+years+DVD+1+%287+subs%29%28thomaske%29+2lions-T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Thomas1234555","files":34,"time":1287085490,"description":"Mr. Bean - It's Bean 20 years 1\nDVD \nCast: Matilda Ziegler, Rowan Atkinson\nRegie: Paul Weiland, John Birkin\nSeptember 2010 | 125 Minuten\nOmschrijving:\n\nMR. BEAN\nDe originele proefopname, die in 1990 de Gouden Roos van Montreux won, liet ons allemaal kennismaken met de verwardste man ter wereld, zijn persoonlijkheid is een afgrijselijke mengeling van gemeenheid, onschuld en vindingrijkheid. Of hij nu EEN EXAMEN aflegt en geen enkele vraag weet, of OP HET STRAND is, waar hij zijn zwembroek wil aantrekken zonder zijn pantalon uit te doen, of in DE KERK zit, waar hij wanhopige pogingen onderneemt om wakker te blijven, Mr. Bean vindt altijd wel een uitweg, waar niemand anders ooit aan gedacht zou hebben.\n\nWELTERUSTEN MR. BEAN\nIn het ziekenhuis verlies ik mijn geduld in de WACHTKAMER maar ik beleef een fantastische tijd bij Windsor Castle met ÃƒÂ©ÃƒÂ©n van Hare Majesteits PALEISWACHTEN. Eindelijk heb ik hen zo ver dat ik een leuke foto van hem kan maken. Later heb ik last van SLAPELOOSHEID, maar dat geeft mij juist inspiratie voor ÃƒÂ©ÃƒÂ©n van mijn allerbeste dierenimitaties sinds jaren (al zeg ik zelf...).\n\nPAS OP DE BABY, MR. BEAN!\nIk had eerlijk gezegd gerekend op een gezellige dag op de kermis toen de baby letterlijk vanuit het niets opdook, ik bedoel letterlijk! Ik probeer hem zo goed als ik kan (baby's kunnen zo zeuren) te sussen, we doen een beetje hotsebots in de botsautootjes, ik verschoon zelfs zijn luier nadat hij een geurige waarschuwing gaf (pffff... gasmaskers op). Gelukkig vliegt hij snel naar zijn moeder terug (ik bedoel letterlijk!) en alles is okÃƒÂ©! Tot ik weer in mijn autootje stap...\n\nDE RAMPZALIGE MR. BEAN\nMr. Bean zit weer achter het stuur van zijn Mini en is zich totaal niet bewust van de gevolgen die zijn slechte rijgedrag op andere weggebruikers heeft. Een klein blauw driewielertje bekijkt de wereld weer van een heel andere kant. \nBij een bezoekje aan HET ZWEMBAD wil Mr. Bean eerst vreselijk graag van de hoge springplank duiken, maar ontdekt dat hij dit toch eigenlijk niet durft. Hij verliest al snel zijn zelf-respect... en zijn zwembroek. \nOp HET BANKJE IN HET PARK laat Mr. Bean ons nog meer zinloze vindingrijkheid zien, als hij voor zichzelf een sandwich klaarmaakt. Mr. Bean is ervan overtuigd, dat een GRIEZELFILM voor hem het toppunt van vermaak is. Totdat de film begint.\n\nTracklist:\n\nDISK 1\n1. Mr. Bean\n2. De terugkeer van Mr. Bean\n3. De rampzalige Mr. Bean\n4. Mr. Bean gaat de stad in\n5. De moeilijkheden met Mr. Bean\n\n\n\n\nDetails:\n\nCast Matilda Ziegler, Rowan Atkinson \nRegie Paul Weiland, John Birkin \nSpeelduur 125 minuten \nBeeldformaat 4:3 \nGeluidsformaat Dolby Digital 2.0 \nOndertiteling Deens - Duits - Engels - Frans - IJslands - Italiaans - Nederlands - Noors - Pools - Portugees - Zweeds \nTalen Engels \nVerpakking Amaray-type \nJaar 2010 \nLand Groot Britannie \nMedia 1 Disc \n*****************************************\n\nBrought to you by\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons NIEUWE forum\n\nNEW NEW ***** http://2lions-site.nl ***** NEW NEW\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden.\n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nTo the fakers Get a Live","torrent":{"xt":"urn:btih:a5d9c95c9e57d58e1b0dfecc4916e19c5f3c6930","amp;dn":"Mr.+Bean+-+It%5C%27s+Bean+20+years+DVD+1+%287+subs%29%28thomaske%29+2lions-T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5d9c95c9e57d58e1b0dfecc4916e19c5f3c6930","infoHashBuffer":{"type":"Buffer","data":[165,217,201,92,158,87,213,142,27,13,254,204,73,22,225,156,95,60,105,48]},"announce":[],"urlList":[]}}