{"title":"Nabari no Ou Full Series","uid":4684636,"size":5740057018,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a66b0f2a96bd0f495e004a7291a58d73c8a48e53&amp;dn=Nabari+no+Ou+Full+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kurogamon","files":27,"time":1233188831,"description":"Full Series\n[AonE/Conclave Hardsubs ep 1-17]\n[Yuurisan Hardsubs ep 18-19]\n[imur88 Softsubs ep 20-26]\n\nFormat: Varying between XviD and x264\nResolution: Varies (704x396, 1280x720, 704x400)\n\nDescription:\n(from ANN)\n\nRokujou Miharu is a boy who has a hijutsu (hidden technique) living inside of him. This hijutsu is the power of creation. Many ninja clans are seeking it as the one who possesses it becomes the ruler of the ninja world. Rokujou's classmate Kouichi started a nindou (&quot;Way of the Ninja&quot;) club at school with Kumohira, his English teacher. Both Kouichi and Kumohira are secretly ninjas. They tried to persuade Rokujou to join the ninjutsu club. At first, he was reluctant, but after being attacked by group of ninjas trying to get his hijutsu, he joins. He must become the Ruler of Nabari in order to survive.\n\nOther Information: AniDB\n\nTrailer:\n\nRelease Notes:\n(by Shifty)\n\nSeeing as there is not a single complete Nabari No Ou subbed torrent, I decided to take the liberty and download each individual episode from various subbers and compile them into a single release. The reason for this is because Funimation decided to send cease and desist orders to all fansubbers to avoid copyright violations, even though Funimation did not yet own the rights to the anime (they do now however, they plan on releasing the dub sometime this year). Some subbers braved the threats and subbed anyway.\n\nVideo quality is generally very good, however the sub quality varies between the subbers.\n\nEnjoy!\n\nOH, AND JUST A REMINDER TO PLEASE SEED WHEN YOU'RE FINISHED DOWNLOADING, ESPECIALLY IN THE EARLY STAGES OF THIS TORRENT.\n\nGrats to ShiftySon for the original upload @ Demonoid.","torrent":{"xt":"urn:btih:a66b0f2a96bd0f495e004a7291a58d73c8a48e53","amp;dn":"Nabari+no+Ou+Full+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a66b0f2a96bd0f495e004a7291a58d73c8a48e53","infoHashBuffer":{"type":"Buffer","data":[166,107,15,42,150,189,15,73,94,0,74,114,145,165,141,115,200,164,142,83]},"announce":[],"urlList":[]}}