{"title":"WEB Development Tools","uid":5874516,"size":667893967,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a766395c5ba39cc948242853fa58c7e9cc974c97&amp;dn=WEB+Development+Tools&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jmbmhs","files":12,"time":1286563778,"description":"1. 3D Button Creator - create 3D buttons for your site in minutes.\n\n2. Amara Flash Suite\n\nThis suite contain all 5 animation applications: News Ticker, Menu Builder, Intro-Banner Builder, Slideshow Builder, and Photo Animation Software.\n\nAmara Software provides affordable animation software solutions to create a wide variety of Flash Player compatible text and photo effects and web animations. Its saves your creations in the popular SWF file format, which can be used in any website and viewed in the Adobe Flash Player. No knowledge of Flash is needed to create animations with Amara Softwares.\n\n\nNews Ticker creates horizontal and vertical Flash Player compatible news tickers instantly. It only takes a few quick steps to create a complete news ticker or scroller. No knowledge of Flash required to use our software.\n\nIntro and Banner Builder is the ultimate Flash Player compatible text effect tool to help web designers create and design animated intros, ads, banners, and any other textual animation. No knowledge of Flash required.\n\nMenu and Button Maker creates horizontal and vertical Flash Player compatible menus for your website fast and easily. Create navigation bars, scrolling menus with sub menus in minutes. No knowledge of Flash required.\n\nSlideshow Builder is a low-cost no-nonsense Flash Player compatible slideshow builder to help web designers create and design animated slideshows. No knowledge of Flash is required to build slide shows or photo albums.\n\nPhoto Animation Software lets you create professional Flash Player compatible virtual tours through your still photos via keypoints you insert, to guide your website visitors along an animated path in each photo.\n\n3.Arles Image Web Page Creator.\nCreates image albums to put on your website in a jiffy.\n\n4.EximiousSoft GIF Creator is a kind of powerful,rapid and           \n  visual GIF design tool. With dozens of Special good           \n  effects,it can help you make out amazing animations or           \n  banners within short time.          \n                                                                                \n  EximiousSoft GIF Creator provides many professional           \n  image-editing tools including seletion tools such as Magic           \n  wand tool and Lasso tool as well as many geometric shapes           \n  selection tools.          \n                                                                                \n  Once you have made a selection on an animation, you can           \n  directly edit on this area without any effects to others.           \n  Moreover, you can also copy, move or delete this area           \n  according to your needs.          \n                                                                                \n  EximiousSoft Gif Creator has strong support to vector           \n  graphics. You can use it drawing out excellent smooth           \n  straight line, rounded rectangle, ellipse and other geometric           \n  shapes.          \n                                                                                \n  Besides, EximiousSoft GIF Creator can produce many texts or           \n  symbols with surprising quality. By adding Outline or shadow,           \n  the texts and symbols will have very strong 3d vision effects.          \n                                                                                \n  Every time when EximiousSoft GIF Creator output an GIF           \n  animation, it will optimize it by greatest degree at first           \n  for creating out smallest GIF file. But it\\\\\\'s still able to           \n  wholly maintain the original quality of the picture.          \n                                                                              \n  What\\\\\\'s more, since all edits of this program are visual, you           \n  can view the edit results directly as well as cancel any           \n  operation at any time. it\\\\\\'s very easy-used and convenient.          \n                                                                               \n  EximiousSoft GIF Creator supports inputting and outputting a           \n  great deal of different animation formats and image formats.           \n  Such as GIF, AVI, BMP, PCX, JPG, TIFF, PNG, TGA, PSD, ICO,           \n  CUR,ANI, SWF etc.\n5.Filezilla 3.3.4 (No description needed I think)\n\n6.Flash Effect Maker - create flash effect quickly.\n\n7.PHP Designer.( I just have it, don\\\\\\'t know how to use it.)\n\n8.Serif WebPlus X2 - One of the best WYSIWYG programmes.\n\n9.Wondershare Flash Gallery Factory.\n\n10. Wondershare Flash Slide Show Builder.\n\n11. WYSIWYG Web Builder - The easiest web builder I have seen.\n\nThese are all collected from either TPB or torrenreactor.net and can be downloaded separately. Thanks to the individual uploaders.\n\nAvast 5.0.677 reported the files to be clean. They are all running on my PC without any hustle.\n\nShall be seeding as usual from 2 to 8 am Indian standard time.\n\nPlease KEEP ON COMMENTING.","torrent":{"xt":"urn:btih:a766395c5ba39cc948242853fa58c7e9cc974c97","amp;dn":"WEB+Development+Tools","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a766395c5ba39cc948242853fa58c7e9cc974c97","infoHashBuffer":{"type":"Buffer","data":[167,102,57,92,91,163,156,201,72,36,40,83,250,88,199,233,204,151,76,151]},"announce":[],"urlList":[]}}