{"title":"PetiteBallerinasFucked - Jessi (Tiny Ballet Beauty) NEW 21 July","uid":15368287,"size":158640308,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a81564ce59586fde204555eae42af3ed877a7546&amp;dn=PetiteBallerinasFucked+-+Jessi+%28Tiny+Ballet+Beauty%29+NEW+21+July+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1469101390,"description":"Cock craving coed Jessi can't keep her hands off of her ballet partner Nick Ross, not that he minds! When Jessi peels her leotard down to bare her small tits and then drops to her knees, Nick eagerly whips out his dick for her enjoyment. Reaching out, she takes it into her hands and then wraps her soft lips around the head to suck him off.Nick returns the favor by getting Jessi out of her remaining clothes and then latching on to her soft bald fuck hole with his mouth to eat her out. Replacing his mouth with his fingers, Nick leans Jessi forward over her ballet barre to slide his fingers deep into her needy twat, followed by his hot hard fuck stick. It's not long before Jessi is eagerly bouncing away on Nick's cock and riding him like her personal steed.Laying on her side, Jessi lifts one leg to give Nick all the spooning access he needs to take her juicy snatch hard and fast. He brings her to a swift climax, and moments later Jessi returns the favor. When Nick is on the edge of cumming, Jessi helps him pull out and then strokes him off until he explodes all over her flat belly to cover her in jizz.\r\nCategories: Small Boobs Shaved Pussy Short Girls Brunette Long hair Hardcore Petite Blowjob Pussy Licking Ballerina\r\n \nhttp://imgdone.com/viewer.php?file=07550579231171610607.jpg\r\n \nhttp://imgdone.com/viewer.php?file=07499326405507400350.jpg","torrent":{"xt":"urn:btih:a81564ce59586fde204555eae42af3ed877a7546","amp;dn":"PetiteBallerinasFucked+-+Jessi+%28Tiny+Ballet+Beauty%29+NEW+21+July+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a81564ce59586fde204555eae42af3ed877a7546","infoHashBuffer":{"type":"Buffer","data":[168,21,100,206,89,88,111,222,32,69,85,234,228,42,243,237,135,122,117,70]},"announce":[],"urlList":[]}}