{"title":"The World At War 28of28 DVD Extras 720p Egilman","uid":11268165,"size":9525544667,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:a847b6a96784e1dde3f560d2ed8932f0ad0146ba&amp;dn=The+World+At+War+28of28+DVD+Extras+720p+Egilman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Egilman","files":-1,"time":1414052556,"description":"The World at War, a 26-episode series on World War II, premiered on Wednesday, the 31st of October, 1973, and subsequent episodes played each Wednesday afternoon through May 1974. Each one hour episode dealt with some aspect of World War II: the rise of Nazi Germany, The &quot;Phoney&quot; War, The Battle of France, The Battle of Britain, The invasion of the Soviet Union, The Entrance of the USA to the war, Stalingrad, etc. Each episode was composed of archival footage originally accumulated by the U.S., British, Russian, Japanese or German services. The use of color footage was a first for broadcast television. Prior to this color footage was converted to B&amp;W. At the time color footage of the war was thought to be rare. (we know today that 90% of the combat footage shot by the allies was shot in color) The drama of the production was enhanced by Laurence Olivier's lilting narration and by Carl Davis's haunting musical score. The series introduced and made great use of the interviews of major participants, not the celebrated heroes, but the people close to them who were actually involved and witnessed the events.\n\nThe World at War is marked as a masterpiece of episodic documentary television. (a genre created by the epic &quot;Victory At Sea) And has gained archival status amongst historians. (the series has been criticized by some for it's objectivity, claiming a British slant to the factual presentation, which Jeremy Issacs admits to in the making of the series extra. You must accept the fact that is is a British produced series which doesn't distract at all from the overall presentation. It still plays very well after all these years and is the most even handed of all the WWII documentary presentations)\n\nThis release comes from my rip of the 2004 A&amp;E Home Video 11 disc DVD set and includes the 11 extras accompanying the episodes, It is coded in x264 and AAC sound at 960x720p (4x3) resolution. It is in full color as shown on TV broadcast back in 1973 and I have done no alteration to the video or sound.\n\nExtras Volume Two   (From the original VHS release)\n\n   The Final Solution: Part One\n   The Final Solution: Part Two\n\n(From the 2004 DVD release)\n\n   Making The Series: A 30th Anniversary Retrospective (2004)\n   Experiences of War (2004)","torrent":{"xt":"urn:btih:a847b6a96784e1dde3f560d2ed8932f0ad0146ba","amp;dn":"The+World+At+War+28of28+DVD+Extras+720p+Egilman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a847b6a96784e1dde3f560d2ed8932f0ad0146ba","infoHashBuffer":{"type":"Buffer","data":[168,71,182,169,103,132,225,221,227,245,96,210,237,137,50,240,173,1,70,186]},"announce":[],"urlList":[]}}