{"title":"Fortress Monasteries of the Himalayas","uid":11771215,"size":7215243,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a874ab438bb175f6bc042d9702a5be3724520747&amp;dn=Fortress+Monasteries+of+the+Himalayas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427088720,"description":"Buddhism has been influential in the mountain kingdoms of the Himalayas since the 7th century AD, most notably in the kingdom of Tibet where it permeated all aspects and levels of society until the 20th century. From the 9th-century AD onwards, the secular rulers of Tibet sought to extend their influence, and that of Buddhism, throughout the region. To this end, huge stone and mud-brick fortifications, known as dzongs, were constructed to dominate the secular landscape, while massive Buddhist monasteries dominated the religious - both following a very specific style of Tibetan architecture. It has been estimated that as many as 3,000 monasteries were built along with 200 dzongs.\n\nMongol invasions from the 12th century onwards provided another influence, while internecine fighting in the 17th century led to increased fortification of the monasteries and the rise of the Dalai Lama as the head of a theocracy in Tibet, centred on the Potala Palace in Lhasa - a true fusion between secular dzong and religious monastery.\nElsewhere in the Tibetan-influenced Himlayas the Buddhist Indian Kashmiri kingdom of Ladakh withstood assaults by both Muslims and Sikhs and developed a style of fortress monastery located on rocky peaks for defence, these often became combined with the fortified palaces of the rulers of Ladakh. With the foundation of Bhutan in the 17th century, further fortified monasteries were created in an effort to protect the new state's independence form the Dalai Lama.\n\nThese fortifications have survived largely intact through today, as Chinese control over the Tibetan Autonomous Region has led to the destruction of the vast majority of the fortified monasteries and dzongs of that particular area.\n\nThis title recreates the dramatic and colorful fortifications created in these mountain kingdoms, and recounts their operational history through the foreign incursions, religious conflicts and civil wars that litter their history, right through to the Tibetan uprising and flight of the Dalai Lama form the Potala Palace in 1959","torrent":{"xt":"urn:btih:a874ab438bb175f6bc042d9702a5be3724520747","amp;dn":"Fortress+Monasteries+of+the+Himalayas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a874ab438bb175f6bc042d9702a5be3724520747","infoHashBuffer":{"type":"Buffer","data":[168,116,171,67,139,177,117,246,188,4,45,151,2,165,190,55,36,82,7,71]},"announce":[],"urlList":[]}}