{"title":"Connie Smith - Born To Sing [1964-1967] 4CD Bear Family","uid":7864132,"size":771883461,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a88f42e093877522e6bf290c87d00d5a2e37b27f&amp;dn=Connie+Smith+-+Born+To+Sing+%5B1964-1967%5D+4CD+Bear+Family&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bonnie335","files":147,"time":1353974748,"description":"Connie Smith - Born To Sing  [1964-1967] 4CD \n\nBear Family Records. Release: 2001. 320kpbs.\n\n\nThis set is one of the many reasons why Bear Family is the reissue label of many kinds of American roots music -- especially country, rockabilly, Western swing and bluegrass. Connie Smith, who still records on occasion today, was one of countrypolitan's first country music superstars of her gender after Patsy Cline, whom she was often compared to because she came onto the scene with the number one single &quot;Once a Day&quot; (penned by Bill Anderson who got her a record deal). These four discs document her amazing RCA career in 127 cuts! While it's true that Smith recorded for Columbia and Monument, it was the RCA sides that cemented her reputation as both a performer and as a songwriter. While Smith has less than a handful of her own cuts here, it hardly matters. She worked with the top songwriters in the business at the time, including Anderson who wrote for her until she semi-retired. Others include Dallas Frazier, Bobby Bare, Albert Brumley, Hank Cochran, Arthur Smith, June Carter Cash, and Jimmie Davis. Her entire RCA output is here, and taken as a whole or in parts, it is stunning and reflects the height of the country music establishment in the '60s and the countrypolitan sound. That said, Smith's voice is what remains center-stage here; her sophisticated emotional delivery, her control and phrasing remain a high-water mark today. \n","torrent":{"xt":"urn:btih:a88f42e093877522e6bf290c87d00d5a2e37b27f","amp;dn":"Connie+Smith+-+Born+To+Sing+%5B1964-1967%5D+4CD+Bear+Family","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a88f42e093877522e6bf290c87d00d5a2e37b27f","infoHashBuffer":{"type":"Buffer","data":[168,143,66,224,147,135,117,34,230,191,41,12,135,208,13,90,46,55,178,127]},"announce":[],"urlList":[]}}