{"title":"The Hold Steady - Discography (2004-2014) [FLAC]","uid":9859403,"size":4453020422,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a8e42346db7244639a00270288744a36b495ced1&amp;dn=The+Hold+Steady+-+Discography+%282004-2014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1396226209,"description":"\n  The Hold Steady - Discography (2004-2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Alternative\n  Source: CD, vinyl, WEB\n  Codec: FLAC\n  Bitrate: ~ 1,000 - 2,900 kbps\n  Bit Depth: 16, 24\n  Sample Rates: 44.1 kHz, 96 kHz\n\n  CD Rips 16/44\n\n  2004 Almost Killed Me\n  2005 Separation Sunday\n  2006 Boys and Girls in America\n  2007 Live at Fingerprints (Live)\n  2008 Stay Positive \n  2009 A Positive Rage (Live)\n  2010 Heaven is Whenever\n  2014 Teeth Dreams (WEB)\n\n  Vinyl Rips 24/96\n\n  2005 Separation Sunday\n  2008 Stay Positive \n\n  Resisting the musical trends in New York City, vocalist/guitarist Craig Finn (ex-Lifter Puller) formed the Hold Steady after moving from Minneapolis in 2000. Wanting to capture the sound of bands such as the Replacements and the Grifters, he recruited guitarist Tad Kubler (also ex-Lifter Puller), drummer Judd Counsell, and bassist Galen Polivka. Recording mostly live, the band released its debut, Almost Killed Me, on Frenchkiss Records in March 2004. Dave Gardener (Rocket from the Crypt, Drive Like Jehu) and Dean Botulonis signed on to produce Separation Sunday, which arrived in 2005. The World/Inferno Friendship Society's Franz Nicolay (keyboards) and Bobby Drake (drums), formerly of End Transmission and Arm, were also added to the Hold Steady lineup. The band's third effort, 2006's Boys and Girls in America, marked its first release for Vagrant. \n\n  After writing the majority of their fourth record on the road, the Hold Steady returned to John Agnello's Water Music studio to record Stay Positive, their most heavily produced effort. In July of 2008, the album was released by both Vagrant and Rough Trade. In 2010 the band announced the departure of Franz Nicolay. Later that same year they released their fifth album, Heaven Is Whenever. In 2012 the band went on a brief hiatus, with frontman Craig Finn releasing his debut solo album, Clear Heart Full Eyes. Regrouping with new guitarist Steve Selvidge in 2013, the revitalized five-piece re-entered the studio to record a track for the Game of Thrones soundtrack -- which was also released as a limited-edition single on Record Store Day 2013. Near the beginning of 2014 they announced the release of their sixth album, Teeth Dreams.\n\n  *Thank you to the original uploaders and rippers.\n\n  **Note to downloaders, please don't complain if something isn't included in this discography.  I have assembled as much material as I could find.  If something is missing you can try to find it and upload it for the community.  Asking for it here wont help.","torrent":{"xt":"urn:btih:a8e42346db7244639a00270288744a36b495ced1","amp;dn":"The+Hold+Steady+-+Discography+%282004-2014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8e42346db7244639a00270288744a36b495ced1","infoHashBuffer":{"type":"Buffer","data":[168,228,35,70,219,114,68,99,154,0,39,2,136,116,74,54,180,149,206,209]},"announce":[],"urlList":[]}}