{"title":"Basics of PET Imaging: Physics, Chemistry &amp; Regulations","uid":6499677,"size":2078897,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa0565cca7be4b89ff682cb05982318530a4ea16&amp;dn=Basics+of+PET+Imaging%3A+Physics%2C+Chemistry+%26+Regulations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1309202619,"description":"Basics of PET Imaging: Physics, Chemistry, and Regulations\nSpringer; 1 edition | November 24, 2004 | ISBN-10: 0387213074 | 208 pages | PDF | 2 MB\n\nThis unparalleled text on the basics of PET imaging technology is an ideal resource for technologists and residents preparing for board examinations and also serves as a useful reference for practicing nuclear medicine professionals. Written by noted author Gopal B. Saha, Ph.D., the book consists of concise but comprehensive chapters that emphasize the fundamentals, including physics, instrumentation and data acquisition, image reconstruction, production of PET radionuclides and radiopharmaceuticals, and regulatory and reimbursement issues. Reviews of Dr. Saha's other best-selling titles consistently cite his ability to make difficult subjects accessible; this book is no exception. To maximize understanding, topics are complete with assessment questions, reviews of pertinent basic science, and lists of suggested reading. Helpful illustrations reinforce key concepts. A wealth of valuable data is presented in practical tables and appendixes as well. The remarkable combination of brevity and clarity of content makes it an ideal text and reference book for nuclear medicine professionals interested in basics of PET imaging. ","torrent":{"xt":"urn:btih:aa0565cca7be4b89ff682cb05982318530a4ea16","amp;dn":"Basics+of+PET+Imaging%3A+Physics%2C+Chemistry+%26+Regulations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa0565cca7be4b89ff682cb05982318530a4ea16","infoHashBuffer":{"type":"Buffer","data":[170,5,101,204,167,190,75,137,255,104,44,176,89,130,49,133,48,164,234,22]},"announce":[],"urlList":[]}}