{"title":"Silicon Nanoelectronics - Shunri Oda, David Ferry","uid":15539042,"size":11861010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa3625df488f4d3e0efe9e5e00a3691522753dfd&amp;dn=Silicon+Nanoelectronics+-+Shunri+Oda%2C+David+Ferry&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1470909174,"description":"Silicon Nanoelectronics - Shunri Oda, David Ferry (CRC, 2006).pdf\r\n\r\nTechnological advancement in chip development, primarily based on the downscaling of the feature size of transistors, is threatening to come to a standstill as we approach the limits of conventional scaling. For example, when the number of electrons in a device's active region is reduced to less than ten electrons (or holes), quantum fluctuation errors will occur, and when gate insulator thickness becomes too insignificant to block quantum mechanical tunneling, unacceptable leakage will occur. Fortunately, there is truth in the old adage that whenever a door closes, a window opens somewhere else. In this case, that window opening is nanotechnology. \r\n\r\nSilicon Nanoelectronics takes a look at at the recent development of novel devices and materials that hold great promise for the creation of still smaller and more powerful chips. Silicon nanodevices are positoned to be particularly relevant in consideration of the existing silicon process infrastructure already in place throughout the semiconductor industry and silicon's consequent compatibility with current CMOS circuits. This is reinforced by the nearly perfect interface that can exist between natural oxide and silicon. \r\n\r\nPresenting the contributions of more than 20 leading academic and corporate researchers from the United States and Japan, Silicon Nanoelectronics offers a comprehensive look at this emergent technology. The text includes extensive background information on the physics of silicon nanodevices and practical CMOS scaling. It considers such issues as quantum effects and ballistic transport and resonant tunneling in silicon nanotechnology. A significant amount of attention is given to the all-important silicon single electron transistors and the devices that utilize them.\r\n\r\nIn offering an update of the current state-of-the-art in the field of silicon nanoelectronics, this volume serves well as a concise reference for students, scientists, engineers, and specialists in various fields, including electron device technology, solid-state physics, and nanotechnology","torrent":{"xt":"urn:btih:aa3625df488f4d3e0efe9e5e00a3691522753dfd","amp;dn":"Silicon+Nanoelectronics+-+Shunri+Oda%2C+David+Ferry","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa3625df488f4d3e0efe9e5e00a3691522753dfd","infoHashBuffer":{"type":"Buffer","data":[170,54,37,223,72,143,77,62,14,254,158,94,0,163,105,21,34,117,61,253]},"announce":[],"urlList":[]}}