{"title":"Tor Browser Bundle v4.0 The Onion Router for Mac OS X 10.6+","uid":11245156,"size":39336061,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:aa4dfba7383ead769479008ca15d9ea52d91fd3e&amp;dn=Tor+Browser+Bundle+v4.0+The+Onion+Router+for+Mac+OS+X+10.6%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CCnOSnBT","files":-1,"time":1413731527,"description":"What is the Tor Browser Bundle?\n\nThe Tor software protects you by bouncing your communications around a distributed network of relays run by volunteers all around the world: it prevents somebody watching your Internet connection from learning what sites you visit, it prevents the sites you visit from learning your physical location, and it lets you access sites which are blocked.\n\nThe Tor Browser Bundle lets you use Tor on Windows, Mac OS X, or Linux without needing to install any software. It can run off a USB flash drive, comes with a pre-configured web browser to protect your anonymity, and is self-contained.\n\nWhat is Tor?\n\nTor is free software and an open network that helps you defend against a form of network surveillance that threatens personal freedom and privacy, confidential business activities and relationships, and state security known as traffic analysis\n\nWhy Anonymity Matters\n\nTor protects you by bouncing your communications around a distributed network of relays run by volunteers all around the world: it prevents somebody watching your Internet connection from learning what sites you visit, and it prevents the sites you visit from learning your physical location. Tor works with many of your existing applications, including web browsers, instant messaging clients, remote login, and other applications based on the TCP protocol.\n\nWant Tor to really work?\n\nYou need to change some of your habits, as some things won't work exactly as you are used to. Please read the full list of warnings for details.\n    &lt;a href=&quot;\nhttps://tor.eff.org/download/download-easy.html.en#warning&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://tor.eff.org/download/download-easy.html.en#warning&lt;/a&gt;","torrent":{"xt":"urn:btih:aa4dfba7383ead769479008ca15d9ea52d91fd3e","amp;dn":"Tor+Browser+Bundle+v4.0+The+Onion+Router+for+Mac+OS+X+10.6%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa4dfba7383ead769479008ca15d9ea52d91fd3e","infoHashBuffer":{"type":"Buffer","data":[170,77,251,167,56,62,173,118,148,121,0,140,161,93,158,165,45,145,253,62]},"announce":[],"urlList":[]}}