{"title":"Better Brain at Any Age: The Holistic Way to Improve Your Memor","uid":8355406,"size":1111473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa6e6fdf61a336f3fb7934808ab83a97d463fece&amp;dn=+Better+Brain+at+Any+Age%3A+The+Holistic+Way+to+Improve+Your+Memor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1365480178,"description":"Sondra Komblatt, &quot;A Better Brain at Any Age: The Holistic Way to Improve Your Memory, Reduce Stress, and Sharpen Your Wits&quot;\nISBN: 1573243205 | 2008 | EPUB\n\nIn A Better Brain at Any Age, Sondra Kornblatt, along with the experts she has interviewed, helps readers put their heads on straight through healthy activities for the body (exercise, healthy food consumption, and relaxation) and through specific activities to boost brain power like movement, eye rolls, supplements, and making environmental changes.\n\nEach of the seven chapters-Body-Mind Connection; Environmental Support; Food and Supplements; Intelligence and Learning; Memory, Learning Shortcuts, and Brain-Stretchers; Emotions and Decisions; and Meditation and Bigger Perspectives-details how that topic impacts the brain, and offers tips and highlights for readers to either delve into the book or peruse it for quick boosts. Kornblatt teaches readers how to reduce brain stress and optimize mental agility, and shares information on how the brain interacts with the body, what habits impact the brain, positively and negatively, and how to maximize learning. She provides tips to strengthen memory, cognition, and creativity so readers can function better in their active lives.\n\nA Better Brain at Any Age offers a complete plan for total brain health in an engaging and accessible way.","torrent":{"xt":"urn:btih:aa6e6fdf61a336f3fb7934808ab83a97d463fece","amp;dn":"+Better+Brain+at+Any+Age%3A+The+Holistic+Way+to+Improve+Your+Memor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa6e6fdf61a336f3fb7934808ab83a97d463fece","infoHashBuffer":{"type":"Buffer","data":[170,110,111,223,97,163,54,243,251,121,52,128,138,184,58,151,212,99,254,206]},"announce":[],"urlList":[]}}