{"title":"French Film Collection(Film 39) LEMMING (2005)","uid":6040920,"size":734985376,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ab9f8cfcc1a2851154ef7c77b13c0e915c1b2a6b&amp;dn=French+Film+Collection%28Film+39%29+LEMMING+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"forcefox","files":-1,"time":1292385021,"description":"ENGLISH SUBTITLES INCLUDED\n\nNo, the title isn't some arty metaphor - there really is furry-rodent action in Lemming, Dominik Moll's belated follow-up to 2000's Harry, He's Here To Help. However, if it is arty metaphors you seek, then there's plenty to be had in this increasingly fuzzy tale of a middle-class marriage rocked by could-be supernatural forces. Once again, it's Harry... star Laurent Lucas at the centre of the strife, though both he and spouse Charlotte Gainsbourg are upstaged by Charlotte Rampling on riveting form.\n\nAlas, the great British actress isn't on screen for very long. But she still steals the film with her shocking table manners. It's watch-through-the-fingers time when inventor Alain (Lucas) and wife Benedicte (Gainsbourg) invite the former's boss (AndrÃƒÂ© Dussollier) and his arctic other half (Rampling) over for dinner at their new pad. This exquisitely embarrassing episode - the movie's best - is only the start of Alain's woes. A violent death occurs. Benedicte starts behaving madly. And there's the ongoing enigma of how a lemming got stuck in the S-bend of the kitchen sink.\n\n&quot;LEAVES THE VIEWER ON THIER OWN&quot;\n\nThis, at least, is one question Moll provides a reasonable answer for (eventually). Otherwise he leaves the viewer on their own to work out what in heaven's name is going on. The first hour's rich; the second strange in a David Lynch stylee. Only without the Mulholland Drive director's ravishing intensity - nor, for that matter, the tightening suspense of Moll's previous pic. Still, between Rampling and the rodents (who show up en masse in one startling scene), there's enough quality to stop anyone from throwing themselves off a cliff. ","torrent":{"xt":"urn:btih:ab9f8cfcc1a2851154ef7c77b13c0e915c1b2a6b","amp;dn":"French+Film+Collection%28Film+39%29+LEMMING+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab9f8cfcc1a2851154ef7c77b13c0e915c1b2a6b","infoHashBuffer":{"type":"Buffer","data":[171,159,140,252,193,162,133,17,84,239,124,119,177,60,14,145,92,27,42,107]},"announce":[],"urlList":[]}}