{"title":"Iron Man and Philosophy Audio and pdf","uid":8236108,"size":221720264,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ac555ac06c1d3eb684b15ec327e2d86c45c33422&amp;dn=Iron+Man+and+Philosophy+Audio+and+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hombrep","files":-1,"time":1362845674,"description":"mp3 + pdf\n\nEditorial Reviews\nFrom the Back Cover\nCan Iron Man's armor actually think?\n\nIs Tony Stark's intelligence the greatest source of Iron Man's power?\n\nCan Iron Man be both a superhero and the corporate property of Stark Industries?\n\nDoes the Iron Man technology point the way to a brighter future or a darkening horizon?\n\nCan Tony Stark be a genuine superhero and a hard-drinking womanizer?\n\nOn the surface, Iron Man appears to be a straightforward superhero, another rich guy fighting crime with fancy gadgets. But beneath the shiny armor and flashy technology lies Tony Stark, brilliant inventor and eccentric playboy, struggling to balance his desires, addictions, and relationships with his duties as the Armored Avenger. Iron Man and Philosophy explores the many philosophical issues that emerge from the essential conflicts found in the decades of Iron Man stories in comics and movies. What kind of moral compass does Tony Stark have? Is Iron Man responsible for the death of Captain America after the Marvel Universe Civil War? Should people like Stark run the world? Ultimately, what can Iron Man teach us about the role of technology in society?\n\nAbout the Author\nMark D. White is a professor in the Department of Political Science, Economics, and Philosophy at the College of Staten Island/CUNY. He coedited Batman and Philosophy and edited Watchmen and Philosophy.\nWilliam Irwin is a professor of philosophy at King's College in Wilkes-Barre, Pennsylvania. He originated the philosophy and popular culture genre of books as coeditor of the bestselling The Simpsons and Philosophy and has overseen recent titles, including Batman and Philosophy, House and Philosophy, and Watchmen and Philosophy.","torrent":{"xt":"urn:btih:ac555ac06c1d3eb684b15ec327e2d86c45c33422","amp;dn":"Iron+Man+and+Philosophy+Audio+and+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac555ac06c1d3eb684b15ec327e2d86c45c33422","infoHashBuffer":{"type":"Buffer","data":[172,85,90,192,108,29,62,182,132,177,94,195,39,226,216,108,69,195,52,34]},"announce":[],"urlList":[]}}