{"title":"Kula Shaker - Peasants, Pigs and Astronauts [1999]","uid":9460544,"size":375041719,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ad33467bd7f4443d55fa88ad4b925d42c65e6d42&amp;dn=Kula+Shaker+-+Peasants%2C+Pigs+and+Astronauts+%5B1999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GenXRock","files":-1,"time":1389344657,"description":"Review by Stephen Thomas Erlewine  [-]\nFame was not kind to Kula Shaker, largely because Crispian Mills could not keep his mouth shut. Speaking like the child of privilege he is, Mills alienated a fair segment of the British pop audience and music press with presumptuous, misguided comments about mysticism and spirituality, as well as a general arrogance. A mere eight months after the release of their debut, K, Kula Shaker was dreadfully overexposed and the group's hippy-dippy neo-psychedelicism and rock classicism were falling out of favor, leaving them with little choice but to retreat to work on their second record. It wasn't quite as easy as that. After rejecting their original producer, John Leckie, and George Drakoulias, they brought Bob Ezrin aboard and began a lengthy recording process. By the time their second record, Peasants, Pigs &amp; Astronauts, was released in the spring of 1999, it had been two-and-a-half years since K appeared in stores -- enough time to regulate the group to footnote status for many observers. You wouldn't know that from the grand, theatrical sound of Peasants, however. The record comes on as a blockbuster, deluging the listener with layers of psychedelic effects, swirling guitars, appropriated chants, Indian instruments, Deep Purple jams, Beatles references, and mystical babble. On a purely sonic level, it's easy to admire what Kula Shaker achieve. They have no shame in recreating the summer of love in a '90s studio and, with Ezrin's help, they've created some enticing, sugary Technicolor treats. The problem is, the high fades away pretty quickly, leaving very little of substance behind. As a songwriter, Mills, for all his portentous posturing, doesn't have a whole lot to say and he doesn't really know how to say it. Only a handful of songs -- &quot;Shower Your Love,&quot; &quot;108 Battles&quot; -- are memorable outside of their sonic trappings, which leaves Peasants, Pigs &amp; Astronauts in pretty much the same position as K. It's the kind of record that sounds pretty impressive as it plays, but makes almost no lasting impression. (3/5)","torrent":{"xt":"urn:btih:ad33467bd7f4443d55fa88ad4b925d42c65e6d42","amp;dn":"Kula+Shaker+-+Peasants%2C+Pigs+and+Astronauts+%5B1999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad33467bd7f4443d55fa88ad4b925d42c65e6d42","infoHashBuffer":{"type":"Buffer","data":[173,51,70,123,215,244,68,61,85,250,136,173,75,146,93,66,198,94,109,66]},"announce":[],"urlList":[]}}