{"title":"Diamond Dogs by Alan Watt","uid":9719104,"size":650647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae344169502ba32ddff0775a718197c7ad4cf28c&amp;dn=Diamond+Dogs+by+Alan+Watt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"PirateBook","files":1,"time":1394151268,"description":"\nHighly readable, if finally unconvincing, Watt's debut novel is the story of a bitter family legacy and a traumatic reckoning, as Watt explores the reasons an abusive father might risk everything to cover up a crime committed by his damaged, equally cruel teenage son.Inebriated after a party with his high school football team, Neil Garvin, 17, first-string quarterback and &quot;the best arm in Nevada,&quot; accidentally kills a classmate, Ian Curtis. \n\nNeil's father, the sheriff of their small town near Las Vegas, covers up for his son. Ian's parents report the boy missing, and more than 300 students join in a search led by Neil's father. Mrs. Curtis asks her brother, an FBI agent, to help, and as the FBI tightens the net, Neil and his father must face some truths about their family. Watt, who is also a stand-up comic, has a knack for deploying well-timed plot points to reveal crucial information.\n\nThe book starts off with faithful characterizations of the sad, angry father and son, and the dialogue between them is appropriately savage, but there are key moments in the story that don't ring true. The most unconvincing scene occurs at the narrative's dramatic apex, when Neil finally, and improbably, discovers the dark secret of why his mother left home when he was three. At the same time, the reasons for Neil's hellish childhood become melodramatically clear. Still, there are certain pleasures in this novel, including incisive scenes that capture the petty cruelties and poignant betrayals of adolescents.\n\nThe author also gives vivid voice to a character type that has become a staple in modern American fiction: a man unmoored by divorce and filled with festering anger and alienation. Watt takes the archetype a step further, delineating how the father's desperate behavior affects his son, and how this pair find an uneasy peace in breaking the chain of lies and violence.\n\nGenre: Fiction/General","torrent":{"xt":"urn:btih:ae344169502ba32ddff0775a718197c7ad4cf28c","amp;dn":"Diamond+Dogs+by+Alan+Watt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae344169502ba32ddff0775a718197c7ad4cf28c","infoHashBuffer":{"type":"Buffer","data":[174,52,65,105,80,43,163,45,223,240,119,90,113,129,151,199,173,76,242,140]},"announce":[],"urlList":[]}}