{"title":"Garage-Punk-New Wave-Neo-Psych 1977-2004 (9 Good Albums)","uid":3400275,"size":1027625623,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ae94dc1bf2ab43c7928d2b4299b9f93ea92d9f66&amp;dn=Garage-Punk-New+Wave-Neo-Psych+1977-2004+%289+Good+Albums%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ChrisGoes","files":196,"time":1130057662,"description":"Size: 968 MB\nBitrade: 256\nmp3\nRipped By: ChrisGoes(Rock)\nArtwork Included\nTracker: tracker.prq.to/announce\n\n************************************************************************************\n\nhttp://img472.imageshack.us/img472/7710/beacavemanfront5wd.jpg\n\nBe A Caveman - The Best Of Voxx Garage Revival (80s US Garage Punk)\n\nFrom 1979 onward, the Voxx label has been the home of more 1960s garage revivalist bands than any other company, although the label's activities tapered off in the early '90s. This is a 27-song survey of Voxx's output (excluding the actual '60s garage bands whose material it reissued occasionally). Many of these names were among the best-known groups in this rather insular movement, such as DMZ, the Crawdaddys, the Barracudas, Plan 9, the Unclaimed, the Pandoras, the Tell Tale Hearts, the Fuzztones, the Cynics, and the Chesterfield Kings. There are a few names that might be unfamiliar to those steeped in the style, like the Time Beings, the Leopards, the Event, and the Laughing Soup Dish. But even if you're the purist who only wants to hear the original 1960s garage recordings, you'll probably recognize most of these bands, if only because so many of them advertised in (and wrote for) fanzines detailing obscure 1960s garage music. The music on this disc? It's a clich&amp;eacute; by now to note that it's not as exciting as the obscure 1960s recordings it's modeled on, but that's no less valid a statement than it ever was. Those songs that are covers of old nuggets don't match the original versions; much of the original material sounds like form without the content. Some non-standard garage influences peek through occasionally, such as surf, punk, and polished late-'60s British psychedelia, but for the most part it's bluesy, simple 1966-style ranting. The Leopards' late-'60s Kinks-style vaudeville-mod satire &quot;Psychedelic Boy&quot; really stands out (refreshingly so) in this context as something a little different. Should you want just one overview sampler of the genre, though, this -- despite the absence of some of the more celebrated names, such as the Lyres -- has got to be the best one out there. ~ Richie Unterberger, All Music Guide\n\n 1.  Left in the Dark - Vertebrats \n 2.  Can't Stand the Pain - DMZ \n 3.  There She Goes Again - The Crawdaddys \n 4.  This Ain't My Time - The Barracudas \n 5.  I'm Not There - Plan 9 \n 6.  Run from Home - The Unclaimed \n 7.  Melvin - Pandoras \n 8.  Spooky - Gravidigger V \n 9.  It's Not Me - Tell-Tale Hearts \n 10.  One Step Closer to You - Miracle Workers \n 11.  Why Don't You Love Me - Time Beings \n 12.  Greem Slime - Fuzztones \n 13.  I'll Make You Sorry - Odds \n 14.  Nothing's from Today - The Vipers \n 15.  Waste of Time - Cynics \n 16.  Are You Gonna Be There? - Chesterfield Kings \n 17.  Dr. Syn - Stomachmouths \n 18.  Bye Bye Baby - Wombats \n 19.  Teenage Lima Bean - Laughing Soup Dish \n 20.  Midnight Hour - Hypstarz \n 21.  Fun in the Summer - Surf Trio \n 22.  She Only Knows - Eyes Of Mind \n 23.  Can't Get Enough - The Things \n 24.  Psychedelic Boy - Leopards \n 25.  Living So Dead - Steppes \n 26.  She's Our Girl - Event \n 27.  Be a Caveman - The Dwarves\n\n************************************************************************************\n\nhttp://img466.imageshack.us/img466/8913/destinationbompfront3so.jpg\n\nDestination Bomp - Best Of Bomp Records (1977-94) (2-CD)\n\nReleased to coincide with Bomp Records' 20th anniversary, Destination Bomp is a two-disc, 48 track aural manifesto from the Los Angeles label, that surveys two decades of underground releases. Music journalist Greg Shaw formed Bomp in 1974 as a platform for rock acts residing below the major label radar. The result was nothing short of a rallying cry from a thousand garages, bedrooms and basements; an euphoric burst of '50s rock, '60s psychedelia, '70s punk and (eventually) '80s college fare that Shaw branded &quot;power-pop&quot;. Destination Bomp begins in 1974 with the label's premier release, the sublime pop breeze of the Flamin' Groovies &quot;You Tore Me Down,&quot; proceeding on a tour of primal surf, decimated blues, gleeful pop and shimmying punk that concludes in 1992. That year the label released &quot;She Made Me,&quot; the debut single from the Brian Jonestown Massacre. Capping off the set is its B-side, &quot;Evergreen,&quot; a slice of shoe-gazing drift, sprinkled with psychedelic tape loops. Though they flirted with greater success in the early '80s with a pair of minor hits (Plimsouls' &quot;A Million Miles Away&quot; and Josie Cotton's &quot;Johnny, Are You Queer?&quot;), the bulk of the label's vast roster consisted of rock &amp; roll footnotes. Even cult idols like Iggy Pop and Jonathan Richmond didn't exactly chalk up large sales figures. Still, in a perfect world, you'd surely find songs like Nikki &amp; The Corvettes' &quot;Just What I Needed,&quot; Things' &quot;Everytime&quot; and Barracudas' &quot;Surfers Are Back,&quot; gracing the Billboard charts. Destination Bomp is an excellent compilation for fans of Nuggets-style garage anthems.\n\n1  You Tore Me Down  Flamin' Groovies  2:47  \n2  Love of the Loved  Poppees  1:47  \n3  Jingle, Jangle  Rockfield Chorale  2:48  \n4  I.R.T.  Snatch  2:07  \n5  Busy Man  DMZ  3:20  \n6  I Got a Right  Iggy &amp; The Stooges  3:24  \n7  Don't Push Me Around  Zeros  2:24  \n8  Life of Crime  Weirdos  2:19  \n9  Okay  Shoes  2:16  \n10  Giving It All  Twenty Twenty  2:47  \n11  You're for Me  Singles  3:34  \n12  Running Away  Romantics  3:00  \n13  Walking Out on Love  Paul Collins, Breakaways  1:36  \n14  Just What I Need  Nikki &amp; The Corvettes  2:45  \n15  Little G.T.O.  Rodney &amp; The Brunettes  2:47  \n16  She Don't Know Why I'm Here  Last  3:25  \n17  I Can Never Tell  Crawdaddys  2:43  \n18  The Last Year  Stiv Bators  3:00  \n19  Hindu Gods of Love  Lipstick Killers  3:23  \n20  Left in the Dark  Vertebrats  3:23  \n21  She Cracked  Modern Lovers  2:54  \n22  Pull My Train [#]  Unknowns  2:26  \n23  A Million Miles Away  Plimsouls  3:31  \n24  Johnny, Are You Queer?  Josie Cotton  2:39  \n25  Frogs  Toy Love  4:45  \n26  Surfers Are Back  Barracudas  2:13  \n27  Rumble at Waikki  Jon &amp; The Nightriders  2:31  \n28  Intro '66  Zebra Stripes  :55  \n29  She's Not Mine  Mystery Machine  2:54  \n30  Hot Generation  Pandoras  2:15  \n31  It's Just a Matter of Time  Tell Tale Hearts  3:04  \n32  Stoneage Stomp  Gravedigger V  2:54  \n33  Already Gone  Miracle Workers  3:09  \n34  Can't You Do Anything Right?  Lazy Cowgirls  3:12  \n35  Lick It  Dwarves  1:23  \n36  HOD  Distorted Pony  2:22  \n37  Everytime  Things  4:24  \n38  With You Again  Eyes Of Mind  3:51  \n39  Tourists from Timenotyet  Steppes  5:55  \n40  Arnold Layne  SS-20  2:35  \n41  Walking in the Rain  Green Pajamas  3:18  \n42  Love Is Blue  Hangman's Beautiful ...  3:37  \n43  The Singer Not the Song  Patti Palladin  2:14  \n44  Honey  Spacemen Three  3:00  \n45  Salvation  Sacred Miracle Cave  6:40  \n46  How Bread Is Made  Head  1:46  \n47  Fantasy of Folk  Blair One Five Two Three  3:04  \n48  Evergreen  Brian Jonestown Massacre  4:53  \n \n************************************************************************************\n\nhttp://img453.imageshack.us/img453/1874/dmzfront1if.jpg\n\nDMZ - When I Get Off (US Garage 1976-77) \n\nBefore Jeff &quot;Monoman&quot; Connolly formed Boston's seminal garage rock terrorists the Lyres, he was in a late-'70s prototype known as DMZ. With the exception of a few musicians, DMZ and the Lyres were essentially same-sounding bands; DMZ just played with a little more speed and punk verve. Oddly enough, during the late-'70s signing frenzy of any band even remotely associated with the punk scenes in Boston and New York City, DMZ got a shot with Sire Records. The label, exhibiting near-total artistic myopia, teamed the band up with goofball has-beens Flo and Eddie as producers. While the resulting record was panned, it's far from a disaster, due mainly to DMZ's ferocity and trashy ebullience. Fans of mid-'60s rock such as the Seeds, ? and the Mysterians, and the Kinks, and who have an unending jones for speedy trash-rock and whiny Farfisa organs, will love DMZ.\n\n01   Busy Man  Connolly     \n02   Can't Stand the Pain  D M Z     \n03   You're Gonna Miss Me  Erickson     \n04   When I Get Off  Connolly     \n05   Do Not Enter  Connolly     \n06   Guilty Child  Connolly     \n07   Shirt Loop  Connolly     \n08   Lift up Your Hood  Connolly     \n09   Barracuda  Cobb     \n10   Comin' After Me  D M Z     \n11   Bloody Englishmen  Connolly     \n12   First Time  Connolly     \n13   Oedipus Show  Connolly     \n14   Rosalyn  D M Z     \n15   Might He I.D.  Connolly     \n16   From Home  D M Z     \n17   Are You Gonna Be There  D M Z     \n18   Pretty Girl  Connolly\n\n************************************************************************************\n\nhttp://img470.imageshack.us/img470/7389/laughingskyfront3xn.jpg\n\nLaughing Sky - Free Inside (Psychdelic Garagerock 1996) \n\nIf '60s garage-psych revivalism will never entirely die, for better or worse, then it's a good thing that there are bands like Laughing Sky around to do the spirit proud. If nowhere near as freaked-out and frazzled, or honestly creative, as bands like Spacemen 3 or Loop, the trio on Free Inside has itself a good and freaky time. The end result comes close to something like the American equivalent of the Damned's Naz Nomad and the Nightmares guise, or XTC's tripping out as the Dukes of Stratosphear. In a nice enough touch, the recording quality is much more full-sounding than simple recreation, suggesting what a lot of groups of the time were maybe trying for but couldn't quite achieve. It's not glossy mainstream overkill or anything, merely rich sonic detail designed for a different age and different ears ? check out the instrumental breaks on &quot;Arms of the Sun&quot; or the chiming introduction of the title track for proof. Songs like the merrily spooked-out trip of &quot;The Slip,&quot; all phased guitar solos and smoky rhythm trance and just-stoned-enough vocal chants and more, capture the spirit of things just right. There are covers both well-known (a reasonable enough &quot;Tomorrow Never Knows,&quot; a mighty fine &quot;Lucifer Sam&quot;) and obscure (&quot;Here We Come&quot; by Alvin Alvey and the Green Fuz, benefiting from some great walls of guitar noise). Perhaps more than once things veer towards the generically hard rock instead of the truly tripped out ? the very beginning of &quot;The Future of Love&quot; almost sounds like it's about to break into some lousy early-'70s nonsense ? but for the most part, this merry trio knows how to have a good time looking back on some crazy days.  \n \n1. 3:03 Here We Come\n2. 6:54 The Slip \n3. 4:50 Arms Of The Sun \n4. 4:08 Eyes In The Sky \n5. 3:46 The Future Of Love \n6. 3:02 Lucifer Sam \n7. 3:38 Take It \n8. 4:47 Free Inside \n9. 3:56 De Empty \n10.4:58 Tomorrow Never Knows\n\n************************************************************************************\n\nhttp://img464.imageshack.us/img464/8272/newracefront7ak.jpg\n\nNew Race - The First And The Last (1981) (Radio Birdman, MC5 &amp; Stooges Members)\n\nAn interesting one-time-only band, New Race was proof that good music can occur when &quot;teachers&quot; and &quot;students&quot; get together. In this instance, the &quot;teachers&quot; were ex-Stooges guitarist Ron Asheton and ex-MC5 drummer Dennis Thompson, who joined forces with &quot;students&quot; Deniz Tek, Rob Younger, and Warwick Gilbert, the latter three members of the seminal Australian punk band Radio Birdman. Tek was a Michigan native who'd emigrated to Australia in the early '70s, bringing his love of high-energy Detroit proto-punk with him. After Birdman's demise, he contacted Asheton and Thompson to come to Australia and form this ad-hoc touring outfit. New Race toured Australia once in 1981, playing mostly small halls and releasing one legit live LP and a few lo-fi bootlegs. While the resulting record, The First and the Last, benefits from a significant amount of in-studio sweetening (backing vocals are added, guitar solos overdubbed), it's still an exciting, guitar-fueled rave-up. Fans of the early-'70s Motor City sound or early Aussie punk wouldn't want to be without it\n\nThis album earned credibility for documenting a unique, one-off event. In 1981, ex-Radio Birdman bassist Warwick Gilbert, guitarist Deniz Tek, and vocalist Rob Younger saluted their influences by joining the Stooges' lead guitarist Ron Asheton and MC5 drummer Dennis Thompson for a six-week blitzkrieg of Australia. The notion made sense, since Radio Birdman had been acclaimed on their Australian home turf, yet relegated to cult fodder elsewhere, while he $MC5 and the Stooges had never been commercial propositions, either. Still, once listeners pass the &quot;punk summit&quot; angle used in promoting the album, they'll find the fruits of this alliance impressive enough to warrant further exploration. Not surprisingly, there's strangled, slash-and-burn guitar playing aplenty on burners like &quot;November 22, 1963,&quot; a conspiratorial recall of President John F. Kennedy's assassination. This track, by Asheton's major post-Stooges outlet, Destroy All Monsters, would undoubtedly win filmmaker Oliver Stone's approval. Tek's &quot;Descent Into the Maelstrom&quot; and &quot;Haunted Road&quot; open similar forays into the fretboard jungle, while the Gilbert-Thompson axis never lets up, especially on the drummer's MC5 standard, &quot;Gotta Keep Movin'.&quot; As these choices show, the set draws evenly from across the board, with &quot;Looking at You&quot; and an understated &quot;Loose&quot; nodding again, respectively, to the MC5 and the Stooges. Tek's moodier songs, &quot;Breaks My Heart&quot; and &quot;Sad TV,&quot; inject variety into the proceedings, while time constraints only permitted one new song to emerge: &quot;Columbia,&quot; whose propulsive riff and atypical space travel theme closes the album on a powerful, decisive note. Strategically overdubbed backing vocals and guitar on three songs, as well as piano on &quot;Descent Into the Maelstrom,&quot; does nothing to blunt this album's appeal, which offers historical value from a one-off event that never occurred again. Tek's terse yet engaging liner notes aptly sum up the exercise: &quot;Humor beats bitterness every time.&quot; It's hard to disagree when the evidence is this powerful.\n\n01  Crying Sun  Gilbert, Tek  3:02  \n02  Haunted Road  Tek  3:48  \n03  Gotta Keep Movin'  Thompson  3:18  \n04  Breaks My Heart  Tek  3:10  \n05  Sad TV  Tek  4:08  \n06  Loose  Asheton, Pop  3:09  \n07  November 22, 1963  Asheton, Niagra  5:20  \n08  Love Kills  Tek  3:51  \n09  Alone in the Endzone  Tek  2:09    \n10  Looking at You  Davis, Kramer, Smith, Thompson ...  7:03  \n11  Columbia  Asheton, Gilbert, Tek ...  4:56 \n\n************************************************************************************\n\nhttp://img470.imageshack.us/img470/3770/rosettawestfront1un.jpg\n\nRosetta West - X Descedant (US Savage And Psychedelic Blues) \n\nROSETTA WEST hails from the Mid-West, and plays true raw psychedelic blues; the sound is basic, crude and savage, almost gothic in its grandeur, and echoes the likes of JAMES BLOOD ULMER, and CAPTAIN BEEFHEART, alternating grungy blues tunes and acoustic numbers to create a landscape of voodoo nightmares, whiskey-fueled raves, and fever-stricken deathbed laments. Starting in 1996, the band has already released a series of self-produced recordings praised by critics, DJs and musicians around the world, including the likes of THURSTON MOORE, PHIL MILSTEIN and BYRON COLEY. After a two year break, ROSETTA WEST is back, always under the guidance of guitarist/singer JOSEPH DEMAGORE, with JAY DANIELS on bass, MIKE WEAVER on drums ... and the infamous NATHAN Q. SCRATCH. Alive records is proud to bring you 'X Descendant', a unique album of acoustic and electric down and dirty blues-swamp-rock.\n\n&quot;X Descendant&quot; is a 9-song witch's brew of distilled booze, swamp sweat, Mississippi mud, bayou Blues, and barroom Psychedelia. I'll just call it &quot;blooze&quot;, and let Rosetta West speak for themselves in all of their gritty, voodoo-laced splendor. Influences seem to range from John Lee Hooker and Creedence Clearwater Revival to early ZZ Top and even The Black Keys. The sound is stark, rural, and abundantly mannish, yet with a purgatorial, somewhat melancholy feel to it. X Descendant should be played as midnight fades into the shadows and the full moon rises low. Bring your own jug, and beware the hound dogs howlin' in the distance. \n\n01 - Blue Honey - 3.24\n02 - Slow Train - 3.53\n03 - The Flag - 3.44\n04 - Vampire Song - 2.30\n05 - Shakin&amp;acute; All Over - 4.34\n06 - Children - 3.34\n07 - Shine - 3.05\n08 - Deeper Than Magic - 6.01\n09 - Return To Inferno - 4.42\n\n************************************************************************************\n\nhttp://img470.imageshack.us/img470/8124/soundofsffront2aq.jpg\n\nVarious Artists - The Sound of San Francisco (US Garage Groups 2004) \n\nAnother year, another scene, another resetting of the rock/soul/garage/R&amp;B clock to year zero, and let's see what happens. So if every generation gets the Cramps or the White Stripes or whatever it deserves, then there are all the other bands along the same lines ? or else vaguely fellow travelers ? out there as well. Thus Alive Records' boss, Patrick Boissel, finding a whole crop of folks to record up in San Francisco circa 2003 presents his new generation of finds here. To be fair, the bands here aren't all trying to be Meg and Jack White, by any stretch of the imagination, and unlike any number of garage fetishists of recent years, just about all the groups are fine with sounding downright radio friendly in a big, expansive way. Maybe in an early-'80s, new wave sense, possibly the secret to what's here ? if New York has gone no wave again, then the Bay Area seems open to the idea of revamping skinny-tie sounds of a different sort, and songs like Mon Frere's &quot;Hello&quot; are most of the way there already. The female vocalist for Boyskout, on &quot;Secrets&quot; and &quot;School of Etiquette&quot; sounds like she could be a cousin of Romeo Void, for instance, while the soulful turn of the singer on Big Midnight is a welcome touch in context. They're actually, generally, a better listen than a slew of the male singers, frankly, who tend to have a strained, hiccupy approach, or else are too dedicated to calling attention to themselves instead of to their respective bands. Musically, a fair amount of the members could probably switch off without much of a hitch, but there are definite moments of individual flair : the compressed snarl of the Coachwhips' &quot;The Alarm&quot;; the dark, swaggering shuffle of the Hotwire Titans' &quot;Thieves and Fakes&quot;; the Low Flying Owls' moody art/psych/goth &quot;Thieves for Hire.&quot; Like all samplers, it's a mix of promise and timekilling, but some folks may yet go on to something more. \n\n       1  Beauty of the Bitch  Nagg  2:15  \n       2  The Alarm  Coachwhips  1:21  \n       3  Secrets  Boyskout  2:23  \n       4  Lost in the Music  Black Cat Music  3:30  \n       5  Thieves and Fakes  Hotwire Titans  2:41  \n       6  Bushmills  Aktion  2:27  \n       7  Thieves for Hire  Low Flying Owls  6:17  \n       8  Push on You  Big Midnight  4:26  \n       9  Sister Temptation  Holy Kiss  3:25  \n       10  Fail Hard to Regain  Gallants  3:31  \n       11  Cryin' Shame  Flakes  2:44  \n       12  Hello  Mon Frere  2:40  \n       13  Va Va Voom  Low Flying Owls  2:48  \n       14  School of Etiquette  Boyskout  2:40  \n       15  Sniff  Nagg  2:15  \n       16  Lucky 7  Young Trade  2:38  \n       17  While You Was Away  Aktion  2:43\n\n************************************************************************************\n\nhttp://img472.imageshack.us/img472/6897/stivbatorsfront0ai.jpg\n\nStiv Bators - Disconnected [Expanded] (US Rock Pre. Dead Boys) (1980)\n\nAs the frontman for the Dead Boys, Stiv Bators terrorized audiences with his snotty, in-your-face punk rock style. But after the Dead Boys, Bators embarked on a musical journey that saw him touch upon new wave (the Wanderers), goth rock (the Lords of the New Church), and power pop (during a brief solo career), as well as a fling with movie acting. Born Steve Bator on October 22, 1949, in Youngstown, OH, Bators took a liking to garage rock and proto-punk early on ? a story he liked to tell is that it was he who handed Iggy Pop the jar of peanut butter that he smeared across his chest and threw around while walking on the audience during the Stooges' televised infamous 1970 rock festival in Ohio (additionally, Bators befriended the Ramones during the quartet's first Ohio performance). As a result of his interest in the burgeoning punk movement, Bators hooked up with friend/guitarist Cheetah Chrome and others to form the short-lived local outfit Frankenstein. Sensing that there was little chance of launching a successful music career in Ohio, Bators convinced a handful of fellow local musicians (Chrome, guitarist Jimmy Zero, and drummer Johnny Blitz) to relocate to New York City in 1976, resulting in the formation of the Dead Boys. The ploy worked, as the Dead Boys not only became an instant part of the CBGB's punk scene, but they also enlisted the club's owner, Hilly Kristal, as their manager, and signed a record deal with Sire. By specializing in a heavily Iggy Pop-influenced live show (which included Bators flailing himself around until he was battered and bloody, and faux-hanging himself on stage), the group built a buzz, which only intensified after the release of its 1977 debut, Young Loud &amp; Snotty. Despite a promising start, the group would quickly disintegrate ? issuing only one more album that failed to replicate the debut's fire, 1978's We Have Come for Your Children, before splitting up. In the wake of the Dead Boys' split, Bators decided to try shedding his wild man image by reinventing himself as a new waver, as he demoed power pop material and issued several singles via the Bomp! label (later collected on the 1994 L.A., L.A. compilation). In 1980 his full-length solo debut, Disconnected, was released; it saw Bators mix his new power pop direction with his punk roots. But rather than fully embark on a solo career, Bators opted to return back to a band, as he formed the Wanderers with ex-Sham 69 members Dave Parsons (guitar), Dave Tregunna (bass), and Rick Goldstein (drums). The group issued only one album, the schizoid concept album Only Lovers Left Alive, which forsake its members' punk past in favor of a sterile production and ambitious futuristic storyline. With punk fans still scratching their heads as to the career path Bators had embarked on since his Dead Boys days, the singer decided to give acting at try, with a bit part in the hilarious 1981 John Waters-directed movie, Polyester. A union with ex-Damned guitarist Brian James followed soon after, resulting in the formation of the Lords of the New Church. And once more, the group didn't sound like what you'd expect from a pair of punk veterans, as they specialized in goth rock (reminiscent of Bauhaus). Unlike his other post-Dead Boys musical projects, the Lords lasted longer, as they issued a trio of albums during the early '80s ? 1982's The Lords of the New Church, 1983's Is Nothing Sacred?, and 1984's The Method to Our Madness ? before Bators exited (an infamous story involves Bators finding out about his impending firing via an ad in a music paper advertising for a vocal vacancy in the band ? for his last performance with the group, he wore a shirt with the ad replicated on it). The late '80s saw Bators briefly work with ex-Hanoi Rocks singer Michael Monroe, appear in another movie, 1988's Tapeheads, and the Sun City music video, plus sporadic reunion gigs with the Dead Boys. Having relocated to Paris, France, little was heard from Bators subsequently, although it became known in later years that he attempted to form a punk rock supergroup featuring ex-New York Dolls guitarist Johnny Thunders and ex-Ramones bassist Dee Dee Ramone. But besides a few rehearsals, nothing ever came of the union. Shortly thereafter, Bators died on June 4, 1990, from injuries sustained after being hit by a car. \n\n       1  Evil Boy  Secich, Zero  3:17  \n       2  Bad Luck Charm  Cabaniss, Quinton  2:54  \n       3  A Million Miles Away  Secich  3:45  \n       4  Make Up Your Mind  Quinton  2:19  \n       5  Swingin' a Go-Go  Cabaniss  2:24  \n       6  Too Much to Dream Last Night  Mantz, Tucker  2:47  \n       7  Ready Any Time  Bators, Secich  2:56  \n       8  The Last Year  Bators, Secich  2:46  \n       9  I Wanna Forget You (Just the Way You Are)  Bators, Secich  3:47  \n       10  Evil Boy [alternate take/*]  Secich, Zero  3:16  \n       11  Swingin' a Go-Go [alternate take/*]  Cabaniss  2:24  \n       12  Crime in the Streets [*/instrumental]  Cabaniss, Quinton, Secich  3:55  \n       13  Little Girl [live/*]   2:37  \n       14  Junebug Skillet (Barbecued Yardbird) \n\n************************************************************************************\n\nhttp://img472.imageshack.us/img472/7207/themasterplanfront3ve.jpg\n\nThe Masterplan - Colossus Of Destiny (w. Andy Shernoff - The Dictators)\n\nNot to be confused with the German death metal supergroup Masterplan, the Master Plan is a garage rock powerhouse headed by two of the leading lights of the old-school, New York garage scene, Andy Shernoff of the Dictators and Keith Streng of the Fleshtones. Fans of those two bands already have an excellent idea of what Colossus of Destiny sounds like: stripped-down, no-frills rock &amp; roll is the order of the day, but without the Dictators' occasional feints toward heavy metal and the soul fixation of the Fleshtones. (The Original Sins and early-'70s Flamin' Groovies are good touchstones, as well, for true aficionados of the style.) The rockabilly-tinged &quot;Kickin' It Old School&quot; is the most aptly titled tune, especially considering that '50s R&amp;B classics like the Cadets' &quot;I Got Loaded&quot; and Hank Ballard's &quot;Annie Had a Baby&quot; are among the pop-rocking originals, sounding like they might have if a British Invasion-era quartet had added them to their set lists. This album is nothing but fun, with no pretensions toward anything more.\n\n       1  What's Up With That?  Shernoff  2:45  \n       2  Better Get Better  Johnson, Shernoff, Streng  3:52  \n       3  Dead Horse  Streng  3:11  \n       4  You're Mine  Johnson  2:41  \n       5  I Got Loaded  Harris  3:07  \n       6  Find Something Beautiful  Roter, Shernoff  2:47  \n       7  Just Because  Price  3:23  \n       8  Annie Had a Baby  Henry  2:39  \n       9  Loves You  Johnson  2:56  \n       10  Picketts Charge  Streng  2:08  \n       11  Kickin' It Old School  Shernoff  3:00  \n       12  Broken Arrow  Anderson  2:18  \n       13  Walking  Darroch  3:24 \n\n************************************************************************************","torrent":{"xt":"urn:btih:ae94dc1bf2ab43c7928d2b4299b9f93ea92d9f66","amp;dn":"Garage-Punk-New+Wave-Neo-Psych+1977-2004+%289+Good+Albums%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae94dc1bf2ab43c7928d2b4299b9f93ea92d9f66","infoHashBuffer":{"type":"Buffer","data":[174,148,220,27,242,171,67,199,146,141,43,66,153,185,249,62,169,45,159,102]},"announce":[],"urlList":[]}}