{"title":"Batman 676-681 Batman R.I.P. (2008-2009, Dgtl, Zone-Empire)","uid":9536337,"size":218681268,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:aec7d17e43d970e64bea4880e1241c33ce6cac9c&amp;dn=Batman+676-681+Batman+R.I.P.+%282008-2009%2C+Dgtl%2C+Zone-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1390941455,"description":"For more information about this storyline and its various tie-ins (not included here), please visit this wiki page:   &lt;a href=&quot; http://en.wikipedia.org/wiki/Batman_R.I.P.&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Batman_R.I.P.&lt;/a&gt;\n\nAfter establishing the character of Damian Wayne in his &quot;Batman and Son&quot; storyline, then presenting the Black Glove organization as a credible and serious threat, Grant Morrison moved on to the next phase of his Batman run - destroying Bruce Wayne utterly and completely. Not merely killing him - that would be too boring and easy - but actually deconstructing both Wayne and the Batman mythos from the inside out. Morrison wrote an intricate tale that traced back years to zany space adventures that time forgot - but he didn't. The attack on Bruce was multi-layered - from intense psychological disaster thanks to the trigger words &quot;Zur en Arrh&quot; planted many moons ago, to creating doubt as to Thomas Wayne's integrity, and of course physical beatings akin to torture on top of everything else - Morrison went after Batman with venom and gusto. Dr. Hurt and his band of cronies, the Club of Villains, used every trick in the book to try to forever eradicate Bruce (and by extension, Batman) from the face of the earth, and it almost worked. The game of identity with Dr. Hurt himself was quite interesting - was it possible that he was Bruce's father after all? The Joker's role is fascinating as well - he participates in the events up to a point but in general seems rather bored of the whole affair, and bets on Batman to come out on top. Of course, he soon turns on his would-be allies as well, in typical Joker fashion. Not even Alfred is spared, since Hurt knows who Batman is. It's all great stuff and one of the touchstones of Morrison's six-year story arc on the Caped Crusader.\n\nWhile there are many additional tales that relate to Batman R.I.P., only the critical issues of the main storyline are presented here, in new digital versions thanks to Zone-Empire. This is largely because there aren't good copies available for the other parts of the story (including the follow-up &quot;missing&quot; chapter, Batman 701-702) and this by itself is good enough reading. I hope you like it too! :-) ","torrent":{"xt":"urn:btih:aec7d17e43d970e64bea4880e1241c33ce6cac9c","amp;dn":"Batman+676-681+Batman+R.I.P.+%282008-2009%2C+Dgtl%2C+Zone-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aec7d17e43d970e64bea4880e1241c33ce6cac9c","infoHashBuffer":{"type":"Buffer","data":[174,199,209,126,67,217,112,230,75,234,72,128,225,36,28,51,206,108,172,156]},"announce":[],"urlList":[]}}