{"title":"The Things They Cannot Say By Kevin Sites (Epub,Mobi) Gooner","uid":9678166,"size":4764166,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af2b81b22424d5bf9157518a3dbf0a139c91538f&amp;dn=The+Things+They+Cannot+Say+By+Kevin+Sites+%28Epub%2CMobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GoonerTPB","files":2,"time":1393604212,"description":"Format: mobi/epub\nGenre: History/Military\nPrint Length: 336 pages\nRelease Date: 29 January 2013\n\nWhat is it like to kill? What is it like to be under fire? How do you know what's right? What can you never forget?\n\nIn The Things They Cannot Say, award-winning journalist and author Kevin Sites asks these difficult questions of eleven soldiers and marines, who, by sharing the truth about their wars?display a rare courage that transcends battlefield heroics.\n\nFor each of these men, many of whom Sites first met while in Afghanistan and Iraq, the truth means something different. One struggles to recover from a head injury he believes has stolen his ability to love; another attempts to make amends for the killing of an innocent man; yet another finds respect for the enemy fighter who tried to kill him. Sites also shares the unsettling narrative of his own failures during war - including his complicity in a murder - and the redemptive powers of storytelling that saved him from a self-destructive downward spiral.\n\nAuthor:\n\nKevin Sites has spent the past decade covering global war and disaster for ABC, NBC, CNN and Yahoo! News. One of the first &quot;backpack journalists,&quot; Sites helped pioneer the more mobile, less-intrusive profile of today's digital reporters. He is the author of In the Hot Zone: One Man, One Year, Twenty Wars. He lives and works in Hong Kong.","torrent":{"xt":"urn:btih:af2b81b22424d5bf9157518a3dbf0a139c91538f","amp;dn":"The+Things+They+Cannot+Say+By+Kevin+Sites+%28Epub%2CMobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af2b81b22424d5bf9157518a3dbf0a139c91538f","infoHashBuffer":{"type":"Buffer","data":[175,43,129,178,36,36,213,191,145,87,81,138,61,191,10,19,156,145,83,143]},"announce":[],"urlList":[]}}