{"title":"Air - 10,000Hz Legend [FLAC]","uid":5274453,"size":394676613,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:afd7263eee4d7483b108e96200253e5e7aaeeb88&amp;dn=Air+-+10%2C000Hz+Legend+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"suprs33dr","files":13,"time":1263328892,"description":"Previously Air's Jean-Benoit Dunckel and Nicolas Godin made softcore collages of Pink Floyd-ish synth tones and droning French lounge pop. 10,000 Hz Legend goes further out, attaining new heights of cheesy, Space Odyssey-like computer music. Like Kraftwerk skinny-dipping with French nymphet Jane Birkin and Star Wars's R2D2, Legend swells with mad robo-love, following a computer romance amid droll tributes to vacant pop culture. Beck's appearance on &quot;The Vagabond&quot; proves the Loser only works well solo, making Air disappear on their own album. The absurd &quot;Radio #1&quot; and the sappy chorus in &quot;How Does It Make You Feel?&quot; could snuggle beside Celine Dion's latest yawner. But there is magic: &quot;Radian&quot; is a Cluster-like orb of cooing flutes, gentle rhythms, and a ghostly vocal. &quot;Electric Performers&quot; offers clunky electronic beats and the lines &quot;We are the synchronizers / Machines give me some freedom.&quot; The catchy &quot;People in the City&quot; sounds like Mirwais producing Serge Gainsbourg, while &quot;Don't Be Light&quot; recalls electro Krautrockers Neu! Feeding us Moog merengue and Reese's Pieces rhythms, Air remain sweet computer boys to the core. --Ken Micallef","torrent":{"xt":"urn:btih:afd7263eee4d7483b108e96200253e5e7aaeeb88","amp;dn":"Air+-+10%2C000Hz+Legend+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afd7263eee4d7483b108e96200253e5e7aaeeb88","infoHashBuffer":{"type":"Buffer","data":[175,215,38,62,238,77,116,131,177,8,233,98,0,37,62,94,122,174,235,136]},"announce":[],"urlList":[]}}