{"title":"Sexually Broken----Cute Japanese girl roughly deep  Marica Hase","uid":8322890,"size":1243333375,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:afe4b6bf5aa91ad7166524a50025be673225470e&amp;dn=Sexually+Broken%5C----Cute+Japanese+girl+roughly+deep++Marica+Hase&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1364688230,"description":"Sexually BrokenCute Japanese girl roughly deep throated and Fucked, with wax dripping on her huge nipples, cumming  Marica Hase  Matt Williams MP4\n\n\nMp4 Only\n\nMarica Hase is back and cute as ever, she doesn't speak English very well, so everything about her is adorable. Her mannerisms, cute smile and the little sounds she makes when she is distressed or cumming are all so hot.\n\n We have Marica bound in a modified Japanese box tie. Modified because we made it a better tie overall, but lets not dwell on that. Marica is blindfolded, her nipples hard, and she sits on a vibrator, trying to get it in that right place where magic happens. She can't see as we approach with a hard cock, but she feels it when it hits the back of her throat.\n\n We deliver a stellar, deep throat fucking. The simple truth is Marica isn't yet accustomed to the larger cocks in American Porn. She struggles with big cocks. We really don't care, we just like watching her struggle with cock in her mouth as we brutally face fuck our sexy Japanese girl's throat into subspace. \n\nWe clamp Marica's huge nipples, lay her down on the floor, and add some neck ropes so she is stretched out spread. The ropes on her neck don't choke or cut off her air, they simply hold her in place. She must remain still, but with what we do to her next she has no hope of being still.\n\n We tie a burning candle above her perfect breasts and clamped nipples. The wax drips and drips, never stopping. We set the candle to swinging so hot wax is working Marica over. At the same time we are making her cum, over and over, she can't move without massive discomfort, so she must take the orgasm punishment. We drive our sexy Japanese girl out of her fucking mind. She can't stop cumming and the wax never stops dripping...\n\n \nScreens     &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/03_29mhase3/SexuallyBroken-Marica-Hase-Matt-Williams-Cute-Japanese-girl-roughly-deep-throated-and-Fucked-with-wax-dripping-on-her-huge-nipples-cumming.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/03_29mhase3/SexuallyBroken-Marica-Hase-Matt-Williams-Cute-Japanese-girl-roughly-deep-throated-and-Fucked-with-wax-dripping-on-her-huge-nipples-cumming.php&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-) ","torrent":{"xt":"urn:btih:afe4b6bf5aa91ad7166524a50025be673225470e","amp;dn":"Sexually+Broken%5C----Cute+Japanese+girl+roughly+deep++Marica+Hase","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afe4b6bf5aa91ad7166524a50025be673225470e","infoHashBuffer":{"type":"Buffer","data":[175,228,182,191,90,169,26,215,22,101,36,165,0,37,190,103,50,37,71,14]},"announce":[],"urlList":[]}}