{"title":"Sondheim - Follies (1985) in Concert - Carol Burnett, Mandy Pati","uid":6142032,"size":736215983,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b1e4e40e48d336732d07769f60434812272c688a&amp;dn=Sondheim+-+Follies+%281985%29+in+Concert+-+Carol+Burnett%2C+Mandy+Pati&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"rambam1776","files":-1,"time":1296538900,"description":"Sondheim - Follies (1985) in Concert - Carol Burnett, Mandy Patinkin, Lee Remick\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 886kbps \nDuration.............: 1:30:02\nResolution...........: 600*460 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 736,116,710\n &lt;a href=&quot;\nhttp://www.amazon.com/Stephen-Sondheims-Follies-Concert-Gregory/dp/B00005KH3H/ref=sr_1_1?s=music&amp;ie=UTF8&amp;qid=1296534895&amp;sr=1-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Stephen-Sondheims-Follies-Concert-Gregory/dp/B00005KH3H/ref=sr_1_1?s=music&amp;ie=UTF8&amp;qid=1296534895&amp;sr=1-1&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0208162/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0208162/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/AAdAMAadK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/AAdAMAadK&lt;/a&gt;\n\n\nEditorial Reviews\n\nAmazon.com\n\nFollies in Concert: Four Days in New York provides a backstage look at a genuine Broadway event, the 1985 concert performance of Stephen Sondheim's 1971 Broadway musical Follies. A star-studded roster is backed by the New York Philharmonic, featuring principals Barbara Cook, Mandy Patinkin, Lee Remick, and George Hearn, supported by the likes of Carol Burnett, Liliane Montevecchi, Elaine Stritch, and Liz Callaway. Unfortunately, this 90-minute documentary only includes about 47 minutes of actual concert footage--ironic because the purpose of the concert was to record the whole score after the original Broadway cast recording had omitted or shortened many songs.\n\nStill, what's here is not to be missed. Sondheim's musical brilliantly captures the memories and heartache of a long-lost era and the performers who embodied it. At a reunion of the fictional musical revue The Weismann Follies, the long-retired players relive their careers through pastiches of past songwriters, sometimes accompanied in song or dance by the ghosts of their previous selves. At the same time, four of the people (two married couples) remember their pasts and wonder whether they chose their spouses--and the course of their lives--correctly. This film includes glimpses of the rehearsals and comments from the actors and Sondheim himself that lend depth and insight to the production. And even if only about half of the actual concert is represented, the closing &quot;Loveland&quot; sequence is almost complete, and &quot;Who's That Woman (The Mirror Song)?&quot;, though heavily edited, does provide some sense of the choreography. --David Horiuchi\n\nProduct Description\n\nThe incomparable Stephen Sondheim brought his sensational Follies to the stage in 1971 where it was hailed as &quot;monumental theater&quot; by The New York Times. Fourteen years later, the magic was recreated by an unparalleled gathering of stage and screen luminaries performing with the New York Philharmonic at Lincoln Center for a wildly enthusiastic audience. This one-night-only performance became a legendary event in Broadway history--Follies in Concert! The evolution of this unique, historic event is exclusively captured in this film, from the first rehearsal--just four days before the show--to the last-second butterflies just before the curtain rose. This is a rare treasure for all fans of musical theater. Includes the memorable songs &quot;Losing My Mind&quot; and &quot;I'm Still Here&quot; and an all-star cast: Carol Burnett, Liz Callaway, Betty Comden, Barbara Cook, Adolph Green, George Hearn, Howard McGillin, Liliane Montevecchi, Phyllis Newman, Mandy Patinkin, Lee Remick, and Elaine Stritch. 90 minutes.\n\n\nCast\n\n \tAndre Gregory\t ...\tDimitri Weismann\n \tArthur Rubin\t ...\tRoscoe\n \tBarbara Cook\t ...\tSally Durant Plummer\n \tGeorge Hearn\t ...\tBenjamin Stone\n \tJim Walton\t ...\tYoung Buddy\n \tHoward McGillin\t ...\tYoung Ben\n \tMandy Patinkin\t ...\tBuddy Plummer\n \tLee Remick\t ...\tPhyllis Rogers Stone\n \tLiz Callaway\t ...\tYoung Sally\n \tDaisy Prince\t ...\tYoung Phyllis\n \tBetty Comden\t ...\tEmily Whitman\n \tAdolph Green\t ...\tTheordore Whitman\n \tLiliane Montevecchi\t ...\tSolange Lafitte\n \tElaine Stritch\t ...\tHattie Walker\n \tPhyllis Newman\t ...\tStella Deems\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Follies&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Follies&lt;/a&gt;\n\nFollies is a musical with music and lyrics by Stephen Sondheim and a book by James Goldman. The story concerns a reunion in a crumbling Broadway theatre, scheduled for demolition, of the past performers of the &quot;Weismann's Follies,&quot; a musical revue (based on the Ziegfeld Follies), that played in that theatre between the World Wars. It focuses on two couples, Buddy and Sally Durant Plummer and Benjamin and Phyllis Rogers Stone, who are attending the reunion. Sally and Phyllis were showgirls in the Follies. Both couples are deeply unhappy with their marriages. Buddy, a traveling salesman, is having an affair with a girl on the road; Sally is still as much in love with Ben as she was years ago; and Ben is so self-absorbed that Phyllis feels emotionally abandoned. Several of the former showgirls perform their old numbers, sometimes accompanied by the ghosts of their former selves.\n\nThe Broadway production opened on April 4, 1971, directed by Harold Prince and Michael Bennett, and with choreography by Bennett. The musical was nominated for eleven Tony Awards and won seven. The original production, which ultimately lost money, ran for 522 performances. Nevertheless, the piece has enjoyed a number of major revivals, and several of its songs have become standards, including &quot;Broadway Baby,&quot; &quot;I'm Still Here,&quot; &quot;Too Many Mornings,&quot; &quot;Could I Leave You?&quot; and &quot;Losing My Mind&quot;.","torrent":{"xt":"urn:btih:b1e4e40e48d336732d07769f60434812272c688a","amp;dn":"Sondheim+-+Follies+%281985%29+in+Concert+-+Carol+Burnett%2C+Mandy+Pati","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1e4e40e48d336732d07769f60434812272c688a","infoHashBuffer":{"type":"Buffer","data":[177,228,228,14,72,211,54,115,45,7,118,159,96,67,72,18,39,44,104,138]},"announce":[],"urlList":[]}}