{"title":"Aladdin Movie Collection - NL Subs - ENG Audio","uid":6021464,"size":1870227545,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b1f1978ef79781151802df32459d298aa162d9d4&amp;dn=Aladdin+Movie+Collection+-+NL+Subs+-+ENG+Audio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Preyas","files":-1,"time":1291807434,"description":"Alle filmen zijn perfecte DVD-rips met een uitstekende English Audio-kwaliteit, NL-ondertitels zijn apart in .SRT-formaat\nAll movies are good DVD-rips with excellent English Audio-quality, Dutch-subs are in separate .SRT-format\n\nAladdin (1992)\n\nAladdin is a street-urchin who lives in a large and busy town long ago with his faithful monkey-friend Abu. When Princess Jasmine gets tired of being forced to remain in the palace that overlooks the city, she sneaks out to the marketplace, where she accidentally meets Aladdin.\nUnder the orders of the evil Jafar (the Sultan's advisor), Aladdin is thrown in jail and becomes caught up in Jafar's plot to rule the land with the aid of a mysterious lamp. Legend has it that only a person who is a &quot;diamond in the rough&quot; can retrieve the lamp from the Cave of Wonders.\nAladdin might fight that description, but that's not enough to marry the princess, who must (by law) marry a prince.\n\n\nAladdin is een straat-jongen die lang geleden in een grote en bezige stad met zijn trouwe aap-vriend Abu leeft. Wanneer de Prinses Jasmine moe wordt om gedwongen in het paleis te blijven dat de stad overziet, vlucht zij heimelijk naar de markt, waar zij toevallig Aladdin ontmoet.\nOnder de orders van de slechte Jafar (Sultan's adviseur), wordt Aladdin gevangen genomen en in Jafar's plot bevangen om het land te overheersen door middel van een mysterieuze lamp. De legende vertelt dat slechts een persoon die een &quot; een ruwe diamant&quot; is de lamp uit de Grot der Wonderen kan terug halen.\nAladdin zou die beschrijving kunnen bestrijden, maar dat is niet genoeg om de prinses te huwen, die (bij wet) een prins moet huwen.\n\n-^-^-^-^-^-^-^-^-\n\nAladdin and The Return of Jafar (1994)\n\nAladdin is adjusting to his new life as part of the upper crust. He and Princess Jasmine may not be married yet, but the pressures of palace society have already begun.\nOn top of that, Iago (the parrot pet of Sultan's ex-vizir turned genie, Jafar) appears asking for help and no one is happy to see him. But things begin to look up when Genie returns from his trip around the world.\nMeanwhile, Jafar's black lamp is discovered by an idiot crook called Abis Mal. By using Abis Mal, Jafar makes his way back to Agrabah with ideas of payback for Aladdin and his friends.\n\n\nAladdin past zich aan aan zijn nieuw leven als deel van de hogere korst klasse. Hij en de Prinses Jasmine zijn dan nog niet gehuwd, maar de druk van de paleismaatschappij is reeds begonnen.\nDaar bovenop, Iago (het papegaaihuisdier van Sultan's het ex-vizir geest-geworden, Jafar) komt vragend om hulp en niemand is gelukkig om hem te zien. Maar de dingen beginnen er goed uit te zien wanneer de Geest van zijn reis rond de wereld terugkeert.\nOndertussen wordt Jafar's zwarte lamp ontdekt door een idioot-oplichter genoemd Abis Mal. Door Abis Mal te gebruiken, maakt Jafar zijn terugweg naar Agrabah met ideeÃƒÆ’Ã‚Â«n van wraak voor Aladdin en zijn vrienden.\n\n-^-^-^-^-^-^-^-^-\n\nAladdin and The King of Thieves (1995)\n\nAt long last, Aladdin is about to marry the Princess Jasmine. Despite the presence and encouragement of his friends Genie, Carpet, and Abu, he is fearful and anxious.\nHe is most worried as to what kind of father he will be, having never known his own. But when the 40 Thieves disrupt the wedding trying to steal a magical oracular talisman, Aladdin is drawn into a dangerous quest to stop the thieves...and find his long-lost father.\n\n\nEindelijk staat Aladdin op het punt de Prinses Jasmine te huwen. Ondanks de aanwezigheid en de aanmoediging van zijn vrienden Geest, Kleedje en Abu, is hij beangstigd en bezorgd.\nHij is het meest ongerust over welk soort vader hij zal zijn, aangezien hij nooit zijn eigen vader heeft gekend. Maar wanneer de 40 Dieven het huwelijk proberen te onderbreken om een magisch orakelachtig amulet te stelen, wordt Aladdin getrokken in een gevaarlijke zoektocht om de dieven tegen te houden ... en zijn lang verloren vader te vinden. \n\n\n\nIk blijf uploaden tot en met 31 December\nWill seed untill December 31st","torrent":{"xt":"urn:btih:b1f1978ef79781151802df32459d298aa162d9d4","amp;dn":"Aladdin+Movie+Collection+-+NL+Subs+-+ENG+Audio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1f1978ef79781151802df32459d298aa162d9d4","infoHashBuffer":{"type":"Buffer","data":[177,241,151,142,247,151,129,21,24,2,223,50,69,157,41,138,161,98,217,212]},"announce":[],"urlList":[]}}