{"title":"La Liceale il Diavolo e lacquasanta","uid":4134732,"size":1993074008,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b213316cd16fe453d0512db7bfa08c861ca65ac3&amp;dn=La+Liceale+il+Diavolo+e+lacquasanta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"circlensess","files":2,"time":1208207894,"description":"Plot Outline: 3 short stories directed by Nando Cicero.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0079467/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0079467/&lt;/a&gt;\n\nRecommended only for those who watch Italian sex comedies for the &quot;comedy&quot;, 5 August 2007 Author: lazarillo \n\nDespite the title and the presence of Gloria Guida and Lino Banfi, this has nothing to do with the &quot;Liceale&quot; sex comedies where Guida and Banfi play ridiculously overage high school students. This is actually a sex comedy anthology, which with it&amp;#039;s religious overtones, suggests the &quot;Decameron&quot; films of the early 70&amp;#039;s, but it is set in modern times and is actually closer to lamer, more contemporary comic anthologies like &quot;Sex with a Smile&quot; and &quot;Tigers in Lipstick&quot;.\n\nIt&amp;#039;s divided into three parts and Guida (who is the only reason that anyone who isn&amp;#039;t a mentally-challenged Italo-phile would watch this)is only in the first one. Instead of a high school student, Guida plays &quot;Luna&quot; a twenty-year-old singer and virgin (OK, that might be a stretch) who first appears dressed in a lime-green spandex body-suit singing and doing a sexy dance to a hideous English-language disco number (which, days later, I still can&amp;#039;t get out of my head). A sleazy music producer pressures her for sex to advance her career. She rebuffs him, but reconsiders when she doesn&amp;#039;t have enough money to pay the rent. Fortunately (or unfortunately, depending on your point of view), Heaven sends a guardian angel to protect her chastity. Her male guardian angel is first seen doing a bizarre swing dance on a cloud with a bunch of pre-pubescent moppet-headed boys(!) Despite being totally incompetent he manages to help her out of her predicament, and despite apparently being a gay pederast he falls in love with her (this IS Gloria Guida, after all). But his subsequent efforts to get together with her in the after-life go horribly awry.\n\nThis film is a good showcase for Guida in that she gets to sing, dance, and do some real comic acting. Unfortunately she isn&amp;#039;t nearly as good at any of these things as she is at taking off her clothes and displaying her incredible body. And Guida only one very brief nude scene here, so be forewarned. As for the other two stories?--well, it&amp;#039;s all downhill from there (actually it&amp;#039;s all pretty much downhill from the opening scene with the lime-green bodysuit). Recommended only for those who watch Italian sex comedies for the &quot;comedy&quot;.","torrent":{"xt":"urn:btih:b213316cd16fe453d0512db7bfa08c861ca65ac3","amp;dn":"La+Liceale+il+Diavolo+e+lacquasanta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b213316cd16fe453d0512db7bfa08c861ca65ac3","infoHashBuffer":{"type":"Buffer","data":[178,19,49,108,209,111,228,83,208,81,45,183,191,160,140,134,28,166,90,195]},"announce":[],"urlList":[]}}