{"title":"Bill Viola - The Passing (1991)","uid":5093709,"size":510112020,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b2218ded08c0974fc2dce4eaef688cf3fd94b284&amp;dn=Bill+Viola+-+The+Passing+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brosiv","files":1,"time":1253368536,"description":"The Passing (1991)\n\nVideo Codec - DivX4\nVideo Bitrate - 1.093\nAudio Codec - MPEG1/2 L3\nAudio Bitrate - 139 kbps 48 KHz\nAspect Ratio - 1.467 [704 x 480 - 4x3]\nFrame Rate - 23.976 FPS\nSize - 486MB\nRuntime: 54 min\n\nDescription\t\n\nFour years marked by both personal and universal events led Bill Viola to produce this 54-minute video tape in black and white. The birth of his son and the death of his mother, two events at the extremities of l ife, incited the artist to investigate some fundamental ontological questions: the meaning of life, the reasons for existence of human beings in the universe, the relationship between the human, the natural elements and the galaxy, and the o rigin of the mind and body in relation to its finiteness. In the grain of the video picture, the human body and the materiality of the world are merged.\nHere, the artist achieves &quot;that unjustifiable certainty of a perceivable world which is common to us all&quot;, as Merleau-Ponty described it. &quot;It is the heart of truth within us. When a child perceives before thinking, when it begins to put its dreams into things and its thoughts into others, forming with them a common block of life where each person's perspectives cannot yet be distinguished&quot;. 1 Bypassing the very idea of Euclidean perspective; Bill Viola shows in para llel the living human body, being born and dying, and the spiritual body floating in the materiality of the world; desert landscapes scattered with bones and gutted vehicles; traces of civilization and urban landscapes shown in negative, dis turbed only by meteors of light, in fact car headlights. He presents himself as the link between the past and future, between the real world and the metaphysical universe.\n\nSeed Please... :) ","torrent":{"xt":"urn:btih:b2218ded08c0974fc2dce4eaef688cf3fd94b284","amp;dn":"Bill+Viola+-+The+Passing+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2218ded08c0974fc2dce4eaef688cf3fd94b284","infoHashBuffer":{"type":"Buffer","data":[178,33,141,237,8,192,151,79,194,220,228,234,239,104,140,243,253,148,178,132]},"announce":[],"urlList":[]}}