{"title":"The Spy in Black 1939 BrRip Mp4 Lee1001","uid":9898078,"size":921375537,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b281d8cd91800b02a71b1ef90409548d91a10c2b&amp;dn=The+Spy+in+Black+1939+BrRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xultfoad","files":2,"time":1396738802,"description":"The Spy in Black (aka U-Boat 29) 1939 BrRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0031968/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0031968/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/The_Spy_in_Black&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/The_Spy_in_Black&lt;/a&gt;\nThe Spy in Black is a 1939 British film, and the first collaboration between the British filmmakers Michael Powell and Emeric Pressburger. They were brought together by Alexander Korda to make the World War I spy thriller by Joseph Storer Clouston into a film. Powell and Pressburger went on to make over 20 more films together.\nThe Spy in Black, which was released in the US as U-Boat 29, stars Conrad Veidt, Valerie Hobson, Sebastian Shaw and features Marius Goring.\n\nIn 1917, a German U-boat captain, Captain Hardt, is sent on a secret mission off the coast of Scotland. He meets up with a German spy posing as an English schoolmistress, who has enlisted the help of an embittered Royal Navy officer, Ashington. Together, they intend to guide a German U-boat into the British fleet and cause as much destruction as possible. Unfortunately for Hardt, things are not quite what they seem... \n\nThis atmospheric wartime thriller marked the first collaboration of Michael Powell and Emeric Pressburger, a duo who would have an enormous impact on British cinema in the 1940s, with films such as The Life and Death of Colonel Blimp (1943), A Matter of Life and Death (1946) and The Red Shoes (1948).\nIn marked contrast to the obvious propaganda agenda of Powell and Pressburger's later wartime films, The Spy in Black is strangely ambiguous in its messages about war. With its frequent digressions into the morality of warfare, there is a strong suggestion of anti-war sentiment, and it is interesting that the film's most sympathetic character is a German officer, portrayed by Conrad Veidt with a depth and nobility that is lacking in later war films.\n\nReleased within a month of the outbreak of World War II, the film had propaganda value and proved to be an enormous commercial success. Strong performances from Valerie Hobson and Conrad Veidt, along with a taut narrative culminating in a suspenseful climax, make this a compelling film, which explores notions of betrayal and the conflict between desire and duty with great sensitivity and intelligence. Hobson and Veidt would subsequently appear together in another Powell-Pressburger film, Contraband (1940).\n\nVeidt is sensational.\nDarkness, foreboding and regret, rather than any sense of propaganda, dominate this extraordinarily atmospheric World War I spy story made on the eve of World War II. It signals the end of a peacetime era even more clearly than The Lady Vanishes. Daringly, the audience is asked to sympathise with the 'enemy' as the magnificent, shadowy Veidt moves through remarkable Scottish sets on a mission to Scapa Flow to destroy the British fleet. Intrigue, uncertainty and confused loyalties build to a bitter, ironic climax, and along the way Powell effortlessly produces more memorable shots and scenes than can be found in a dozen contemporary films.\n\nThe Spy In Black may fall short of being a classic, but you can't argue with just how thought-provoking a film it is - and it's a gripping, entertaining wartime thriller to boot.\n\nVIDEO\nSize.... 878mb\nDuration.... 01:18:35\nCodec.... h264\nFrame Width..... 720\nFrame Height.... 528\nData Rate.... 1432kbps\nFrame Rate.... 25F/S\nAUDIO\nBit Rate.... 125kbps\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:b281d8cd91800b02a71b1ef90409548d91a10c2b","amp;dn":"The+Spy+in+Black+1939+BrRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b281d8cd91800b02a71b1ef90409548d91a10c2b","infoHashBuffer":{"type":"Buffer","data":[178,129,216,205,145,128,11,2,167,27,30,249,4,9,84,141,145,161,12,43]},"announce":[],"urlList":[]}}