{"title":"Red Hot Chili Peppers UNRELEASED SESSIONS unmastered music","uid":12756311,"size":4360804984,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b295433a555fec776a006bd61ff033083e847c5f&amp;dn=Red+Hot+Chili+Peppers+UNRELEASED+SESSIONS+unmastered+music&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":25,"time":1447454054,"description":"This was created to help catalog and archive each of the many recording sessions undertaken by LA band the Red Hot Chili Peppers in their many forms from 1983 to 2014. \r\n\r\nThis is an effort undertaken to help clear up confusion, spread the word about lost, little known or newly unearthed recordings, and generally celebrate a brilliant band.\r\n\r\nDo a web search for &quot;rhcp sessions&quot; to get more information about each recording session. sites.google.com/site/rhcpsessions/\r\n\r\n\r\n\r\n\r\nNotable inclusions in this is are:\r\n\r\nThe &quot;Unmastered&quot; version of the Californication album: Tou should absolutely check it out as it is a much better quality, better mastering, than the originally released album had due to the so-called &quot;loudness wars&quot; nonsense.\r\n\r\nThis now famous bootleg is sourced from a reference disc made during mixing (at The Village, Los Angeles) to put all of the tracks in one place for the band or for the WB. How it leaked out after that is unknown. - If you have ever noticed that the retail album doesn't sound too great - listen to this!\r\n\r\n\r\nAs well as the 1998 &quot;TEATRO&quot; recordings:\r\n\r\nThe band rehearsed and recorded about 80 minutes worth of demos in September of 1998 at Daniel Lanois' El Teatro studio in Oxnard, California, an old converted Spanish language theatre at 624 S Oxnard Boulevard, Oxnard CA.\r\n\r\nTwo tracks from this recording have surfaced officially, both on the 'Around The World' single; a version of 'Parallel Universe' and a jam called 'Teatro Jam'. The rest have only surfaced in 2014. \r\nAt last. They exist. They're here, and I'm not dreaming.\r\n\r\nThe tracks with Anthony's early vocals seem to be run-throughs of the more finished songs with at least guide melodies, the others are far looser, with only scatting vocals or none at all. Whether they are separate and should be seen as two different collections of songs is unknown at the moment.\r\n'Plate of Brown',  'Tellin' a Lie',  'Mommasan',  'Andaman &amp; Nicobar', 'Sugar Sugar', 'Trouble In The Pub' and 'Boatman' are 100% new and unheard prior to these leaks. 'Californication' and 'Purple Stain' contain vastly different instrumentation and are essentially different songs, though the normal ending for 'Purple Stain' is present.\r\nIn Scar Tissue, Anthony mentions recording eleven songs that they had 'just finished' all up - there are twenty one full songs here.\r\n\r\nThe TEATRO recordings give a different sound to some of the songs you've already heard, and they're quite nice!\r\n\r\nsites.google.com/site/rhcpsessions/\r\n\r\nDo a web search for &quot;rhcpsessions&quot; to get more information about each recording session","torrent":{"xt":"urn:btih:b295433a555fec776a006bd61ff033083e847c5f","amp;dn":"Red+Hot+Chili+Peppers+UNRELEASED+SESSIONS+unmastered+music","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b295433a555fec776a006bd61ff033083e847c5f","infoHashBuffer":{"type":"Buffer","data":[178,149,67,58,85,95,236,119,106,0,107,214,31,240,51,8,62,132,124,95]},"announce":[],"urlList":[]}}