{"title":"Mark of the Ninja Special Edition-3DM","uid":8822606,"size":2403309096,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b2d564fa45b7d5f5c0e1724bbd0094acbe5d838e&amp;dn=Mark+of+the+Ninja+Special+Edition-3DM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1376699086,"description":"\nMark of the Ninja: Special Edition expands the critically-acclaimed 2D stealth experience not only with new challenges and tools, but by adding developer commentary throughout the entire game. This Special Edition encourages playing Mark of the Ninja in new ways, experimenting with new techniques and learning more about the game's development and the team who created it.\nThe new items and playstyle can be unlocked to use in the original game or New Game+ and commentary is available in all game modes and levels. The commentary is also available in all languages supported by Mark of the Ninja, thanks to a massive localization effort by volunteers from the community!\nKey Features:\n\n    New Level - Playing as the tattoo artist Dosan, a new level taking place before the events of Mark of the Ninja sets up the events of the main game in addition to providing new challenges, especially for the non-lethal approach\n    New Items - Two new items provide for more ways to move through shadows and dispatch enemies by turning fallen enemies into traps\n    New Playstyle - Playing as Dosan provides new non-lethal takedowns and the ability to carry more items than any other playstyle\n    Developer Commentary - Over 25 pages of commentary, written by many members of the team and distributed throughout the game, provides interesting insights and anecdotes about Mark of the Ninja's development \n\nExtract and Play.","torrent":{"xt":"urn:btih:b2d564fa45b7d5f5c0e1724bbd0094acbe5d838e","amp;dn":"Mark+of+the+Ninja+Special+Edition-3DM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2d564fa45b7d5f5c0e1724bbd0094acbe5d838e","infoHashBuffer":{"type":"Buffer","data":[178,213,100,250,69,183,213,245,192,225,114,75,189,0,148,172,190,93,131,142]},"announce":[],"urlList":[]}}