{"title":"Richard Thompson...Hand of Kindness(1983)[FLAC]","uid":5599814,"size":280290826,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b2fbbfad12a6546184281ac3c2e474f7b7c38cad&amp;dn=Richard+Thompson...Hand+of+Kindness%281983%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":13,"time":1275240306,"description":"Richard Thompson...Hand of Kindness(1983)[FLAC]\n\nHand Of Kindness is an album by Richard Thompson recorded and released in 1983.After the &quot;Tour From Hell&quot; to\npromote Shoot Out The Lights Richard Thompson resumed a solo career as a recording and performing artist.Hand Of Kindness is a distinct departure from the albums that preceded it. Thompson biographer Patrick Humphries\nobserved that with this album Thompson &quot;left the darkness behind him and walked out into the light&quot;. This is one of the\nmost straight forward and up tempo rock albums in the Thompson catalog. The mood is generally exuberant and Thompson's\nvocals and particularly his guitar playing are confident and extrovert. The one exception is the very dark and\nmelancholy &quot;Devonside&quot;, a track which Thompson rarely plays live, occasionally joking that he doesn't want to depress\nthe audience.Several songs feature the dual saxophones of Pete Zorn and Pete Thomas, and for about 18 months\nafter the release of Hand Of Kindness Thompson toured with his &quot;Big Band&quot; that featured the two sax players\nprominently.The album opens with &quot;Tear Stained Letter&quot;, which was later a Top Ten hit on the country music\ncharts when Jo-El Sonnier recorded it on his 1987 album Come On Joe. A second country music cover of this song was later\nrecorded by Patty Loveless on her 1997 album The Trouble with the Truth.Track listingAll songs written\nby Richard Thompson&quot;Tear Stained Letter&quot; &quot;How I Wanted To&quot; &quot;Both Ends Burning&quot; &quot;A Poisoned\nHeart And A Twisted Memory&quot; &quot;Where The Wind Don't Whine&quot; &quot;The Wrong Heartbeat&quot; &quot;Hand Of Kindness&quot; &quot;Devonside&quot; &quot;Two Left Feet&quot;  PersonnelRichard Thompson - guitar, vocals Dave Pegg - bass\nguitar Dave Mattacks - drums Pete Zorn - saxophone, backing vocals Pete Thomas - saxophone Simon\nNicol - guitar John Hiatt, Bobby King and Clive Gregson - backing vocals John Kirkpatrick - accordion,\nconcertina Aly Bain - violin cd ripped by dBpowerampplease seed","torrent":{"xt":"urn:btih:b2fbbfad12a6546184281ac3c2e474f7b7c38cad","amp;dn":"Richard+Thompson...Hand+of+Kindness%281983%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2fbbfad12a6546184281ac3c2e474f7b7c38cad","infoHashBuffer":{"type":"Buffer","data":[178,251,191,173,18,166,84,97,132,40,26,195,194,228,116,247,183,195,140,173]},"announce":[],"urlList":[]}}