{"title":"[FS9/FSX] Aerosoft - Luxembourg Airports v 3.01 [DVD Box]","uid":7721310,"size":504429213,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b37b2e39450021f8d67d1a722ecc01c22e61ebd5&amp;dn=%5BFS9%2FFSX%5D+Aerosoft+-+Luxembourg+Airports+v+3.01+%5BDVD+Box%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_SnakEye","files":-1,"time":1350074388,"description":"This package includes the three airports of Luxembourg in great detail and the complete country with all relevant landmarks and sightseeing objects. It has detailed mesh and aerial imagery covering the terrain. All buildings on and around the airport of ELLX are photorealistic. Release of the Box: Mid of November 2009 (without guarantee)\n \nLuxembourg is, with an area of 2586 kmÂ², the second smallest country in European Union. But it houses a large amount of international institutions that create a steady stream of civil servants to and from the Duchy. For example the European Court of Justice, European Court of Auditors, European Investment Bank and the secretariat of the European Parliament.\n \nAlthough not know as an aviation superpower it does have three airports and it handles an amazing amount of passengers from the surrounding countries. Sixteen airlines, including German Charter airlines fly on Findel. There are two airlines using Findel as their home base: passenger airline Luxair and cargo airline Cargolux. Cargolux has a direct connection to the highway and is a major company from a small country.\n \nThis package includes the detailed airports of Luxembourg and the complete country with all relevant landmarks and sightseeing objects. It has detailed mesh and aerial imagery covering the terrain. All buildings on and around the airport of ELLX are photorealistic.\n \nThrough the support of the Cargolux simulation department, all ground marks and relevant signs were adopted to reflect reality. The status resembles the date of the inauguration of Terminal A, as of August 2008.\n","torrent":{"xt":"urn:btih:b37b2e39450021f8d67d1a722ecc01c22e61ebd5","amp;dn":"%5BFS9%2FFSX%5D+Aerosoft+-+Luxembourg+Airports+v+3.01+%5BDVD+Box%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b37b2e39450021f8d67d1a722ecc01c22e61ebd5","infoHashBuffer":{"type":"Buffer","data":[179,123,46,57,69,0,33,248,214,125,26,114,46,204,1,194,46,97,235,213]},"announce":[],"urlList":[]}}