{"title":"Napoleon (dvd 1en 2)(MINISERIE) (2002) ( NL SUBS) 2Lions-Team","uid":5567051,"size":9362780363,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b3b7eee12311f66076e56f0ae382efefd4ecf45b&amp;dn=Napoleon+%28dvd+1en+2%29%28MINISERIE%29+%282002%29+%28+NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Pioen","files":-1,"time":1274017061,"description":"Napoleon (dvd 1en 2) (2002)       \n\n\nFrankrijk / Duitsland / ItaliÃƒÂ« / Canada / Verenigde Staten / Verenigd Koninkrijk / Hongarije / Spanje / TsjechiÃƒÂ«\nAvontuur / Drama\n357 minuten (miniserie, 4 delen)\n\ngeregisseerd door Yves Simoneau\nmet Christian Clavier, Isabella Rossellini en GÃƒÂ©rard Depardieu\n\nSerie over het leven van Napoleon, die hier wordt afgebeeld als een man van vlees en bloed, een soldaat, politicus en idealist tegelijk. Hij plaatste zichzelf boven andere mensen en transfomeerde zichzelf in een mythe. De kijker ziet hoe hij omging met macht, vrouwen en zijn veeleisende Corsicaanse familie.\n\n\nEnglish\n\nThe year is 1816, and NAPOLEON, held prisoner by the British on the island of St. Helena, is telling the young English girl BETSY his life story. His meteoric rise to military prominence begins with his victory over the Royalists in 1795, which is followed by campaigns in Italy and Egypt. He marries the young and capricious JOSEPHINE DE BEAUHARNAIS, the love of his life, who unfortunately cannot bear him any children. After a coup d'ÃƒÂ©tat he seizes power in France and crowns himself Emperor of the French in 1804. After his decisive victory at Austerlitz, Napoleon reorganizes Europe and makes his relatives into princes and kings. Continuing resistance by the Spanish results in some initial losses, however. Meanwhile, Napoleon is increasingly fascinated by other women, including the Polish patriot MARIA WALEWSKA, who bears him a son. Napoleon intends to found an imperial dynasty, however, to strengthen his position. After divorcing Josephine, he marries the Austrian princess MARIE-LUISE, who gives birth to an imperial heir. Napoleon's attempt to bring the Czar of Russia to his knees results in a massive catastrophe for his army, and prompts the European powers to form an alliance against him. In 1814 he is defeated in the Campaign of France, and is exiled to the island of Elba. Napoleon gathers all his strength one more time, however, returns to France and wins the hearts of its people again. With a new army he goes into battle against the Allies in 1815 at Waterloo. \n\n\nBeeldformaat: 1.78:1\nGeluid: Dolby digital 5.1\nAudio: English\nSubbs : Dutch\nRarfiles 85\nCover en label Yes\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)(EXTRERN)\n \nGenre : Avontuur\nDrama\n \nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/27912&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/27912&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0253839&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0253839&lt;/a&gt; \n\n\n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nTo the fakers Get a Live\n\n\n \n \n \n","torrent":{"xt":"urn:btih:b3b7eee12311f66076e56f0ae382efefd4ecf45b","amp;dn":"Napoleon+%28dvd+1en+2%29%28MINISERIE%29+%282002%29+%28+NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3b7eee12311f66076e56f0ae382efefd4ecf45b","infoHashBuffer":{"type":"Buffer","data":[179,183,238,225,35,17,246,96,118,229,111,10,227,130,239,239,212,236,244,91]},"announce":[],"urlList":[]}}