{"title":"Johnnie Taylor - Live at the Summit Club - 1972 (2007)","uid":9599839,"size":153974405,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b3f848327685895ca33ce187f6b1b8b089c8a669&amp;dn=Johnnie+Taylor+-+Live+at+the+Summit+Club+-+1972+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1392086851,"description":"mp3 320\n\nWith the release of Johnnie Taylor's Live at the Summit Club, the Concord label's takeover of the Stax catalog from its former owner, Fantasy, has already born fruit. This set is a club date recorded in 1972 as part of the WattStax: The Living Word documentary. Taylor was bumped from the festival lineup on the day of because of time overruns. He was booked into the club with his own band and an expanded set of Los Angeles musicians. The ten cuts here have never been issued unedited, and only one, an edited version of &quot;Jody Got Your Girl and Gone,&quot; made the film, and three others were on earlier LPs as edited versions. The performance by Taylor is electrifying. He's in a club in front of the City of Angels regulars who, according to the notes, were &quot;fur-lined players and ice cold hustlers.&quot; Given the film stills in the booklet, this observation proves to be true. Taylor is far from intimidated, however; he simply delivers an authoritative, strutting, burning performance that engages the audience at street level. They are active participants in what makes this date so special. The band is ragged and sometimes a bit off harmonically, missing cues (especially early), but Taylor doesn't miss a step. He chides them semi-regularly -- the first time happens at the beginning of &quot;Steal Away,&quot; a Jimmy Hughes ballad he ramps up into a funky burner after his amazing read of Isaac Hayes' and David Porter's &quot;Little Bluebird.&quot; He simply tells them to pick it up because they've been dragging all night. &quot;Who's Making Love,&quot; his smash 1968 hit, is here as a full-blown audience participation number, and works to stunning effect. Cuts like &quot;I Don't Wanna Lose You,&quot; &quot;Hello Sundown,&quot; and &quot;Stop Doggin' Me&quot; simply come off like the lost funky soul Holy Grail that they are. The sound is impeccable, as the music was recorded for possible inclusion in the film -- he tells the crew to get their stuff out of his way at one point. This one cannot be recommended enough. ","torrent":{"xt":"urn:btih:b3f848327685895ca33ce187f6b1b8b089c8a669","amp;dn":"Johnnie+Taylor+-+Live+at+the+Summit+Club+-+1972+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3f848327685895ca33ce187f6b1b8b089c8a669","infoHashBuffer":{"type":"Buffer","data":[179,248,72,50,118,133,137,92,163,60,225,135,246,177,184,176,137,200,166,105]},"announce":[],"urlList":[]}}