{"title":"Beyond Compare 3.1.11.12204 Portable","uid":5575753,"size":10633634,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b4d4c1b08418fb5111c393e87753854eded0f1cc&amp;dn=Beyond+Compare+3.1.11.12204+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NoExcuses","files":4,"time":1274380185,"description":"Beyond Compare 3.1.11.12204 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Key are included. Copy the Key file in Install Dir...\n\n\nCompare Files, Folders\n\nBeyond Compare allows you to quickly and easily compare your files and folders.  By using simple, powerful commands you can focus on the differences you're interested in and ignore those you're not.  You can then merge the changes, synchronize your files, and generate reports for your records.\n\nYou can compare entire drives and folders at high speed, checking just sizes and modified times.  Or, thoroughly verify every file with byte-by-byte comparisons.  FTP sites and zip files are integrated seamlessly, so you can update your website with the touch of a button.\n\nOnce you've found specific files you're interested in, Beyond Compare can intelligently pick the best way to compare and display them.  Text files can be viewed and edited with syntax highlighting and comparison rules tweaked specifically for documents, source code, and HTML.  Data files, executables, binary data, and images all have dedicated viewers as well, so you always have a clear view of the changes.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.scootersoftware.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.scootersoftware.com/&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. It's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you like it and it's useful for you, show your support buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:b4d4c1b08418fb5111c393e87753854eded0f1cc","amp;dn":"Beyond+Compare+3.1.11.12204+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4d4c1b08418fb5111c393e87753854eded0f1cc","infoHashBuffer":{"type":"Buffer","data":[180,212,193,176,132,24,251,81,17,195,147,232,119,83,133,78,222,208,241,204]},"announce":[],"urlList":[]}}