{"title":"All the Art That's Fit to Print (And Some That Wasn't) Inside Th","uid":13233759,"size":166749636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b506e1a7097453f62c07fb823e0e98c43274eb38&amp;dn=All+the+Art+That%27s+Fit+to+Print+%28And+Some+That+Wasn%27t%29+Inside+Th&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1452978768,"description":"All the Art That's Fit to Print (And Some That Wasn't) Inside The New York Times Op-Ed Page - RePrint Edition (2012).pdf Gooner\r\n\r\nPublisher: Columbia University Press; Reprint edition (September 4, 2012)\r\nLanguage: English\r\nISBN-10: 0231138253\r\nISBN-13: 978-0231138253\r\n\r\nAll the Art That's Fit to Print reveals the true story of the world's first Op-Ed page, a public platform that―in 1970―prefigured the Internet blogosphere. Not only did the New York Times's nonstaff bylines shatter tradition, but the pictures were revolutionary. Unlike anything ever seen in a newspaper, Op-Ed art became a globally influential idiom that reached beyond narrative for metaphor and changed illustration's very purpose and potential.\r\n\r\nJerelle Kraus, whose thirteen-year tenure as Op-Ed art director far exceeds that of any other art director or editor, unveils a riveting account of working at the Times. Her insider anecdotes include the reasons why artist Saul Steinberg hated the Times, why editor Howell Raines stopped the presses to kill a feature by Doonesbury's Garry Trudeau, and why reporter Syd Schanburg—whose story was told in the movie The Killing Fields—stated that he would travel anywhere to see Kissinger hanged, as well as Kraus's tale of surviving two and a half hours alone with the dethroned peerless outlaw, Richard Nixon.\r\n\r\nAll the Art features a satiric portrayal of John McCain, a classic cartoon of Barack Obama by Jules Feiffer, and a drawing of Hillary Clinton and Obama by Barry Blitt. But when Frank Rich wrote a column discussing Hillary Clinton exclusively, the Times refused to allow Blitt to portray her. Nearly any notion is palatable in prose, yet editors perceive pictures as a far greater threat. Confucius underestimated the number of words an image is worth; the thousand-fold power of a picture is also its curse.\r\n\r\nOp-Ed's subject is the world, and its illustrations are created by the world's finest graphic artists. The 142 artists whose work appears in this book hail from thirty nations and five continents, and their 324 pictures-gleaned from a total of 30,000-reflect artists' common drive to communicate their creative visions and to stir our vibrant cultural-political pot","torrent":{"xt":"urn:btih:b506e1a7097453f62c07fb823e0e98c43274eb38","amp;dn":"All+the+Art+That%27s+Fit+to+Print+%28And+Some+That+Wasn%27t%29+Inside+Th","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b506e1a7097453f62c07fb823e0e98c43274eb38","infoHashBuffer":{"type":"Buffer","data":[181,6,225,167,9,116,83,246,44,7,251,130,62,14,152,196,50,116,235,56]},"announce":[],"urlList":[]}}