{"title":"RiffTrax - Dr. Who and the Daleks","uid":8503387,"size":935618554,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b596373d7c69ee0fa6dabc9b8f717439a2c25ac8&amp;dn=RiffTrax+-+Dr.+Who+and+the+Daleks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"saybis","files":1,"time":1369359327,"description":"ATTENTION, WHOVIANS! (For the uninitiated, that is not something Jay-Z yells at the beginning of a song, it's a name for Doctor Who fans)\n\nBefore Matt Smith, before David Tennant, before Christopher Eccleston, before even the scarf and afro guy, there was Peter Cushing. Well, not before, exactly, because this feature-length movie isn't a canonical part of the Doctor Who universe or storyline. So it's sort of more adjacent, than before. It's nearby, if nothing else. Approximate, at least. Like, Dr. Who is in it! But instead of a mysterious Timelord alien, he's kind of just a confused human grandpa with the last name Who. But he does have a TARDIS! Of course, instead of a disguised alien craft it's just, like, this junky thing he made with his granddaughter. Oh yeah, he hangs out with his granddaughters. Yeah. But then they travel through space and fight the most classic Dr. Who bad guys of all, the Daleks! Of course, in this imagining of Dr. Who, the Daleks are just some dopey trashcan looking guys with plungers sticking out of 'em that talk funny -- oh, that's how they still are? Seriously?? PERFECT! IT'S CANON AFTER ALL!\n\nSo no matter how much you know, don't know, or don't want to know about Dr. Who, this movie will fill your needs. Plus, the RiffTrax itself is totally canon, and an official part of the Mike, Kevin, and Bill timeline (unlike that regrettable one-off TV special, &quot;RiffTrax goes to Hawaii&quot;, which shall never be spoken of again). Exterminate Dr. Who and the Daleks today!","torrent":{"xt":"urn:btih:b596373d7c69ee0fa6dabc9b8f717439a2c25ac8","amp;dn":"RiffTrax+-+Dr.+Who+and+the+Daleks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b596373d7c69ee0fa6dabc9b8f717439a2c25ac8","infoHashBuffer":{"type":"Buffer","data":[181,150,55,61,124,105,238,15,166,218,188,155,143,113,116,57,162,194,90,200]},"announce":[],"urlList":[]}}