{"title":"Tangled Series Audiobooks (1-4) by Emma Chase","uid":13974344,"size":905868334,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b615edddc4793945ea05fdc52afa4f6df19b5a41&amp;dn=Tangled+Series+Audiobooks+%281-4%29+by+Emma+Chase&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"yousef86","files":24,"time":1458640424,"description":"Tangled (Tangled Book 1) by Emma Chase\r\n======================================\r\nEnglish | MP3 64kbps CBR | 08:00:51 | ISBN: 1442370599 | 220 MB\r\nGenre: Contemporary Romance | Narrator: Sebastian York\r\n\r\n\r\nWhen rich, handsome, and arrogant meets beautiful, brilliant, and ambitious, things are bound to get tangled.\r\n\r\nDrew Evans makes multimillion-dollar business deals and seduces New York’s most beautiful women with just a smile. So why has he been shuttered in his apartment for seven days, miserable and depressed? He’ll tell you he has the flu, but we all know that’s not really true.\r\n\r\nWhen Katherine Brooks is hired as the new associate at Drew’s father’s investment banking firm, every aspect of the dashing playboy’s life is thrown into a tailspin. The professional competition she brings is unnerving, his attraction to her is distracting, his failure to entice her into his bed is exasperating.\r\n\r\nHow can one woman turn a smooth-talking player into a broken, desperate man? By making the one thing he never wanted in life the only thing he can’t live without.\r\n\r\n\r\nHoly Frigging Matrimony: A Tangled Series Short Story (Tangled Book 1.5) by Emma Chase\r\n======================================================================================\r\nEnglish | MP3 32kbps CBR | 52:22 | ISBN: 1442377607 | 11.9 MB\r\nGenre: Contemporary Romance | Narrator: Sebastian York\r\n\r\n\r\nWhat does Drew Evans have to say next? Find out in this forty page short story, filled with his sexy charm, unique advice and hilarious one-liners.\r\n\r\nMarriage: the final frontier. Steven went first. He was kind of our test subject. Like those monkeys that NASA sent off into space in the fifties, all the while knowing they’d never make it back.\r\n\r\nAnd now another poor rocket is ready to launch.\r\n\r\nBut this isn’t just any posh New York wedding. You’ve seen my friends, you’ve met our families, you know you're in for a treat. Everyone wants their wedding to be memorable. This one’s going to be un-frigging-forgettable.\r\n\r\nHoly Frigging Matrimony takes place about a year after Tangled’s end and is from Drew’s POV.\r\n\r\n\r\nTwisted (Tangled Book 2) by Emma Chase\r\n======================================\r\nEnglish | MP3 64kbps CBR | 07:02:13 | ISBN: 1442370602 | 193 MB\r\nGenre: Contemporary Romance | Narrator: Charlotte Penfield &amp; Sebastian York\r\n\r\n\r\nWhen spontaneous and carefree meets cautious and responsible, falling in love can get just a little Twisted.\r\n\r\nThere are two kinds of people in this world: the ones who look first, and the ones who leap. I’ve always been more of a looker. A planner. Cautious. Then I met Drew Evans. He was so persistent. So sure of himself. He made it easy to leap with him.\r\n\r\nDid you think Drew and I were going to ride off into the sunset and live happily ever after? So did I. But life is about choices, and Drew already made his. In fact, he tried to decide for the both of us—but you know that’s not my style. So I came back to Greenville, to spend some time alone... sort of.\r\n\r\nBecause old habits die hard, and sometimes you have to go back to where you began before you can move ahead again.\r\n\r\n\r\nTamed (Tangled Book 3) by Emma Chase\r\n====================================\r\nEnglish | MP3 64kbps CBR | 05:42:58 | ISBN: 1442370610 | 157 MB\r\nGenre: Contemporary Romance | Narrator: Deacon Lee\r\n\r\n\r\nStop me if you’ve heard this one before: girl meets player, they fall in love, player changes his ways.\r\n\r\nIt’s a good story. But it’s not our story. Ours is a lot more colorful.\r\n\r\nWhen I met Dee I knew right away that she was special. When she met me, she thought I was anything but special—I was exactly like every other guy who’d screwed her over and let her down. It took some time to convince her otherwise, but turns out I can make a convincing argument when sex is at stake.\r\n\r\nYou might know where this story’s headed. But the best part isn't where we ended up.\r\n\r\nIt’s how we got there.\r\n\r\nTAMED goes back in time to the Tangled days. But this time around, it’s not Drew dishing out the advice and opinions—it’s his best friend Matthew, who of course is dealing with Dee Dee.\r\n\r\n\r\nTied (Tangled Book 4) by Emma Chase\r\n===================================\r\nEnglish | MP3 96kbps CBR | 06:48:41 | ISBN: 1442375175 | 280 MB\r\nGenre: Contemporary Romance | Narrator: Sebastian York\r\n\r\n\r\nIn the fourth sexy romance by the New York Times bestselling author of Tangled and Twisted, Drew and Kate can’t wait to tie the knot—if they can survive the pre-wedding festivities.\r\n\r\nFor most of my life, I never imagined I’d get married. But Kate did the impossible: she changed me. I think we can all agree I was pretty frigging awesome before, but now I’m even better.\r\n\r\nThe road to this day wasn’t all rainbows and boners. There were mistakes and misunderstandings worthy of a Greek tragedy. But Kate and I made it through with our inexhaustible lust, boundless admiration, and everlasting love for one another intact.\r\n\r\nThat being said, there were some unexpected incidents in Vegas last weekend that could have been a problem. It was kind of…my final test.\r\n\r\nI know what you’re thinking—what the hell did you do this time? Relax. Let’s not judge, or call for my castration, until you’ve heard the whole story.\r\n\r\nAnd hold on tight, because you’re in for a wild ride. Did you expect anything less?","torrent":{"xt":"urn:btih:b615edddc4793945ea05fdc52afa4f6df19b5a41","amp;dn":"Tangled+Series+Audiobooks+%281-4%29+by+Emma+Chase","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b615edddc4793945ea05fdc52afa4f6df19b5a41","infoHashBuffer":{"type":"Buffer","data":[182,21,237,221,196,121,57,69,234,5,253,197,42,250,79,109,241,155,90,65]},"announce":[],"urlList":[]}}