{"title":"Mika - The Origin of Love (2012) 2 CDs","uid":7805528,"size":144951197,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b68dc779e3b20f66a908f25de8c731f1389110f1&amp;dn=Mika+-+The+Origin+of+Love+%282012%29+2+CDs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bayfia","files":22,"time":1352387469,"description":"Review by Wikipedia\n\nThe Origin of Love is the third studio album released by British singer-songwriter Mika. The album was released in France on 17 September 2012, and in the United Kingdom was released on 8 October 2012, via Casablanca Records and Barclay Records respectively. The album was preceded by an alternate lead single in each region: &quot;Elle me dit&quot; was first released in France, whereas &quot;Celebrate&quot; served as the first official single for the United Kingdom.\n\nMika worked with Greg Wells, Dan Wilson, Benny Benassi and Klas Ã…hlund on the album. The team contributed both written material and production credits. Mika was confirmed to be recording the album in various locations, including Montreal, Miami and Sweden.\n\nIn an interview for Digital Spy, Mika described the album as &quot;more simplistic pop, less layered than the last one&quot;. He also described the album's themes as dealing with the adult years, claiming that &quot;it's a serious album, but still has the boppy, happy tunes.&quot; In an interview for a popular French magazine, Mika claimed that the album's musical style will include elements of Daft Punk and Fleetwood Mac.","torrent":{"xt":"urn:btih:b68dc779e3b20f66a908f25de8c731f1389110f1","amp;dn":"Mika+-+The+Origin+of+Love+%282012%29+2+CDs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b68dc779e3b20f66a908f25de8c731f1389110f1","infoHashBuffer":{"type":"Buffer","data":[182,141,199,121,227,178,15,102,169,8,242,93,232,199,49,241,56,145,16,241]},"announce":[],"urlList":[]}}