{"title":"Paper Valentine - Brenna Yovanoff.epub","uid":9374277,"size":389168,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b69aa17e7cd349bd4a5ee6a41a29cd0c44bf7c43&amp;dn=Paper+Valentine+-+Brenna+Yovanoff.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387592381,"description":"The city of Ludlow is gripped by the hottest July on record. The asphalt is melting, the birds are dying, petty crime is on the rise, and someone in Hannah Wagnor's peaceful suburban community is killing girls.For Hannah, the summer is a complicated one. Her best friend Lillian died six months ago, and Hannah just wants her life to go back to normal. But how can things be normal when Lillian's ghost is haunting her bedroom, pushing her to investigate the mysterious string of murders? Hannah's just trying to understand why her friend self-destructed, and where she fits now that Lillian isn't there to save her a place among the social elite. And she must stop thinking about Finny Boone, the big, enigmatic delinquent whose main hobbies seem to include petty larceny and surprising acts of kindness.With the entire city in a panic, Hannah soon finds herself drawn into a world of ghost girls and horrifying secrets. She realises that only by confronting the Valentine Killer will she be able move on with her life - and it's up to her to put together the pieces before he strikes again.","torrent":{"xt":"urn:btih:b69aa17e7cd349bd4a5ee6a41a29cd0c44bf7c43","amp;dn":"Paper+Valentine+-+Brenna+Yovanoff.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b69aa17e7cd349bd4a5ee6a41a29cd0c44bf7c43","infoHashBuffer":{"type":"Buffer","data":[182,154,161,126,124,211,73,189,74,94,230,164,26,41,205,12,68,191,124,67]},"announce":[],"urlList":[]}}