{"title":"Larry Jon Wilson - New Beginnings / Let Me Sing My Song To You [","uid":11705411,"size":417163441,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b7c6057d2834cda1d02df0ec12cb5cce2f9b28a4&amp;dn=Larry+Jon+Wilson+-+New+Beginnings+%2F+Let+Me+Sing+My+Song+To+You+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":37,"time":1424103224,"description":"1. Ohoopee River Bottomland \n2. Through The Eyes Of Little Children \n3. New Beginnings (Russian River Rainbow) \n4. The Truth Ain't In You \n5. Canoochee Revisited (Jesus Man) \n6. Broomstraw Philosophers And Scuppernong Wine \n7. Lay Me Down Again \n8. Melt Not My Igloo \n9. Things Ain't What It Used To Be (And Probably Never Was) \n10. Bertrand My Son \n11. Drowning In The Mainstream \n12. Let Me Sing My Song To You \n13. Sheldon Churchyard \n14. I Remember It Well \n15. Ballad Of Handy Mackey \n16. Think I Feel A Hitchhike Coming On \n17. Willoughby Grove \n18. Life Of A Good Man \n19. Kindred Spirit \n20. Farther Along\n\nNEW BEGINNINGS is a long overdue reissue of the first two albums by this mysteriously overlooked singer-songwriter/cultfigure. Larry Jon Wilson made these albums in the mid-'70s for a country label, but his music is much richer and genre bending than the country tag might indicate. He's a highly literate and occasionally very funny writer (see &quot;Melt Not My Igloo&quot;), a bit of a bluesman in the vein of Tony Joe White(check out the swampish opening &quot;Ohoopee River Bottom Line&quot;), and the possessor of a rich, vibrato-laden baritone that recalls Fred Neil.\n\nIt's therefore astonishing that at the time these records first appeared they were heard by hardly anybody except peers like Kris Kristofferson and Townes VanZant. They've hardly dated at all (the production is surprisingly tasteful for mid-'70s Nashville) and anybody with a taste for the two above-mentioned good old boys should purchase this immediately. \n\nSmoky, elegant storytelling that drifts through a southern gothic haze and over a funky backbeat. Such is the unique and criminally underappreciated songcraft of Larry Jon Wilson. Ahead and possibly outside of his time Wilson cut a handful of stellar yet neglected LPs for Monument Records in the mid-1970s. The first two are presented here in all their smouldering soul groove glory. From the windswept country-fried funk of Sheldon Churchyard to the heartfelt muse of Bertrand My Son, Wilson was praised and revered by his peers (Kristofferson, Van Zandt, Newbury et. al.) but passed over by the Nashville mainstream.\n\nLarry Jon Wilson, ambassador for the soul country","torrent":{"xt":"urn:btih:b7c6057d2834cda1d02df0ec12cb5cce2f9b28a4","amp;dn":"Larry+Jon+Wilson+-+New+Beginnings+%2F+Let+Me+Sing+My+Song+To+You+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7c6057d2834cda1d02df0ec12cb5cce2f9b28a4","infoHashBuffer":{"type":"Buffer","data":[183,198,5,125,40,52,205,161,208,45,240,236,18,203,92,206,47,155,40,164]},"announce":[],"urlList":[]}}