{"title":"Encyclopedia of Race and Crime","uid":11775059,"size":11658791,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7e1f5acea1f5dc6196a939775dc652ee25b5523&amp;dn=Encyclopedia+of+Race+and+Crime&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427247283,"description":"As seen almost daily on local and national news, race historically and presently figures prominently in crime and justice reporting within the United States, in the areas of hate crimes, racial profiling, sentencing disparities, wrongful convictions, felon disenfranchisement, political prisoners, juveniles and the death penalty, and culturally specific delinquency prevention programs.\nThe Encyclopedia of Race and Crime covers issues in both historical and contemporary context, with information on race and ethnicity and their impact on crime and the administration of justice. These two volumes offer a greater appreciation for the similar historical experiences of varied racial and ethnic groups and illustrate how race and ethnicity has mattered and continues to matter in the administration of American criminal justice.\n\nKey Features\n\nCovers a number of broad thematic areas: basic concepts and theories of criminal justice; the police, courts, and corrections; juvenile justice; public policy; the media; organizations; specific groups and populations; and specific cases and biographies\nAddresses such topics as gender, hate/bias crimes, immigrant experiences, international and cross-cultural issues, race and gangs, and race and law,\nPresents experiences of all major racial and ethnic groups in the U.S., including Asians, Blacks, Latinos, Native Americans, and Ethnic Whites, as well as religious minorities, such as Muslims\nIncludes coverage of recent incidents like the alleged rape of a black female North Carolina Central University student by white male members of the Duke University Lacrosse Team;, the Jena 6 incident; the Tulia, Texas drug arrests; the Rodney King beating; the O. J. Simpson trials in the 1990s; and more recent racial profiling incidents\nTwo appendices provide information on locating and interpreting statistical data on race and crime, as well as detailed instructions on how to access statistical data on the web for such specific areas as arrests, drugs, gang membership, hate crimes, homicide trends, juvenile justice, prison populations, racial profiling, the death penalty, and victimization\nBecause the topic of race and crime is of wide interest and relevance, entries in this Encyclopedia are written in an accessible style to appeal to a broad audience, making it a welcome addition to academic and public libraries alike","torrent":{"xt":"urn:btih:b7e1f5acea1f5dc6196a939775dc652ee25b5523","amp;dn":"Encyclopedia+of+Race+and+Crime","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7e1f5acea1f5dc6196a939775dc652ee25b5523","infoHashBuffer":{"type":"Buffer","data":[183,225,245,172,234,31,93,198,25,106,147,151,117,220,101,46,226,91,85,35]},"announce":[],"urlList":[]}}