{"title":"[XLGirls] Jasmine Jones (Jasmine &amp; The Ass Cream Man / 02.07","uid":9592141,"size":498818144,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b87b638b50034e5c45ccad5d59612d45a98aae47&amp;dn=%5BXLGirls%5D+Jasmine+Jones+%28Jasmine+%26amp%3B+The+Ass+Cream+Man+%2F+02.07&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chkm8te","files":1,"time":1391924334,"description":"[XLGirls] Jasmine Jones (Jasmine &amp; The Ass Cream Man / 02.07.2014)\n\nTony does not often drink scotch. But when he does, he likes it served by good-looking women with huge tits that he can boff right then and there. Perfectly understandable. You see, at this private club, guys and gals can bang each other without any hassles. After Tony gets his drink from Jasmine Jones, he throws a pitch at her and she catches it. Pulling out one big boob from her dress, Jasmine brings it to his face for him to suck on. Now look carefully at Jasmine's right nipple before and after he sucks it. It hardens and noticeably elongates immediately after he sucks it. When she takes out her left breast, that nipple is also long and hard. If you saw Jasmine's slo-mo breast bouncing video, the super-sensitivity of her nipples is talked about and seen in close-ups. While Tony is enjoying a mouthful of big boobs, Jasmine is unbuttoning his shirt. When she gets to his trousers, his horn is already hard and ready for Jasmine's wet lips. Jasmine kneels as he sits and licks the tip, then opens her mouth wide in an impressive show of deep throat cock swallowing. Jasmine Jones has award-winning blow job skills. Tony undresses Jasmine to her stockings and heels and lays her out on the couch. It's time to fuck. Spreading Jasmine's legs wide, he finger-bangs her shaved, wet pussy and then finger-bangs her brown-eye. First he will fuck Jasmine's hot, tight cunt, then switch over to fill her asshole with the stiff man-bone she dearly loves. (Please note: Our videos and photo sets are shot separately. In the video, Jasmine's creampie is in her pussy; in the still set, the creampie is anal.)\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=9nyjt7hjkfrmprqeylqw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=9nyjt7hjkfrmprqeylqw.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=2ambvb794dfi49lxqorb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=2ambvb794dfi49lxqorb.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:b87b638b50034e5c45ccad5d59612d45a98aae47","amp;dn":"%5BXLGirls%5D+Jasmine+Jones+%28Jasmine+%26amp%3B+The+Ass+Cream+Man+%2F+02.07","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b87b638b50034e5c45ccad5d59612d45a98aae47","infoHashBuffer":{"type":"Buffer","data":[184,123,99,139,80,3,78,92,69,204,173,93,89,97,45,69,169,138,174,71]},"announce":[],"urlList":[]}}