{"title":"Red Alert 2 plus Yuris Revenge Portable - [Espera]","uid":6364765,"size":360592571,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b8f5ed9e1c320053f06699cc362aaa0e0584299a&amp;dn=Red+Alert+2+plus+Yuris+Revenge+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"BainKB","files":2,"time":1304468555,"description":"\n    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2a.Run &quot;Red Alert 2 - 1 Click.exe&quot;\n3b.Run &quot;Red Alert 2 Yuri's Revenge 1 Click.exe&quot;\n4.Enjoy.\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nPicture yourself sitting peacefully in the comfort of your living room watching your favorite television program, when suddenly a newscast flashes on the screen declaring that invading Soviet armed forces have destroyed the Statue of Liberty and their next target is Washington, D.C. and the Pentagon. Such a dreaded scenario plays out in Command &amp; Conquer Red Alert 2, the long overdue sequel to the RTS game that helped put real-time strategy on the map. If benchmarks are any indication, the original C&amp;C Red Alert is still very much the standard against which many RTS games are measured. More often than not, recent RTS games have largely failed in their attempts at trying to improve upon that benchmark by introducing 3D accelerated graphics, eliminating all forms of base construction, or blending the RTS format with other types of games. In consideration of those failures, Westwood Studios was faced with the dilemma of either taking an innovative or conservative approach with Red Alert 2. In this case, they chose to take the conservative approach by creating a sequel that doesn?t push the genre forward by any means, but nevertheless offers loads of fun in the classical RTS formula. \n\nThe story in Yuri's Revenge logically continues the events we witnessed in Red Alert 2. After the allies overpowered the Soviets and conquered Moscow, Yuri retreats underground to develop his plan on how to wreak his revenge on both sides. He starts building a network of psychic dominators, which can control the minds of people all over the planet. The allies manage to hold Yuri in San Francisco long enough for Mr. Albert Einstein to send you back through time. If you play the Soviet campaign, your mission will not only be to stop Yuri, but also to change the course of history and help Russia return to its old glory.\n\nSystem requirements\n\nWindows 95/98/NT/ME/2000\n266 MHz Processor\n64 MB RAM\n900 MB HDD space\n4x CD-ROM Drive\n2 MB video card\nDirectSound-compatible soundcard","torrent":{"xt":"urn:btih:b8f5ed9e1c320053f06699cc362aaa0e0584299a","amp;dn":"Red+Alert+2+plus+Yuris+Revenge+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8f5ed9e1c320053f06699cc362aaa0e0584299a","infoHashBuffer":{"type":"Buffer","data":[184,245,237,158,28,50,0,83,240,102,153,204,54,42,170,14,5,132,41,154]},"announce":[],"urlList":[]}}