{"title":"Troubleshooting Switching Power Converters{BBS}","uid":6845282,"size":10326506,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b98527c58099bfb578a1c5103025dd5e1ecdd129&amp;dn=Troubleshooting+Switching+Power+Converters%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1322325055,"description":"Power Supply design is all about detail. And a large part of that detail lies in the practical domain, largely because of the typically small number of microseconds of switching periods involved, and the even smaller tens of nanoseconds of switch transition times --- all these, in effect accentuating various &quot;second-order&quot; effects, that eventually end up playing prime havoc with &quot;normal&quot; expectations of how the circuit should behave. So not unsurprisingly, even after reading several books, most readers still find themselves no closer to the ultimate goal of designing an actual power supply.\n\nSooner or later, all engineers start realizing the hard fact that designing a switching power supply isn't the trivial task it once seemed to be. But even after years of successfully mastering the underlying theory, the ultimate goal of creating a cost-effective, reliable and commercially viable power supply may still remain a distant dream, since success ultimately hinges on experience. That is, in fact, what clearly differentiates a senior and seasoned power supply engineer from the others --- the ability to navigate and surmount a veritable minefield of tricky issues that can only be learned the hard way, by actual hands-on experience on the job.\n\nThis book presents practical knowledge the author acquired rather painfully, while working &quot;in the trenches&quot; for several years in major engineering companies scattered across several continents. This is intended to be the mythical senior engineer's &quot;bag of tricks,&quot; finally made available in the form of an easy-to-read book on your shelf. This book will make life for the ambitious power supply engineer much simpler --- besides reducing significantly, the rigorous requirement of having to be a senior engineer's protÃƒÂ©gÃƒÂ© for years on end, just to gain a small measure of real success in this field.\n\n* A practical presentation that answers the important question: why is my switching converter behaving so differently than what I was expecting on the basis of my paper design? And how do I bridge that huge gap?\n* For the first time, a systematic and thorough discussion of troubleshooting switching power supplies.\n* Coverage of AC/DC and DC/DC power supplies.\n* Bench Evaluation of semiconductor ICs used in power conversion --- describing standard and unusual techniques mastered by the author, while testing similar chips at National Semiconductor.\n* Detailed coverage of vital topics that haven't been covered by available sources --- grounding systems, the subtleties of component datasheets, and using instruments and probes effectively.\n* Systematic investigation (type of failure mechanism, topology, etc.) and solutions for 5 years of reported power supply issues on a prominent, public web forum. This approach will ensure that engineers will not repeat the same mistakes.\n* A unique, readable style: personal and direct; no mystification--- just the plain truth, easily and logically explained, with plenty of pictures, graphs and plots.\n\n\n\n# Hardcover: 320 pages\n# Publisher: Newnes; 1 edition (September 14, 2007)\n# Language: English\n# ISBN-10: 0750684216\n# ISBN-13: 978-0750684217","torrent":{"xt":"urn:btih:b98527c58099bfb578a1c5103025dd5e1ecdd129","amp;dn":"Troubleshooting+Switching+Power+Converters%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b98527c58099bfb578a1c5103025dd5e1ecdd129","infoHashBuffer":{"type":"Buffer","data":[185,133,39,197,128,153,191,181,120,161,197,16,48,37,221,94,30,205,209,41]},"announce":[],"urlList":[]}}