{"title":"[SoM]Furia cieca[DvdRip-Divx5-Ita-Mp3]","uid":4437339,"size":851386908,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ba3cab04045bf7cfcf40b4838791047133118cb2&amp;dn=%5BSoM%5DFuria+cieca%5BDvdRip-Divx5-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mitimex","files":1,"time":1223630675,"description":"Divenuto cieco in seguito a un&amp;#039;azione di guerra nel Vietnam il soldato americano Nick Parker viene raccolto, ospitato e curato da gente semplice di un vicino villaggio, e in seguito allenato a far tesoro di suoni, odori, impressioni tattili, per cavarsela ed essere autosufficiente, nonostante la grave menomazione. Tornato negli Stati Uniti, Nick si pone con pertinacia alla ricerca di Frank Deveraux, un commilitone amico che si era distanziato da lui - e forse non a caso - durante lo scontro che gli ha causato la cecitÃƒÂ . Ma l&amp;#039;amico ÃƒÂ¨ stato rapito dalla mafia e costretto a lavorare a Reno in un&amp;#039;industria chimica che produce droga, per aver salva la vita del figlio Billy, di appena nove anni.Vista perÃƒÂ² la riluttanza di Deveraux a mettere a punto una miscela di droga particolarmente micidiale, i malviventi decidono di rapire il ragazzo, per obbligare Frank al suo dannato compito. Diretto all&amp;#039;abitazione dell&amp;#039;amico a Miami, sicuro di trovarlo in casa, Nick, ignorando la &quot;situazione&quot; di Frank vi capita - per coincidenza fortuita - proprio nel bel mezzo della sparatoria messa in atto dai klller dell&amp;#039;industria farmaceutica per rapire il ragazzo. Brandendo alla cieca il suo - apparentemente inoffensivo - bastone di non vedente, che in realtÃƒÂ  cela una lama affilatissima, e con l&amp;#039;aiuto della sorprendente acutezza sentitiva e straordinaria destrezza nelle arti marziali accumulata durante il lungo allenamento nel villaggio vietnamita, Nick riesce a sterminare gli aggressori e a salvare il ragazzo. Non perÃƒÂ² la madre, che, colpita a morte nella sparatoria, raccomanda a Nick di riportare Billy al padre.\nDivenuto inopinatamente padre putativo del piccolo viziatissimo Billy, Nick, con i suoi ruvidi interventi educativi non sempre ortodossi, riesce ad affezionarselo e a farne un ragazzo audace e volitivo. Giunto a Reno dopo una serie di spettacolari avventure insieme a Billy, Nick riesce a liberare Frank e a distruggere il laboratorio dell&amp;#039;industria chimica.","torrent":{"xt":"urn:btih:ba3cab04045bf7cfcf40b4838791047133118cb2","amp;dn":"%5BSoM%5DFuria+cieca%5BDvdRip-Divx5-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba3cab04045bf7cfcf40b4838791047133118cb2","infoHashBuffer":{"type":"Buffer","data":[186,60,171,4,4,91,247,207,207,64,180,131,135,145,4,113,51,17,140,178]},"announce":[],"urlList":[]}}