{"title":"BBC Heroes of the Enlightenment","uid":9392727,"size":1337854036,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ba48ff93802a5ef9be38ad30a8570af5994bd1ec&amp;dn=BBC+Heroes+of+the+Enlightenment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"stew_dent","files":2,"time":1387915905,"description":"The Power of Knowledge explores the fact that from Google, and Facebook and Wikipedia to the systems of democracy, finance, manufacture and the law - many aspects of modern life owe their existence to a single defining period: the Age of Enlightenment of the 18th century.\n\nIn the space of barely 100 years, Western deference to divine and royal authority gave way to a belief that humans had the power to understand their own nature and the universe around them. Holy writ gave way to empirical investigation, the power of miracles to that of logic and reason. In The Power of Knowledge we can see it was a revolution in ideas, information and technology.\n\nFilmed in locations across Britain, France, Germany, Portugal and America, this illuminating series brings to life some of the key characters of the era - Newton, Erasmus, Darwin, Voltaire, Diderot, Condorcet, Frederick the Great and Thomas Jefferson - and the ideas that shaped the world we live in today.\n\nThe Power of Knowledge is part of the BBC history series Heroes of the Enlightenment which provides an insightful look at this turbulent historical period.\n\n***********************************************************************************\n\nFrom Google, and Facebook and Wikipedia to the systems of democracy, finance, manufacture and the law - Changing Society investigates how many aspects of modern life owe their existence to a single defining period: the Age of Enlightenment of the 18th century.\n\nIn Changing Society  we see how in the space of barely 100 years, Western deference to divine and royal authority gave way to a belief that humans had the power to understand their own nature and the universe around them. Holy writ gave way to empirical investigation, the power of miracles to that of logic and reason. It was a revolution in ideas, information and technology.\n\nFilmed in locations across Britain, France, Germany, Portugal and America, this illuminating series brings to life some of the key characters of the era - Newton, Erasmus, Darwin, Voltaire, Diderot, Condorcet, Frederick the Great and Thomas Jefferson - and the ideas that shaped the world we live in today.\n\nChanging Society is part of the BBC history series Heroes of the Enlightenment which takes a look at how the radical ideas of the 18th century shaped the world we live in today.","torrent":{"xt":"urn:btih:ba48ff93802a5ef9be38ad30a8570af5994bd1ec","amp;dn":"BBC+Heroes+of+the+Enlightenment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba48ff93802a5ef9be38ad30a8570af5994bd1ec","infoHashBuffer":{"type":"Buffer","data":[186,72,255,147,128,42,94,249,190,56,173,48,168,87,10,245,153,75,209,236]},"announce":[],"urlList":[]}}