{"title":"New York Dolls - Studio Discography 1973-2011 [FLAC]","uid":8781129,"size":3123552594,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba691e9acec6eb9fd6fb16724e43d828a17aed87&amp;dn=New+York+Dolls+-+Studio+Discography+1973-2011+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"rudown78","files":205,"time":1375714113,"description":"New York Dolls - Studio Discorgaphy 1973-2011 [FLAC]\n\n\nThe New York Dolls created punk rock before there was a term for it. Building on the Rolling Stones' dirty rock &amp; roll, Mick Jagger's androgyny, girl group pop, the Stooges' anarchic noise, and the glam rock of David Bowie and T. Rex, The New York Dolls created a new form of hard rock that presaged both punk rock and heavy metal. Their drug-fueled, shambolic performances influenced a generation of musicians in New York and London, who all went on to form punk bands. And although they self-destructed quickly, the band's first two albums remain among the most popular cult records in rock &amp; roll history.\n\nAll of the members of The New York Dolls played in New York bands before the band formed in late 1971. Guitarists Johnny Thunders and Rick Rivets, bassist Arthur Kane, and drummer Billy Murcia were joined by vocalist David Johansen. Early in 1972, Rivets was replaced by Syl Sylvain and the group began playing regularly in Lower Manhattan, particularly at the Mercer Arts Center. Within a few months, they had earned a dedicated cult following, but record companies were afraid of signing the Dolls because of their cross-dressing and blatant vulgarity.\n\nLate in 1972, the Dolls embarked on their first tour of England. During the tour, drummer Murcia died after mixing drugs and alcohol. He was replaced by Jerry Nolan. After Nolan joined the band, the Dolls finally secured a record contract with Mercury Records. Todd Rundgren -- whose sophisticated pop seemed at odds with the band's crash-and-burn rock &amp; roll -- produced the band's debut New York Dolls, which appeared in the summer of 1973. The record received overwhelmingly positive reviews, but it didn't stir the interest of the general public; the album peaked at number 116 on the U.S. charts. The band's follow-up, Too Much Too Soon, was produced by the legendary girl group producer George &quot;Shadow&quot; Morton. Although the sound of the record was relatively streamlined, the album was another commercial failure, only reaching number 167 upon its early summer 1974 release.\n\nFollowing the disappointing sales of the Dolls' two albums, Mercury Records dropped the band. No other record labels were interested in the group, so the Dolls decided to hire a new manager, the British Malcolm McLaren, who would soon become famous for managing the Sex Pistols. With the Dolls, McLaren began developing his skill for turning shock into invaluable publicity. Although he made it work for the Pistols just a year later, all of his strategies backfired for the Dolls. McLaren made the band dress completely in red leather and perform in front of the U.S.S.R.'s flag, all of which meant to symbolize the Dolls' alleged communist allegiance. The new approach only made record labels more reluctant to sign the band and members soon began leaving the group.\n\nBy the middle of 1975, Thunders and Nolan left the Dolls. The remaining members, Johansen and Sylvain, fired McLaren and assembled a new lineup of the band. For the next two years, the duo led a variety of different incarnations of the band, to no success. In 1977, Johansen and Sylvain decided to break up the band permanently. Over the next two decades, various outtakes collections, live albums, and compilations were released by a variety of labels and The New York Dolls' two original studio albums never went out of print.\n\nUpon the Dolls' breakup, David Johansen began a solo career that would eventually metamorphose into his lounge-singing alter ego, Buster Poindexter, in the mid-'80s. Syl Sylvain played with Johansen for two years before he left to pursue his own solo career. Johnny Thunders formed the Heartbreakers with Jerry Nolan after they left the group in 1975. Over the next decade, the Heartbreakers would perform sporadically and Thunders would record an occasional solo album. On April 23, 1991, Thunders -- who was one of the more notorious drug abusers in rock &amp; roll history -- died of a heroin overdose. Nolan performed at a tribute concert for Thunders later in 1991; a few months later, he died of a stroke at the age of 40.\n\nIn 2004, former Smiths vocalist Morrissey -- who was once the president of a British New York Dolls fan club -- invited the surviving members of The New York Dolls to perform at the 2004 Meltown Festival, a music and cultural festival that was being curated that year by the singer. To the surprise of many, David Johansen, Syl Sylvain, and Arthur Kane agreed to the gig, with Steve Conte (from Johansen's solo band) standing in for Thunders and Gary Powell from the Libertines sitting in on drums. The group's set was well received by critics and fans (and was recorded for release on DVD and compact disc), which led to offers for other festival appearances, but only a few weeks after the Meltdown show, Kane checked himself into a Los Angeles hospital with what he thought was a severe case of the flu. Kane's ailment was soon diagnosed as leukemia, and he died only a few hours later, on July 13, 2004, at age 55.\n\nWith Sam Yaffa (of Hanoi Rocks) on bass, the remaining Dolls played a hometown tribute to their fallen brothers at Little Steven's International Underground Garage Festival in New York City on August 14, 2004, reuniting again (this time with Brian Delaney on drums) in 2006 for the all-new CD/DVD One Day It Will Please Us to Remember Even This. The Todd Rundgren-produced 'Cause I Sez So appeared on Rhino in 2009. A fifth studio album, Dancing Backward in High Heels, featuring both Johansen and Sylvain and produced and mixed by Jason Hill, appeared from 429 Records early in 2011.\n\n\nContents:\n\n1. New York Dolls (1973) [Original &amp; 2009 Japan Remaster]\n2. Too Much Too Soon (1974) [Original &amp; 2009 Japan Remaster]\n3. One Day It Will Please Us to Remember Even This (2006)\n4. Private World: The Complete Early Studio Demos 1972-73 (2006)\n5. 'Cause I Sez So (2009)\n6. Dancing Backward in High Heels (2011)\n\n\nAlbum artwork and audiochecker logs are included. Enjoy!!!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:ba691e9acec6eb9fd6fb16724e43d828a17aed87","amp;dn":"New+York+Dolls+-+Studio+Discography+1973-2011+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba691e9acec6eb9fd6fb16724e43d828a17aed87","infoHashBuffer":{"type":"Buffer","data":[186,105,30,154,206,198,235,159,214,251,22,114,78,67,216,40,161,122,237,135]},"announce":[],"urlList":[]}}