{"title":"Endless.Legend-RELOADED","uid":11055958,"size":1946746880,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ba711c698768a7eca391d52f7df3c919f85d4bb0&amp;dn=Endless.Legend-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Taker009","files":-1,"time":1411110587,"description":"nERv \n\nEndless Legend (c) AMPLITUDE Studios \n\n09/2014: RELEASE.DATE .. PROTECTION: Steam\n1: DISC(S) .. GAME.TYPE: Indie, Strategy \n\nCreate your own Legend\nAnother sunrise, another day of toil. Food must be grown, industries built\nscience and magic advanced, and wealth collected. Urgency drives these simple\nefforts, however, for your planet holds a history of unexplained apocalypse\nand the winter you just survived was the worst on record. A fact that has\nalso been true for the previous five \n\nAs you discover the lost secrets of your world and the mysteries of the\nlegends and ruins that exist as much in reality as in rumor, you will come to\nsee that you are not alone. Other peoples also struggle to survive, to grow\nand perhaps even to conquer \n\nYou have a city, a loyal populace, and a few troops; your power and magic\nshould be sufficient to keep them alive. But beyond that, nothing is certain\nWhere will you go, what will you find, and how will you react? Will your\ntrail be one of roses, or of blood? \n\nExplore fantastic lands \n\n* Lead one of eight civilizations each with a unique gameplay style and\nstoryline\n* Survive through cold dark seasons that drive Auriga to its end. Will it\nalso be yours?\n* Experience an endless replayability with randomly generated worlds and\nquests\n* Set the size, shape, topography and more... to create your own world to\ndiscover\nExpand beyond the unknown \n\n* Conquer, build and develop villages into feared fortresses or wonderful\ncities\n* Assimilate powerful minor factions and use their special traits and units\nwisely\n* Hire, equip and train your heroes to become army leaders or city governors\n* Raise your civilization by finding mysterious artefacts and forgotten\ntechnologies\nExploit every opportunity \n\n* Evolve your civilization through the discovery of new advanced\ntechnologies\n* Collect Dust, luxuries and strategic resources tradable on the marketplace\n* Keep one step ahead of other civilizations through trade and subtle\ndiplomacy\n* Choose from different victory conditions and adapt your strategy on the\nfly\nExterminate fools who defy you \n\n* Experience an innovative dynamic simultaneous turn-based battle system\n* Use unit equipement, abilities and the terrain to overcome your opponents\n* Zoom out of a battle and rule the other aspects of your empire seamlessly\n* Define your custom civilizations and confront those created by your\nfriends \n\n1. Unrar\n2. Burn or mount the image\n3. Install the game\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:ba711c698768a7eca391d52f7df3c919f85d4bb0","amp;dn":"Endless.Legend-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba711c698768a7eca391d52f7df3c919f85d4bb0","infoHashBuffer":{"type":"Buffer","data":[186,113,28,105,135,104,167,236,163,145,213,47,125,243,201,25,248,93,75,176]},"announce":[],"urlList":[]}}