{"title":"the Big Bang Theory S7E13 - The Hesitation Ramification","uid":9426772,"size":2572636164,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ba72d8dd301d96386f659d9d97a4401d70975346&amp;dn=the+Big+Bang+Theory+S7E13+-+The+Hesitation+Ramification&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"real_epi","files":1,"time":1388718458,"description":"Penny gets a bit part on &quot;NCIS&quot;, but is devastated when her scene is cut. After Leonard tells Penny how hard it is to become a star, she feels like he doesn't believe in her. Leonard brings her an Internet offer where one submits a video to get a part in the new &quot;Star Wars&quot; movie. Frustrated and tipsy Penny complains that she has been in LA for ten years with no success. Leonard reminds her that she does have him. Penny agrees, gets down on one knee and asks him to marry her. Leonard replies &quot;Uhhhh&quot; since she is upset and drunk. She leaves with Leonard thinking that their relationship might be over.\n\nSheldon wants to learn how to become funnier and tries to develop a theory of universal humor. He bores Amy who does appreciate it when he drops his pants for a humorous effect. Raj and Stuart plan to go the mall to improve their ability to talk to women and end up talking to the security guard.\nRecurring character: Kevin Sussman as Stuart Bloom\nGuest stars: Marcus Folmar as Security Guard and Lexie Contursi as Girl\n\nThumbs:","torrent":{"xt":"urn:btih:ba72d8dd301d96386f659d9d97a4401d70975346","amp;dn":"the+Big+Bang+Theory+S7E13+-+The+Hesitation+Ramification","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba72d8dd301d96386f659d9d97a4401d70975346","infoHashBuffer":{"type":"Buffer","data":[186,114,216,221,48,29,150,56,111,101,157,157,151,164,64,29,112,151,83,70]},"announce":[],"urlList":[]}}