{"title":"Jurassic Park lll NL sub avi (MovieNight)","uid":6614079,"size":594486272,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bba7a8ea0e9f64d1325415a077a4b03a62d86e2e&amp;dn=Jurassic+Park+lll+NL+sub+avi+%28MovieNight%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MovieNight","files":1,"time":1313711715,"description":"In deze derde Jurassic Park moet Sam Neill weer de longen uit zijn lijf lopen om uit de klauwen te blijven van prehistorische monsters\n\nDr. Alan Grant (Sam Neill) laat zich overhalen om terug te keren naar de dino's. Een rijke avonturier (Willam H. Macy) en zijn vrouw (TÃƒÂ©a Leoni) bieden hem een flinke som geld om als gids mee te vliegen over Isla Sorna. Op dit eiland had InGen, het bedrijf van multi-miljonair John Hammond, het tweede park gepland. De luchttour boven Site B blijft helaas van korte duur want het vliegtuigje stort neer, en de toeristen moeten plotseling zien te overleven tussen de levensgevaarlijke monsters. Bovendien blijkt de luchttour een heel andere reden te hebben gehad...\n\n'Jurassic Park 3' is niet meer geregisseerd door Steven Spielberg, maar door Joe Johnston die eerder verantwoordelijk was voor 'Jumanji'. Spielberg zelf fungeerde als executive producer en was opvallend weinig aanwezig op de set omdat hij het te druk had met de opnames van 'A.I.' en 'Minority Report'. Dit derde deel doet echter niet onder voor zijn voorgangers, en er bestaan zelfs al plannen voor een vierde deel. Acteur Sam Neill is wel een oude bekende: hij keert terug in de rol van Dr. Alan Grant, de paleontoloog die in de allereerste film het thema-park moest goedkeuren.\n\n\nMovieNight","torrent":{"xt":"urn:btih:bba7a8ea0e9f64d1325415a077a4b03a62d86e2e","amp;dn":"Jurassic+Park+lll+NL+sub+avi+%28MovieNight%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bba7a8ea0e9f64d1325415a077a4b03a62d86e2e","infoHashBuffer":{"type":"Buffer","data":[187,167,168,234,14,159,100,209,50,84,21,160,119,164,176,58,98,216,110,46]},"announce":[],"urlList":[]}}