{"title":"The House of Morgan - Ron Chernow [National Book Award Winner]","uid":8353348,"size":695306885,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bbdc3fedb7d3f71ae3a965c1e68da6186f15758c&amp;dn=The+House+of+Morgan+-+Ron+Chernow+%5BNational+Book+Award+Winner%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"notpaid","files":48,"time":1365414428,"description":"\nThe winner of the National Book Award and now considered a classic, The House of Morgan is the most ambitious history ever written about an American banking dynasty. Acclaimed by The Wall Street Journal as &quot;brilliantly researched and written,&quot; the book tells the rich, panoramic story of four generations of Morgans and the powerful, secretive firms they spawned. It is the definitive account of the rise of the modern financial world. A gripping history of banking and the booms and busts that shaped the world on both sides of the Atlantic, The House of Morgan traces the trajectory of the J. P. Morgan empire from its obscure beginnings in Victorian London to the crash of 1987. Ron Chernow paints a fascinating portrait of the private saga of the Morgans and the rarefied world of the American and British elite in which they moved. Based on extensive interviews and access to the family and business archives, The House of Morgan is an investigative masterpiece, a compelling account of a remarkable institution and the men who ran it, and an essential book for understanding the money and power behind the major historical events of the last 150 years.\n--This text refers to an out of print or unavailable edition of this title.\n","torrent":{"xt":"urn:btih:bbdc3fedb7d3f71ae3a965c1e68da6186f15758c","amp;dn":"The+House+of+Morgan+-+Ron+Chernow+%5BNational+Book+Award+Winner%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbdc3fedb7d3f71ae3a965c1e68da6186f15758c","infoHashBuffer":{"type":"Buffer","data":[187,220,63,237,183,211,247,26,227,169,101,193,230,141,166,24,111,21,117,140]},"announce":[],"urlList":[]}}