{"title":"The Mighty Thor 126-177,179 by Lee &amp; Kirby (1966-1970|F+DCP)","uid":9644388,"size":1199977566,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bbe96f314d735926b9de1e668e7c35744d08ae28&amp;dn=The+Mighty+Thor+126-177%2C179+by+Lee+%26amp%3B+Kirby+%281966-1970%7CF%2BDCP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1392968589,"description":"Continuing their epic run onwards from Journey Into Mystery, Stan Lee &amp; Jack Kirby took Thor into his own title and to heights heretofore unseen. Thor battled the likes of Hercules, Galactus, Jormungand (The Midgard Serpent) and many more; all the while, Lee set about expanding the nine realms and its inhabitants to the fullest extent, creating more friends and gods (and enemies) as well as highlighting the divisions and traditions of Asgard against those of Earth. Kirby's art here was among the best of his career; he managed to capture the expressive intensity of Thor while almost always framing him in epic grandeur befitting the Crown Prince of Asgard. Together, they had 50+ issues on the title before Kirby left for other projects after 179 (and a break in 178, drawn by John Buscema). Lee would leave himself shortly after, but their combined body of work here on both JIM and TMT remains second to none. IMHO it is one of the finest runs of any era, and deserves to be read.\n\nWhile we can't be lucky enough to get full digital copies of these issues, I have managed to scrounge up much more recent scans that look really great; the issues a c2c (cover-to-cover) so you can laugh at those terrible Charles Atlas ads and such. These copies are the combined effort of Team-DCP scanners as well as Fett, so massive thanks to them for their hard work - it really shows. To be clear, this is only the stuff of Lee + Kirby together; I will/can post the remaining issues in this quality (up to 207) at a later date. Please seed, and enjoy - THE MIGHTY THOR! :-) ","torrent":{"xt":"urn:btih:bbe96f314d735926b9de1e668e7c35744d08ae28","amp;dn":"The+Mighty+Thor+126-177%2C179+by+Lee+%26amp%3B+Kirby+%281966-1970%7CF%2BDCP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbe96f314d735926b9de1e668e7c35744d08ae28","infoHashBuffer":{"type":"Buffer","data":[187,233,111,49,77,115,89,38,185,222,30,102,142,124,53,116,77,8,174,40]},"announce":[],"urlList":[]}}