{"title":"Munay KI - the great rites of the shaman medicine way","uid":3633248,"size":724929182,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:bc267c3998fddb988b97de784556d1cc26c9a152&amp;dn=Munay+KI+-+the+great+rites+of+the+shaman+medicine+way&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"munaysonko","files":6,"time":1173157483,"description":"The Munay-Ki are the nine great rites of initiation of the medicine way. The word munay means ?I love you? or ?BE AS THOU ART.? The Munay-Ki are the nine gates that heal us and transform our human energy field into that of homo luminous. The prophecies of the ancient Americas speak about a new human appearing on the planet ? one who lives free of fear and resides in his or her transcendent nature. The Munay-Ki are the codes for the new human. They are delivered in the form of energetic transmissions. The ninth rite, the ?Creator Rite? was transmitted for the first time in the summer of 2006 at the Holy Mountains in the Andes. The nine initiations of the Munay-Ki have only been available until recently to the high wisdom keepers of the Americas.\n\nPart 1/5\nAlberto Villoldo, PH.D. (thefourwinds.com), introduces viewers to the luminous energy field that surrounds and informs our physical body like a blueprint of life. Unveiling the secret of ancient shaman-healers, he teaches us that many of our physical and psychological problems stem from imprints within our luminous body. Dr. Villoldo reveals the nature of this luminous field, how it acts as a blueprint for our physical body and how by understanding its nature, we can actually heal ourselves and each other. Once the luminous body is cleared, Dr. Villoldo explains, physical and emotional healing can begin.\n\nTrained as a Medical Anthropologist, Dr. Villoldo left the academic world behind twenty years ago to study among the Inka shamans. It was in the Andes Mountains of South America that he discovered the wisdom of the luminous body from the indigenous shamans. This ancient knowledge reveals the secret of true health and happiness.\n\nTo aid Dr. Villoldo in explaining the luminous energy field, the paintings of visionary artist Alex Grey are presented. No other artist has depicted the luminous energy form in all of its intricacies as clearly as Alex Grey. Dr. Villoldo\\\\\\\\\\\\\\&amp;#039;s presentation, together with Alex Grey\\\\\\\\\\\\\\&amp;#039;s images helps all of us understand the nature of our spiritual and physical well-being.\n\nMany of our illnesses, psychological disorders, addictions and failed relationships can be traced to faulty imprints in our luminous body. In this video, Dr. Villoldo unveils how to heal and recover from these destructive imprints and regain our physical, mental and spiritual well-being. Join us as we travel to the Andes Mountains to learn the secret of the ancient Shamans, a secret that can lead all of us to health, happiness and beauty.\n\nPart 2/5 - Rites of the Munay KI - Introduction\nAlberto Villoldo introduces the rites of the Munay KI. Rites that have the potential to change the world.\n\nPart 3/5 - The Rites\nIn this part the 9 rites are presented. The Healers rite, the Bands of Power, Harmony rite, Seer rite, Daykeeper rite, Wisdomkeeper rite, Earthkeeper rite, Starkeeper rite and the Creator rite. For detailed description of the rites visit http://munay-ki.org/Munay-Ki_The_Heros_Journey.html\n\nPart 4/5 - The Four Brains\nIn this part Alberto Villoldo talks about the four brains.\n\nPart 5/5 - Interviews\nIn this part 6 people who have received the rites talk about their experiences with the Munay KI.\n\nNumber of video files: 5\nTotal Run time: 2 hour, 07 minutes\nVideo codec: XviD 1.0.3, 1204 kbps, 640x480, 30 fps\nAudio codec: mp3, 152 kbps, 48 kHz, mono, cbr\nSource: DVD (4:3, NTSC)\n\nmore info can be found at: munay-ki.org and thefourwinds.com","torrent":{"xt":"urn:btih:bc267c3998fddb988b97de784556d1cc26c9a152","amp;dn":"Munay+KI+-+the+great+rites+of+the+shaman+medicine+way","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc267c3998fddb988b97de784556d1cc26c9a152","infoHashBuffer":{"type":"Buffer","data":[188,38,124,57,152,253,219,152,139,151,222,120,69,86,209,204,38,201,161,82]},"announce":[],"urlList":[]}}