{"title":"Brenda Ueland - If You Want to Write (pdf)","uid":8622175,"size":2230507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc58d9883a84f8e4996e38645347005a10b3766b&amp;dn=Brenda+Ueland+-+If+You+Want+to+Write+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1372404609,"description":"Brenda Ueland - If You Want to Write (Graywolf, 1983). \n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nClassic inspirational guide for writers.\n\ndescription:\n\nCarl Sandburg called this book about art, independence, and spirit, &quot;the best book ever written about how to write.&quot; Over 50 years since its publication, If You Want to Write continues to motivate aspiring writers.\n\nReview\n\nFor most, the hardest part of writing is overcoming the mountain of self-denial that weighs upon the spirit, always threatening to extinguish those first small embers of ambition. Brenda Ueland, a writer and teacher, devotes most of her book--published back in 1938, before everyone and their goldfish got their MFA's in creative writing--to these matters of the writer's heart. Still, the real gift of the book is Ueland herself: She liked to write, she didn't care what anyone thought, and she had a great sense of humor. You're simply happy to hang out with her.\n\nFrom Publishers Weekly\n\nUeland argues that anyone can write well once the imagination is freed from self-consciousness, anxiety and fear of failure. This is a fresh and vivid approach to creative endeavors. \n","torrent":{"xt":"urn:btih:bc58d9883a84f8e4996e38645347005a10b3766b","amp;dn":"Brenda+Ueland+-+If+You+Want+to+Write+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc58d9883a84f8e4996e38645347005a10b3766b","infoHashBuffer":{"type":"Buffer","data":[188,88,217,136,58,132,248,228,153,110,56,100,83,71,0,90,16,179,118,107]},"announce":[],"urlList":[]}}