{"title":"Osho_Bodhidharma The Greatest Zen Master-05.avi","uid":15223112,"size":203726964,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bcdc1da75b4ae71e068e4cf907d87fca7ed91f52&amp;dn=Osho_Bodhidharma+The+Greatest+Zen+Master-05.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1467750150,"description":"Bodhidharma: The Greatest Zen Master\r\nChapter #5\r\nChapter title: Suchness is our self-nature\r\n7 July 1987 am in Gautam the Buddha Auditorium\r\nLength: \t110 mins\r\nBELOVED Bhagwan,\r\nTHE BUDDHA SAID PEOPLE ARE DELUDED. THIS IS WHY WHEN THEY ACT THEY FALL INTO THE RIVER OF ENDLESS REBIRTH. AND TRYING TO GET OUT, THEY ONLY SINK DEEPER. AND ALL BECAUSE THEY DON'T SEE THEIR NATURE. IF PEOPLE WEREN'T DELUDED, WHY ELSE WOULD THEY ASK ABOUT SOMETHING RIGHT IN FRONT OF THEM? NOT ONE OF THEM UNDERSTANDS THE MOVEMENT OF HIS OWN HANDS AND FEET. THE BUDDHA WASN'T MISTAKEN. DELUDED PEOPLE DON'T KNOW WHO THEY ARE. SOMETHING SO HARD TO FATHOM IS KNOWN BY A BUDDHA AND NO ONE ELSE. ONLY THE WISE KNOW THIS MIND, THIS MIND CALLED DHARMA-NATURE, THIS MIND CALLED LIBERATION. NEITHER LIFE NOR DEATH CAN RESTRAIN THIS MIND. NOTHING CAN. IT'S ALSO CALLED THE UNSTOPPABLE TATHAGATA, THE INCOMPREHENSIBLE, THE SACRED SELF, THE IMMORTAL, THE GREAT SAGE. ITS NAMES VARY BUT NOT ITS ESSENCE. BUDDHAS VARY TOO, BUT NONE LEAVES HIS OWN MIND.\r\nTHE MIND'S CAPACITY IS LIMITLESS, AND ITS MANIFESTATIONS ARE INEXHAUSTIBLE. SEEING FORMS WITH YOUR EYES, HEARING SOUNDS WITH YOUR EARS, SMELLING ODORS WITH YOUR NOSE, TASTING FLAVORS WITH YOUR TONGUE, EVERY MOVEMENT OR MODE, IT'S ALL YOUR MIND. AT EVERY MOMENT, WHERE LANGUAGES CAN'T GO, THAT'S YOUR MIND.\r\nTHE SUTRAS SAY, &quot;A TATHAGATA'S FORMS ARE ENDLESS. AND SO IS HIS AWARENESS.&quot; THE ENDLESS VARIETY OF FORMS IS DUE TO THE MIND. ITS ABILITY TO DISTINGUISH THINGS, WHATEVER THEIR MOVEMENT OR MODE, IS THE MIND'S AWARENESS. BUT THE MIND HAS NO FORM AND ITS AWARENESS NO LIMIT. HENCE, IT'S SAID, &quot;A TATHAGATA'S FORMS ARE ENDLESS. AND SO IS HIS AWARENESS.&quot;\r\nA MATERIAL BODY OF THE FOUR ELEMENTS IS TROUBLE. A MATERIAL BODY IS SUBJECT TO BIRTH AND DEATH. BUT THE REAL BODY EXISTS WITHOUT EXISTING BECAUSE A TATHAGATA'S REAL BODY NEVER CHANGES. THE SUTRAS SAY, &quot;PEOPLE SHOULD REALIZE THAT THE BUDDHA-NATURE IS SOMETHING THEY HAVE ALWAYS HAD.&quot; MAHAKASHYAPA ONLY REALIZED HIS OWN NATURE.      ...THE SUTRAS SAY, &quot;EVERYTHING THAT HAS FORM IS AN ILLUSION.&quot; THEY ALSO SAY, &quot;WHEREVER YOU ARE, THERE'S A BUDDHA.&quot; YOUR MIND IS THE BUDDHA. DON'T USE A BUDDHA TO WORSHIP A BUDDHA.\r\nEVEN IF A BUDDHA OR BODHISATTVA SHOULD SUDDENLY APPEAR BEFORE YOU, THERE'S NO NEED FOR REVERENCE. THIS MIND OF OURS IS EMPTY AND CONTAINS NO SUCH FORM. THOSE WHO HOLD ONTO APPEARANCES ARE DEVILS. THEY FALL FROM THE PATH. WHY WORSHIP ILLUSIONS BORN OF THE MIND? THOSE WHO WORSHIP DON'T KNOW. AND THOSE WHO KNOW DON'T WORSHIP. BY WORSHIPING YOU COME UNDER THE SPELL OF DEVILS. I POINT THIS OUT BECAUSE I'M AFRAID YOU'RE UNAWARE OF IT. THE BASIC NATURE OF A BUDDHA HAS NO SUCH FORM. KEEP THIS IN MIND, EVEN IF SOMETHING UNUSUAL SHOULD APPEAR. DON'T EMBRACE IT, AND DON'T FEAR IT. AND DON'T DOUBT THAT YOUR MIND IS BASICALLY PURE. WHERE COULD THERE BE ROOM FOR ANY SUCH FORM? ALSO, AT THE APPEARANCE OF SPIRITS, DEMONS, OR DIVINE BEINGS, CONCEIVE NEITHER RESPECT NOR FEAR. YOUR MIND IS BASICALLY EMPTY. ALL APPEARANCES ARE ILLUSIONS. DON'T HOLD ONTO APPEARANCES","torrent":{"xt":"urn:btih:bcdc1da75b4ae71e068e4cf907d87fca7ed91f52","amp;dn":"Osho_Bodhidharma+The+Greatest+Zen+Master-05.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcdc1da75b4ae71e068e4cf907d87fca7ed91f52","infoHashBuffer":{"type":"Buffer","data":[188,220,29,167,91,74,231,30,6,142,76,249,7,216,127,202,126,217,31,82]},"announce":[],"urlList":[]}}