{"title":"Batman 514-524 (1995-01) (digital) (OkC.O.M.P.U.T.O.-Novus-HD) [","uid":10380895,"size":390594891,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bd7a83aebd5747e6283fcfc631d41c5984435e02&amp;dn=Batman+514-524+%281995-01%29+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-HD%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dadrkhomr","files":-1,"time":1403072062,"description":"\nA Novus Release\n\n\n\nThis torrent includes the HD version.  \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n#514  &quot;Prodigal&quot; part 9, continued from ROBIN (1993-2009) #12. As the man beneath the cape and cowl tracks three ruthless, escaped convicts into a lawless area in Gotham City, he experiences a personal crisis that will change his life! Continued in BATMAN: SHADOW OF THE BAT #34. \n\n#515  &quot;Troika&quot; part 1! A new era begins for the Dark Knight as Bruce Wayne adopts a fearsome new look for his battle against a group of former KGB operatives. The Dark Knight's first encounter with the &quot;Troika&quot; turns into a savage clash with the Cossack. Continued in BATMAN: SHADOW OF THE BAT #35. \n\n#516  A trail of corpses sends the Dark Knight in pursuit of the serial killer known as the Sleeper...who is committing murder in order to save her own life. \n\n#517  In pursuit of the serial killer Sleeper, the Dark Knight uncovers her greatest secret--one that may stop cold Batman's attempts to halt her murderous spree. \n\n#518  As a gang murders innocent Gotham City citizens, the deadly Black Spider battles the Dark Knight. \n\n#519  The Dark Knight must find out whom the Black Spider is planning to assassinate before gang warfare erupts across Gotham City. \n\n#520  While Harvey Bullock finds romance with a nurse and James Gordon struggles to preserve his marriage to the woman who took his job, Batman prowls the city's darkest alleys trying to prevent the Black Mask gang's next murder. \n\n#521  Killer Croc escapes Arkham Asylum and the trail leads Batman to Louisiana, where Croc's mysterious ally awaits! \n\n#522  Batman's trip deep into the Louisiana Bayou in pursuit of Killer Croc brings him face-to-murky-face with Swamp Thing. \n\n#523  Batman must stop a frightening new rampage by the Scarecrow. \n\n#524  The Scarecrow lures Batman to an amusement park funhouse for a duel of terror.\n\n\n\n\n\nThanks goes to the OkC.O.M.P.U.T.O. for this release.\n\n\n\n\n\n","torrent":{"xt":"urn:btih:bd7a83aebd5747e6283fcfc631d41c5984435e02","amp;dn":"Batman+514-524+%281995-01%29+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-HD%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd7a83aebd5747e6283fcfc631d41c5984435e02","infoHashBuffer":{"type":"Buffer","data":[189,122,131,174,189,87,71,230,40,63,207,198,49,212,28,89,132,67,94,2]},"announce":[],"urlList":[]}}