{"title":"Too Late the Hero 1970 Michael Caine DvDRip x264 AAC-miKem","uid":8510815,"size":1491982893,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bd7cb771c145c7da38e510638e511f3c4fb0fbaf&amp;dn=Too+Late+the+Hero+1970+Michael+Caine+DvDRip+x264+AAC-miKem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"mikem777","files":5,"time":1369579971,"description":"Too Late the Hero (1970)\n\n\nIMDb: http://www.imdb.com/title/tt0066471\n\nSAMPLE file included\n\n\nA WWII film set on a Pacific island. Japanese and allied forces occupy different parts of the island. When a group of British soldiers are sent on a mission behind enemy lines, things don't go exactly to plan. This film differs in that some of the 'heros' are very reluctant, but they come good when they are pursued by the Japanese who are determined to prevent them returning to base.\n\nExtremely interesting WW11 drama of a clash between two very different Allied cultures. Cliff Robertson playing a somewhat reticent U.S. Naval Lieutenant (Lawson) hoping for a long due leave posting, is unexpectedly assigned to a command with a British base on an island in the New Hebrides off the South West Pacific in 1942. Because of his Japanese language skills and directed to penetrate to the north of the island with a British commando force he is given a directive to take control of an enemy radio station and deliver deceptive messages to their adversary in order to confuse Japanese naval intelligence. On arriving at the British base and expecting some form of settling relaxation beforehand, is informed by Commanding Officer Thompson (Played by Harry Andrews), that he will be leaving for his duties in &quot;half an hour&quot;. The stunned look on Lawson's face, and at a subsequent pr-briefing put him into a state of disbelief as to what is happening with his association with his British colleagues who are already demonstrating precision control over their already come to attention to duties. Enter British &quot;Limey&quot; Michael Caine (Tosh) an equally disconcerted medical orderly soldier with a totally disloyal uninterested squad of men, led on this patrol by bungling Captain Hornsby (played superbly by Denholm Elliot) who takes his troops to complete disaster with poor judgment of jungle fighting skills. A shootout between them and an unanticipated Japanese Patrol leads to casualties on both sides - with the sarcastic remark of a Corporal describing the affray as though it was the outcome of a Soccer match - &quot;It's been a great day at Hampden Park folks - Hornsby's Hotspurs 5 - Japanese United 3&quot;. - all of them scored by Hornsby. Tosh after attending to the dead and wounded replies - &quot;Fairy Feet Hornsby deployed his forces with such a masterful grasp of tactics one half of ourselves got shot by the other half&quot;.  Another replies - I don't believe it. Tosh again interjects referring to his fallen comrades - go dig out the bullets - you won't find &quot;Made in Japan&quot; written on them. The rest of the patrol in their mission ends in absolute disaster with the loss of Hornsby on his disastrous assault of the radio station. A subsequent discovery of a major Jap naval airstrip there by the remainder of the patrol leads to a chase and run by the enemy in an endeavor to stop them reporting this find. The remainder of the force retreat in a shambles with some of the party becoming victims of the Japanese,either killed or surrendering beforehand, leaving Lawson and Tosh to try to make it back to base. Both eventually leave the jungle perimeter under enemy fire over an exposed field with only one survivor returning. Really great movie full of comedy quips, combined with interesting American - British off beat well quoted differences, and a conclusion deserved of the movie title.\n\n*** General Parameters ***\n- Name:  Too Late the Hero (1970).m4v \n- Container:  M4V - QuickTime \n- Size:  1.482 GB \n- Duration:  2h 7mn \n- Bitrate:  1 542 Kbps \n\n*** Video Track Parameters ***\n- Format:  H.264/MPEG-4 AVC \n- Bitrate:  Max.: Undefined / Average: 1 373 Kbps / Min.: Undefined \n- Frame rate (fps):  Max.: --- / Average: 25.000 / Min.: --- \n- Encoding profile:  &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;2b63424c436b6718051b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; \n- Image size:  720*418 (Actual 768 x 418 pixels)\n- Pixel Aspect Ratio:  Undefined \n- Display Aspect Ratio:  1.85:1 \n- Interlacing:  Progressive \n\n*** First Audio Track Parameters ***\n- Format:  AAC - MPEG-4 audio \n- Bitrate:  164 Kbps \n- Resolution:  Undefined \n- Rate:  48.0 KHz \n- Channel(s):  2 (stereo) \n- Position:  Front: L R\n\ntags: action, war, drama, japanese, captain, private, lieutenant, behind enemy lines,","torrent":{"xt":"urn:btih:bd7cb771c145c7da38e510638e511f3c4fb0fbaf","amp;dn":"Too+Late+the+Hero+1970+Michael+Caine+DvDRip+x264+AAC-miKem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd7cb771c145c7da38e510638e511f3c4fb0fbaf","infoHashBuffer":{"type":"Buffer","data":[189,124,183,113,193,69,199,218,56,229,16,99,142,81,31,60,79,176,251,175]},"announce":[],"urlList":[]}}