{"title":"Mother of Invention: How the Government Created (2014) epub","uid":9592896,"size":2118860,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bda311c4e3e43ec1e021777b849ab298e747d0ea&amp;dn=Mother+of+Invention%3A+How+the+Government+Created+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1391906027,"description":"Mother of Invention: How the Government Created &quot;Free-Market&quot; Health Care\n\n\nBy relying on private enterprise more than any other developed nation, American health care has all the appearances of the free-market in action. And for more than a hundred years, attempts to reform this system (including President Obama's Affordable Care Act) have been met with opposition from parties warning against the stifling effect of government intervention.\n\n What these warnings about federal intrusion overlook is the fact that the federal government has long been an indispensable player in guiding and supporting the current US health care system. Its role is so pervasive and of such longstanding importance that it is easy to overlook, but it actually created American health care as we know it today.\n\n Seminal public programs stand behind every segment of America's massive and hugely profitable health care industry. This is not to deny the instrumental roles of private entrepreneurship and innovation, but rather to describe the foundation on which they rest. The industry's underlying driving force is a massive partnership between the public and private spheres. The partnership is complex, and its effects are not always ideal. But for better or worse, it shapes every aspect of what we in the United States know as health care.\n\n Mother of Invention traces the government's role in building four key health care sectors into the financial powerhouses they are today: pharmaceuticals, hospitals, the medical profession, and private insurance. It traces their history, surveys their growth, and highlights some of their greatest success stories, which together reveal the indispensable role of public initiatives in contemporary private health care.\n\n Only by understanding what actually drives our system can we appreciate possibilities for meaningful reform or comprehend the true context--historically and politically--of the Obama plan.","torrent":{"xt":"urn:btih:bda311c4e3e43ec1e021777b849ab298e747d0ea","amp;dn":"Mother+of+Invention%3A+How+the+Government+Created+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bda311c4e3e43ec1e021777b849ab298e747d0ea","infoHashBuffer":{"type":"Buffer","data":[189,163,17,196,227,228,62,193,224,33,119,123,132,154,178,152,231,71,208,234]},"announce":[],"urlList":[]}}