{"title":"Jordan L Hawk - Whyborne and Griffin Book 1 Widdershins","uid":11454536,"size":278494640,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:be0b6102e3bfc25ae0ef66790b6951e9cffda3f0&amp;dn=Jordan+L+Hawk+-+Whyborne+and+Griffin+Book+1+Widdershins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"katelynor","files":3,"time":1415923340,"description":"Some things should stay buried.\n\nRepressed scholar Percival Endicott Whyborne has two skills: reading dead languages and hiding in his office at the Ladysmith Museum. After the tragic death of the friend he secretly loved, he's ruthlessly suppressed any desire for another man.\n\nSo when handsome ex-Pinkerton Griffin Flaherty approaches him to translate a mysterious book, Whyborne wants to finish the job and get rid of the detective as quickly as possible. Griffin left the Pinkertons following the death of his partner, hoping to start a new life. But the powerful cult that murdered Glenn has taken root in Widdershins, and only the spells in the book can stop them. Spells the intellectual Whyborne doesn't believe are real.\n\nAs the investigation draws the two men closer, Griffin's rakish charm threatens to shatter Whyborne's iron control. When the cult resurrects an evil sorcerer who commands terrifying monsters, can Whyborne overcome his fear and learn to trust? Will Griffin let go of his past and risk falling in love? Or will Griffin's secrets cost Whyborne both his heart and his life?","torrent":{"xt":"urn:btih:be0b6102e3bfc25ae0ef66790b6951e9cffda3f0","amp;dn":"Jordan+L+Hawk+-+Whyborne+and+Griffin+Book+1+Widdershins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be0b6102e3bfc25ae0ef66790b6951e9cffda3f0","infoHashBuffer":{"type":"Buffer","data":[190,11,97,2,227,191,194,90,224,239,102,121,11,105,81,233,207,253,163,240]},"announce":[],"urlList":[]}}