{"title":"Exploring the Moon - The Apollo Expeditions (Malestrom)","uid":4640322,"size":50974603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be8c21c79d417f81eee19202d5205dce1ba37cdc&amp;dn=Exploring+the+Moon+-+The+Apollo+Expeditions+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1231694467,"description":" &lt;a href=&quot;http://www.image-upload.net/images/2qvgfbje0tu4yxept2t4.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/2qvgfbje0tu4yxept2t4.jpeg&lt;/a&gt;\n\nExploring the Moon\nSpringer-Praxis | 2008-01 | ISBN: 0387746382 | 447 pages | PDF \n\nDavid Harland opens with a review of the robotic probes, namely the Rangers which returned television before crashing into the Moon, the Surveyors which 'soft landed' in order to investigate the nature of the surface, and the Lunar Orbiters which mapped prospective Apollo landing sites. He then outlines the historic landing by Apollo 11 in terms of what was discovered, and how over the next several missions the program was progressively geared up to enable the final three missions each to spend three days on comprehensive geological investigations. He concludes with a review of the robotic spacecraft that made remote-sensing observations of the Moon. Although aimed at the enthusiast, and can be read as an adventure in exploration, the book develops the scientific theme of lunar geology, and therefore will be of use as background reading for undergraduate students of planetary sciences. In addition, with the prospect of a resumption of human missions, it will help journalists understand what Apollo achieved after the 'flags and footprints' of the Apollo 11 landing in July1969 and will commemorate the fortieth anniversary of that momentous event.\n\nHighlighted as a &quot;Commemorative Edition&quot; on the cover, this second edition will have a new Foreword by one of the original astronauts and a short extra section at the end previewing the prospect of a renewal of human exploration of the Moon. It will include new extra high quality graphics which are only now available and 32 pages of colour illustrations.","torrent":{"xt":"urn:btih:be8c21c79d417f81eee19202d5205dce1ba37cdc","amp;dn":"Exploring+the+Moon+-+The+Apollo+Expeditions+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be8c21c79d417f81eee19202d5205dce1ba37cdc","infoHashBuffer":{"type":"Buffer","data":[190,140,33,199,157,65,127,129,238,225,146,2,213,32,93,206,27,163,124,220]},"announce":[],"urlList":[]}}