{"title":"Electric Fields in Composite Dielectrics and their Applications ","uid":6011474,"size":4350662,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf2f355b6f953aa6a2e62a3fa0207b680f30d838&amp;dn=Electric+Fields+in+Composite+Dielectrics+and+their+Applications+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1291469962,"description":"Tadasu Takuma, Boonchai Techaumnat, &quot;Electric Fields in Composite Dielectrics and their Applications&quot;\nPublisher: Springer | 2010 | ISBN: 9048193915 | 187 pages | PDF \n\nAn accurate quantitative picture of electric field distribution is essential in many electrical and electronic applications. In composite dielectric configurations composed of multiple dielectrics, anomalous or unexpected behavior of electric fields may appear when a solid dielectric is in contact with a conductor or another solid dielectric. The electric field near the contact point may become higher than the original field not only in the surrounding medium but also in the solid dielectric. Theoretically it may become infinitely high, depending on the contact angle. \n\nAlthough these characteristics are very important in a variety of applications, they have been clarified only recently using analytical and numerical calculation methods, and this is the first book to cover these new findings.\nElectric Fields in Composite Dielectrics and Their Applications describes the fundamental characteristics and practical applications of electric fields in composite dielectrics. The focus is on the field distribution (and the resultant force when appropriate) near points of contact. \n\nApplications include insulation design of high-voltage equipment with solid insulating supports, utilization of electrostatic force on dielectric particles in electrophotography and electrorheological fluids, and others. Electric Fields in Composite Dielectrics and Their Applications also explains the calculation methods used to analyze electric fields in composite dielectrics","torrent":{"xt":"urn:btih:bf2f355b6f953aa6a2e62a3fa0207b680f30d838","amp;dn":"Electric+Fields+in+Composite+Dielectrics+and+their+Applications+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf2f355b6f953aa6a2e62a3fa0207b680f30d838","infoHashBuffer":{"type":"Buffer","data":[191,47,53,91,111,149,58,166,162,230,42,63,160,32,123,104,15,48,216,56]},"announce":[],"urlList":[]}}