{"title":"Uriah Heep-Lady In Black  192k  mp3    ak6103","uid":10723407,"size":82294784,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bf407ea9bb015e18ca84cb73359c43da05ca3708&amp;dn=Uriah+Heep-Lady+In+Black++192k++mp3++++ak6103&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"analogkid6103","files":14,"time":1407517095,"description":"Uriah Heep-Lady In Black  192k  mp3    ak6103 What we got...Uriah Heep are an English rock band formed in London in 1969 and are regarded as one of the seminal hard rock acts of the early 1970s. Uriah Heep's progressive/art rock/heavy metal fusion's distinctive features have always included a massive keyboard sound, strong vocal harmonies and (in the early years) David Byron's quasi-operatic vocals. Twelve of the band's albums have made it to the UK Albums Chart (Return to Fantasy reached No. 7 in 1975) while of the fifteen Billboard 200 Uriah Heep albums Demons and Wizards was the most successful (#23, 1972).In the late 1970s the band had massive success in Germany, where the &quot;Lady in Black&quot; single was a big hit. Along with Black Sabbath, Deep Purple and Led Zeppelin, Uriah Heep had become one of the top bands in the early 1970s - one of &quot;The Big 4&quot; of hard rock.\n\nUriah Heep's audience declined by the 1980s, to the point where they became essentially a cult band in the United Kingdom and United States. The band maintains a significant following and performs at arena-sized venues in the Balkans, Germany, Japan, the Netherlands, Russia and Scandinavia. They have sold over 40 million albums worldwide with over 4 million sales in the U.S. Anyway what this is is some kind of compilation album and im not sure who commissioned it god knows they have been with multiple record labels in there what 40+ years so I grabbed it and it up to you as always if it lives or dies so If you need the track list for this one click on files and it will appear They called it Lady in Black so here we go.....seed ...or let it die this ones your call for sure cause I will keep it alive for 75 downloads after that .........................................","torrent":{"xt":"urn:btih:bf407ea9bb015e18ca84cb73359c43da05ca3708","amp;dn":"Uriah+Heep-Lady+In+Black++192k++mp3++++ak6103","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf407ea9bb015e18ca84cb73359c43da05ca3708","infoHashBuffer":{"type":"Buffer","data":[191,64,126,169,187,1,94,24,202,132,203,115,53,156,67,218,5,202,55,8]},"announce":[],"urlList":[]}}