{"title":"The Smell of Reeves and mortimer series 1 DVDRip","uid":3885905,"size":1842975279,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bf97cc2de230153c218836575430b6e3ac2fecbb&amp;dn=The+Smell+of+Reeves+and+mortimer+series+1+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"artsiteuk","files":7,"time":1194828195,"description":"Series one of The Smell of Reeves and Mortimer established the format of the show. Each programme began with a bizarre introduction, narrated by Patrick Allen (&quot;Austria, 1930, a young boy is challenged by his mischievous grandfather to attempt to throw a handbell at the local village idiot&quot;) before the studio set appeared and Allen introduced the duo (&quot;Please welcome Libya&amp;#039;s foremost air-conditioning engineers, Reeves &amp; Mortimer!&quot;), after which the pair would sing a song before seating themselves at the desk to tell silly jokes, introduce the bizarre guests and endorse various Reeves &amp; Mortimer products (such as the &quot;Reeves &amp; Mortimer Walk-Me-Home Cheddar&quot; and &quot;The Home Vibration Cowboy Unit&quot;).\n\nA regular feature was a bizarre spoof of a then-current TV programme, such as Food &amp; Drink, which saw host Chris Kelly (Mortimer), whose face was a piece of toasted cheese and whose legs gradually became ridiculously long, boiling his head in a pot to &quot;prepare a nice pot of tea,&quot; and Antiques Roadshow, where a termite mound containing the singer Prince was found inside a wardrobe. Perhaps the most bizarre was Noel&amp;#039;s Addicts, an insane parody of a show hosted by Noel Edmonds in 1992 about people&amp;#039;s hobbies.\n\nThe duo would frequently promise a celebrity guest such as Burt Reynolds, who turned out to be Vic in a bizarre outfit yelling about his book Coping With Stress, Cuban soap star Juan Nelly The Elephant (Vic), who kept intermittently turning into an electrical salesman, and Ian Crust, the Inventor of the Bag (Bob).\n\nAt the end of series one, Bob played a huge practical joke on Vic, who lapsed into a coma. After a rousing final song, Bob unplugged Vic&amp;#039;s life-support machine.\n\n\nDVD rip of series 1. Series 2 coming ASAP.\nPlease enjoy this classic","torrent":{"xt":"urn:btih:bf97cc2de230153c218836575430b6e3ac2fecbb","amp;dn":"The+Smell+of+Reeves+and+mortimer+series+1+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf97cc2de230153c218836575430b6e3ac2fecbb","infoHashBuffer":{"type":"Buffer","data":[191,151,204,45,226,48,21,60,33,136,54,87,84,48,182,227,172,47,236,187]},"announce":[],"urlList":[]}}