{"title":"Matroesjka's - seizoen 2 preair 2Lions-team","uid":4451655,"size":3760407341,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bfce189758393ba02de8b2a0d8ffaf743d05d22f&amp;dn=Matroesjka%5C%27s+-+seizoen+2+preair+2Lions-team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"M33DG","files":-1,"time":1224285639,"description":"MATROESJKA'S SEIZOEN 2\n\ntrailers English en Nederlands\nhttp://www.vtm.be/matroesjkas-2008/items/video/1045_2.php\n\nhet volledige 2e seizoen Preair release !!!\ninclusief dvd cover\nfoto's van de acteurs\ninfo over de serie\n\nMatroesjka's zijn terug\nTweede en laatste reeks van langverwachte successerie van start \nDrie jaar na de eerste 'Matroesjka's', is vanaf vandaag een gloednieuwe reeks van de zeer gesmaakte serie rond vrouwenhandel te zien op Prime, de digitale tv van Telenet. 'Matroesjka's2' duikt in de gore sekswereld van zowel Thailand als Oost-Europa en laat zien hoe de vrouwenhandel is veranderd. 'Steeds meer meisjes weten waaraan ze beginnen en proberen zichzelf en hun familie uit de armoede te helpen.' \nTegenover de eerste reeks maakt Matroesjka's2 een sprong van drie jaar: de tijd dat Ray Van Mechelen (Peter Van Den Begin) en Luk Wyns (Eddy Stoefs) in de gevangenis hebben gezeten. De twee vrouwenhandelaars komen vrij en stellen vast dat hun vroegere kompaan Jan Verplancke (Axel Daeseleire) met hun spaarcenten mooie sier maakt in Thailand. De kerel heeft zich in een sekstent ingekocht en hij schrikt nog geen klein beetje wanneer Ray en Eddy plots naast zijn zwembad staan om hun centen terug te eisen. Verplancke heeft niet de poen, maar wel een ideetje: hij biedt zijn vroegere 'zakenpartners' enkele Thaise meisjes aan. Voor een vriendenprijsje, dat spreekt.\n\n'Ook nu hebben we ons gebaseerd op ware gebeurtenissen', zeggen bedenkers en coregisseurs Marc Punt en Guy Goossens. 'We zijn vijf keer naar Thailand gereisd waar we bars hebben bezocht om er met meisjes te praten. Niet iedereen was bereid zijn verhaal te doen, maar als je tien meisjes benadert, is er altijd wel eentje die iets kwijt wil.''Daarnaast hebben we ook een toer door Oost-Europa gemaakt, van OekraÃƒÆ’Ã‚Â¯ne tot MoldaviÃƒÆ’Ã‚Â«, want dat is de tweede verhaallijn in de nieuwe reeks. Oost-Europa biedt ons meteen de kans te tonen dat de vrouwenhandel is geÃƒÆ’Ã‚Â«volueerd. De tijd dat naÃƒÆ’Ã‚Â¯eve meisjes naar Europa werden gelokt met beloften van een lekker leventje als au pair is grotendeels voorbij. De meeste meisjes die wij hebben gesproken wisten perfect waar ze aan begonnen.'\n\nDe eerste Matroesjka's die aan ruim 50landen werd verkocht, kwam ook in het Oostblok op tv. 'In GeorgiÃƒÆ’Ã‚Â« bereikte de serie een marktaandeel van 55procent', zegt Guy Goossens. 'De helft van de mensen heeft daar ons verhaal over mensenhandel gezien. We denken graag dat we meegeholpen hebben om jonge vrouwen bewust te maken van het gevaar dat ze lopen, hoewel wij natuurlijk in de eerste plaats makers van fictie blijven. Anderzijds gebruikte Amnesty International wel beelden uit Matroesjka's voor de campagne tegen vrouwenhandel die ze in heel Oost-Europa hebben gevoerd.'\n\nWat alvast sterk naar voor komt uit de uitstekende eerste aflevering die wij gisteren in wereldpremiÃƒÆ’Ã‚Â¨re konden bekijken, is dat zowel in Thailand als Oost-Europa armoede de motor is die de prostitutie draaiende houdt. 'Met die nuance dat meisjes in Thailand er vaak door hun familie worden toe aangezet hun lichaam te verkopen om ouders, broers en zusjes te onderhouden. Ik ben een wandelende Bancontact voor hen, zoals een meisje het formuleerde. In Oost-Europa zetten de meisjes steeds vaker zelf de stap omdat ze de armoede beu zijn.'\n\n\n******************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum  &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************","torrent":{"xt":"urn:btih:bfce189758393ba02de8b2a0d8ffaf743d05d22f","amp;dn":"Matroesjka%5C%27s+-+seizoen+2+preair+2Lions-team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfce189758393ba02de8b2a0d8ffaf743d05d22f","infoHashBuffer":{"type":"Buffer","data":[191,206,24,151,88,57,59,160,45,232,178,160,216,255,175,116,61,5,210,47]},"announce":[],"urlList":[]}}