{"title":"Beach Boys - Greatest Hits - The Swedish Collection  FLAC","uid":5570651,"size":446355713,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c009967ca2f3b64059dce815801a3d3715b37a5c&amp;dn=Beach+Boys+-+Greatest+Hits+-+The+Swedish+Collection++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"keeybee","files":38,"time":1274238978,"description":"Please seed!\n\nThe Beach Boys are an American rock band, formed in 1961, who gained popularity for their close vocal harmonies and lyrics reflecting a Southern California youth culture of cars, surfing, and romance. Brian Wilson's growing creative ambitions later transformed them into a more artistically innovative group that earned critical praise and influenced many later musicians.\nThe group was initially composed of singer-musician-composer Brian Wilson, his brothers, Carl and Dennis, their cousin Mike Love, and friend Al Jardine. This core quintet was inducted into the Rock and Roll Hall of Fame Class of 1988.  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Beach_Boys&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Beach_Boys&lt;/a&gt;\n\nTrying to collect a complete, and I mean complete, discography with all Beach Boys releases seems to be almost impossible. According to Wiki there are 28 studio albums (32 with the live albums). According to AMG there are 38 albums (including live albums). The compilations seems to be countless/innumerable. And I don't even want to think of all unofficial releases.\n\nAnyway,here's one Swedish compilation, various mono and stereo mixes.\n\nEnjoy!\n\n\nThe Beach Boys - Greatest Hits - The Swedish Collection\nDigital remaster 1995\nThis compilation 2000 (EMI)\n\n\n01  The Beach Boys - Greatest Hits - The Swedish Collection - I Get Around  \n02  The Beach Boys - Greatest Hits - The Swedish Collection - California Girls  \n03  The Beach Boys - Greatest Hits - The Swedish Collection - Fun, Fun, Fun  \n04  The Beach Boys - Greatest Hits - The Swedish Collection - Don't Worry Baby  \n05  The Beach Boys - Greatest Hits - The Swedish Collection - Help Me Rhonda  \n06  The Beach Boys - Greatest Hits - The Swedish Collection - Surfin' USA  \n07  The Beach Boys - Greatest Hits - The Swedish Collection - Wouldn't It Be Nice  \n08  The Beach Boys - Greatest Hits - The Swedish Collection - Sloop John B  \n09  The Beach Boys - Greatest Hits - The Swedish Collection - Surfin' Safari  \n10  The Beach Boys - Greatest Hits - The Swedish Collection - Ten Little Indians  \n11  The Beach Boys - Greatest Hits - The Swedish Collection - Surfer Girl  \n12  The Beach Boys - Greatest Hits - The Swedish Collection - God Only Knows  \n13  The Beach Boys - Greatest Hits - The Swedish Collection - Good Vibrations  \n14  The Beach Boys - Greatest Hits - The Swedish Collection - Little Deuce Coupe  \n15  The Beach Boys - Greatest Hits - The Swedish Collection - Little Honda  \n16  The Beach Boys - Greatest Hits - The Swedish Collection - Be True To Your School  \n17  The Beach Boys - Greatest Hits - The Swedish Collection - Heroes And Villains  \n18  The Beach Boys - Greatest Hits - The Swedish Collection - Darlin'  \n19  The Beach Boys - Greatest Hits - The Swedish Collection - In My Room  \n20  The Beach Boys - Greatest Hits - The Swedish Collection - When I Grow Up  \n21  The Beach Boys - Greatest Hits - The Swedish Collection - Dance, Dance, Dance  \n22  The Beach Boys - Greatest Hits - The Swedish Collection - Barbara Ann  \n23  The Beach Boys - Greatest Hits - The Swedish Collection - I Can Hear Music  \n24  The Beach Boys - Greatest Hits - The Swedish Collection - Cotton Fields  \n25  The Beach Boys - Greatest Hits - The Swedish Collection - Do You Wanna Dance?  \n26  The Beach Boys - Greatest Hits - The Swedish Collection - You're So Good To Me  \n27  The Beach Boys - Greatest Hits - The Swedish Collection - Then I Kissed Her  \n28  The Beach Boys - Greatest Hits - The Swedish Collection - Do It Again  \n29  The Beach Boys - Greatest Hits - The Swedish Collection - California Dreamin'  \n30  The Beach Boys - Greatest Hits - The Swedish Collection - Kokomo","torrent":{"xt":"urn:btih:c009967ca2f3b64059dce815801a3d3715b37a5c","amp;dn":"Beach+Boys+-+Greatest+Hits+-+The+Swedish+Collection++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c009967ca2f3b64059dce815801a3d3715b37a5c","infoHashBuffer":{"type":"Buffer","data":[192,9,150,124,162,243,182,64,89,220,232,21,128,26,61,55,21,179,122,92]},"announce":[],"urlList":[]}}