{"title":"Robert A. Heinlein - Orphans of the Sky","uid":12090696,"size":134891431,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c0286e89cfcdad6b3242b67ff47d73e1c6866982&amp;dn=Robert+A.+Heinlein+-+Orphans+of+the+Sky&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":6,"time":1436038598,"description":"Hugh had been taught that, according to the ancient sacred writings, the Ship was on a voyage to faraway Centaurus. But he also understood this was actually allegory for a voyage to spiritual perfection. Indeed, how could the Ship move, since its miles and miles of metal corridors were all there was of creation? Science knew that the Ship was all the Universe, and as long as the sacred Convertor was fed, the lights would continue to glow and the air would flow, and the Creator's Plan would be fulfilled.\n\nOf course, there were the muties, grotesquely deformed parodies of humans, who lurked in the upper reaches of the Ship where gravity was weaker. Were they evil incarnate, or merely a divine check on the population, keeping humanity from expanding past the capacity of the Ship to support?\n\nThen Hugh was captured by the muties and met their leader (or leaders), Joe-Jim, with two heads on one body. And he learned the true nature of the Ship and its mission between the stars. But could he make his people believe him before it was to late? Could he make them believe that he must be allowed to fly the ship?\n\n\nRead by Eric Michael Summerer\nFormat: MP3\nUnabridged","torrent":{"xt":"urn:btih:c0286e89cfcdad6b3242b67ff47d73e1c6866982","amp;dn":"Robert+A.+Heinlein+-+Orphans+of+the+Sky","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0286e89cfcdad6b3242b67ff47d73e1c6866982","infoHashBuffer":{"type":"Buffer","data":[192,40,110,137,207,205,173,107,50,66,182,127,244,125,115,225,198,134,105,130]},"announce":[],"urlList":[]}}