{"title":"ACTION  Comics - IPC Magazines (UK) - 1976","uid":4159312,"size":704573029,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c0d16dceddd115e180a5355859241ce0872f93ab&amp;dn=ACTION++Comics+-+IPC+Magazines+%28UK%29+-+1976&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"citaltras","files":41,"time":1209302306,"description":"A C T I O N - IPC Magazines (UK) - 1976\n\nThe ACTION first series is now available in this torrent. Thanks to the scanners and to all the people who worked to bring us this series. Please visit the home of Action: www.sevenpennynightmare.co.uk\n\nWarning: this is not Superman&amp;#039;s Action Comics!\n\nAction was a controversial weekly British comic book published by IPC Magazines, starting in February 1976.\n\nConcerns over the comic&amp;#039;s violent content saw it withdrawn from sale in October 1976. It reappeared the following month, in toned-down form, and continued publication until November 1977, at which point it was merged with Battle Picture Weekly. Despite its short lifespan, Action was highly influential on the British comics scene, and was a direct forerunner of the long-running 2000 AD.\n\n(from Wikipedia)\nTaken from THE SUN Friday April 30 1976:\n\nTHE SEVENPENNY NIGHTMARE Do you worry over what your kids read? By Chris Greenwood\nA GIANT shark snaps off a man?s head in one crimson-splashed chomp. Then it tears apart another victim, limb from trunk. An international diplomat dissolves in agony as sulphuric acid gushes from his bathroom shower. They could be X-certificate, adults-only scenes from a thriller combining the worst violence of Jaws and James Bond. But they are not. These are just two scenes from Action, a lurid new 7p British comic. And some of its readers are only seven years old!\n\nAction pinpoints a horrific bloodlust among today?s young children. Its circulation is rocketing by the week, while sales of the traditional tamer comics, like Wizard, Hotspur and Victor, are slumping. Kids are bored with the good, clean-cut adventure heroes their parents grew up with. They get their kicks from kidney-punches, bloodletting, limb severing, and other violence.\n\nFlick through the pages of some recent issues of Action. You?ll see?\n\nTHE SEVERED FINGER of a kidnapped boxing trainer delivered in a box - a warning to a black fighter to lose an important fight.\n\nBLACKJACK THE BOXER smashing punches into am opponent?s face, splattering blood everywhere.\n\nDEVIL WORSHIPPERS drinking human blood from chalices while their Satan-masked leader jabs a dagger into a victim?s chest.\n\nA SADISTIC WARDER dragging a boy prisoner along on his stomach from a rope attached to the back of his speeding car.\n\nA RAZOR-EDGED steel discus slicing into a man?s back.\n\nYet Action is not the product of a sleazy Soho printing press. Launch It is published by the International Publishing Corporation, which Prints 45 per cent of all British children?s comics and rnagazines. It is the unlikely stablemate of toddler&amp;#039;s favourites like Jack And Jill. And educationaI magazines such as Look And Learn.\n\nAction is the brainchild of IPC editorial director John Sanders, 44. It was launched three months ago in a Â£50,000 campaign, which included heavy television advertising at times when children are most likely to watch. Sanders says ?Two years ago, I was getting very concerned about the falling sales of our more traditional adventure comics like Bunter, Magnet and Champion. Some of them had been favourites for over half a century. I was keeping an eye in all other media and noticed the increasing levels of violence. Television news bulletins are full of it. Violence now is commonplace in all media. People are saturated with it, including children. Until 20 years ago, comics led the trend in children?s? entertainment Now we are a poor third behind television and films. There is a trend towards realism in action, and comics are bound to reflect this if they are to survive.? Sanders uses the hit movie Jaws, given an A Certificate, to back his case. He says, ?It?s incredible that a 14-year-old can take a little brother or sister along to see this type of film without an adult.? Sanders is not altogether happy about the trend. He says: ?We would like to stick with traditional stories of Union Jacks fluttering over Boy Scout camps. But kids don?t buy that anymore.?\n\nIPC are the world?s largest publisher of children?s material. Their 21 comics and magazines have 3,600,000 young readers every week in Britain alone. Do they need to be in the violence market at all? Sanders says, ?Yes, we do. You might as well ask: Should Britain abdicate from the United Nations because we don?t like what is going an in the world today. It?s the same as saying We don?t like what the kids like, so we won?t publish. We can?t turn our backs on this trend.?\n\nRough &quot;Violence is a highly emotive word. We prefer to say that Action gives rough, tough entertainment.&quot;\n\nSanders produced a large box of mail from some of Action?s 200,000 plus readers. The comic is intended for the 10-to-14 age bracket. But many of the appreciative letters come from seven-yearÂ­-olds. Of both sexes. There are also letters from angry parents. Sanders says ?They make me mad. They stick their children in front of the telly to keep them quiet, not noticing what they are watching. But when they pick up comic, the action is frozen before them.?\n\n?So they kick up a fuss, not realising that we are two stages behind television and films in realism.?\n\nOnce, American comics took the blame for horror and violence. But now they represent only ten per cent of children?s reading In Britain. Most seem pale compared to Action. They offer a tame mishmash of Dracula, Superman and spooky monsters which children find funny rather than frightening. The remaining 90 per cent of the home market is shared equally between IPC and D.C. Thomson of Dundee. Thomson?s produce evergreen favourites like Dandy and Beano, and traditional adventure comics like Wizard, Victor and Hotspur. They do not sell violence. Their nearest-to-violent publications, Bullet and Warlord, go in for car-crash yarns and World War Two adventures.\n\nSales Executive George Moonie says; ?We are not influenced by this violent trend. We are sticking to our traditional adventure lines.?\n\nBut D.C. Thomson face the falling sales which worried John Sanders so much. Joseph Holden and Sons, a firm of London wholesalers, have been distributing comics for over 100 years. Ian Holden, 23, a director, of the company, and great-grandson of the founder, says, ?The more violent comics are, the better they sell. Action is going like a rocket. More comics will have to follow suit and go in for blood and guts, or go out of business.?\n\nSome people would like to see Action go out of business. Lord Ted Willis, 58-year-old creator of television?s long-running family favourite, Dixon Of Dock Green Says: ?It is up to a big children?s publisher like IPC to go against such a violent trend, not cater to it.?\n\nStrict ?They are prostituting themselves to make money.?\n\nMr. Edward Gardner, 64-year-old Tory MP for South Fylde, Lancs. and a barrister, says: ?Horror comics should be subjected to strict controls. A great deal of harm can be done to the impressionable minds of children who read them.?\n\nMrs. Mary Whitehouse, 65, says, ?This publication must be doing an awful lot of harm to its young readers. Dreadful ?There is widespread evidence that viewing and reading violent material can increase aggressive behaviour. The Children, And Young Persons Harmful Publications Act 0f 1955 was deliberately designed to stop such things. Action comic is really dreadful. If the police don?t already know about it, I shall be informing them. And writing to IPC, pleading that this publication be taken off the bookstands.? Grown-ups are more scared ADULTS are much more likely to be frightened or shocked by horror comics and films than are children. That is the opinion of leading child psychologist Glen Smith after reading several issues of Action and other children?s thriller comics. He says, ?Children have such a short experience of life they don?t identify with pain and suffering in the same way as an adult. Youngsters are much better at separating fact from fantasy. They realise that what they are reading or seeing is not real. There is a very high degree of violence in Tom and Jerry cartoons. But children know this isn?t real, and that the characters come bouncing back after they have been squashed flat by steamrollers and shattered into pieces by hammers. Adults tend to identify with the pain and suffering.?\n\nMr Smith is head of the Children?s Research Unit. His team of 19 psychologistsÂ­ and 40 researchers vet a whole range of children?s products ? from toys to television programmes - before they are released to the public. He says, ?Kids can be incredibly gruesome. There is a big selling ice lolly on sale called Count Dracula, which has bits of red jelly put in to look like real blood.? NOW YOU TELL US WHAT was your favourite comic or comic characters? Did they have an effect on your life? Write to Comics, The Sun, 30 Bouverie Street, London, EC4Y 8DE. Â£1 for every letter published. ","torrent":{"xt":"urn:btih:c0d16dceddd115e180a5355859241ce0872f93ab","amp;dn":"ACTION++Comics+-+IPC+Magazines+%28UK%29+-+1976","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0d16dceddd115e180a5355859241ce0872f93ab","infoHashBuffer":{"type":"Buffer","data":[192,209,109,206,221,209,21,225,128,165,53,88,89,36,28,224,135,47,147,171]},"announce":[],"urlList":[]}}