{"title":"The Kant Dictionary (2015) pdf","uid":11740498,"size":818827,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c104c4db19df623699afa25d9991cec675fe7373&amp;dn=The+Kant+Dictionary+%282015%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1425782072,"description":"The Kant Dictionary is a comprehensive and accessible guide to the world of Immanuel Kant, one of the most important and influential thinkers in the history of philosophy. Meticulously researched and extensively cross-referenced, this unique book covers all his major works, ideas and influences and provides a firm grounding in the central themes of Kant's thought. Students will discover a wealth of useful information, analysis and criticism. A-Z entries include clear definitions of all the key terms used in Kant's writings and detailed synopses of his key works. The Dictionary also includes entries on Kant's major philosophical influences, such as Plato, Descartes, Berkeley and Leibniz, and those he influenced and engaged with, including Fichte, Hume and Rousseau. It covers everything that is essential to a sound understanding of Kant's philosophy, offering clear and accessible explanations of often complex terminology. The Kant Dictionary is the ideal resource for anyone reading or studying Kant or Modern European Philosophy more generally","torrent":{"xt":"urn:btih:c104c4db19df623699afa25d9991cec675fe7373","amp;dn":"The+Kant+Dictionary+%282015%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c104c4db19df623699afa25d9991cec675fe7373","infoHashBuffer":{"type":"Buffer","data":[193,4,196,219,25,223,98,54,153,175,162,93,153,145,206,198,117,254,115,115]},"announce":[],"urlList":[]}}