{"title":"Passware Kit Forensic v10.0.1772 Portable","uid":5647951,"size":39442079,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c13ada687f66a60b3ee304a70e80ecb7f9b4be8c&amp;dn=Passware+Kit+Forensic+v10.0.1772+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NoExcuses","files":2,"time":1277424809,"description":"Passware Password Recovery Kit Forensic v10.0 build 1772 Portable.\n\nNo need to install it!\n\nKey Features\n\n    * Recovers passwords for 180+ file types and decrypts hard disks New! providing an all-in-one user interface\n    * Scans computers and network for password-protected files (Encryption Analyzer Professional included)\n    * Acquires memory images of the seized computers (FireWire Memory Imager included) New!\n    * Retrieves electronic evidence in a matter of minutes from a Windows Desktop Search Database (Search Index Examiner included)\n    * Supports Distributed Password Recovery New!\n    * Runs from a USB thumb drive and recovers passwords without installation on a target PC (Portable Version included)\n    * Includes 1-year Subscription to updates\n\nGeneral Features\n\n    * Instantly recovers many password types\n    * Instantly decrypts MS Word and Excel files up to version 2003 (20 Credits for Decryptum attack included)\n    * Resets passwords for Local and Domain Windows Administrators instantly\n    * Recovers encryption keys for hard drives protected with BitLocker in minutes New!\n    * Decrypts TrueCrypt volumes in minutes New!\n    * Provides 8 different password recovery attacks (and any combination of them) with an easy-to-use setup wizard and drag &amp; drop attacks editor\n    * Uses multiple-core CPUs and nVidia GPUs efficiently to speed up the password recovery process by 3,500%\n    * Uses Tableau TACC hardware accelerators to speed up the password recovery process by up to 25 times\n    * Provides detailed reports with MD5 hash values\n\nBenefits for Computer Forensics\n\n    * This complete electronic evidence discovery solution reports all password-protected items on a computer and gains access to these items using the fastest decryption and password recovery algorithms. Many types of passwords are recovered or reset instantly, and advanced acceleration methods are used to recover difficult passwords. Passware Kit Forensic introduces a new attacks editor, which sets up the password recovery process in the most precise way to provide the quickest decryption solution possible. The highest performance is achieved with Distributed Password Recovery, using the computing power of multiple computers.\n\n      Passware Kit Forensic includes a Portable version that runs from a USB drive and finds encrypted files, recovers files and websites passwords without modifying files or settings on the host computer. Perform a complete encrypted evidence discovery process without installing Passware Kit on a target PC.\n\n      Passware Kit Forensic, complete with Passware FireWire Memory Imager, is the first commercial software that decrypts BitLocker and TrueCrypt hard disks of the seized computers without applying a time-consuming brute-force attack.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.lostpassword.com/kit-forensic.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lostpassword.com/kit-forensic.htm&lt;/a&gt;\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista/W7 machine. It's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:c13ada687f66a60b3ee304a70e80ecb7f9b4be8c","amp;dn":"Passware+Kit+Forensic+v10.0.1772+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c13ada687f66a60b3ee304a70e80ecb7f9b4be8c","infoHashBuffer":{"type":"Buffer","data":[193,58,218,104,127,102,166,11,62,227,4,167,14,128,236,183,249,180,190,140]},"announce":[],"urlList":[]}}