{"title":"Defect structure in nanomaterials","uid":9720384,"size":8391974,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c164701c7c699b553670ceaebfe7bc9833db9abb&amp;dn=Defect+structure+in+nanomaterials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1394225321,"description":"ISBN: 0857092065 | 2012 | PDF | 389 pages | 8 MB\n\nNanomaterials exhibit unique mechanical and physical properties compared to their coarse-grained counterparts, and are consequently a major focus of current scientific research. Defect structure in nanomaterials provides a detailed overview of the processing methods, defect structure and defect-related mechanical and physical properties of a wide range of nanomaterials. The book begins with a review of the production methods of nanomaterials, including severe plastic deformation, powder metallurgy and electrodeposition. The lattice defect structures formed during the synthesis of nanomaterials are characterised in detail. Special attention is paid to the lattice defects in low stacking fault energy nanomaterials and metal - carbon nanotube composites. Topics covered in the second part of the book include a discussion of the thermal stability of defect structure in nanomaterials and a study of the influence of lattice defects on mechanical and hydrogen storage properties.\n\n- Gives in-depth, physically based explanations for the relationships between the defect structure and mechanical properties of nanomaterials\n- Covers a wide range of nanomaterials including metals; alloys; ceramics; diamond; carbon nanotubes and their composites\n- Provides a detailed characterization of the lattice defect structure in nanomaterials\n","torrent":{"xt":"urn:btih:c164701c7c699b553670ceaebfe7bc9833db9abb","amp;dn":"Defect+structure+in+nanomaterials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c164701c7c699b553670ceaebfe7bc9833db9abb","infoHashBuffer":{"type":"Buffer","data":[193,100,112,28,124,105,155,85,54,112,206,174,191,231,188,152,51,219,154,187]},"announce":[],"urlList":[]}}