{"title":"[Mark Browning]David Fincher Films That Scar(pdf){Zzzzz}","uid":11461446,"size":692086,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c18f11d3861cdb508bc62d7a5344c2fc5158aa7b&amp;dn=%5BMark+Browning%5DDavid+Fincher+Films+That+Scar%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415992863,"description":"David Fincher is one of the most exciting filmmakers working in Hollywood today. He has produced a string of groundbreaking films that have achieved both critical and commercial success, while constantly challenging audiences to rethink their expectations of generic boundaries. David Fincher: Films That Scar is the first truly analytical work on the films of this mysterious and complex filmmaker. This insightful book analyzes all of Fincher's feature films, as well as examples of his commercials and pop videos, tracing key influences that include his background in special effects. It considers how he creates roles for strong women, how he has extended the detective genre, and how he adapts cult texts. The book also questions whether Fincher's films, famous for their downbeat endings and &quot;dark&quot; visual style, are really bleak or just part of an unconventional approach to filmmaking. In the end, readers will understand the development of Fincher's individual films and appreciate how the films relate closely to each other.\n\nProduct Description\nReview\n&quot;For film studies scholars and enthusiasts, Browning, who has taught film studies at schools in England, analyzes all of the feature films of director David Fincher, as well as examples of his commercials and pop videos. Noting the need for a critical study of all of his works rather than specific films only, he looks at commercials and videos by Fincher and their influence on his later career; how he created roles for strong women in Alien3 and Panic Room; how he extended the detective genre in Seven and Zodiac; and how he adapted literary texts in The Game, Fight Club, and The Curious Case of Benjamin Button; as well as the stylistic features of each film, general elements, and a comparison to the works of Brian De Palma.&quot; - Reference &amp; Research Book News &quot;Recommended. All readers.&quot; - Choice\n\nAbout the Author\nMark Browning, PhD, has taught film studies in a number of schools in England and was senior lecturer in education in Bath. He is the author of David Cronenberg: Author or Filmmaker? and Stephen King on the Big Screen. He currently works in Germany where he is writing books on Danny Boyle and Wes Anderson.\n\nPublisher: Praeger Publishers Inc (2 June 2010)\nLanguage: English\nISBN-10: 0313377723\nISBN-13: 978-0313377723","torrent":{"xt":"urn:btih:c18f11d3861cdb508bc62d7a5344c2fc5158aa7b","amp;dn":"%5BMark+Browning%5DDavid+Fincher+Films+That+Scar%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c18f11d3861cdb508bc62d7a5344c2fc5158aa7b","infoHashBuffer":{"type":"Buffer","data":[193,143,17,211,134,28,219,80,139,198,45,122,83,68,194,252,81,88,170,123]},"announce":[],"urlList":[]}}