{"title":"Eydie GormÃƒÂ©   4 Albums","uid":4190543,"size":246022293,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c1c464404bc2db3103f3da3899bf6f9e72703c15&amp;dn=Eydie+Gorm%C3%83%C2%A9+++4+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mingy2","files":49,"time":1210931115,"description":"Eydie GormÃƒÂ©   4 Albums\n\n\n\n\nEydie Gorme, Alternative spelling Eydie GormÃƒÂ©[1] (born Edith Gormezano on August 16, 1931) is an American singer credited heavily, along with husband Steve Lawrence, with helping to keep the classic Traditional pop music repertoire alive and well. She still continues to entertain and tour with husband Steve.\n\nThroughout her long career she has been the recipient of numerous awards including the Grammy Award, and an Emmy Award.\n\nThe couple&amp;#039;s striking union of broad ballads and breezy swing has combined with the endurance of their marriage and their comic facility to make them American institutions---even though neither of the couple, as separate performers or together, has put a single into the American Top 40 since 1963.\n\n\nGormÃƒÂ© was born Edith Gormezano in Bronx, New York, and raised by her immigrant Sephardic parents, of Spanish descent. She graduated from William Howard Taft high school in 1946 (legendary film director Stanley Kubrick attended the school at the same time), and worked for the United Nations as a translator, using her fluency in the Spanish language.\n\nMade her recording debut in 1950 with Tommy Tucker Orchestra and Don Brown and a second recording which featured Dick Noel. MGM issued these two recordings on 78rpm vinyl.\n\nEarly releases:\n\nA: Powder And Paint Original Issue: On 78 rpm vinyl only on MGM 10758\n\nA: Cherry Stones Original Issue: On 78 rpm vinyl only on MGM 10767\n\nBig Band Years:\n\nShe also hired out as a singer, working in the big bands of former Glenn Miller singer Tex Beneke In 1951 Eydie made several radio transmission recordings that have been issued on vinyl LP and recently on CD, in 1952 Eydie GormÃƒÂ© went on to record solo and her first recordings were issued on the Coral label.\n\nShe caught both her big break and her life partner when she and singer Steve Lawrence were booked to the original The Tonight Show, then hosted by Steve Allen. Andy Williams was also a singer on the Tonight Show during this period.\n\n\nThe couple were married in Las Vegas on December 29, 1957. They had two sons, one of whom predeceased them. They became famous on stage for their banter, which usually involved tart yet affectionate and sometimes bawdy references to their married life, which remains a feature of their stage style even now. (A typical exchange: Lawrence---&quot;Baby, you&amp;#039;re the only thing I&amp;#039;ve invested in that&amp;#039;s doubled.&quot; GormÃƒÂ©---&quot;Now you have to figure out how to make me split.&quot;)\n\nIn 1995 Gorme and Lawrence were honored for their lifetime contribution to song by the Songwriters Hall of Fame.\n\n\nGormÃƒÂ© enjoyed a few hit singles on her own, none selling bigger than 1963&amp;#039;s &quot;Blame it on the Bossa Nova&quot;, which was also her final foray into the Top 40 pop charts. Still, she won a Grammy Award for Best Female Vocal Performance in 1967, for her version of &quot;If He Walked Into My Life&quot;, from the stage musical Mame. Like her husband, GormÃƒÂ© has appeared on numerous television shows over the years, including The Carol Burnett Show and The Nanny. She and Lawrence appeared together on Broadway in the unsuccessful musical Golden Rainbow, the gestation of which is covered in very unflattering detail in William Goldman&amp;#039;s 1968 book The Season.\n\n \nEydie Gorme on the cover of her 1964 album titled &quot;Eydie Gorme Canta En EspaÃƒÂ±ol con Los PanchosGorme also gained unique crossover success in the Latin Music market through a series of albums she made in Spanish. One album being her bestselling album: Eydie Gorme, Canta en EspaÃƒÂ±ol (Sings in Spanish) with a trio of musicians called Los Panchos. The second album is called Cuatro Vidas (Four Lives). The last album with Los Panchos is a Christmas collection titled Blanca Navidad.\n\nAs a duo with her husband, their show name was &quot;Steve and Eydie&quot;. In 1960, Steve and Eydie were awarded the Grammy Award for Best Performance by a Vocal Group for their song &quot;We Got Us.&quot; One of their best known duos was the 1979 Israeli song &quot;Hallelujah,&quot; winner of the Eurovision song contest. They recorded it under the pseudonym Parker and Penny.\n\nSince the 1970s, the couple has focused strictly on the American pop repertoire, recording several albums themed around individual American pop composers. As the 21st Century arrived, the normally indefatigable couple announced their plans to cut back on their touring, launching a &quot;One More For The Road&quot; tour in 2002.\n\nIn 2006 GormÃƒÂ© became a blogger, posting occasional messages on her official Web site.\n\n\nGormÃƒÂ© and Lawrence had two sons, David, who is a composer, and Michael, who died unexpectedly of ventricular fibrillation resulting from an undiagnosed heart condition in 1986, at the age of 23.[2] Michael was a seeded tennis player at Cal State Northridge the time of his death, and apparently healthy despite a previous diagnosis of slight arrhythmia, which he was expected to grow out of. GormÃƒÂ© and Lawrence were in Atlanta at the time of his death, having performed at the Fox Theater the night before. Upon learning of the tragedy, Frank Sinatra sent his private plane to pick up the couple so that they could fly to New York to meet their other son, David, who was attending school at the time. Following the death of Michael, the couple took a year off before touring again.\n\n\n\n\n\n\n\n\nEydie Gorme - Don&amp;#039;t Go To Strangers   1966\n\n\n01 - How About Me\n02 - What&amp;#039;s New?\n03 - What Did I Have That I Don&amp;#039;t Have\n04 - I&amp;#039;ll Be Around\n05 - If He Walked Into My Life\n06 - Don&amp;#039;t Go To Strangers\n07 - I Wish You Love\n08 - How Did He Look?\n09 - I Wanna Be Around\n10 - Tell Him I Said Hello\n11 - When He Leaves You\n\nArranged And Produced By Don Costa\n\n\n\n\n\n\n\nEydie Gorme - I Feel So Spanish    1961\n\n01 - Granada\n02 - Te Quiero Asi\n03 - Besame Mucho\n04 - My Heart\n05 - Come Closer To Me\n06 - Un Telegrama\n07 - Adios\n08 - La Puerta\n09 - Frenesi\n10 - Quien Sera\n11 - Perfidia\n12 - I Feel So Spanish\n\nOrchestra Conducted By Don Costa\n\n\n\n\n\n\n\n\nEydie Gorme - Navidad Means Christmas  1966\n\n01 - Noche De Paz (Silent Night)\n02 - Blanca Navidad (White Christmas)\n03 - Gracias A Dios\n04 - Navidad Y AÃƒÂ±o Nuevo\n05 - Melchor, Gaspar Y Baltazar\n06 - Alegre Navidad\n07 - Cancion Para Meditar\n08 - Gloria A Dios En Las Alturas\n09 - Aguinaldo No. 1\n10 - Felices Pascuas\n\n\n\n\n\n\nEydie Gorme - Eydie Gorme   1956\n\n01 - I&amp;#039;ll Take Romance\n02 - This Is No Laughing Matter\n03 - Fine And Dandy\n04 - Day By Day\n05 - The Gentleman Is A Dope\n06 - Too Close For Comfort\n07 - Guess Who I Saw Today\n08 - Be Careful It&amp;#039;s My Heart\n09 - Saturday Night (Is The Loneliest Night Of The Year)\n10 - First Impressions\n11 - How Long Has This Been Going On?\n12 - Gypsy In My Soul\n\nOrchestra Conducted By Don Costa","torrent":{"xt":"urn:btih:c1c464404bc2db3103f3da3899bf6f9e72703c15","amp;dn":"Eydie+Gorm%C3%83%C2%A9+++4+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1c464404bc2db3103f3da3899bf6f9e72703c15","infoHashBuffer":{"type":"Buffer","data":[193,196,100,64,75,194,219,49,3,243,218,56,153,191,111,158,114,112,60,21]},"announce":[],"urlList":[]}}