{"title":"Ultraviolet Light in Food Technology: Principles and Application","uid":6763350,"size":2306405,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c20413097026a926f1deadc98ee978774f241a61&amp;dn=Ultraviolet+Light+in+Food+Technology%3A+Principles+and+Application&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1319275567,"description":"Ultraviolet Light in Food Technology: Principles and Applications (Contemporary Food Engineering)\nTatiana Koutchma (Author), Larry J. Forney (Author), Carmen I. Moraru (Author)\n\nHardcover: 296 pages\nPublisher: CRC Press; 1 edition (March 6, 2009)\nLanguage: English\nISBN-10: 1420059505\nISBN-13: 978-1420059502\n\nThe production of environmentally friendly, sustainable, chemical-free food continues to challenge the food industry, spurring on investigations into alternative food processing techniques that are more sophisticated and diverse than current practices. Exploring one of these emerging solutions, Ultraviolet Light in Food Technology: Principles and Applications incorporates the fundamentals of continuous and pulsed UV light generation and propagation; current food regulations; recommendations for optimal UV reactor design, selection, and validation; information on both commercially available and under-development UV sources; and the outlook for future food applications.\n\nAfter reviewing essential terms, definitions, and current applications, the book emphasizes the need to properly assess the physical and chemical properties in foods that influence the effectiveness of UV treatment and impact inactivation kinetics. It also addresses the effects of UV processing on food quality, before considering the engineering aspects of UV light treatment, such as transport phenomena, process calculations, and continuous-flow reactor geometries. The book then describes the principles of validating UV reactors as well as the principles and applications of UV pulsed light, including microbial inactivation in water, meat, fruits, vegetables, and packaging materials.\n\nFor anyone working in food research, development, and operations, this resource provides broad, accessible information on the science and applications of UV light technology. It shows how UV light irradiation can be used as a physical preservation method in food processing.","torrent":{"xt":"urn:btih:c20413097026a926f1deadc98ee978774f241a61","amp;dn":"Ultraviolet+Light+in+Food+Technology%3A+Principles+and+Application","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c20413097026a926f1deadc98ee978774f241a61","infoHashBuffer":{"type":"Buffer","data":[194,4,19,9,112,38,169,38,241,222,173,201,142,233,120,119,79,36,26,97]},"announce":[],"urlList":[]}}