{"title":"The.Weight.of.Chains.Tezina.Lanca.(2010).EN.stEN.DVD.Mister.G","uid":10141525,"size":3680182272,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c207e8ca496680f29cb1921fbd0b63038230cf24&amp;dn=The.Weight.of.Chains.Tezina.Lanca.%282010%29.EN.stEN.DVD.Mister.G&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"asc11","files":-1,"time":1400005861,"description":"DVD5 PAL 720x576 25 fps\nAC3 256 kbps 40 kHz 2ch\n\nSee the passionate reviews, for and against: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1789083/reviews&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1789083/reviews&lt;/a&gt;\n\nIF racial hatred, war and deaths were instigated by &quot;market&quot; crusaders,\nthat's all in the past, and nothing similar could happen again today --\nsuch as in Ukrain -- OR COULD IT?\n\n-------------------------------------------\n\n110 out of 164 people found the following review useful:\n\nFinally a fresh look at a complex situation.\n\n********-- Author: david griffin (david at utopiated dot net) from UK Midlands\n2 July 2011\n\nI watched the first phase of the Balkans 90s conflict play out whilst studying for a degree in Peace Studies and Conflict Resolution at a UK college... it was made immediately part of the course. Since then I've made a constant effort to keep an eye of how things have progressed - right up to the recent duping of the people in Kosovo - who seem to welcome being made one big US/NATO base.\n\nAnyway - apart from a 5 part BBC series - nothing has tackled this issue in the depth it demands till now apart from this documentary. Ignore the handful of reviewers who claim it's &quot;Serb propaganda&quot; - that's just idiotic - in fact this is one of the best produced and written documentaries I've seen on contemporary geopolitical monkey-business to date! The interview snatches are all from erudite commentators, the chronology is unravelled in a comprehensive manner and footage they've amassed really adds a human quality to things. The footage of elderly Serb and Croat neighbours being forced to pack up and leave after living together without any issue is heart-wrenching (and definitely not staged, before someone suggests this).\n\nAlso - by peeling away the propaganda the Serbs have been framed with for so long - we finally begin to hear the real ramifications of the war... which was partially a CORPORATE war. Bosnitch adds some amazing facts - such as the Yugo car industry being terminated by clever bombing - and the take-over by US firm Philip Morris by Clinton agreeing to bomb three times a very successful Serb cigarette factory - so much for military targets??! Recommended. A total and much needed breath of air.\n\n\n------------------------------------------\n","torrent":{"xt":"urn:btih:c207e8ca496680f29cb1921fbd0b63038230cf24","amp;dn":"The.Weight.of.Chains.Tezina.Lanca.%282010%29.EN.stEN.DVD.Mister.G","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c207e8ca496680f29cb1921fbd0b63038230cf24","infoHashBuffer":{"type":"Buffer","data":[194,7,232,202,73,102,128,242,156,177,146,31,189,11,99,3,130,48,207,36]},"announce":[],"urlList":[]}}