{"title":"Minecraft Cracked 1.4.4 ~AutoInstaller~ ~Multiplayer~","uid":7826242,"size":55805301,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c2ada47dffb3e7e2d4c4e9716727486803988fd9&amp;dn=Minecraft+Cracked+1.4.4+%7EAutoInstaller%7E+%7EMultiplayer%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TagCraft","files":1,"time":1352933681,"description":"TagCraftMC's official 1.4.4 Minecraft client!\n\nOur client is super simple to install!\n\n- Download the torrent.\n\n- Run the Installer\n\n- Play Minecraft from the Shortcut made on the Desktop.\n\n\nIf you have any problems, please open the &quot;Client Help and Info&quot; file or click the &quot;Client Help and Info&quot; button on the top of our website www.tagcraftmc.com. Also everything on the launcher has a tooltip telling you what it does, just mouse over it for a few seconds.\n\nOn our website we also offer and Online Cracked Client for those unable to use the installer (Mac OS ect), this allows you to play Cracked Minecraft from our website, just Click the &quot;Play Online Now!&quot; button.\n\nOn our site we also supply a .zip file of our cracked client for people who do not or cannot use our installer or for whatever reason cannot download the torrent. You can find this link on the &quot;Client Help and Info&quot; page.\n\nDue to our superfast release of this client we are unable to distribute it with reiÎ“Ã‡Ã–s minimap or the HD texture pack for 1.4.4, however when both are updated we will add support for adding them to 1.4.4 on our site.\n\nOur server is already in the server list but if you forget it or deleted it, here is the address again or\nOur server is running 1.4.2 at the release of this torrent, if you downloaded 1.4.4 you will have to wait until we are able to update our server (may take a weeks)\nOur 1.4.2 torrent can be found here: http://thepiratebay.se/torrent/7760102\n\nIf you have any questions please feel free to post on our forums or in the comments.\n\nPicture of our Client - http://i.imgur.com/2P641.jpg\n\nEnjoy the Client and hope to see you on our server soon :) - If you like Minecraft buy it!","torrent":{"xt":"urn:btih:c2ada47dffb3e7e2d4c4e9716727486803988fd9","amp;dn":"Minecraft+Cracked+1.4.4+%7EAutoInstaller%7E+%7EMultiplayer%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2ada47dffb3e7e2d4c4e9716727486803988fd9","infoHashBuffer":{"type":"Buffer","data":[194,173,164,125,255,179,231,226,212,196,233,113,103,39,72,104,3,152,143,217]},"announce":[],"urlList":[]}}