{"title":"Halo - The Forerunner Saga [PDF]","uid":9904207,"size":3720649,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c363397c590bee1bd618fc4374e2348fde15b289&amp;dn=Halo+-+The+Forerunner+Saga+%5BPDF%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"skumole83","files":1,"time":1396815419,"description":"The Forerunner Saga is a trilogy of Halo novels focusing on Forerunner life 100,000 years before the Human-Covenant War, written by Greg Bear and published by Tor Books. The series reveals a great deal of new information about the Forerunner-human interactions in ancient history, as well as providing additional background for the events in Halo 4 and subsequent media.\n\nCryptum\n\nReleased January 4, 2011, Cryptum focuses on a young Forerunner known as Bornstellar Makes Eternal Lasting, a rebellious Manipular from a family of Builders, the highest and most politically powerful rate of the Forerunner. His father sends him to the planet Edom in a distant system known as Sol to work with the Miners to come to terms with his duty as a Builder. As part of the Librarian's far-reaching plans, however, Bornstellar is led to Earth, where he crosses paths with two humans, Chakas and Riser. They soon stumble upon the Cryptum of the ancient Promethean military leader known as the Didact, forever changing the fate of the galaxy.\n\nPrimordium\n\nThe sequel to Halo: Cryptum was released on January 3, 2012. Primordium is centered around Chakas, one of the two humans who accompanied Bornstellar in the first novel. After being captured by the Master Builder during the events of Cryptum, Chakas finds himself marooned on an embattled Halo installation, where he is joined by two humans on a quest to find his companion Riser. During their journey and its eventual conclusion, revelations are made as to the nature of the Flood, the rampant AI Mendicant Bias and the mysterious Primordial, as well as the far-reaching plans of the Precursors.\n\nSilentium\n\nHalo: Silentium is the third and last book of The Forerunner Saga. Released on March 19th, 2013, Silentium ties in directly with Halo 4, elaborating on the stories of the Ur-Didact, IsoDidact, the Librarian and the end of the Forerunner civilization as the Forerunner-Flood war draws to a close. Mythology concerning the Precursors and the origins of the Flood is expanded upon and clarified, along with a number of elements and locales touched on in the previous Forerunner Saga novels.","torrent":{"xt":"urn:btih:c363397c590bee1bd618fc4374e2348fde15b289","amp;dn":"Halo+-+The+Forerunner+Saga+%5BPDF%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c363397c590bee1bd618fc4374e2348fde15b289","infoHashBuffer":{"type":"Buffer","data":[195,99,57,124,89,11,238,27,214,24,252,67,116,226,52,143,222,21,178,137]},"announce":[],"urlList":[]}}