{"title":"DDFBusty - Alyson Tyler (Dark Pirates Nest)","uid":12669269,"size":234588211,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c4ab001c4ab92a82ba7108046d9ceffe0adb8de5&amp;dn=DDFBusty+-+Alyson+Tyler+%28Dark+Pirates+Nest%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"feeldabyte","files":1,"time":1446419139,"description":"\nScreens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n  \nhttp://imgkiss.com/image/fRCGS \nhttp://imgkiss.com/image/fRFji\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nHalloween, 2015. A hidden pirates’ nest in a dark cave. Once upon a time, the two nasty pirates Alyson Tyler and Bruce Ventura stranded on the coast outside of treasure island. They died a slow death and come back to life once a year since hundreds of years for only one reason: to fuck their brains out. Alyson used to be a busty maneater while alive. She crammed her face and shaved pussy with one pirate’s cock after the other. Bruce, on the other hand, used his natural grown sword over any other weapon and banged one voluptuous lady after the other, each of who were eager to suck his hard cock whenever he was on shore leave.\r\n\r\nAlyson is a brunette babe with blue eyes. During a hardcore gangbang on board of their buccaneer, it got crazy wild and she got one eye poked out by a hard-on. She wears an eyepatch since then. Her enormous cleavage can’t wait for a titty fuck by Bruce and after she’s done deep throat sucking his cock, he crams her shaved fuckhole with his long john. Alyson rides him like a cowgirl and makes her pussy gape wide open. Then he bangs her doggy style and fucks the American beauty in standing sex position. Her big and curvy ass can’t wait to be slapped by the pirate’s hand!\r\n\r\nFinally, slides his meat between her giant jugs and titty fucks her while she spits onto his dick for that extra lubrication. Her white face and smokey eyes can’t wait for him to come all over her zombie hooters. DDF Network’s Halloween episode of our amazing Busty series comes to an end when pirate Bruce blows his cum on her tits. Enjoy some XXX porn pics in our Full HD gallery below!\r\n\r\n\r\nSail to another one :\r\n  \nhttps://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:c4ab001c4ab92a82ba7108046d9ceffe0adb8de5","amp;dn":"DDFBusty+-+Alyson+Tyler+%28Dark+Pirates+Nest%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4ab001c4ab92a82ba7108046d9ceffe0adb8de5","infoHashBuffer":{"type":"Buffer","data":[196,171,0,28,74,185,42,130,186,113,8,4,109,156,239,254,10,219,141,229]},"announce":[],"urlList":[]}}