{"title":"The Forest 0.06B","uid":10984799,"size":559099012,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c4b00c661f14f67dc89b452296d2f4cc47817960&amp;dn=The+Forest+0.06B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Astheris","files":-1,"time":1409906694,"description":"Direct copy from Steam after the 0.06B update.\n\n\n\nThe Forest is a first-person video game in development by Endnight Games for Windows. The game's pre-alpha version was released through Steam Early Access on May 30, 2014.\n\nIn The Forest, the player must survive on a forested island after becoming the lone survivor of a plane crash by creating shelter, weapons, and other survival tools. Inhabiting the island, along with various woodland creatures, are a tribe of nocturnal, cannibalistic mutants who dwell in deep caves beneath the island. While they are not necessarily always hostile to the player, their usual behavior is aggressive, especially during the night. However, the developers want players to question whether the island's cannibalistic tribe is the enemy of the player, or vice versa.[1] For example, when first encountering the player, the cannibals may hesitate to attack and instead observe the player from a distance, attempt to communicate with the player through effigies, and send patrols around the player's base camp. In combat, they regularly attempt to protect one another from injury, remove torches, surround the player, hide behind cover, drag wounded tribesmen to safety, keep their distance, use tactical decisions, not overextend into unknown territory, and occasionally surrender out of fear. They are also afraid of fire, and will refrain from approaching the player if there is a campfire or torch nearby. Though there are no set missions, there will be an optional conclusion to the game.\n\nThe game features a day/night cycle, with the player able to build a shelter and traps, hunt animals and collect supplies during the day, and defend themselves against the mutants by night.","torrent":{"xt":"urn:btih:c4b00c661f14f67dc89b452296d2f4cc47817960","amp;dn":"The+Forest+0.06B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4b00c661f14f67dc89b452296d2f4cc47817960","infoHashBuffer":{"type":"Buffer","data":[196,176,12,102,31,20,246,125,200,155,69,34,150,210,244,204,71,129,121,96]},"announce":[],"urlList":[]}}