{"title":"Owls - Two (2014) [FLAC]","uid":9808450,"size":254735215,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c4daeebe8d794ae762d7a2e8102293b3919ddbe6&amp;dn=Owls+-+Two+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1395448037,"description":"\n  Owls - Two (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Emo\n  Source: CD (log + cue) \n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16 \n  Sample Rate: 44.1 kHz\n\n  01 Four Works of Art...\n  02 I'm Surprised...\n  03 The Lion...\n  04 Why Oh Why...\n  05 This Must Be How...\n  06 Ancient Stars Seed...\n  07 It Collects Itself...\n  08 I'll Never Be...\n  09 Oh No, Don't...\n  10 A Drop of Blood...\n\n  In 2001, a good seven years after the dissolution of teenage emo/artsy hardcore group Cap'n Jazz, most of its members regrouped as a far different beast called Owls. While Cap'n Jazz unknowingly pioneered the entire emo genre with their screamy, melodic urgency, Owls' self-titled debut was a darker, more angular affair, composed of bottle-rocket drumming, epic technical guitar runs, and increasingly cracked lyrical wordplay from singer/lyricist Tim Kinsella, who had been confounding listeners with his polarizing and experimental work in Joan of Arc around the time Owls took off. An incredible, well-received debut album and scant amounts of touring took place before the band imploded, breaking up just a year after it began. \n\n  Now, 13 years after the group's debut album, the appropriately titled Two has materialized as if no time had passed at all. From the beginning drone of &quot;Four Works of Art,&quot; Owls have the same strange lurch that popped up on their years-old debut, as well as the same mathy sense of melodicism on tracks like &quot;I'm Surprised.&quot; Guitarist Victor Villarreal's airy, serpentine guitar lines wind around every track in strange time signatures, providing counterpoints to Sam Zurick's rock-steady basslines and Mike Kinsella's explosive yet precise drumming. Always dead center is Tim Kinsella, whose abstract lyrical approach is the equivalent to the band's complex musical push, painting surreal images of everything from observations on getting older to psychedelic portrayals of hornets and honeybees. &quot;Ancient Stars Seed&quot; is an enormous highlight, seeing all of the band's strengths elevated to a level of complete focus, the strange structures, the doomy rock undercurrents, the incredible tension of the group's dynamic playing, and Tim Kinsella's mad-genius lyrics peppering the song with insights as oddly brilliant as he's always had. Though they took over a decade to follow up their first album, Two still sounds like a band a decade ahead of its time.","torrent":{"xt":"urn:btih:c4daeebe8d794ae762d7a2e8102293b3919ddbe6","amp;dn":"Owls+-+Two+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4daeebe8d794ae762d7a2e8102293b3919ddbe6","infoHashBuffer":{"type":"Buffer","data":[196,218,238,190,141,121,74,231,98,215,162,232,16,34,147,179,145,157,219,230]},"announce":[],"urlList":[]}}