{"title":"Hopeless Series Audiobooks (1-2.5) by Colleen Hoover","uid":13974111,"size":1262085817,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c51a83d5e4fc2195fb85eacd04cc83db8afa1825&amp;dn=Hopeless+Series+Audiobooks+%281-2.5%29+by+Colleen+Hoover&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"yousef86","files":13,"time":1458639032,"description":"Hopeless: Hopeless, Book 1 (Audiobook) by Colleen Hoover\r\n========================================================\r\nEnglish | MP3 128kbps CBR | 12:35:18 | ASIN: B00CS7QULQ | 691 MB\r\nGenre: Contemporary Romance | Narrator: Angela Goethals\r\n\r\n\r\nSometimes discovering the truth can leave you more hopeless than believing the lies…\r\n\r\nThat’s what seventeen-year-old Sky realizes after she meets Dean Holder. A guy with a reputation that rivals her own and an uncanny ability to invoke feelings in her she’s never had before. He terrifies her and captivates her all in the span of just one encounter, and something about the way he makes her feel sparks buried memories from a past that she wishes could just stay buried.\r\n\r\nSky struggles to keep him at a distance knowing he’s nothing but trouble, but Holder insists on learning everything about her. After finally caving to his unwavering pursuit, Sky soon finds that Holder isn’t at all who he’s been claiming to be. When the secrets he’s been keeping are finally revealed, every single facet of Sky’s life will change forever.\r\n\r\n\r\nLosing Hope: Hopeless, Book 2 (Audiobook) by Colleen Hoover\r\n===========================================================\r\nEnglish | MP3 64kbps CBR | 10:34:19 | ISBN: 1442366486 | 290 MB\r\nGenre: Contemporary Romance | Narrator: Kirby Heyborne\r\n\r\n\r\nSometimes in life, in order to move forward you must face the past…#1 New York Times bestselling author Colleen Hoover held readers spellbound with her novel Hopeless, the story of what happened when a troubled girl named Sky encountered a long-lost childhood friend, Dean Holder. With Holder’s help, Sky uncovered shocking family secrets and came to terms with memories and emotions that had left deep scars.\r\n\r\nHopeless was Sky’s story. Now, in Losing Hope, we finally learn the truth about Dean Holder.\r\n\r\nHaunted by the little girl he couldn’t save from imminent danger, Holder’s life has been overshadowed by feelings of guilt and remorse. He has never stopped searching for her, believing that finding her would bring him the peace he needs to move on. However, Holder could not have anticipated that he would be faced with even greater pain the moment they reconnect.\r\n\r\nIn Losing Hope, Holder reveals the way in which the events of Sky’s youth affected him and his family, leading him to seek his own redemption in the act of saving her. But it is only in loving Sky that he can finally begin to heal himself.\r\n\r\n\r\nFinding Cinderella: Hopeless, Book 2.5 (Audiobook) by Colleen Hoover\r\n====================================================================\r\nEnglish | MP3 128kbps CBR | 04:02:11 | ISBN: 1442377127 | 221 MB\r\nGenre: Contemporary Romance | Narrator: Jason Carpenter\r\n\r\n\r\nA chance encounter in the dark leads eighteen-year-old Daniel and the girl who stumbles across him to profess their love for each other. But this love has conditions: they agree it will last only one hour, and it will be only make-believe.\r\n\r\nWhen their hour is up and the girl rushes off like Cinderella, Daniel tries to convince himself that what happened between them seemed perfect only because they were pretending it was. Moments like that happen only in fairy tales.\r\n\r\nOne year and one bad relationship later, his disbelief in love-at-first-sight is stripped away the day he meets Six: a girl with a strange name and an even stranger personality. Unfortunately for Daniel, finding true love doesn't guarantee a happily ever after... it only further threatens it.\r\n\r\nWill an unbearable secret from the past jeopardize Daniel and Six's only chance at saving each other?","torrent":{"xt":"urn:btih:c51a83d5e4fc2195fb85eacd04cc83db8afa1825","amp;dn":"Hopeless+Series+Audiobooks+%281-2.5%29+by+Colleen+Hoover","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c51a83d5e4fc2195fb85eacd04cc83db8afa1825","infoHashBuffer":{"type":"Buffer","data":[197,26,131,213,228,252,33,149,251,133,234,205,4,204,131,219,138,250,24,37]},"announce":[],"urlList":[]}}