{"title":"The Legend of Korra 1 t/m 4 NL Gesproken","uid":13258057,"size":12489164998,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c52ccefd78b8d739a59008fd0a046be3af31929f&amp;dn=The+Legend+of+Korra+1+t%2Fm+4+NL+Gesproken&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jordiadr","files":49,"time":1453234799,"description":"Dit zijn alle delen van De legende van Korra Nederlands Gesproken in HD.\r\nDus delen 1, 2, 3 en 4 zijn inbegrepen. \r\n\r\nVeel kijk plezier!\r\n\r\nThis is the dutch release of The Legend of Korra containing season's 1 to 4. \r\nIf you are looking for the original English version, look elsewhere. ;)\r\n\r\nDe serie speelt zich af 70 jaar na de vorige serie. De oorlog is voorbij en de Aarderijk-kolonies van de Vuurnatie zijn omgevormd in de Verenigde Republiek der Naties met als hoofdstad Republic City. Op technologisch gebied is er in de afgelopen 70 jaar veel veranderd. Zo zijn onder andere auto’s, grammofoonspelers, radio's, telefoons en fototoestellen uitgevonden.\r\n\r\nAvatar Aang is inmiddels overleden. Centraal in de serie staat de nieuwe Avatar, Korra; een tiener van de Zuidelijke Waterstam. Ze is qua persoonlijkheid heel anders dan Aang. Ze is onafhankelijk, houdt van vechten, en kan erg impulsief zijn. Bij aanvang van de serie heeft ze de elementen water, aarde en vuur al onder de knie, maar moet luchtsturen nog aanleren. Er is in de hele wereld slechts 1 luchtmeester die haar dit kan leren: Tenzin, de zoon van Aang en Katara. Hij kan echter Republic City niet verlaten daar er groeiende problemen zijn, dus besluit Korra tegen de wil van haar andere leermeesters in de Zuidpool te verlaten en Tenzin op te zoeken op luchttempel eiland net voor de kust van Republic City.\r\n\r\nKorra maakt in Republic City al snel enkele vrienden, maar ook vijanden. Er blijkt een groepering actief te zijn geleid door een zekere Amon, die ernaar streven om het elementsturen te laten verbieden zodat iedereen gelijk is. Korra ontdekt al snel dat Amon de gave heeft om iemand zijn/haar sturingskunsten te ontnemen. Amon en zijn groep zijn niet bang om terrorisme te gebruiken om zo hun doel te bereiken. Ook krijgt Korra te maken met Tarlok, een ambitieuze politicus die de illegale kunst van het bloedsturen beheerst. In de climax van de eerste saga komt het tot een militair conflict waarbij Amon en zijn leger tegenover het leger van de verenigde Republiek komen te staan. Korra ontdekt tijdens dit conflict de waarheid over Tarrlok en Amon; ze zijn beide zonen van een bloedmeester genaamd Yakone, die ooit door Aang werd verslagen. Nadat het Amon uiteindelijk is gelukt om de stuurkrachten van Korra te ontnemen, ontsluit Korra eindelijk haar luchtstuurvaardigheden en ontmaskert Amon als een watermeester, waardoor hij moet vluchten. Nadat Korra terug kwam naar de Zuidelijke Waterstam maakte ze contact met Aang, hij geeft Korra haar stuurkrachten terug. Het is haar gelukt om alle slachtoffers van Amon hun stuurkunsten terug te geven","torrent":{"xt":"urn:btih:c52ccefd78b8d739a59008fd0a046be3af31929f","amp;dn":"The+Legend+of+Korra+1+t%2Fm+4+NL+Gesproken","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c52ccefd78b8d739a59008fd0a046be3af31929f","infoHashBuffer":{"type":"Buffer","data":[197,44,206,253,120,184,215,57,165,144,8,253,10,4,107,227,175,49,146,159]},"announce":[],"urlList":[]}}