{"title":"HISTORY OF POP AND ROCK MUSIC - part 539","uid":9373760,"size":1141377480,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c64560c509769f1aa624b2a27d075c8ce2e8f399&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+539&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1387579956,"description":" \n\n                      PART  359\n\n\n\n            CONCRETE BLONDE  -  Still in Hollywood (1986)\n            CONCRETE BLONDE  -  God is a Bullet (1989)\n            CONCRETE BLONDE  -  Joey  (1990)\n            CONCRETE BLONDE  -  Everybody Knows  (1990)\n            CONCRETE BLONDE  -  Caroline  (1990)         \n            CONCRETE BLONDE  -  Ghost Of A Texas Ladies' Man  (1992)\n\n\n\n\n            Concrete Blonde is an alternative rock band based in the United States. They were active from 1982 to 1995, from 2001 to 2004, and then reunited in 2010 and have been active since. They are best known for their 1990 album &quot;Bloodletting&quot;, their top 20 single &quot;Joey,&quot; and Johnette Napolitano's distinctive vocal style.She has also recorded as a solo artist, with the albums Sketchbook (2002), Sketchbook 2 (2006), Scarred (2007), Sketchbook 3 (2010) and as a member of Dream 6 (a precursor to Concrete Blonde).She has contributed music to many films, including the 2006 Australian film Candy, and &quot;Suicide Note&quot; from Underworld. Johnette is currently a resident of Joshua Tree, California. She composes music for films and works as a gallery artist. \n\n                Their first release was 1986's  &quot;Concrete Blonde&quot;, which included &quot;Still in Hollywood.&quot; They added a second guitarist, Alan Block, for their 1989 release, &quot;Free&quot;. This album included the college radio hit &quot;God is a Bullet.&quot;\n              &quot;Joey&quot; is a song from Concrete Blonde's third and most successful album &quot;Bloodletting&quot;. The song was released in 1990 and was sung by Johnette Napolitano. One interpretation is that the song is about a man who is in love with alcohol. Johnette Napolitano mentioned in her book, Rough Mix, that the song was written about her relationship with Marc Moreland of the band Wall of Voodoo.  It became the group's biggest hit, spending four weeks atop the Billboard Modern Rock Tracks chart, and crossing over to pop radio, reaching #19 on the Billboard Hot 100 chart; it remains their only charting song on the latter chart.\n             &quot;Everybody Knows&quot; is a song written by Leonard Cohen and collaborator Sharon Robinson.\n&quot;Everybody Knows&quot; has been covered by Concrete Blonde, in the film Pump Up the Volume (1990), the TV series Dirty Sexy Money at the end of the third episode of the first season, and on their compilation album &quot;Still in Hollywood&quot; (1994)\n","torrent":{"xt":"urn:btih:c64560c509769f1aa624b2a27d075c8ce2e8f399","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+539","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c64560c509769f1aa624b2a27d075c8ce2e8f399","infoHashBuffer":{"type":"Buffer","data":[198,69,96,197,9,118,159,26,166,36,178,162,125,7,92,140,226,232,243,153]},"announce":[],"urlList":[]}}