{"title":"Olaf Stapledon - Star Maker","uid":11624783,"size":461132298,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c685e1a57a1347d63db9bd60c3c3584797d0d394&amp;dn=Olaf+Stapledon+-+Star+Maker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":1,"time":1417606054,"description":"Widely regarded as one of the true classics of science fiction, Star Maker is a poetic and deeply philosophical work. The story details the mental journey of an unnamed narrator who is transported not only to other worlds but also other galaxies and parallel universes, until he eventually becomes part of the &quot;cosmic mind.&quot; First published in 1937, Olaf Stapledon's descriptions of alien life are a political commentary on human life in the turbulent inter-war years. The book challenges preconceived notions of intelligence and awareness, and ultimately argues for a broadened perspective that would free us from culturally ingrained thought and our inevitable anthropomorphism. This is the first scholarly edition of a book that influenced such writers as C.S. Lewis and Arthur C. Clarke and which Jorge Luis Borges called &quot;a prodigious novel.&quot;\n\nOne moment a man sits on a suburban hill, gazing curiously at the stars. The next, he is whirling through the firmament, and perhaps the most remarkable of all science fiction journeys has begun.\n\nEven Stapledon's other great work, LAST AND FIRST MEN, pales in ambition next to STAR MAKER, which presents nothing less than an entire imagined history of life in the universe, encompassing billions of years.\n\nThis bold exploration of the cosmos ventures into intelligent star clusters and mingles among alien races for a memorable vision of infinity. Cited as a key influence by science-fiction masters such as Doris Lessing, this classic has left its mark not only in modern literature but also in the fields of social anthropology and philosophy.\n\nOlaf Stapledon's 1937 successor to Last and First Men offers another entrancing speculative history of the future. Its narrator, a contemporary Earthman, joins a community of explorers who travel to the farthest reaches of the universe, seeking traces of intelligence. Along the way, they encounter nautiloid water beings, races of hyperspiders and hyperfish, composite group intelligences, plantlike creatures, and other strange life forms. Their dramatic voyage unfolds against a backdrop of life-and-death struggles on a cosmic scale","torrent":{"xt":"urn:btih:c685e1a57a1347d63db9bd60c3c3584797d0d394","amp;dn":"Olaf+Stapledon+-+Star+Maker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c685e1a57a1347d63db9bd60c3c3584797d0d394","infoHashBuffer":{"type":"Buffer","data":[198,133,225,165,122,19,71,214,61,185,189,96,195,195,88,71,151,208,211,148]},"announce":[],"urlList":[]}}