{"title":"QI Series G (All episodes, mostly XL)","uid":5645641,"size":5117654688,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c686eb969e1e435905ea259bcbe8402ff6024156&amp;dn=QI+Series+G+%28All+episodes%2C+mostly+XL%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"yurigroller","files":-1,"time":1277283381,"description":"All the episodes from QI series G, mostly XL editions except episodes 2, 3, 15, and 16 which I could not find  \n\nThanks to the original uploader of the individual files (nskid11). My upload speed is being throttled at the minute, so sorry if the transfer takes a long time.\n\nThe Show (Taken from its website):\n\nQuite Interesting - or 'QI' to its friends - could loosely be described as a comedy panel quiz. However, none of the stellar line-up of comedians is expected to be able to answer any questions, and if anyone ends up with a positive score, they can be very happy with their performance. Points are awarded for being interesting or funny (and, very occasionally, right) but points are deducted for answers which merely repeat common misconceptions and urban myth. (Alan Davies has turned this aspect of the game into somewhat of an artform.) It's okay to be wrong, but don't be obviously, boringly wrong. In this way, QI tries to rid the world of the flotsam of nonsense and old wives' tales that can build up in your mind. QI not only makes us look more closely at things, it encourages us to question all the received wisdom we have carried with us since childhood. Think of the program as a humorous cranial de-scaler.\n\nPlease seed, obviously.","torrent":{"xt":"urn:btih:c686eb969e1e435905ea259bcbe8402ff6024156","amp;dn":"QI+Series+G+%28All+episodes%2C+mostly+XL%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c686eb969e1e435905ea259bcbe8402ff6024156","infoHashBuffer":{"type":"Buffer","data":[198,134,235,150,158,30,67,89,5,234,37,155,203,232,64,47,246,2,65,86]},"announce":[],"urlList":[]}}