{"title":"Yovee - City Strollin [EP] &amp; Too Far Gone by Fab!","uid":9257826,"size":732463475,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c723a3c81325ba35201db3cde3e2b1aa419614db&amp;dn=Yovee+-+City+Strollin+%5BEP%5D+%26amp%3B+Too+Far+Gone+by+Fab%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"fabunbutaps","files":-1,"time":1385579666,"description":"Hello pirates!\n\nYovee joined forces in 2003 as the result of a recording project, the soundtrack for Riding In Vans With Boys. Eight months later, they released their first EP, City Strollin, and began performing in front of sold-out crowds immediately. Yovee blends acoustic guitar, piano, and vocal harmonies with a modern chord progression, resulting in a lush sound influenced by a diverse mix of history... Young, Fleetwood Mac, the Beatles, Coldplay and Radiohead.\n\nYovee can be heard on several of San Diego's largest FM radio stations including 91X, 94.9, and 102.1. They have performed live on Fox, KUSI News, and received coverage in numerous print publications--Transworld Surf, San Diego Union-Tribune, North County Times, San Diego CityBeat, San Diego Reader, 944, and SD Music Matters Magazine.\n\nNominated in 2004 for Best New Artist and in 2005 for Best Pop Band in the San Diego Music Awards, Yovee has been a headlining act since day one and covered an amazing amount of ground in a relatively short period of time. The band was featured on the soundtrack of Drive Thru: South Central America by award-winning surf filmmaker Taylor Steele, and a three song Yovee EP was included with every copy of the movie sold. Yovee's first music video for the song &quot;Dreamer On The Run&quot; debuted on a promotional DVD distributed nationwide by Macbeth Shoes and appeared in Atticus Clothing's 'Dragging the Lake Vol. 2' video magazine. Following the first video Yovee teamed up with Z-Media to shoot the &quot;Private Caller&quot; music video that is available online at sdmusicmatters.com. In 2005 Yovee released their first full length album on Manaloft Record's entitled Too Far Gone.\n\nThe band recorded tracks for their 3rd album, Praying for Fire EP, to be released October 2008. Yovee also had plans for a national tour that would have brought their music across the United States and then to Europe. As of May 2009, the members of Yovee have parted ways, but still continue other musical endeavors. Recently in 2010 and 2011, Yovee has been playing live shows in and around San Diego. This could be the sign of a possible reformation.\n\n\n\nPLease Seed After!!!","torrent":{"xt":"urn:btih:c723a3c81325ba35201db3cde3e2b1aa419614db","amp;dn":"Yovee+-+City+Strollin+%5BEP%5D+%26amp%3B+Too+Far+Gone+by+Fab%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c723a3c81325ba35201db3cde3e2b1aa419614db","infoHashBuffer":{"type":"Buffer","data":[199,35,163,200,19,37,186,53,32,29,179,205,227,226,177,170,65,150,20,219]},"announce":[],"urlList":[]}}