{"title":"The Agile Startup - Jeff Scheinrock, Matt Richter-Sand (shailab)","uid":13387615,"size":268316747,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c73a835be6ed122030089d037e194cea7755e987&amp;dn=The+Agile+Startup+-+Jeff+Scheinrock%2C+Matt+Richter-Sand+%28shailab%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"shailab","files":4,"time":1454307649,"description":"Link (Amazon) - amazon/The-Agile-Startup-Lessons-Entrepreneur/dp/1118548264\r\n\r\nLink (Wiley) - http://www.wiley.com/WileyCDA/WileyTitle/productCd-1118548264.html\r\n\r\nThe Agile Startup: Quick and Dirty Lessons Every Entrepreneur Should Know\r\n\r\nJeff Scheinrock, Matt Richter-Sand\r\n\r\nProduct Details\r\nPublisher: Wiley; 1 edition (September 16, 2013)\r\nLanguage: English\r\nISBN-10: 1118548264\r\nISBN-13: 978-1-118-54826-4\r\n368 pages (450 Pages in PDF)\r\n\r\n\r\nDescription\r\n\r\nAn inspiring and impactful compilation of the most important lessons of entrepreneurship\r\nThe tools of a digital age make it easier than ever to start a new business. And with billion-dollar IPOs and acquisitions making weekly headlines, the potential rewards are enormous. But even with all of the advantages and resources that today's entrepreneurs have access to, the likelihood of any one business succeeding is slim. That's why you need the simple, clear lessons found in The Agile Startup.\r\n\r\nEngaging and informative, The Agile Startup doesn't offer step-by-step instructions on how to build a better mousetrap. Instead, it shows you how to build companies that continually adapt to the &quot;real&quot; world. Along the way, you'll discover you're not alone in your entrepreneurial endeavors, and that almost every challenge a startup can face has already been faced, and overcome, by someone in the past.\r\n\r\nContains lessons culled from decades of creating successful companies, which includes possessing a flexible mindset\r\nProvides valuable insights, based on a market-driven philosophy, regarding launching and managing products, businesses, and brands\r\nWritten by two authors who have a combined sixty-plus years of startup experience and understand the reasons behind their successes and failures\r\nA companion Website contains supplementary material that allows you to learn in a hands-on fashion long after closing the book\r\nThe journey of a startup is daunting. Think about everything that has to be overcome and you'll quickly see that the odds are stacked heavily against you. But with The Agile Startup as your guide, you'll learn exactly what it takes to succeed in your entrepreneurial endeavors.\r\n\r\nThe journey of a startup is daunting. Think about everything that has to be overcome and you'll quickly see that the odds are stacked heavily against you. But with The Agile Startup as your guide, you'll learn exactly what it takes to succeed in your entrepreneurial endeavors.\r\n\r\nTable of Contents:-\r\n\r\nWhy You Should Read This Book xiii\r\n\r\nThe Entrepreneur’s Life Cycle xv\r\n\r\nCHAPTER 1\r\n\r\nAGILE PHILOSOPHY\r\n\r\nCHAPTER 2\r\n\r\nMAKE IT FEASIBLE\r\n\r\nCHAPTER 3\r\n\r\nCUSTOMERS AND COMPETITION\r\n\r\nCHAPTER 4\r\n\r\nMAKING MONEY\r\n\r\nCHAPTER 5\r\n\r\nMARKETING\r\n\r\nPITCHING YOUR STARTUP\r\n\r\nCHAPTER 8\r\n\r\nINVESTORS\r\n\r\nCHAPTER 9\r\n\r\nBUILDING THE BUSINESS\r\n\r\nCHAPTER 10\r\n\r\nWHAT TO KNOW BEFORE YOU GO\r\n\r\n\r\nAuthor Information:-\r\n\r\nJEFF SCHEINROCK is currently a Continuing Lecturer at UCLA Anderson School of Management. He is also President and CFO of the venture investment firm Originate. Scheinrock has personally raised over $1 billion in venture capital, served as the chief investment officer of a fund-of-funds, and helped take Packard Bell from inception to over $7 billion in annual revenue. He has negotiated in excess of $1 billion in bank debt and $3 billion in trade credit from companies such as Intel, Microsoft, Panasonic, Tatung, Lite-On, and Seagate. Scheinrock also handled the negotiation and structuring of many acquisitions, including Zenith Data Systems and Ark Interface Software, among others.\r\n\r\nMATT RICHTER-SAND is a serial entrepreneur, having launched three businesses. An Air Force veteran, he earned an MBA from UCLA before spending two years as a venture capitalist. Currently, he mentors entrepreneurs and is actively building his third startup.\r\n\r\n\r\nenjoy...\r\n\r\nYOURs INsincerely...\r\n \r\n-------------------------------------------------------------------------------\r\n\r\n                                    .:.Shailab.:.\r\n\r\n\t\t      https://thepiratebay.se/user/shailab/\r\n\r\n                            https://kat.cr/user/shailab/","torrent":{"xt":"urn:btih:c73a835be6ed122030089d037e194cea7755e987","amp;dn":"The+Agile+Startup+-+Jeff+Scheinrock%2C+Matt+Richter-Sand+%28shailab%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c73a835be6ed122030089d037e194cea7755e987","infoHashBuffer":{"type":"Buffer","data":[199,58,131,91,230,237,18,32,48,8,157,3,126,25,76,234,119,85,233,135]},"announce":[],"urlList":[]}}