{"title":"The Search for El Dorado (History Arts Ebook).pdf","uid":10993761,"size":29857113,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c812768559d3c411b1a6cab6a2e194432c81789f&amp;dn=The+Search+for+El+Dorado+%28History+Arts+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1410040848,"description":"Pdf / English / 168 pag / 1994 / Time-Life Lost Civilization Series / 28.4 MB\n\nThis exploration of the legend of El Dorado is an archaeology lover's gold mine. Progressive versions of the lore surrounding the Gilded Man are intertwined with the often destructive and brutal deeds of numerous expeditions of treasure hunters from Pizarro in 1541 to those in the 20th century. The major focus is directed at another wave of treasure seekers, however--organized archaeological projects trying to reconstruct knowledge about civilizations almost destroyed by greed. Their efforts also led to discoveries of older, pre-Columbian cultures--the Chavin, Moche, Paracas, and Nazca--previously unknown but leaving incredibly rich inheritances with their artistry in pottery making, embroidered textiles, architecture, and geoglyphs. This well-organized study of South American Indian cultures is an effective blend of history and legend--further enhanced by a remarkable collection of photographs of artifacts, ruins, and excavations, plus 16th-century engravings depicting scenes from expeditions and facets of the El Dorado legend. A brief chronology of Indian culture is included, highlighting their major artistic achievements, and an extensive bibliography will tempt the ambitious to explore further. Background knowledge of early exploration of the Americas would enhance appreciation of this fascinating book.\n\nAmazon","torrent":{"xt":"urn:btih:c812768559d3c411b1a6cab6a2e194432c81789f","amp;dn":"The+Search+for+El+Dorado+%28History+Arts+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c812768559d3c411b1a6cab6a2e194432c81789f","infoHashBuffer":{"type":"Buffer","data":[200,18,118,133,89,211,196,17,177,166,202,182,162,225,148,67,44,129,120,159]},"announce":[],"urlList":[]}}