{"title":"H.Paul Honsinger - Man Of War (komplet) [PDF+EPUB] [Polish]","uid":13635679,"size":8281229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c83c9397ec7b41191cbc7de399dd9e305aaf7b28&amp;dn=H.Paul+Honsinger+-+Man+Of+War+%28komplet%29+%5BPDF%2BEPUB%5D+%5BPolish%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"everdarksoul","files":7,"time":1456068069,"description":"H. Paul Honsinger - Trylogia: &quot;Man Of War&quot; (komplet)\r\njęzyk: PL / format: PDF+EPUB / jakość: dobra\r\n\r\nMan Of War -1- Wezwał Nas Honor\r\nUnia Terrańska zaangażowana jest w międzygwiezdną wojnę z Krag - bezwzględną rasą obcych, chcących zniszczyć ludzkość. W 2315 roku obiecującemu młodemu oficerowi - Maxowi Robichaux - powierzone zostaje dowodzenie nad USS Cumberland - niszczycielem najnowszej generacji, jednak mającym tak złą opinię, że nazywany jest pogardliwie &quot;Przełęczą Cumberland&quot;.\r\nPierwszą misją kapitana Robichaux jest patrol w Wolnym Korytarzu - miejscu, w którym Krag potajemnie kupują materiały do produkcji wojennej, oraz zniszczenie każdej jednostki przewożącej wojenną kontrabandę. Z dala od własnej floty, operujący w warunkach wymuszonej rozkazami ciszy radiowej, Max polegać może tylko na swojej determinacji… oraz wsparciu błyskotliwego szefa służby medycznej okrętu, doktora Sahina.\r\nWykonując to niebezpieczne zadanie, Max i doktor zdają sobie sprawę, że jedynie &quot;Cumberland&quot; może powstrzymać śmiertelny atak Krag - który chce raz na zawsze zakończyć wojnę - oraz istnienie rasy ludzkiej...\r\n\r\nMan Of War -2- Honor To My\r\nUnia Terrańska powoli przegrywa ponadtrzydziestoletnią wojnę z Hegemonią Krag. Komandor Max Robichaux - weteran niejednej bitwy i potyczki z Krag - musi tym razem stawić czoła także wrogom wewnętrznym: nielojalnym członkom załogi USS Cumberland oraz aroganckim przełożonym...\r\nTymczasem doktor Sahin otrzymuje zakodowaną wiadomość, sugerującą możliwość sojuszu - który całkowicie zmieniłby układ sił w Galaktyce. Jednak aby rozpocząć negocjacje, trzeba uniknąć pułapek zastawionych przez świetnie wyszkolone i uzbrojone siły, pracujące dla wrogów ludzkości.\r\nSahin i Robichaux zmuszeni są odwołać się do swej przyjaźni i doświadczenia, by unieść brzemię ultimatum postawionego Unii Terrańskiej przez Hegemonię Krag - które skutkować może wiecznym zniewoleniem - a nawet eksterminacją ludzkości...\r\n\r\nMan Of War -3- Bracia W Chwale\r\nUSS &quot;Cumberland&quot; wraz z załogą wykonują misję, wydającą się niemożliwą do wykonania - ale wycofanie się nie wchodzi w grę...\r\nCzasem kapitan Robichaux walczy zgodnie z zasadami, a czasem zapomina o nich całkowicie. To czyni go wschodzącą gwiazdą Marynarki Wojennej Unii. To także utrzymuje przy życiu jego i jego niedoświadczoną załogę. \r\nKiedy Max i jego okręt osaczeni zostają przez osiem okrętów przeciwnika, ich szanse przeżycia wynoszą mniej niż jeden do miliona. Wszystkich umiejętności i stalowych nerwów potrzeba, aby po prostu uciec z pułapki.\r\nWysłani z tajną misją za linie wroga, Max i jego załoga mają przeprowadzić tak ważne uderzenie, że jego sukces może odmienić koleje wojny. Przegrana zaś kosztować będzie życie nie tylko ich samych, ale najprawdopodobniej także wszystkich ludzi w Galaktyce.\r\n___________________________________________________________________\r\n\r\nAutor planuje kontynuację przygód bohaterów trylogii &quot;Man Of War&quot; w nowej serii - &quot;Flames Of War&quot;\r\nW roku 2015 ukazała się też powieść &quot;Deadly Nightshade&quot; - będąca prequelem trylogii &quot;Man Of War&quot; i opisująca wydarzenia z życia Maxa Robichaux, zanim objął on dowodzenie nad USS &quot;Cumberland&quot;","torrent":{"xt":"urn:btih:c83c9397ec7b41191cbc7de399dd9e305aaf7b28","amp;dn":"H.Paul+Honsinger+-+Man+Of+War+%28komplet%29+%5BPDF%2BEPUB%5D+%5BPolish%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c83c9397ec7b41191cbc7de399dd9e305aaf7b28","infoHashBuffer":{"type":"Buffer","data":[200,60,147,151,236,123,65,25,28,188,125,227,153,221,158,48,90,175,123,40]},"announce":[],"urlList":[]}}