{"title":"Batman.Arkham.City.Repack.R.G.Catalyst","uid":6854737,"size":12221540046,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c84ca137bf68ed7e321ce734a20f97a3e6447c49&amp;dn=Batman.Arkham.City.Repack.R.G.Catalyst&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MisterNobody","files":-1,"time":1322614276,"description":"\nBatman.Arkham.City.Repack.R.G.Catalyst\n_______________________________________\n\n1, run setup.exe to install the game\n2, at the beginning of the language selection drop-down box, choose the ENGLISH\n3, and then start the installation of the main interface, select the lower left button CONFIGURATION, and then choose the installation directory, and then click\nThe bottom of the left second button &quot;soft and components&quot;, the GUI LANGUAGE to ENGLISH RUSSIAN below\n4, the lower right corner of the BEGIN INSTALLATION Click the button to start the installation\n5, are particularly important: the background to intercept free antivirus software DVD patch, please turn off anti-virus software and then began to install the game\nStart the game:\nCreate a grid XLIVE offline account\nMethod\nXLIVE games are generally required to SIGN IN before they can be archived. Otherwise XLIVE will prompt.\nPress the HOME key will display XLIVE account console.\nSIGN IN PROFILE has the information will be displayed, how many games archive, whether to automatically SIGN IN and so on.\nThere will be no SIGN IN SIGN IN button (this is the SIGN IN have a username) and CREATE NEW PROFILE buttons, point CREATE NEW PROFILE go, it will show XLIVE string description, pulled the bottom, there is a CREATE LOCAL PROFILE text , similar to the URL like this, click on is to create an offline account.\nI XLIVE is the English version, Chinese version should also be about the same interface and workflow.","torrent":{"xt":"urn:btih:c84ca137bf68ed7e321ce734a20f97a3e6447c49","amp;dn":"Batman.Arkham.City.Repack.R.G.Catalyst","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c84ca137bf68ed7e321ce734a20f97a3e6447c49","infoHashBuffer":{"type":"Buffer","data":[200,76,161,55,191,104,237,126,50,28,231,52,162,15,151,163,230,68,124,73]},"announce":[],"urlList":[]}}