{"title":"Nanostructure Control of Materials","uid":15505999,"size":8069396,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8b3e8f1180694592b28ea4ff77e7fbf6301d4ce&amp;dn=Nanostructure+Control+of+Materials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1470585238,"description":"Nanostructure Control of Materials - R. H. J. Hannink, A. J. Hill (WP, 2006).pdf\r\n\r\nThe ability to measure and manipulate matter on the nanometer level is making possible a new generation of materials with enhanced mechanical, optical, transport and magnetic properties. This important book summarises key developments in nanotechnology and their impact on the processing of metals, polymers, composites and ceramics.\r\n\r\nAfter a brief introduction, a number of chapters discuss the practical issues involved in the commercial production and use of nanomaterials. Other chapters review ways of nanoengineering steel, aluminium and titanium alloys. Elsewhere the book discusses the use of nanoengineered metal hydrides to store hydrogen as an energy source, and the development of nanopolymers for batteries and other energy storage devices. Other chapters discuss the use of nanotechnology to enhance the toughness of ceramics, the production of synthetic versions of natural materials such as bone, and the development of nanocomposites.\r\n\r\nNanostructure control of materials is an ideal introduction to the ways nanotechnology is being used to create new materials for industry. It will be welcomed by R&amp;D managers in such sectors as automotive engineering as well as academics working in this exciting area.\r\n\r\nReviews key developments in nanotechnology and their impact on various materials\r\nEdited by leading experts in the field","torrent":{"xt":"urn:btih:c8b3e8f1180694592b28ea4ff77e7fbf6301d4ce","amp;dn":"Nanostructure+Control+of+Materials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8b3e8f1180694592b28ea4ff77e7fbf6301d4ce","infoHashBuffer":{"type":"Buffer","data":[200,179,232,241,24,6,148,89,43,40,234,79,247,126,127,191,99,1,212,206]},"announce":[],"urlList":[]}}