{"title":"Orbiter X [British Radio science fiction] BBC OTR 1959","uid":11581774,"size":104238062,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c955ea2237d6128f2cf346855c34eaa1ff0d46ec&amp;dn=Orbiter+X+%5BBritish+Radio+science+fiction%5D+BBC+OTR+1959&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NrKNrK","files":6,"time":1417135747,"description":"A BBC space oddessey in 14 episodes. Orbiter X was broadcast from 28 September - 28 December 1959.\n\n\nOrbiter X is a fascinating science fiction radio series about an imaginary space station. Using the then current scientific research at the time (1959), the fictional space station in Orbiter X was created with the research of scientists like Dr. Wernher von Braun.\n\nIt is a interesting series because much of the science fiction of Orbiter X has become science fact including the creation of the real International Space station. Everything in the series was kept in the &quot;realm of possibility&quot; and therefore the writers of the show attempted to make it as authentic as possible. Series writer B.D Chapman was even concerned that a space station would be built before the series was finished making it appear outdated.\n\nThe story begins with the fictional space workers from the Commonwealth Space Project thousands of miles above the earth's surface to create the space station 'Orbiter X'. It is a six hour serial about the space pioneers and their struggle to conquer humankind's final frontier, space.\n\n\n\nmp3 files, complete in four parts, total running time 05h46m11s","torrent":{"xt":"urn:btih:c955ea2237d6128f2cf346855c34eaa1ff0d46ec","amp;dn":"Orbiter+X+%5BBritish+Radio+science+fiction%5D+BBC+OTR+1959","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c955ea2237d6128f2cf346855c34eaa1ff0d46ec","infoHashBuffer":{"type":"Buffer","data":[201,85,234,34,55,214,18,143,44,243,70,133,92,52,234,161,255,13,70,236]},"announce":[],"urlList":[]}}