{"title":"The Rosetta Stone and the Rebirth of Ancient Egypt - (Malestrom)","uid":4828993,"size":3510651,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca371c848550be8c10132ca3f495aef33ba590ea&amp;dn=The+Rosetta+Stone+and+the+Rebirth+of+Ancient+Egypt+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1239057104,"description":" &lt;a href=&quot;http://www.image-upload.net/images/4rw86jjqwwalvpeye.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/4rw86jjqwwalvpeye.jpeg&lt;/a&gt;\n\nThe Rosetta Stone: And the Rebirth of Ancient Egypt By John Ray\nPublisher: Profile Books Ltd | ISBN: 186197339X | edition 2008 | PDF | 208 pages\n\nIn The Rosetta Stone and the Rebirth of Ancient Egypt, John Ray introduces the enigmatic Rosetta Stone as being a key to our understanding of Ancient Egyptian culture as well as our own. In seamlessly weaving together a condensed chunk of human history, Ray convincingly asserts that without the Stone, ostensibly an exalted piece of granite, Egyptology (the scientific study of Ancient Egyptian culture) would still be in its infancy. Ray also handles the sticky issue of the Stone's rightful &quot;owner&quot; in an impressively objective way. Anyone with even a vague interest in Ancient history or the illustrious heritage of Egypt would be behooved to read Ray's articulate and fascinating survey of one of the world's best-known treasures.\n\n\nAs for the mechanics of the text itself, there certainly is a kind of authenticity in how the author chooses to present his findings. One gets the sense that he is not merely a broad-field historian with a cursory interest in Egyptology and the Rosetta Stone. Ray is clearly a devout disciple of ancient lore, Egyptian religion and archaeology, etc. He's also not just another dry lecturer bent on presenting the facts in the most straightforward and dull manner imaginable; he is quite witty and frequently takes academically correct jibes at popular culture for its general antipathy to ancient civilizations and their importance to our present affairs. Each chapter begins with some kind of quote relating to the content that follows. These are usually composed of scraps of correspondence between historical figures with some relationship to the Stone, others may be thoughtful poems by the likes of Lord Byron among others. Invariably, each chapter begins with a redundancy from the last before moving on into new waters. \n\nIf one is reading the book in a single sitting (not unlikely given that it's a slim volume of 200 pages), this may seem somewhat like the author needed a recap himself, but if it is read in installments the recaps would probably be quite helpful. On the whole The Rosetta Stone advances fluidly and the language, while fraught with arcane historical allusions, is easily understood and free from trifles of jargon.\n","torrent":{"xt":"urn:btih:ca371c848550be8c10132ca3f495aef33ba590ea","amp;dn":"The+Rosetta+Stone+and+the+Rebirth+of+Ancient+Egypt+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca371c848550be8c10132ca3f495aef33ba590ea","infoHashBuffer":{"type":"Buffer","data":[202,55,28,132,133,80,190,140,16,19,44,163,244,149,174,243,59,165,144,234]},"announce":[],"urlList":[]}}