{"title":"Somebody's Daughter 6 [Ray Dark] 2016 DVDRip","uid":15195463,"size":1465585722,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cab77110481df96d19b08131268305dc1ad267b8&amp;dn=Somebody%27s+Daughter+6+%5BRay+Dark%5D+2016+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"distinc","files":1,"time":1467565009,"description":"Somebody's Daughter 6 [Ray Dark] 2016 DVDRip\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=5286215404\r\n \nhttp://imagedisco.net/?g=6896498781\r\n\r\n\r\nPlot:\r\n\r\n11 Gigantic Loads!\r\nPretty Else Jean, the hot 19-year-old blonde from Ohio, is back! She takes Justin's thick cock down her throat and has a fun time sucking him off. Elsa then lays back and Justin dives in balls deep to give her a good hard fucking and then blows a huge load all over her tongue. The follow-up load is another winner, as Elsa milks Justin's dick for another hot stick prize.\r\nTanner Mayes (aka Evangeline) is as cute as they come. She is here to interview for a job. She has to go a little above and beyond, so she stops by and shows Thomas what a freak she can be. It's looking good for her ... LOL. This little cutie can suck cock and is quite the sperm eating machine!\r\nTaylor May is a 21 year old beauty from Washington. But Taylor has a naughty secret! She absolutely loves sex and she is particularly fond of giving head and swallowing cum. She found our website and is here today to give it a shot! Taylor sucks, fucks and swallows Ray's big load of semen. What a sexy girl!\r\nDallas Black is a stunning 5 '3 &quot;spinner from Northern California. She takes Ray's thick cock down her throat before he lifts her skirt and bangs her out. She drops down for the semen and Ray unloads all over her tongue! The follow up is also hot, as Dallas sucks, milks and devours a second load from Ray's balls!\r\nTabetha is pissed at her boyfriend. He lost his job and she shows up with a &quot;revenge fuck&quot; on her mind. So Thomas helps her out! This little darling really knows how to fuck and suck. She swallows two loads in this hot scene!\r\nSexy Talia Tyler returns! The adorable young nympho sucks and fucks Thomas until he shoots a huge load of cum all over a glass table. He then has Talia lick the load off the table and swallow it! Talia follows-up by giving Thomas another hot round of head and swallowing a second load of cum!\r\n\r\n\r\nTitle: Somebody's Daughter 6\r\nOriginal: Somebody's Daughter 6\r\nYear: 2016\r\nGenre: 18+ Teens, Amateur, Blowjobs, Cumshots, Gonzo, Point Of View, Swallowing\r\nDirected by: Thomas (III), Ray Dark / Amateur Allure\r\nStarring: Tanner Mayes, Elsa Jean, Tabetha, Talia Tyler, Taylor May, Dallas Black\r\n\r\nCountry: USA\r\nDuration: 1:48:59\r\nTranslation: No Translation\r\n\r\nTechnical data\r\nQuality: DVDRip-AVC\r\nFormat: MP4\r\nVideo Codec: AVC\r\nVideo: 720 x 400 1 625 kbit / s\r\nAudio codec: AAC\r\nSound: 159 Kbit / sec","torrent":{"xt":"urn:btih:cab77110481df96d19b08131268305dc1ad267b8","amp;dn":"Somebody%27s+Daughter+6+%5BRay+Dark%5D+2016+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cab77110481df96d19b08131268305dc1ad267b8","infoHashBuffer":{"type":"Buffer","data":[202,183,113,16,72,29,249,109,25,176,129,49,38,131,5,220,26,210,103,184]},"announce":[],"urlList":[]}}