{"title":"The Firm - '2 CD Discography' [320k MP3]","uid":4705877,"size":191911160,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cb58444dda9994f4e0f00334678385aa288f22a7&amp;dn=The+Firm+-+%5C%272+CD+Discography%5C%27+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"smbdownload","files":-1,"time":1233857667,"description":"The Firm were an English rock supergroup comprising former Free and Bad Company singer Paul Rodgers, ex-Led Zeppelin guitarist Jimmy Page, bass player Tony Franklin, and ex-Uriah Heep drummer Chris Slade. Formed in 1984, the band had only mediocre album sales, although they did have sellout tours. Page originally wanted former Yes drummer Bill Bruford and fretless bassist Pino Palladino in the group; however, Bruford was contracted to another label and Palladino had tour commitments with singer Paul Young.\n\nBoth Page and Rodgers refused to play any material from their former bands and instead opted for a selection of songs from both their solo albums and new songs which were heavily infused with a soulful and more commercially accessible sound, courtesy of Franklin's fretless bass guitar underpinning and understated song structure. Although refusing to play old material, the last track from The Firm, &quot;Midnight Moonlight&quot;, was originally an unreleased song by Led Zeppelin entitled &quot;The Swan Song&quot;. The recording of the track led critics to believe that Page had begun to run out of ideas. In subsequent press interviews, Page had indicated that the band was never meant to last more than two albums. After the band split, Page and Rodgers returned to solo work while Chris Slade joined AC/DC and Franklin teamed up with guitarist John Sykes in Blue Murder.\n\n----------------------------------------------------------------------------------\n\nThe Firm is a studio album by The Firm, released by Atlantic Records on 11 February 1985. Tracks ranged from the epic &quot;Midnight Moonlight&quot; based on a previously unreleased song by Led Zeppelin called &quot;Swan Song&quot;, first tinkered with during the Physical Graffiti sessions, to the commercially successful &quot;Radioactive&quot;. &quot;Closer&quot; employs a horn section to subtle effect. The cover version of &quot;You've Lost That Lovin' Feeling&quot; featured lead vocals by Paul Rodgers of Bad Company and Free fame, but was never released as a single.\n\nThe Firm peaked at #17 on the Billboard's Billboard 200 chart, and reached #15 on the UK Album Chart. The single &quot;Radioactive&quot; topped the Mainstream Rock Tracks chart for one week.\n\nTrack Listing [320k MP3]\n\n1. &quot;Closer&quot;   Page, Rodgers 2:52 \n2. &quot;Make or Break&quot;   Rodgers 4:21 \n3. &quot;Someone to Love&quot;   Page, Rodgers 4:55 \n4. &quot;Together&quot;   Page, Rodgers 3:54 \n5. &quot;Radioactive&quot;   Rodgers 2:49 \n6. &quot;You've Lost That Lovin' Feeling&quot;   Mann, Spector, Weil 4:33 \n7. &quot;Money Can't Buy&quot;   Rodgers 3:35 \n8. &quot;Satisfaction Guaranteed&quot;   Page, Rodgers 4:07 \n9. &quot;Midnight Moonlight&quot;   Page, Rodgers 9:13 \n\n-----------------------------------------------------------------------------------\n\nMean Business is a studio album by The Firm, released by Atlantic Records on 3 February 1986. Repeating the same bluesy formula as the debut album, Mean Business did not achieve the same commercial success.\n\nOne of the album's tracks &quot;Live in Peace&quot; was first recorded on Paul Rodgers' first solo album, 1983's Cut Loose. The differences between the two versions was that Chris Slade played the drums slower than the Cut Loose version except for the ending and Jimmy Page added a bluesy guitar solo at the end of the song.\n\nThe album's title was intended to have a double meaning: that the music business is a hard one, and that the band was serious about its music (&quot;The Firm mean business&quot;). However, perhaps due to the lukewarm-at-best critical and financial success with which the band met, Jimmy Page and Paul Rodgers decided to disband The Firm within months of this album's release.\n\nThe album peaked at #22 on the Billboard's Billboard 200 album chart and #46 on the UK Album Chart, and the single &quot;All The King's Horses&quot; spent four weeks at the top of Billboard's Mainstream Rock Tracks chart.\n\nTrack Listing [320k MP3]\n\n1. &quot;Fortune Hunter&quot;   Page, Rodgers 5:00 \n2. &quot;Cadillac&quot;   Page, Rodgers 5:57 \n3. &quot;All the King's Horses&quot;   Rodgers 3:16 \n4. &quot;Live in Peace&quot;   Rodgers 5:05 \n5. &quot;Tear Down the Walls&quot;   Page, Rodgers 4:43 \n6. &quot;Dreaming&quot;   Franklin 6:00 \n7. &quot;Free to Live&quot;   Page, Rodgers 4:13 \n8. &quot;Spirit of Love&quot;   Rodgers 5:06 \n\n----------------------------------------------------------------------------------\n\nP.S. - IGNORE THE DETAILED ARTIST INFO BELOW - IT'S FOR A HIP HOP GROUP 'THE FIRM'","torrent":{"xt":"urn:btih:cb58444dda9994f4e0f00334678385aa288f22a7","amp;dn":"The+Firm+-+%5C%272+CD+Discography%5C%27+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb58444dda9994f4e0f00334678385aa288f22a7","infoHashBuffer":{"type":"Buffer","data":[203,88,68,77,218,153,148,244,224,240,3,52,103,131,133,170,40,143,34,167]},"announce":[],"urlList":[]}}