{"title":"Lulu - Melody Fair (1970) MP3@256kbps","uid":9633858,"size":69059795,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cb74db5f34385c635298072006e8d89ca9abb012&amp;dn=Lulu+-+Melody+Fair+%281970%29+MP3%40256kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AaronVincent","files":17,"time":1392822195,"description":"Since Lulu's most soulful qualities had usually been repressed or smothered by MOR-conscious material and production, this 1970 album seemed to have all the right ingredients for a blue-eyed soul triumph along the lines of Dusty Springfield's late-'60s LPs. The same label that midwifed those Springfield sessions was now doing the same for Lulu, matching her with backing by the Dixie Flyers, the Sweet Inspirations, and the Memphis Horns. Atlantic honchos Jerry Wexler, Tom Dowd, and Arif Mardin produced; the material included compositions by Gary Bonds, Leiber-Stoller, Randy Newman, and Bacharach-David. Yet the results, as is so often the case when the menu seems tasty, were rather underwhelming, the sums failing to add up to the parts. It's not at all bad, just unexciting. The songs aren't special enough, the arrangements never catch fire, and there are a couple ill-advised detours into cheery pop tunes by the Beatles and Bee Gees. But it's not all bad timing; Lulu herself never seemed to let it all hang out and belt as she had occasionally in the past, except for a few funky moments.","torrent":{"xt":"urn:btih:cb74db5f34385c635298072006e8d89ca9abb012","amp;dn":"Lulu+-+Melody+Fair+%281970%29+MP3%40256kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb74db5f34385c635298072006e8d89ca9abb012","infoHashBuffer":{"type":"Buffer","data":[203,116,219,95,52,56,92,99,82,152,7,32,6,232,216,156,169,171,176,18]},"announce":[],"urlList":[]}}