{"title":"Storage Wars - Season 01 (19 Episodes) 720p WEB-DL [COMPLETE]","uid":9667159,"size":12869816139,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:cbae161049b21d5852a4f3f9a3e04f1fbc3fa445&amp;dn=Storage+Wars+-+Season+01+%2819+Episodes%29+720p+WEB-DL+%5BCOMPLETE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Albe_Sure","files":-1,"time":1393395647,"description":"Storage Wars - Season 01 (19 Episodes) 720p WEB-DL [COMPLETE]\n\nThis is COMPLETE collection of ALL 19 episodes of Storage Wars - Season 1, EACH of the following are presented in 720p High-Definition...\n\nIncluded Episodes\n\n1. &quot;High Noon in the High Desert&quot; (Originally aired December 1, 2010)\nIt's a showdown in the high desert as the buyers crack open a trove of abandoned storage lockers. Barry Weiss unearths the personal possessions of rap magnate Suge Knight. Jarrod Schulz and Dave Hester throw down their bankrolls in hopes of scoring a classic organ.\n\n2. &quot;Railroad Roulette&quot; (Originally aired December 1, 2010)\nChaos ensues throughout the storage units of Westminister. A secret weapon is brought out by Barry Weiss to dwarf the competition. Two bitter rivals, Dave Hester and Darrell Sheets, go toe-to-toe for a locker with a twenty thousand dollar payout. After Jarrod buys a suspect unit, a lover's quarrel breaks out between he and Brandi.\n\n3. &quot;Melee in the Maze&quot; (Originally aired December 8, 2010)\nThe buyers venture to the labyrinth-like Self Storage Center in Cerritos. Jarrod and Dave set their sights on a locker filled with handcrafted bamboo fishing rods. Brandi tries a little feminine wit to outsmart her macho competitors. And the financial future of Darrell's granddaughter, Zoe, hangs in the balance.\n\n4. &quot;War on the Shore&quot; (Originally aired December 8, 2010)\nIn Huntington Beach the buyers are picking up anything but good vibrations. Dave Hester leaves Darrell Sheets hanging out to dry with a pump fake approach. But Darrell's wrath costs Dave dearly in return. Barry Weiss finds a twelve inch piano, but there's a chance this small wonder could be more than just a child's toy. And a rip tide of cash is spent on the highest winning unit of the season.\n\n5. &quot;The Old Spanish Standoff&quot; (Originally aired December 15, 2010)\nWhen the locks are blasted off the storage doors in a California town rich in historic Spanish-American culture, our intrepid buyers discover an unusual mannequin phone, a bootlegger's moonshine still, and some enticing office equipment. Nice stuff--but is it worth anything?\n\n6. &quot;All Guns To Port&quot; (Originally aired December 15, 2010)\nSince the Port of Long Beach, Calif., boasts high-end imports but low-income housing, the buyers know they can either go boom or bust today. When the storage units finally swing open, they reveal surfing and cowboy items, maintenance equipment, and even some flare guns. The tension mounts as the buyers bid for stuff that might make 'em or break 'em.\n\n7. &quot;Senior Center Showdown&quot; (Originally aired December 22, 2010)\nWhen the auction action goes to Homeland, Calif., an upscale retirement community, the bidders start to dream of scoring big. Darrell lands a locker filled with furniture, and Jarrod gambles on a safe. Have they bought treasure--or trash?\n\n8. &quot;Midnight in the Gardena Good and Evil&quot; (Originally aired January 12, 2011)\nWelcome to the eerie side of storage. When Barry hires two psychics to &quot;see&quot; inside the units at Gardena, Calif., they say they've got a &quot;dark&quot; feeling about the place. But that doesn't spook Jarrod and Brandi, who decide to roll the dice on a unit that could save their store. It's a creepy, pressure-packed look at the storage business.\n\n9. &quot;Collector's Last Stand&quot; (Originally aired January 19, 2011)\nNorwalk, California--a Los Angeles suburb with a small town feel. Stashed away in these lockers is the potential for collectables, heirlooms, and other forgotten jewels. Barry Weiss looks for a piece to add to his collection of oddities. Brandi and Jarrod find common ground in a heated battle against Dave Hester.\n\n10. &quot;School House Lock&quot; (Originally aired January 26, 2011)\nIn the college town of Fullerton, California the buyers search for textbooks and rare university artifacts. Dave and Darrell compete in a mano-a-mano showdown. Barry Weiss takes a stab at some antique vinyl, while Jarrod and Brandi fight the other buyers (and each other) for a unit to keep their store afloat. Who will find frat house junk and who will find the professor's treasury?\n\n11. &quot;Gambler's Last Resort&quot; (Originally aired February 2, 2011)\nThe buyers journey eastward to the city of sin for a marathon of auctions. But with a 300 mile haul between them and their stores, the rules of the game have changed. Now on a level playing field, Jarrod fires back at the big dogs. Dave Hester rolls up his sleeves with an &quot;earthy&quot; find. And Darrell Sheets bids on a unit with some golden potential.\n\n12. &quot;Auction Royale&quot; (Originally aired February 9, 2011)\nThey say Las Vegas can make or break you overnight. But when the sun comes up, the real gamblers go to work. The Storage Warriors press their luck at a marathon of auctions. When Darrell Sheets gambles on a locker completely covered with blankets, Brandon questions his father's judgment. Barry Weiss makes a surprising new friend, when appraising a sign from the forties.\n\n13. &quot;Makings of a Mogul&quot; (Originally aired March 16, 2011)\nPerris, California is SoCal's adventure capital. Our buyers' strategy: search high and low for hiking, camping, and skydiving gear. Jarrod and Barry vie for a unit filled with power tools and high end potential. Darrell Sheets sends a message by bringing a fleet of trucks. And Dave Hester reveals his trade secret to storage auction success.\n\n14. &quot;Trouble the Oil&quot; (Originally aired March 23, 2011)\nIn the LBC, there are two ways to strike it rich--imports and oil. The buyers dig deep in search of antiques and industrial merchandise. Jarrod and Brandi uncover what appears to be an antique wine rack. Dave Hester and Barry Weiss test each other's knowledge of oddities, while Darrell Sheets is just looking to make some gas money.\n\n15. &quot;Chairman of the Hoard&quot; (Originally aired March 30, 2011)\nRumors run wild in Orange, California when 6 lockers--owned by one tenant--go up for auction. Dave and Darrell vie for a unit with a 12 grand payday. Barry Weiss stumbles across a vintage magazine. One buyer nearly breaks a hip. And Jarrod is forced to ask Dave Hester for an appraisal. The question remains, who was this previous tenant? An antique dealer? A local business owner?\n\n16. &quot;High End Heist&quot; (Originally aired April 6, 2011)\nThe buyers head to the &quot;antiquers&quot; town of Torrance, California. At this high-end facility, the competition has never been stiffer. Dave and Jarrod bid on a unit with a classic Jaguar. Barry Weiss buys a locker to satisfy his adventurous spirit. And Brandi challenges Jarrod to a battle of the sexes. Who will find the money and who will break the bank?\n\n17. &quot;Young with the Gun&quot; (Originally aired April 20, 2011)\nIn Riverside, Jarrod and Barry are greeted by a mob of eager newbies. With their financial futures at stake, the buyers must choose to fight or befriend the crowd. Barry Weiss buys a &quot;mystery trunk.&quot; Jarrod and Brandi battle for a unit filled with household goods and classic signs. And Darrell Sheets finds a box of turn-of-the-century books.\n\n18. &quot;Skullduggery&quot; (Originally aired April 17, 2011)\nTempers flare! The buyers attack! In Yucaipa, California Darrell Sheets crosses the line with a stab at Dave Hester's Newport Consignment Store. Brandi and Jarrod argue over the worth of a bizarre looking horse head. Barry Weiss bids on a locker littered with antique furniture.\n\n19. &quot;Live and Let Bid&quot; (Originally aired April 20, 2011)\nIn the hippie-town of Encinitas, the buyers comb for seventies memorabilia. When Darrell declares this facility his &quot;home turf&quot;, the other bidders are forced to fight for their claim of the treasure. Barry finds a relic from his past. Darrell Sheets stumbles upon a lucrative medical device and Dave Hester teaches his son about the family business.\n\n\nMy genuine thanks and appreciation go to the original poster(s) of the above individual episodes.  I will only be able seed this collection myself for as much as a week or two...so, if you want to see it survive beyond that, then PLEASE SEED!!!\n\nThank you so much! ;)\n\n\n-A.S.","torrent":{"xt":"urn:btih:cbae161049b21d5852a4f3f9a3e04f1fbc3fa445","amp;dn":"Storage+Wars+-+Season+01+%2819+Episodes%29+720p+WEB-DL+%5BCOMPLETE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbae161049b21d5852a4f3f9a3e04f1fbc3fa445","infoHashBuffer":{"type":"Buffer","data":[203,174,22,16,73,178,29,88,82,164,243,249,163,224,79,31,188,63,164,69]},"announce":[],"urlList":[]}}