{"title":"Mork &amp; Mindy  Season 3 Complete  DVDRip  DivX","uid":4445007,"size":4561875044,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cbeae542d76f4c7b660cd8aa2a64be59d226114a&amp;dn=Mork+%26+Mindy++Season+3+Complete++DVDRip++DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lee.ka","files":26,"time":1224003786,"description":"Mork &amp; Mindy Season 3\nStarring Robin Williams, Pam Dawber\n\nMork &amp; Mindy is an American sci-fi-based sitcom broadcast from 1978 until 1982 on ABC.  The series starred Robin Williams as Mork, an alien who came to Earth from the planet Ork in a large egg-shaped space ship, and Pam Dawber as Mindy McConnell, his human friend, roommate, and wife after they married in the final season.\n\nMork &amp; Mindy was a spinoff of the sitcom Happy Days.  Mork&amp;#039;s egg-shaped spacecraft lands on Earth, with his mission to observe human activity, assigned by Orson, his mostly-unseen and long-suffering superior (voiced by Ralph James), who has sent Mork to Earth to get Mork off Ork. \n\nStorylines usually centered on Mork&amp;#039;s attempts to understand human behavior and American culture as Mindy helps him to adjust to life on Earth. At the end of each episode, Mork must report back to Orson on what he has learned about Earth. These end-of-show summaries allow Mork to comment humorously on social norms.\n\nThe third season saw a return to the show&amp;#039;s original themes after a disasterous second season in which the storylines and characters were drastically changed and the show had been moved to a new timeslot.  Mindy&amp;#039;s father and grandmother returned and a couple kids from the daycare were added (perhaps to replace Eugene), but the show never fully recovered.\n\nThis series was Robin Williams&amp;#039; first major acting break. It became famous for Williams&amp;#039; use of his manic improvisational comedic talent. Williams would make up so many jokes during filming that the scripts eventually had specific gaps where Williams was allowed to perform freely. In many scenes, Pam Dawber had to bite her lip to avoid laughing and ruining the filming.\nWikipedia http://en.wikipedia.org/wiki/Mork_and_Mindy\n\nApprox. all shows - \nDVD&gt;DivX/512x384/990kbps/23.976fps/mp3/48KHz/stereo/106Kbps/25min/200Mb\n\nEpisode descriptions and dvd covers are included.","torrent":{"xt":"urn:btih:cbeae542d76f4c7b660cd8aa2a64be59d226114a","amp;dn":"Mork+%26+Mindy++Season+3+Complete++DVDRip++DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbeae542d76f4c7b660cd8aa2a64be59d226114a","infoHashBuffer":{"type":"Buffer","data":[203,234,229,66,215,111,76,123,102,12,216,170,42,100,190,89,210,38,17,74]},"announce":[],"urlList":[]}}