{"title":"Pink Floyd Dark Side of the Moon 24 Bit Vinyl Pack","uid":8521824,"size":9475663064,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cc215a5ca453a691b3f07196f8e5432558497a3f&amp;dn=Pink+Floyd+Dark+Side+of+the+Moon+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1369932522,"description":"\n  Pink Floyd Dark Side of the Moon 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styes: Album Rock, Art Rock, Prog-Rock, Hard Rock\n  Source: Vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,800 - 3,100 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  Dark Side of the Moon (German LP, 1C 062-05249 2nd edition)\n  Dark Side of the Moon (Reissue UK 1997)\n  Dark Side of the Moon (MFSL 1-0117)\n  Dark Side of the Moon (MFSL UHQR 200g Dr Robert)\n  Dark Side of the Moon (Harvest SHVL 804)\n  Dark Side of the Moon (Original US Pressing)\n  Dark Side of the Moon (German First Pressing Quad)\n  Dark Side of the Moon (Original UK Quad)\n  Dark Side of the Moon (MFLS UHQR)\n  Dark Side of the Moon (1992 Reissue)\n\n  By condensing the sonic explorations of Meddle to actual songs and adding a lush, immaculate production to their trippiest instrumental sections, Pink Floyd inadvertently designed their commercial breakthrough with Dark Side of the Moon. The primary revelation of Dark Side of the Moon is what a little focus does for the band. Roger Waters wrote a series of songs about mundane, everyday details which aren't that impressive by themselves, but when given the sonic backdrop of Floyd's slow, atmospheric soundscapes and carefully placed sound effects, they achieve an emotional resonance. But what gives the album true power is the subtly textured music, which evolves from ponderous, neo-psychedelic art rock to jazz fusion and blues-rock before turning back to psychedelia. It's dense with detail, but leisurely paced, creating its own dark, haunting world. Pink Floyd may have better albums than Dark Side of the Moon, but no other record defines them quite as well as this one.","torrent":{"xt":"urn:btih:cc215a5ca453a691b3f07196f8e5432558497a3f","amp;dn":"Pink+Floyd+Dark+Side+of+the+Moon+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc215a5ca453a691b3f07196f8e5432558497a3f","infoHashBuffer":{"type":"Buffer","data":[204,33,90,92,164,83,166,145,179,240,113,150,248,229,67,37,88,73,122,63]},"announce":[],"urlList":[]}}