{"title":"The Hope","uid":4464713,"size":712585092,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cc41a6229ce75aeb1c6d481ee9d88bb689c8049e&amp;dn=The+Hope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"IndianChristian","files":2,"time":1224864411,"description":"The Bible is a source of hope and help for all who place their faith in its Author. Like the Bible, The Hope transcends age and culture to communicate the love, and the story of Jesus -- from Creation to cruxificion, and beyond! \nIf you&amp;#039;ve been a Christian for as long as you can remember, you&amp;#039;ll be amazed at how much better you understand the Bible after just one viewing. If your relationship with Jesus has only recently begun, this production could easily advance your understanding of Scripture by 10 years. The Hope is an evangelistic tool that touches hearts as it emblazons unforgettable stories on the minds of its viewers. An amazing overview of God&amp;#039;s miraculous plan of Salvation!\n\nWithout question, The Hope is the most powerful presentation of the gospel on video that we have ever seen. Where the .Jesus film has introduced millions worldwide to the life and message of Jesus, The Hope is set to supplement that by giving an overall view of the timeline of history on earth. ...There is a zero embarrassment factor on this one, so feel free to share a copy with friends, family, your local library... the question is what part will you and The Hope play together in reaching the nations with the Good News of the Kingdom?\n\nLanguage: English\nSubtitles: None\nRuntime: 57 Minutes\nMy Rating: 10/10\nQuality: 10/10\n\nPlease seed for as long as possible. Let others also come to know that there is Salvation only in the name of Jesus Christ.\n\nUploaded by IndianChristian\n\n\n","torrent":{"xt":"urn:btih:cc41a6229ce75aeb1c6d481ee9d88bb689c8049e","amp;dn":"The+Hope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc41a6229ce75aeb1c6d481ee9d88bb689c8049e","infoHashBuffer":{"type":"Buffer","data":[204,65,166,34,156,231,90,235,28,109,72,30,233,216,139,182,137,200,4,158]},"announce":[],"urlList":[]}}