{"title":"TagScanner 5.1.592 MrxNL","uid":7954781,"size":1915203,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cd1bc1ce3b36b73eec2fdcae7a5055ab7dbf43ba&amp;dn=TagScanner+5.1.592+MrxNL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MrxNL","files":3,"time":1356383465,"description":"TagScanner 5.1.592\n\nFile: exe\nFile size: 1,82 mb\n\nThis is freeware. It's legal to share it with you! ;)\n\nDutch:\n\nComputer Idee over TagScanner:\n\nEr bestaan heel wat programma's om uw muziekverzameling mee te taggen en te beheren maar ze gaan geen van allen zo ver als TagScanner. \nUiteraard kunt u met TagScanner hele gewone dingen doen zoals het taggen van mp3's met behulp van een cd-database op internet of het hernoemen van bestanden aan de hand van hun tags. Wat TagScanner echter bijzonder maakt, is dat het programma met vrijwel elk gangbaar muziekformaat en de bijbehorende tags uit de voeten kan (id3, Ape, Vorbis, WMA en mp4/iTunes).\nBovendien kunt u met deze tags allerlei geavanceerde dingen doen zoals de map-structuur van uw verzameling op basis van tags aanpassen of grote hoeveelheden tags tegelijk bewerken (bijvoorbeeld hoofd- en kleine letters verwisselen). Uiteraard vergen zo veel mogelijkheden de nodige studie maar het Nederlandstalige programma heeft een goede (Engelse) helpfunctie. TagScanner werkt ook onder Vista.\n\nEnglish:\n\nTagScanner is a multifunction program for organizing and managing your music collection. It can edit tags of mostly state-of-the-art audio formats, rename files based on the tag information, generate tag information from filenames, and perform any transformations of the text from tags and filenames. Also you may get album info via online databases like freedb or Amazon. Supports ID3v1, ID3v2, Vorbis comments, APEv2, WindowsMedia and MP4(iTunes) tags. Powerful TAG editor with batch functions and special features. Playlist maker with ability to export playlists to HTML or Excel. Easy-to-use interface. Built-in player.\n\nFeatures:\n\n- Rename files based on the tag and file information\n- Powerful multiple files tag editor\n- Import tag information and album art from online databases like freedb or Amazon\n- Generate tag information from file/foldernames\n- Tag fields formatting and rearrangement\n- Words replacement and case conversion from tags and filenames\n- Supports MP3, OGG, FLAC, WMA, MPEG-4, Opus, Musepack, Monkey's Audio, AAC, OptimFROG, SPEEX, WavPack, TrueAudio files\n- Supports ID3 1.0/1.1/2.2/2.3/2.4 tags, APE v1 and v2 tags, Vorbis Comments, WMA  tags and MP4(iTunes) metadata\n- Supports for embedded lyrics and cover art\n- Resize cover art for portable devices on the fly\n- TAGs versions conversions\n- Quick playlists creation\n- Export information to HTML, XML CSV or any user-defined format\n- Full support for Unicode\n- Multilanguage interface\n- Built-in multiformat player\n\nUPLOADED BY: MrxNL\n\nAll I ask is a thanks! :)\n\n","torrent":{"xt":"urn:btih:cd1bc1ce3b36b73eec2fdcae7a5055ab7dbf43ba","amp;dn":"TagScanner+5.1.592+MrxNL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd1bc1ce3b36b73eec2fdcae7a5055ab7dbf43ba","infoHashBuffer":{"type":"Buffer","data":[205,27,193,206,59,54,183,62,236,47,220,174,122,80,85,171,125,191,67,186]},"announce":[],"urlList":[]}}