{"title":"The Story Of God-(WTC-SWE)","uid":4647744,"size":1887082449,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cdbc91c0567417e2020ba06d455b10e14c8a85b5&amp;dn=The+Story+Of+God-%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"WTC-SWE","files":-1,"time":1231943629,"description":"BBC:\n----\n\n\n                              THE STORY OF GOD\n                             ------------------\n\n\nProfessor Robert Winston presents a definitive three-part documentary series on the history of mankind's quest to understand the nature of God. The Story of God is an epic journey across continents, cultures and eras exploring religious beliefs from their earliest incarnations, through the development of today's major world faiths and the status of religious faith in a scientific age.\nThe series examines the roots of religious beliefs in prehistoric societies and the different ways in which humanity's sense of the divine developed.\n\nIt looks at the divergence between religions that worship a range of deities and those that represent strict monotheism.\nProfessor Winston says: &quot;However you define God, and whether you believe in God or not, the world we live in has been shaped by the universal human conviction that there is more to life than life itself; that there is a 'god' shaped hole at the centre of our universe.\n&quot;We have come up with many different ways to fill that hole, with many gods or just one, with gods of hunting, gods of farming, gods of war and gods of sea and sky.&quot;\n\nThe series begins with Professor Winston examining the religions which believe in many different gods and explores why mankind started to believe in God at all.The answer to that question, says Professor Winston, can be found in the caves where our ancestors first approached their gods and in the fields where people still call on them for help, in the cities where our ancestors have been honoured and in the temples where the gods have been appeased with sacrifices.\n\n&quot;But most of all the answer,&quot; says Professor Winston, &quot;lies in the human desire to be united with something bigger than ourselves.&quot;\nHe travels to the Gargas Caves in South West France where, he says, if the story of God has a beginning, it is to be found.\nHe examines mysterious stencilled hand prints from 27,000 years ago which appear to have one or more fingers missing - do these represent early humans' attempts to reach out to God?In India, Professor Winston explores the origins of Hinduism and the emergence of Brahman as the supreme being with many different forms.Some experts believe that there may be 330 million gods across the Hindu faith and he looks at the notions of karma and reincarnation, also popular in Buddhism.\n\nWhile there are those who believe in many gods there are also those who believe there is only one true God and Professor Winston delves into the past to discover the beginnings of . are examined in order to understand the ideas they share about God and the issues that divide them.Professor Winston goes in search of an answer to the centuries old question: 'If God created humanity why does God allow humanity to suffer?'Finally he explores how belief in God has been challenged in the modern world by secular ideas, in particular science.He looks at those scientific disciplines (nuclear and astro-physics) where a convergence between faith and science seems possible.\n\nProfessor Winston ventures into vast underground laboratories in Switzerland where they are trying to prove the existence of the 'God particle' and speaks to an American geneticist who believes there is a God gene which predisposes some people to have religious or spiritual beliefs.He also puts his own belief in God to the test with a mathematical formula that has been adapted to calculate the probability of God's existence.\n\n\n\n\n\nÃ‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤\n\nWHERE WERE YOU, WHEN I LAID THE EARTHÃ‚Â´S FOUNDATIONS? TELL ME SINCE YOU RE SO WELL  INFORMED! HAVE YOU GRASPED THE CELESTIAL LAWS? COULD YOU MAKE THEIR WRIT RUN UPON THE EARTH?\nWILL LIGHTNING FLASHES COME AT YOUR COMMAND AND ANSWER HERE WE ARE.......\n\nÃ‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤Ã‚Â¤\n\n\n\n\n\n\nProducer &amp; Director: Tim Kirby\n------------------------------\n\n\n\n\n\nTitle: The Story Of God\nYear: 2008 \nFile Size: 599 MB/Episode I + 599 MB/Episode II + 600 MB/Episode III\nFormat:AVI\nVideo Length: 00:58:38 Episode I + 00:59:04 Episode II + 00:58:54 Episode III\nVideo Codec: XviD \nVideo Resolution: 720x400 (EP I) + 720X416 (EP II)+  720X416 (EP III) \nVIdeo Bitrate: 1396 kbit/s (EP I) + 1386 kbit/s(EP II) + 1390 kbit/s(EP III)\nFPS:  25.000000 \nAudio Bitrate: 161 kbit/s (EP I) + 162 kbit/s(EP II) +  163 kbit/s(EP III) \nAudio Codec: MPEG Layer-3   \nChannels:  2    \nSubtitles: (N/A)\nParts: 3 Episodes (599 MB + 599 MB + 600 MB)  \n\n\n\n\n\nENJOY:\n\n\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n\n(Please seed so others can enjoy)\n\n\n\n\n\n\nFor father information and pictures of all my torrents visit&quot; Suprbay Forum&quot; at   \n\nthis link: --------&gt; &lt;a href=&quot; http://suprbay.org/showthread.php?t=38774&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/showthread.php?t=38774&lt;/a&gt;                 \n\n*** This information is also avaible on the &quot;nfo&quot; file that comes with all my uploads.)***   \n\n\nTips:For better background view chance the &quot;Style Chooser&quot; at the bottom left \ncorner to &quot;graphite_x&quot;.\n\n\n\n","torrent":{"xt":"urn:btih:cdbc91c0567417e2020ba06d455b10e14c8a85b5","amp;dn":"The+Story+Of+God-%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdbc91c0567417e2020ba06d455b10e14c8a85b5","infoHashBuffer":{"type":"Buffer","data":[205,188,145,192,86,116,23,226,2,11,160,109,69,91,16,225,76,138,133,181]},"announce":[],"urlList":[]}}