{"title":"JulesJordan - August Ames (Once You Go Mandingo, You Go Whee","uid":14609490,"size":472600200,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ce56f47ed2adaf606cb83c98a3277d9b0064b596&amp;dn=JulesJordan+-+August+Ames+%28Once+You+Go+Mandingo%2C+You+Go+Whee&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SudoSu","files":1,"time":1463130587,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――  \nhttp://imgkiss.com/image/0xNxU \nhttp://imgkiss.com/image/0xc4K\r\n\r\nBack in Black, fuckers! MANDINGO is back in the Jules Jordan house and August Ames is up to the Mandingo challenge! What a perfect fucking specimen of the female anatomy and none better to welcome back the BIGGEST BLACK COCK ever! This is the shit you have been waiting for and August says so herself, &quot;This is the biggest cock I've ever fucking seen.&quot; Thankfully, that intimidation doesn't stop the perfect slut from shoving as much of that huge cock down her throat as she can. She may not have even known she had a gag reflex but if anyone can test the limits it's Mandingo. All that effort isn't in vain and she gets a good chunk of that meat down her pretty throat and all that spit helps lube that massive cock up for its initial entry into August's tight pussy. Her voice quivers and her body shakes as she feels the biggest cock she has ever taken in her life! Her amazingly perfect and all-natural tits sway and bounce as Mandingo fucks her from behind and she screams like it hurts, because it probably fucking does! But it obviously hurts so good because this gorgeous whore doesn't want it to stop as she drops back down and puts her mouth back on it. Mandingo puts her on her back and fucks her more and gives her every single inch... &quot;That's all of it,&quot; he tells her and... the rest you just have to see to believe! Welcome back, Mandingo!\r\n\r\nSail to another one:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:ce56f47ed2adaf606cb83c98a3277d9b0064b596","amp;dn":"JulesJordan+-+August+Ames+%28Once+You+Go+Mandingo%2C+You+Go+Whee","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce56f47ed2adaf606cb83c98a3277d9b0064b596","infoHashBuffer":{"type":"Buffer","data":[206,86,244,126,210,173,175,96,108,184,60,152,163,39,125,155,0,100,181,150]},"announce":[],"urlList":[]}}