{"title":"The Geek Atlas: 128 Places Where Science and Tech Come Alive","uid":8249690,"size":16857412,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cede1fd8d50af2e881f53305462a2986398ec577&amp;dn=The+Geek+Atlas%3A+128+Places+Where+Science+and+Tech+Come+Alive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1363142658,"description":"John Graham-Cumming, &quot;The Geek Atlas: 128 Places Where Science and Technology Come Alive&quot;\nISBN: 0596523203 | 2009 | EPUB | 544 pages | 16 MB\n\nThe history of science is all around us, if you know where to look. With this unique traveler's guide, you'll learn about 128 destinations around the world where discoveries in science, mathematics, or technology occurred or is happening now. Travel to Munich to see the world's largest science museum, watch Foucault's pendulum swinging in Paris, ponder a descendant of Newton's apple tree at Trinity College, Cambridge, and more. Each site in The Geek Atlas focuses on discoveries or inventions, and includes information about the people and the science behind them. Full of interesting photos and illustrations, the book is organized geographically by country (by state within the U.S.), complete with latitudes and longitudes for GPS devices. Destinations include: * Bletchley Park in the UK, where the Enigma code was broken\n\n* The Alan Turing Memorial in Manchester, England\n\n* The Horn Antenna in New Jersey, where the Big Bang theory was confirmed\n\n* The National Cryptologic Museum in Fort Meade, Maryland\n\n* The Trinity Test Site in New Mexico, where the first atomic bomb was exploded\n\n* The Joint Genome Institute in Walnut Creek, California\n","torrent":{"xt":"urn:btih:cede1fd8d50af2e881f53305462a2986398ec577","amp;dn":"The+Geek+Atlas%3A+128+Places+Where+Science+and+Tech+Come+Alive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cede1fd8d50af2e881f53305462a2986398ec577","infoHashBuffer":{"type":"Buffer","data":[206,222,31,216,213,10,242,232,129,245,51,5,70,42,41,134,57,142,197,119]},"announce":[],"urlList":[]}}