{"title":"Anton Shammas - Arabesques (Israeli Arab novel)","uid":11000672,"size":1776602,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf742460494f2b2fa3fbd1fb564d34374e7f7694&amp;dn=Anton+Shammas+-+Arabesques+%28Israeli+Arab+novel%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1410137897,"description":"\n* Anton Shammas - ARABESQUES: A Novel (Harper &amp; Row, 1988).  Translated from the Hebrew by Vivian Eden.  263 pp. -- PDF (reprocessed older scan)\n\n\nThe publication of Anton Shammas' acclaimed debut novel ARABESQUES in Israel in 1986 created a stir whose ripples reached far beyond literary circles and concerns.  It was the first novel written by an Arab in Hebrew, Shammas' &quot;stepmother tongue&quot;, and a significant literary feat in its own right that was hailed as &quot;multilayered, dazzling and sophisticated&quot; (Publishers Weekly).\n\nShammas is a writer, poet and translator who describes himself as an &quot;Israeli Arab&quot; -- an ambiguous, problematic identity that forms the subject of this book.  It is a classic, complex novel of identity, memory, and history in the Middle East and points beyond.  Employing two narrators, this semi-autobiographical and &quot;elaborate tapestry&quot; interweaves the 150-year history of the Shammas clan in Fassuta, a village in northern Israel, with contemporary scenes in Paris, New York City, and at the University of Iowa.\n\nARABESQUES has been translated into several languages, including English, Spanish, French, German, and Italian, although it has never appeared in Arabic.  It was chosen as one of the best books of 1988 by the editors of the New York Times Book Review.\n\n\nReviews\n\n&quot;Intricately conceived and beautifully written. . .  A crisp, luminous, and nervy mixture of fantasy and autobiography, and an elegant example of postmodern baroque.&quot; -- John Updike\n\n&quot;This book is a history of its author's youth and the memoir of a family and a fabled region -- Galilee. . .  a beautifully impressive piece of prose.&quot; -- William Gass, New York Times Book Review\n\n&quot;Arabesques is not only the first Hebrew novel written by an Arab but also one of the most adventurous pieces of Israeli writing in recent years.  It is a spectacularly literary book, with moments of real poetic power.&quot; -- Robert Alter\n\n&quot;If Hebrew literature is at all destined to have its Conrads, Nabokovs, Becketts, and Ionescos, it could not have hoped for a more auspicious beginning.&quot; -- Muhammad Siddiq, Los Angeles Times Book Review\n\n&quot;Arabesques is a classic of the exploration of identity.  A Palestinian master of Hebrew, living at the seam between Jews and Arabs, between the ancient and the modern, between loyalties and appetites, Shammas has written beautifully about his search for design.  He transforms fact into fantasy without changing a thing.&quot; -- Leon Wieseltier\n\n&quot;An ornate twining and twisting of memory, myth, history and authorial self-consciousness -- so many supple, rich strands.&quot; -- Gerald Marzorati, New York Times\n\n&quot;Interlacing myth, history, and familiar memories, Shammas creates a tale that takes him toward some resolution of the disparate sources of his own identity.  Depicting men and women as colorful as reality itself, he portrays Palestinians in a light that will surprise and please many American readers.&quot; -- Library Journal\n\n_____________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                            &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:cf742460494f2b2fa3fbd1fb564d34374e7f7694","amp;dn":"Anton+Shammas+-+Arabesques+%28Israeli+Arab+novel%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf742460494f2b2fa3fbd1fb564d34374e7f7694","infoHashBuffer":{"type":"Buffer","data":[207,116,36,96,73,79,43,47,163,251,209,251,86,77,52,55,78,127,118,148]},"announce":[],"urlList":[]}}