{"title":"Lord Peter Wimsey: Murder Must Advertise - Dorothy Sayers","uid":11023680,"size":351513031,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cfdea590342ae77c6a23fac06865c516a968f24e&amp;dn=Lord+Peter+Wimsey%3A+Murder+Must+Advertise+-+Dorothy+Sayers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"davieboy1966","files":12,"time":1410636251,"description":"Audio Books : Mystery and Suspense : MP3/64Kbps : English\nUnabridged and read by Ric Jerrom. 12 hours 11 Mins. CD (64 kbps / 44kHz Fraunhofer CBR Mono)\n\n\n[ Book 10 in the Lord Peter Wimsey mystery series]\n\nWhen advertising executive Victor Dean dies from a fall down the stairs at Pym's Publicity, Lord Peter Wimsey is asked to investigate. It seems that, before he died, Dean had begun a letter to Mr. Pym suggesting some very unethical dealings at the posh London ad agency. Wimsey goes undercover and discovers that Dean was part of the fast crowd at Pym's, a group taken to partying and doing drugs. Wimsey and his brother-in-law, Chief-Inspector Parker, rush to discover who is running London's cocaine trade and how Pym's fits into the picture--all before Wimsey's cover is blown...\n\nWhen I posted the complete Lord Peter Wimsey collection at back in 2011, this title was the only one that was not available in CD quality format. This CD recording is not read by Ian Carmichael (who was the narrator for the collection titles), but by Ric Jerrom who does an excellent job all the same. The CD version is certainly clearer and less noisy than my previous cassette transcription, but I think I still prefer Ian Carmichael even though the sound quality is not as good. YMMV. (Get both!)\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:cfdea590342ae77c6a23fac06865c516a968f24e","amp;dn":"Lord+Peter+Wimsey%3A+Murder+Must+Advertise+-+Dorothy+Sayers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfdea590342ae77c6a23fac06865c516a968f24e","infoHashBuffer":{"type":"Buffer","data":[207,222,165,144,52,42,231,124,106,35,250,192,104,101,197,22,169,104,242,78]},"announce":[],"urlList":[]}}