{"title":"Imagining the Balkans","uid":11744602,"size":1294887,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d080f193ddb16c47842f07e48cbb20bf7702fcb2&amp;dn=Imagining+the+Balkans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425947595,"description":"&quot;If the Balkans hadn't existed, they would have been invented&quot; was the verdict of Count Hermann Keyserling in his famous 1928 publication, Europe. Over ten years ago, Maria Todorova traced the relationship between the reality and the invention. Based on a rich selection of travelogues, diplomatic accounts, academic surveys, journalism, and belles-lettres in many languages, Imagining the Balkans explored the ontology of the Balkans from the sixteenth century to the present day, uncovering the ways in which an insidious intellectual tradition was constructed, became mythologized, and is still being transmitted as discourse.\n\nMaria Todorova, who was raised in the Balkans, is in a unique position to bring both scholarship and sympathy to her subject, and in a new afterword she reflects on recent developments in the study of the Balkans and political developments on the ground since the publication of Imagining the Balkans. The afterword explores the controversy over Todorova's coining of the term Balkanism. With this work, Todorova offers a timely, updated, accessible study of how an innocent geographic appellation was transformed into one of the most powerful and widespread pejorative designations in modern history","torrent":{"xt":"urn:btih:d080f193ddb16c47842f07e48cbb20bf7702fcb2","amp;dn":"Imagining+the+Balkans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d080f193ddb16c47842f07e48cbb20bf7702fcb2","infoHashBuffer":{"type":"Buffer","data":[208,128,241,147,221,177,108,71,132,47,7,228,140,187,32,191,119,2,252,178]},"announce":[],"urlList":[]}}