{"title":"Hormone-Disruptive Chemical Contaminants in Food","uid":12570443,"size":46470044,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d191bfc7f46732898614a80a7cf6101757fde826&amp;dn=Hormone-Disruptive+Chemical+Contaminants+in+Food&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1444845732,"description":"Hormone-Disruptive Chemical Contaminants in Food (Issues in Toxicology No. 11) (RSC, 2012).pdf\r\n\r\nISBN: 978-1-84973-189-8\r\n\r\nToday, we are surrounded by a multitude of different chemicals that are essential components of our everyday life. As a consequence, there are various hazardous substances like dioxins, phthalates and flame-retardants circulating in the environment. These have an impact on ecosystems, wildlife and possibly human health. In recent years, the phenomenon called endocrine disruption has raised considerable concern. This book discusses the scientific basis of this issue using epidemiological and experimental in vitro and in vivo data about chemicals targeting the hormonal systems. It also provides an up-to-date review of international initiatives (including high-throughput screening, use of model organisms and in silico applications) aiming to screen, detect and functionally test these chemicals. The authors are highly experienced academics and acknowledged experts with both multidisciplinary and international expertise. The book provides an up-to-date, in-depth review of the current field of food safety research describing many of the &quot;hot topics&quot; currently debated. Recent media attention concerning, for example, dioxins in meat and bisphenol A in baby bottles has created a growing interest in food safety-related issues from both consumers and authorities. In addition, European legislation REACH, which requires industry to extensively test chemicals, has led to new initiatives within this area. This book presents a comprehensive overview of the recent international initiatives formed to meet the challenges of environmental pollutants in our food","torrent":{"xt":"urn:btih:d191bfc7f46732898614a80a7cf6101757fde826","amp;dn":"Hormone-Disruptive+Chemical+Contaminants+in+Food","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d191bfc7f46732898614a80a7cf6101757fde826","infoHashBuffer":{"type":"Buffer","data":[209,145,191,199,244,103,50,137,134,20,168,10,124,246,16,23,87,253,232,38]},"announce":[],"urlList":[]}}