{"title":"Private Xtreme - Wet Young Bitches (DVD.xvid) - anal, DP","uid":4683597,"size":1168405852,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d1dcb195c247a7835f1a51aa76ca026ed34c90c5&amp;dn=Private+Xtreme+-+Wet+Young+Bitches+%28DVD.xvid%29+-+anal%2C+DP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mechanixx","files":1,"time":1233159850,"description":"Wet Young Bitches\n\n\n\n\n\nall 6 screens (+ DVD-covers):\n &lt;a href=&quot;\nhttp://4tpb.blogbugs.org/6279918/Wet-Young-Bitches---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4tpb.blogbugs.org/6279918/Wet-Young-Bitches---screens.html&lt;/a&gt;\n\n\n\n\n\nActresses\n\n    * Clara                         [Facial]\n    * Diana Rossi (as Diane)        [Anal Facial]\n    * Lolita Angel                  [Facial]\n    * Maria Bellucci                [Anal Facial A2M]\n    * Moonlight                     [Anal Facial Bald A2M]\n    * Niki Blond                    [Anal Facial DP]\n    * Sabrina                       [Anal Facial DP]\n\n\nScenes:\nScene 1 Maria Bellucci\nScene 2 Moonlight\nScene 3 Lolita Angel &amp; Sabrina\nScene 4 Nikky Blond\nScene 5 Irina &amp; Clara\nScene 6 Moonlight\n\n\nDVD released: November 24, 2003.\nEnglish dialogue.\nDirector: Gianfranco Romagnoli\nFormat:  Xvid\n\n\n\nREVIEW:\n\nScene 1: Maria Bellucci, David Perry\nActs Included: Oral, Vaginal, Anal, PTM, ATM, Facial\n\nDavid watches Maria from across the room as she rubs her body. He puts on a dog collar and walks to her and she demands he lick her pussy. After a nice round of toungue lashing for her, Maria bends down to give Dave a little oral delight as well. All of the oral leads up to Maria riding Dave in reverse cowgirl before rolling into spoon. The couple try out doggy next and she works in some more oral for him before going back to spoon. They do a breif amount of straight sex then she moves his dick back to her ass. Marai and David roll into reverse cowgirl for a moment then she flips around to take his cock in her backdoor some more in cowgirl before jerking him off onto her face.\n\nNice scene. The dog collar set it up differently than it actually turned out. Maria was very sexy and seemed to enjoy herself, but the sex looked a little mechanical at times.\nMoonlight\n\n\nScene 2: Moonlight, Zenza Raggi\nActs Included: Oral, Vaginal, Anal, Facial\n\nMoonlight and Zenza walk into a parking garage after having dinner and get a little frisky. He kisses his way down her body and bends her over a little to eat her pussy before satnding up so she can suck his dick. She gives hims a vigorous bj then bends over to let him fuck her pussy from behind in a standing doggy position. They amke their way over to a parked car and use it's trunk for a nice platform to fuck on in mish both vaginally and anally. Moonlight turns around places one leg on the grounsd and one on the car to let Zenza fuck her until he's ready to cum. She quickly turns around and drops to her knees to catch his load on her face.\n\nMoonlight and Zenza realy seemed to be into each other in this scene. The pace is a great with both slower more sensual and faster hardcore sex.\nSabrina\nLolita Angel\n\n\nScene 3: Lolita Angel, Sabrina, James Brosman, Johnny Montana\nActs Included: Oral, Vaginal, Anal, DP, Facial\n\nAfter dancing for the guys and letting them video tape it, the girls go a little further by letting the guys get touchy feely with them. Sabrina dances on Johnny's toungue then lets him fuck her mouth while her friend is doing the same across the room with James. The couples get closer to each other and both women start out screwing in reverse cowgirl. A few minutes after sarting, both men decide to take Sabrina on in a double penetration while Lolita watches and plays with her own slit. James gets to fuck Sabrina's ass in spoon all by himself when Johnny moves over to fuck Lolita's pussy. Both men end by cumming on the girl's faces.\n\nSabrina is the first natural girl in this movie, so it was nice to see her. The heat never really shows up in this scene.\nNikky Blond\n\n\nScene 4: Nikky Blond, ?, ?\nActs Included: Oral, Vaginal, Anal, DP, Facial\n\nNikky goes in to the blackmailers home to retrieve the tape. The guys tell her all she has to do is fuck them and they'll give it to her. Nikky eases back and spreads her legs to be eaten by one guy while she blows the other. She lays on her side so she can suck dick and get fucked in spoon before switching dicks and positions. Nikky does a little standing doggy before getting dp'ed by both men in cowgirl for a moment. She turns around and lets one guy bang her ass on his own while she lets the other fuck her mouth before taking a cumshot on her pussy and face to end the scene.\n\nNikky gives a nice energetic performance in this scene.\nClara\nDana\n\n\nScene 5: Clara, Dana, Zenza Raggi\nActs Included: Masturbation, Oral, Vaginal, Anal, PTM, Facial\n\nClara talks about how Zenza helps people then let's him help her out by eating her pussy in the beginning of this scene. She helps him out by giving his cock a few licks before Dana joins them and &quot;helps&quot; out Zenza'a prick too. Dana continues the spirit of giving, by giving Zenza a ride, reverse cowgirl and doggy. Both women give him some more head before Clara lays back to let him fuck her backdoor for a moment. Dana gets into the spoon position so Zenza can bang her pussy one more time before he cums on both of their faces.\n\nOK scene, I would have liked to have seen more of Clara in this one.\nMoonlight\n\n\nScene 6: Moonlight,?\nActs Included: Masturbation, Oral, Vaginal, Anal, DP, ATM, Facial\n\nMoonlight gives a quick round of head to a guy she just met then lays back on the couch to let him eat her pussy. The guy moves back to her mouth for more head and some anal stimulation from her toungue and finger before bending her over to give her ass a little attention too. From ther he goes right up her butt in doggy then he goes in her pussy and back to her butt before going to her mouth. They switch to reverse cowgirl then spoon for more anal action before the guy jerks off on her face.\n\nI could have done without the male ass closeups, but Moonlight turned in another good scene. This one goes along more with the Xtreme label more than the others do.\n\n\nOverall Thoughts: \n\nThe Xtreme label was started up to replace The Matador series' hardcore anal sex dvds. So far, I haven't watched anything from this series that really lives up to the filth Jean Yves LeCastel made in the Matador. The Xtreme movies seem to be more story driven with better production values than most of the movies in the other series. I think Wet Young Bitches is a decent movie, but it lacks a little in the heat department. Even though I'm more of a natural breast fan, I felt Moonlight turned in the best scenes of the bunch. Speaking of natural breasts, Private used to be the place to go for gorgeous natural women, but it seems there are more and more &quot;enhanced&quot; women showing up in their releases these days. The dvd itself is on par with all of the other Private releases. The chapter breaks are lacking though. Only 7 chapters total, one for the intro then six scenes.\n\nThere were some decent scenes here, but nothing I would call spectacular. If you're looking for an anal title this wouldn't be a bad one to watch, Rent It.\n\n\n\n\n\n\n\n\n.\n\n\n\n","torrent":{"xt":"urn:btih:d1dcb195c247a7835f1a51aa76ca026ed34c90c5","amp;dn":"Private+Xtreme+-+Wet+Young+Bitches+%28DVD.xvid%29+-+anal%2C+DP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1dcb195c247a7835f1a51aa76ca026ed34c90c5","infoHashBuffer":{"type":"Buffer","data":[209,220,177,149,194,71,167,131,95,26,81,170,118,202,2,110,211,76,144,197]},"announce":[],"urlList":[]}}