{"title":"BLACK PANTHER 001-041 (2005-2008) COMPLETE plus Extra (REQUEST)","uid":8045137,"size":667015052,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d242325389dbd6cd06396e7b93a4631283305d20&amp;dn=BLACK+PANTHER+001-041+%282005-2008%29+COMPLETE+plus+Extra+%28REQUEST%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1358728759,"description":"This torrent fills a request from johnnyisawesome1234. Please seed and share so our friends on TPB know how awesome johnny is!  LOL\n\nNote: Despite what the Comicvine site says, this is volume 4. (I guess they aren't counting the 1988 miniseries as volume 2.)\n\n------\n\nThis torrent contains:\n\nBLACK PANTHER 01-41 (2005-2008)\n\nBLACK PANTHER ANNUAL (2008)\n\nand 1 extra, a special summarizing the Panther's story, 1966-2008:\n\nBLACK PANTHER SAGA (Marvel Digital Comics Exclusive)\n\n------\n\nFrom Wikipedia, with a couple of notes that I added:\n\nIn 2005, Marvel began publishing Black Panther vol. 4, which ran 41 issues (April 2005 - Nov. 2008). It was initially written by filmmaker Reginald Hudlin (through issue #38) and penciled by John Romita, Jr. (through #6). Hudlin said he wanted to add &quot;street cred&quot; to the title, although he noted that the book was not necessarily or primarily geared toward an African-American readership. As influences for his characterization of the character, Hudlin has cited comic character Batman, film director Spike Lee, and music artist Sean Combs.\n\nIssue #18 features the wedding of the Black Panther -- T'Challa marries former X-Men leader Storm. Their marriage lasted for six years of comics (until 2012's Avengers Vs. X-Men crossover).\n\nIssues 28 to 30 features the undead heroes-turned-brain-eaters of an alternate Earth, taking place between Marvel Zombies and Marvel Zombies 2.\n\nBased on the Hudlin-Romita Jr. issues, Marvel Animation and BET began producing a primetime animated series. Djimon Hounsou was cast as the voice of Black Panther. The series is produced in motion-comic style. The series premiered online in the US on June 23, 2010, and was released on DVD in the US in January 2011.","torrent":{"xt":"urn:btih:d242325389dbd6cd06396e7b93a4631283305d20","amp;dn":"BLACK+PANTHER+001-041+%282005-2008%29+COMPLETE+plus+Extra+%28REQUEST%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d242325389dbd6cd06396e7b93a4631283305d20","infoHashBuffer":{"type":"Buffer","data":[210,66,50,83,137,219,214,205,6,57,110,123,147,164,99,18,131,48,93,32]},"announce":[],"urlList":[]}}