{"title":"Franz Kafka (2 books)","uid":6499673,"size":801271,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2797f6a4c5db1c443b3e7767e8860ac8b43e4e6&amp;dn=Franz+Kafka+%282+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FatFreddy39","files":2,"time":1309202326,"description":"All books are in .mobi format\n\nIf you don't have a program that can convert or view .mobi you can download the free program calibre\n &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n\nPleese seed. \n\nBook List:\n\nThe Metamorphosis and Other Stories\nThe Trial\n\nDescription:\n\nMetamorphosis:\n\n&quot;When Gregor Samsa woke up one morning from  unsettling dreams, he found himself changed in his  bed into a monstrous vermin.&quot; With this  startling, bizarre, yet surprisingly funny first  sentence, Kafka begins his masterpiece, The  Metamorphosis. It is the story of a  young man who, transformed overnight into a giant  beetlelike insect, becomes an object of disgrace to  his family, an outsider in his own home, a  quintessentially alienated man. A harrowing -- though  absurdly comic -- meditation on human feelings of  inadequecy, guilt, and isolation, The  Metamorphosis has taken its place as one  of the mosst widely read and influential works of  twentieth-century fiction. As W.H. Auden wrote,  &quot;Kafka is important to us because his predicament  is the predicament of modern man.\n\nThe Trial:\n\nA terrifying psychological trip into the life of one Joseph K., an ordinary man who wakes up one day to find himself accused of a crime he did not commit, a crime whose nature is never revealed to him. Once arrested, he is released, but must report to court on a regular basis--an event that proves maddening, as nothing is ever resolved. As he grows more uncertain of his fate, his personal life--including work at a bank and his relations with his landlady and a young woman who lives next door--becomes increasingly unpredictable. As K. tries to gain control, he succeeds only in accelerating his own excruciating downward spiral. ","torrent":{"xt":"urn:btih:d2797f6a4c5db1c443b3e7767e8860ac8b43e4e6","amp;dn":"Franz+Kafka+%282+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2797f6a4c5db1c443b3e7767e8860ac8b43e4e6","infoHashBuffer":{"type":"Buffer","data":[210,121,127,106,76,93,177,196,67,179,231,118,126,136,96,172,139,67,228,230]},"announce":[],"urlList":[]}}