{"title":"Bryan Caplan - The Myth of the Rational Voter","uid":8800859,"size":379785228,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d297a1ebaae2392b3c7421b104b97e90847f1998&amp;dn=Bryan+Caplan+-+The+Myth+of+the+Rational+Voter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"zis123","files":-1,"time":1376197317,"description":"Bryan Caplan - The Myth of the Rational Voter\n\n96 kbps, Unabridged, Read by David Drummond\n\t\nThe greatest obstacle to sound economic policy is not entrenched special interests or rampant lobbying, but the popular misconceptions, irrational beliefs, and personal biases held by ordinary voters. This is economist Bryan Caplan's sobering assessment in this provocative and eye-opening book. Caplan argues that voters continually elect politicians who either share their biases or else pretend to, resulting in bad policies winning again and again by popular demand.\n\nBoldly calling into question our most basic assumptions about American politics, Caplan contends that democracy fails precisely because it does what voters want. Through an analysis of Americans' voting behavior and opinions on a range of economic issues, he makes the convincing case that noneconomists suffer from four prevailing biases: they underestimate the wisdom of the market mechanism, distrust foreigners, undervalue the benefits of conserving labor, and pessimistically believe the economy is going from bad to worse. Caplan lays out several bold ways to make democratic government work better--for example, urging economic educators to focus on correcting popular misconceptions and recommending that democracies do less and let markets take up the slack.\n\nThe Myth of the Rational Voter takes an unflinching look at how people who vote under the influence of false beliefs ultimately end up with government that delivers lousy results. With the upcoming presidential election season drawing nearer, this thought-provoking book is sure to spark a long-overdue reappraisal of our elective system.","torrent":{"xt":"urn:btih:d297a1ebaae2392b3c7421b104b97e90847f1998","amp;dn":"Bryan+Caplan+-+The+Myth+of+the+Rational+Voter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d297a1ebaae2392b3c7421b104b97e90847f1998","infoHashBuffer":{"type":"Buffer","data":[210,151,161,235,170,226,57,43,60,116,33,177,4,185,126,144,132,127,25,152]},"announce":[],"urlList":[]}}