{"title":"The Reel World (1994) XXX DVDRip","uid":11832653,"size":911892210,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d360da1b3ec5c8a1df30750239b52bb4fe1abfcd&amp;dn=The+Reel+World+%281994%29+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HighCode","files":14,"time":1429644362,"description":"Length: 01:12:43\nFilesize: 868 MB\nFormat: MP4\nRez: 640x480\nBitrate: ~1530kbps\n\nHey all, here's some nice ass blast from the past porn! This is the first flick in the Forbidden Films &quot;Reel World&quot; series, and features performances by Christina Angel, Dyanna Lauren, Lacy Rose, and exotic hottie Lana Sands!\n\nThe video spoofs the whole dynamic of the famed MTV series &quot;The Real World&quot;, with a bunch of porn stars in a house, but doesn't go too heavy into it. After all, it's a fuck flick, not raw drama!\n\nI'm not sure of the scene order, so going alphabetically:\n\nChristina Angel and Lacy Rose - In this scene, brunette Lacy (wearing white shorts, white cowboy boots, and a navy blue sleeveless blouse) gets lezzy with Christina Angel (wearing white heels and lacy white lingerie). The ladies suck each others tits, and then Lacy eats out Christina's pussy, with Christina reciprocating afterwards. No boys, no toys, just some good ol' 1990s lesbian action!\n\nDyanna Lauren and Alex Sanders - Dyanna and Alex get oral with each other on a bed with zebra pattern sheets, and then Dyanna gets banged from behind. Alex at one point gives Dyanna a real good pounding from behind, a mix of prone bone with Dyanna lifting her ass up in the air. The two finish things up missionary style, ending with a facial.\n\nDyanna Lauren and Gerry Pike - Dyanna and Gerry make out in front of a fireplace, leading to Dyanna sucking on Gerry's cock, which then changes into a 69. The two go at this for a bit, and then Gerry fucks Dyanna from behind. This shifts into an interesting position, with Dyanna lying on her back behind Gerry as he fucks her missionary style lying on his stomach. They then finish up normal missionary style, ending with Gerry letting his jizz splash out on Dyanna's pussy.\n\nLacy Rose and Nick East - Lacy, wearing the same outfit as in her lez scene, strips down to her panties and sucks Nick's dick. He then pulls off her panties and fucks her missionary style. Nick then titfucks Lacy for a bit and she orally refreshes his ramrod, and then he bangs her from behind and finishes the scene with a cumshot on Lacy's ass.\n\nLana Sands and Micky Ray - Lana and Micky bang in a kitchen. Lana's wearing some mid-90s &quot;flygirl&quot; uniform, consisting of a backwards baseball cap, plaid shirt with the end tied up, denim jeans, and a white Calvin Klein sports bra. Micky strips Lana down to the bra and panties, eating her out and fingering her as she sits and squats on the counter. She then gets banged from behind standing style, ending with Micky emptying his balls in the canyon of Lana's ass.\n\n  Screenshots:  &lt;a href=&quot;\nhttp://imgclover.com/image/IN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/IN&lt;/a&gt; &lt;a href=&quot;\nhttp://imgclover.com/image/IY&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/IY&lt;/a&gt; &lt;a href=&quot;\nhttp://imgclover.com/image/It&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/It&lt;/a&gt; &lt;a href=&quot;\nhttp://imgclover.com/image/Iu&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/Iu&lt;/a&gt; &lt;a href=&quot;\nhttp://imgclover.com/image/I6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/I6&lt;/a&gt;","torrent":{"xt":"urn:btih:d360da1b3ec5c8a1df30750239b52bb4fe1abfcd","amp;dn":"The+Reel+World+%281994%29+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d360da1b3ec5c8a1df30750239b52bb4fe1abfcd","infoHashBuffer":{"type":"Buffer","data":[211,96,218,27,62,197,200,161,223,48,117,2,57,181,43,180,254,26,191,205]},"announce":[],"urlList":[]}}