{"title":"1177 B.C.: The Year Civilization Collapsed (2014) epub","uid":10189146,"size":4568597,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d41870b0b57e963cd6592db654a5cc8cf83ae720&amp;dn=1177+B.C.%3A+The+Year+Civilization+Collapsed+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1400617054,"description":"In 1177 B.C., marauding groups known only as the &quot;Sea Peoples&quot; invaded Egypt. The pharaoh's army and navy managed to defeat them, but the victory so weakened Egypt that it soon slid into decline, as did most of the surrounding civilizations. After centuries of brilliance, the civilized world of the Bronze Age came to an abrupt and cataclysmic end. Kingdoms fell like dominoes over the course of just a few decades. No more Minoans or Mycenaeans. No more Trojans, Hittites, or Babylonians. The thriving economy and cultures of the late second millennium B.C., which had stretched from Greece to Egypt and Mesopotamia, suddenly ceased to exist, along with writing systems, technology, and monumental architecture. But the Sea Peoples alone could not have caused such widespread breakdown. How did it happen?\n\n In this major new account of the causes of this &quot;First Dark Ages,&quot; Eric Cline tells the gripping story of how the end was brought about by multiple interconnected failures, ranging from invasion and revolt to earthquakes, drought, and the cutting of international trade routes. Bringing to life the vibrant multicultural world of these great civilizations, he draws a sweeping panorama of the empires and globalized peoples of the Late Bronze Age and shows that it was their very interdependence that hastened their dramatic collapse and ushered in a dark age that lasted centuries.","torrent":{"xt":"urn:btih:d41870b0b57e963cd6592db654a5cc8cf83ae720","amp;dn":"1177+B.C.%3A+The+Year+Civilization+Collapsed+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d41870b0b57e963cd6592db654a5cc8cf83ae720","infoHashBuffer":{"type":"Buffer","data":[212,24,112,176,181,126,150,60,214,89,45,182,84,165,204,140,248,58,231,32]},"announce":[],"urlList":[]}}