{"title":"Draw (Western) {K, Douglas  J, Coburn} [1984]","uid":7826268,"size":730573614,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d47121f29542ce4c570d4bbf041c8a4650a4f1ef&amp;dn=Draw+%28Western%29+%7BK%2C+Douglas++J%2C+Coburn%7D+%5B1984%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"alien99","files":3,"time":1352934326,"description":"another one i found on one of my hard drives gathering dust stats say it was a made for tv movie.  not there funniest western but will worth watching if you like either actor.\n\nStoryline\n\nIn the final days of the Old West, a former desperado faces down a now drunken ex-sheriff, who was his long time nemesis. \n\n\n*** This review may contain spoilers ***\n\nImagine Kirk Douglas's character of Lomax from The War Wagon years later presumably after he'd spent that much reduced share from that robbery and you've got Handsome Harry Holland. Kirk is still a charmer, but now is just a bit tired of putting up with some of the people he has to deal with.\n\nCase in point where he wins a hand at poker where the sniveling son of the town's richest man, Derek McGrath, acts like a real sore loser. His crybaby attitude sets in motion the whole plot where Douglas who only wants to cash McGrath's IOU at the bank winds up killing the sheriff who drew on him. Douglas is shot in the leg also in the same fracas and traveling actress Alexandra Bastedo takes him up to her room.\n\nWith McGrath stirring up the populace and Douglas's reputation the only thing to do is send for feared lawman James Coburn who's dealt with Douglas in the old days. Coburn who is now a sodden alcoholic does sober up for the occasion and of course finds he has more in common with Douglas than the 'law and order' citizens of the town.\n\nThose old pros Douglas and Coburn are the main reason to see Draw!. That and the considerable feminine charms of Alexandra Bastedo who really does make the best of being held 'hostage' by Douglas in her room. ","torrent":{"xt":"urn:btih:d47121f29542ce4c570d4bbf041c8a4650a4f1ef","amp;dn":"Draw+%28Western%29+%7BK%2C+Douglas++J%2C+Coburn%7D+%5B1984%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d47121f29542ce4c570d4bbf041c8a4650a4f1ef","infoHashBuffer":{"type":"Buffer","data":[212,113,33,242,149,66,206,76,87,13,75,191,4,28,138,70,80,164,241,239]},"announce":[],"urlList":[]}}