{"title":"The.Incredible.Adventures.of.Van.Helsing.Update.2","uid":8503876,"size":55457554,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d491250ddc2aa4ce0227a118868406ef7b1216d9&amp;dn=The.Incredible.Adventures.of.Van.Helsing.Update.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":".SceNe.","files":5,"time":1369374366,"description":"Known issues:\n\n- The multiplayer game still has some issues. Please use it with a character created for the multiplayer only because data loss may occur sometimes.\n\nBalance changes:\n\n- The Blood Rabbit is a lot stronger now.\n\n- The monsters in the Sewers around the Secret Lair are weaker now.\n\n- The final wave of attackers in the Siege of the Secret Lair has been reduced in numbers.\n\n- The price of some epic items has been modified.\n\n- The shooting range of the Dreadknechts has been decreased\n\nFixed bugs:\n\n- Multiplayer\n\n- Fixed an issue at &quot;Online character&quot; saving.\n\n- A lot of crash/disconnect issues have been fixed.\n\n- The ping column has been removed from the game list.\n\n- Fixed an issue with the audio volumes.\n\n- Fixed an issue with Veteran Domovoys AI.\n\n- Fixed an issue with the scrollbar in the Ink Gate window.\n\n- The final boss will talk your head off - like he should do.\n\n- The outro movie is played when the final boss has collapsed - not when he gets the killing blow.\n\n- You could only select from the first 10 skills you've learned even though there are 11 active skills. This has been fixed.\n\n- Fixed crash on the Artifact Forge window.\n\n- Fixed an issue with conversations in different resolutions.\n\n- Localisation issues have been fixed in the German, Spanish, Hungarian and Portuguese language versions.\n\n- Cloak appears properly on Van Helsing when the equipped item is changed.\n\n- The area of the bridge detonation cutscene has been adjusted (it could be avoided)\n\n- Fixed a bug with the customize button. (It didn't save your settings if you used online character.)\n\nNew features:\n\n- 2560x1080 and 6052x1200 resolutions are supported.\n\n\n\n# # Installation:\n\n1. Download and install The Incredible Adventures of Van Helsing [P2P].\n\n2. Install Update.2.exe .\n\n3. Copy / cut the contents of the folder in the root installation directory of the game.\n\n4. Copy the contents of the folder Crack in the install directory of the game.\n\n5. Play!\n\n\n\n\nNot ensure compatibility with Release of RELOADED!!!","torrent":{"xt":"urn:btih:d491250ddc2aa4ce0227a118868406ef7b1216d9","amp;dn":"The.Incredible.Adventures.of.Van.Helsing.Update.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d491250ddc2aa4ce0227a118868406ef7b1216d9","infoHashBuffer":{"type":"Buffer","data":[212,145,37,13,220,42,164,206,2,39,161,24,134,132,6,239,123,18,22,217]},"announce":[],"urlList":[]}}