{"title":"Crusader Castles of the Teutonic Knights","uid":11771206,"size":108261252,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4b7cde2034637846623ed34b98d5e691b111923&amp;dn=Crusader+Castles+of+the+Teutonic+Knights&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":4,"time":1427088007,"description":"1.Throughout their stormy history the Teutonic Knights of Germany have always been the most controversial brotherhood ever to call themselves 'Knights of Christ'.They were the most warlike of the religious orders, and this is reflected in the architecture they left behind. In contrast to the Templars who are remembered for their churches, the Teutonic memorials are the magnificent brick-built castles they built as a result of their conquest of Prussia between 1230 and 1380. Many of these dramatic fortresses still exist today in what is now Poland and provide a unique example of an architectural style that closely reflects the nature of the Order.\n\n\n\n\n2.The original forced conversion of pagan Livonia, what is now the Baltic states of Latvia and Estonia, was carried out by a military order known as the Brethren of the Sword. In 1236 this order was incorporated into the Teutonic Knights following a catastrophic military defeat. The knights had always consolidated their conquests through networks of castles and fortified places, and the Livonian Chapter of the Teutonic Order built castles of stone. This title covers the developmental and operational history of these fortresses over the length of the Middle Ages. It details how the Baltic fortifications of the Teutonic Knights evolved to reflect the changing nature of siege warfare and the increasing dominance of gunpowder in warfare","torrent":{"xt":"urn:btih:d4b7cde2034637846623ed34b98d5e691b111923","amp;dn":"Crusader+Castles+of+the+Teutonic+Knights","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4b7cde2034637846623ed34b98d5e691b111923","infoHashBuffer":{"type":"Buffer","data":[212,183,205,226,3,70,55,132,102,35,237,52,185,141,94,105,27,17,25,35]},"announce":[],"urlList":[]}}