{"title":"Pete Fountain - Dixieland - Live Performane","uid":11781210,"size":74165021,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d4d31fc10747442f99bef30d19a834a93aee57a5&amp;dn=Pete+Fountain+-+Dixieland+-+Live+Performane&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Big-Papi","files":12,"time":1427586981,"description":"[quote]Authentic Dixie by the &quot;Stylists Who Made the Style&quot;\n\nJazz may have come up the river from New Orleans, as the musical bromide has it, but lots of it remained behind, too, and is still flourishing there. Even though jazz, and especially the Dixieland style of jazz, has fallen into the musical melting pots of Chicago, Kansas City, St. Louis, San Francisco and New York, New Orleans has remained the daddy of 'em all.\n\nThere's something about New Orleans that keeps its music and its musicians continually vigorous and vital, and the city has remained a potent jumping-off point for happy musical adventures. This, despite the changes in form and pattern that have been taking place in the over all jazz scene through the past couple of decades. Also, New Orleans has continued to be one of the most fertile cities in the country for bringing new musicians to the fore. It is no accident that men like Pete Fountain and Tony Almerico have blossomed after exposure in New Orleans.\n\nAlthough many words have been written about New Orleans' contribution to America's musical history, few have been able to capture the essence as well as an actual performance. This album is such a performance - and what a performance. &quot;Live - from New Orleans&quot; should be enough of a catch phrase to intrigue any musical buff. But there's more to this album than that. For here we have the stylists who made the style. Fore-most among them, perhaps, is Pete Fountain who has done so much to spread the Dixieland gospel around the country in the past few years. A clarinetist who can stand with the all-time greats, he has the mellow and lyrical tone that has become identified with the New Orleans clarinet style. And there is Tony Almerico, a trumpeter-singer who has upheld the New Orleans tradition for many years.\n\nWorking along with Pete Fountain and Tony Almerico are such Dixieland luminaries as trumpeter George Girard, trombonist Jack Delaney, clarinetist Harry Shields, tenor sax man Lester Bouchon, pianist Roy Zimmerman, and many others of equal stature.\n\nThere is a line in the popular New Orleans' song Basin Street which says that it's the place where old friends meet. You'll meet most of them here, playing away to their delight as well as yours.\n\nMIKE GROSS Music Editor, Variety[/quote]\n\n\n---------------------------------------------------------------------\nPete Fountain - Dixieland - Live Performane in New Orleans (Camden1-727)\n---------------------------------------------------------------------\n\nArtist...............: Pete Fountain\nAlbum................: Dixieland - Live Performane in New Orleans (Camden1-727)\nGenre................: Jazz\nSource...............: CD\nYear.................: 1987\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 212kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n---------------------------------------------------------------------\n Tracklisting\n---------------------------------------------------------------------\n\n 1. Pete Fountain - When the Saints Go Marching In [04:08]\n 2. Pete Fountain - High Society [06:05]\n 3. Pete Fountain - Farewell Blues [04:00]\n 4. Pete Fountain - Darktown Strutters' Ball [04:09]\n 5. Pete Fountain - Ballin' the Jack [05:30]\n 6. Pete Fountain - Way Down Yonder in New Orleans [02:12]\n 7. Pete Fountain - Muskrat Ramble [04:14]\n 8. Pete Fountain - Twelfth Street Rag [03:54]\n 9. Pete Fountain - Tin Roof Blues [06:53]\n 10. Pete Fountain - Won't You Come Home, Bill Bailey? [04:29]\n\nPlaying Time.........: 45:39\nTotal Size...........: 70.53 MB\n\nNFO generated on.....: 3/28/2015 3:52:17 PM\n\n\n---------------------------------------------------------------------\nWrite anything you want... ;)\nAll Big Papi rips are directly from original CD's unless stated otherwise.\n\n[b]This volume has been ripped at MP3 V0 which is nearly indistinguishable \nfrom FLAC using spectral analysis. It provides higher dynamic range than \n320kbps at a fraction of the file size. If you love FLAC then you'll know MP3 \nV0 is your other buddy for going mobile when space and quality is a concern\n[/b]\n\nThe AccurateRip data is embedded in the MP3 tags so you can look at any \ntrack to validate the accuracy of the rip.\n\n- Big Papi","torrent":{"xt":"urn:btih:d4d31fc10747442f99bef30d19a834a93aee57a5","amp;dn":"Pete+Fountain+-+Dixieland+-+Live+Performane","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4d31fc10747442f99bef30d19a834a93aee57a5","infoHashBuffer":{"type":"Buffer","data":[212,211,31,193,7,71,68,47,153,190,243,13,25,168,52,169,58,238,87,165]},"announce":[],"urlList":[]}}