{"title":"The Secret Life of the Grown-Up Brain: The Surprising Talents of","uid":6183769,"size":198177307,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d632fe556f2e9700c7c0fc3ca118fdc9e1b01c9c&amp;dn=The+Secret+Life+of+the+Grown-Up+Brain%3A+The+Surprising+Talents+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ut1880h","files":2,"time":1298047990,"description":"Audio Books : Misc. Educational : MP3/64Kbps : English\nThe Secret Life of the Grown-Up Brain: The Surprising Talents of the Middle-Aged Mind\nLENGTH\n6 hrs and 52 mins\nAUDIBLE RELEASE DATE\n04-16-10\nPublisher's Summary\n \nA leading science writer examines how the brain's capacity reaches its peak in middle age. For many years, scientists thought that the human brain simply decayed over time and its dying cells led to memory slips, fuzzy logic, negative thinking, and even depression. But new research from neuroscientists and psychologists suggests that, in fact, the brain reorganizes, improves in important functions, and even helps us adopt a more optimistic outlook in middle age. Growth of white matter and brain connectors allow us to recognize patterns faster, make better judgments, and find unique solutions to problems. Scientists call these traits cognitive expertise and they reach their highest levels in middle age.\nIn her impeccably researched book, science writer Barbara Strauch explores the latest findings that demonstrate, through the use of technology such as brain scans, that the middle-aged brain is more flexible and more capable than previously thought. For the first time, long-term studies show that our view of middle age has been misleading and incomplete. By detailing exactly the normal, healthy brain functions over time, Strauch also explains how its optimal processes can be maintained.","torrent":{"xt":"urn:btih:d632fe556f2e9700c7c0fc3ca118fdc9e1b01c9c","amp;dn":"The+Secret+Life+of+the+Grown-Up+Brain%3A+The+Surprising+Talents+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d632fe556f2e9700c7c0fc3ca118fdc9e1b01c9c","infoHashBuffer":{"type":"Buffer","data":[214,50,254,85,111,46,151,0,199,192,252,60,161,24,253,201,225,176,28,156]},"announce":[],"urlList":[]}}