{"title":"Tom Wrigglesworth's Open Letters - Comedy MP3 - Slimoo","uid":13417047,"size":105850862,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d634227086779482292a1dd40ee6992c013d3623&amp;dn=Tom+Wrigglesworth%27s+Open+Letters+-+Comedy+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_Slimoo_","files":4,"time":1454506838,"description":"Tom Wrigglesworth's Open Letters - S01 - Audio Comedy - BBC Radio 4 \r\n4 x 30 minutes - 128k - MP3 - Slimoo \r\n\r\n\r\n\r\nThis series started life as a one-off recording of Tom Wrigglesworth's Edinburgh Comedy Award nominated stand-up routine about a rude and unhelpful train guard. \r\n\r\nAfter the success of this first show, Tom was commissioned to return to Radio 4 to regale his audience with more tales of corporate lunacy and ridiculous rip-offs.\r\n\r\nThrough the medium of four open letters, Tom investigates the countless examples of corporate lunacy and maddening &quot;jobsworths&quot; in modern Britain. His subjects range from traffic wardens to estate agents, with Tom recalling his own funny and ridiculous experiences as well as recounting the absurd encounters of others. \r\n\r\nIt's a show about being proud and sticking up for what is right.\r\n\r\n\r\n \nhttp://www.comedy.co.uk/guide/radio/tom_wrigglesworth_open_letter/ Review: \r\n\r\nWith a down-to-earth charm and an insightful eye for the idiosyncrasies of British life, Tom is one of the country's leading young stand-up comedians and this is a great programme vehicle for him.\r\n\r\nWrigglesworth's original routine, based on the true story of what happened on a Manchester to London train on 9th October 2008, stormed Edinburgh... so it's great Radio 4 brought it to a wider audience in the 2010 pilot.\r\n\r\nThe full series is just as fun, with some clever use of the English language, although perhaps some of the targets are a little easy (yes, we all dislike parking wardens) \r\n\r\n\r\nCast: \r\nTom Wrigglesworth\r\nJoanna Monro\r\n\r\n\r\n\r\n\r\n\r\nTom Wrigglesworth's Open Letters - S01 - E01 - Parking Enforcement\r\nTom Wrigglesworth's Open Letters - S01 - E02 - Utilities Companies\r\nTom Wrigglesworth's Open Letters - S01 - E03 - Bankers \r\nTom Wrigglesworth's Open Letters - S01 - E04 - Estate Agents\r\n\r\nAudio Format : MP3 \r\nDuration Approx : 25mn 54s \r\nBit rate mode : Constant \r\nBit rate : 128 Kbps \r\nChannel(s) : 2 channels \r\nSampling rate : 44.1 KHz \r\nResolution : 16 bits","torrent":{"xt":"urn:btih:d634227086779482292a1dd40ee6992c013d3623","amp;dn":"Tom+Wrigglesworth%27s+Open+Letters+-+Comedy+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d634227086779482292a1dd40ee6992c013d3623","infoHashBuffer":{"type":"Buffer","data":[214,52,34,112,134,119,148,130,41,42,29,212,14,230,153,44,1,61,54,35]},"announce":[],"urlList":[]}}