{"title":"James Wesley Rawles -Survivors","uid":14221379,"size":393430486,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d6979c238150282e7c5918277b1590c0881f62d3&amp;dn=James+Wesley+Rawles+-Survivors&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"twocows","files":13,"time":1460047698,"description":"Survivors \r\nby James Wesley Rawles\r\n\r\n\r\nThe America we are accustomed to is no more. Practically overnight the stock market has plummeted, hyperinflation has crippled commerce, and the fragile chains of supply and high-technology infrastructure have fallen. The power grids are down. Brutal rioting and looting grip every major city. The volatile era known as &quot;the Crunch&quot; has begun, and this new period in our history will leave no one untouched. In this unfamiliar environment, only a handful of individuals are equipped to survive.\r\n\r\nAndrew Laine, a resourceful young U.S. Army officer stationed overseas in Afghanistan, wants nothing more than to return home to Bloomfield, New Mexico. With the world in turmoil and all air and sea traffic to America suspended, Laine must rely on his own ingenuity and the help of good Samaritans to reach his family. Andrew will do whatever it takes to make it home to his fiancée, no matter how difficult the circumstances.\r\n\r\nMajor Ian Doyle is a U.S. Air Force pilot sta-tioned in Arizona with his wife, Blanca. Their young daughter, Linda, is trapped in the North- eastern riots. Three teenage orphans, Shadrach, Reuben, and Matthew Phelps, have no choice but to set out on their own when their orphanage closes at the beginning of the Crunch. Then there is Ignacio Garcia, the ruthless leader of the criminal gang called La Fuerza, who will stop at nothing to amass an army capable of razing the countryside. And over everything looms the threat of a provisional government, determined to take over America and destroy the freedoms upon which it was built. The world of Survivors is a terrifyingly familiar one. Rawles has written a novel so close to the truth, readers will forget it's fiction. If everything you thought you knew suddenly fell apart, would you survive?","torrent":{"xt":"urn:btih:d6979c238150282e7c5918277b1590c0881f62d3","amp;dn":"James+Wesley+Rawles+-Survivors","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6979c238150282e7c5918277b1590c0881f62d3","infoHashBuffer":{"type":"Buffer","data":[214,151,156,35,129,80,40,46,124,89,24,39,123,21,144,192,136,31,98,211]},"announce":[],"urlList":[]}}