{"title":"The Disneyization of Society","uid":6564934,"size":1741789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d6cee0d6e2ba25217ec5d915ea91442577067d28&amp;dn=The+Disneyization+of+Society&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1311635777,"description":"Professor Alan Bryman, &quot;The Disneyization of Society&quot;\nPublisher: Sage Publications Ltd | 2004 | ISBN: 0761967656 | PDF | 200 pages | 1.66 MB\n\n&quot;Alan Bryman has expanded on his internationally well-known work on Disney theme parks and Disneyization to create a fascinating and highly readable book. It should prove of interest to beginning students in a number of different courses and fields, as well as to scholars interested in culture and consumption. There is no question that the model created by Disney, and emulated in whole or in part by many organizations and in many settings, will continue to influence social structure and culture well into the future. This is an important book about a significant social process. And, it manages to be a fun read, as well!&quot;\n -George Ritzer, author of McDonaldization, University of Maryland\n This is an agenda-setting new work in the sociology of culture and modern society. It argues that the contemporary world is increasingly converging towards the characteristics of the Disney theme parks. This process of convergence is revealed in: the growing influence of themed environments in settings like restaurants, shops, hotels, tourism and zoos; the growing trend towards social environments that are driven by combinations of forms of consumption: shopping, eating out, gambling, visiting the cinema, watching sports; the growth in cachet awarded to brands based on licensed merchandise; and the increased prominence of work that is a performance in which the employees have to display certain emotions and generally convey impressions as though working in a theatrical event. This insightful book demonstrates the importance of control and surveillance in consumer culture.\n Of interest to a wide variety of students studying in business, sociology, cultural studies, media studies and leisure studies courses this will also be of interest to anybody interested in understanding the intricacies of modern society.","torrent":{"xt":"urn:btih:d6cee0d6e2ba25217ec5d915ea91442577067d28","amp;dn":"The+Disneyization+of+Society","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6cee0d6e2ba25217ec5d915ea91442577067d28","infoHashBuffer":{"type":"Buffer","data":[214,206,224,214,226,186,37,33,126,197,217,21,234,145,68,37,119,6,125,40]},"announce":[],"urlList":[]}}