{"title":"Bob Dylan &amp; The Band - The Basement Tapes (1975) (2 CDs)","uid":8660558,"size":440153419,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d70bb7f98cb5a3035e7d31e5cf89e78c53757854&amp;dn=Bob+Dylan+%26amp%3B+The+Band+-+The+Basement+Tapes+%281975%29+%282+CDs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":42,"time":1373312127,"description":"This is the same torrent that was uploaded to Demonoid in July 2008.\n\n\nBob Dylan &amp; The Band - The Basement Tapes (1975) (2 CDs)\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 12 page booklet.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nBob Dylan's influence on popular music is incalculable. As a songwriter, he pioneered several different schools of pop songwriting, from confessional singer/songwriter to winding, hallucinatory, stream-of-conscious narratives. As a vocalist, he broke down the notions that in order to perform, a singer had to have a conventionally good voice, thereby redefining the role of vocalist in popular music. As a musician, he sparked several genres of pop music, including electrified folk-rock and country-rock. And that just touches on the tip of his achievements. Dylan's force was evident during his height of popularity in the '60s -- the Beatles' shift toward introspective songwriting in the mid-'60s never would have happened without him -- but his influence echoed throughout several subsequent generations. Many of his songs became popular standards, and his best albums were undisputed classics of the rock &amp; roll canon. Dylan's influence throughout folk music was equally powerful, and he marks a pivotal turning point in its 20th century evolution, signifying when the genre moved away from traditional songs and toward personal songwriting. Even when his sales declined in the '80s and '90s, Dylan's presence was calculable. ...\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:0ifrxqe5ldhe~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:0ifrxqe5ldhe~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nThe official release of The Basement Tapes -- which were first heard on a 1968 bootleg called The Great White Wonder -- plays with history somewhat, as Robbie Robertson overemphasizes the Band's status in the sessions, making them out to be equally active to Dylan, adding in demos not cut at the sessions and overdubbing their recordings to flesh them out. As many bootlegs (most notably the complete five-disc series) reveal, this isn't entirely true and that the Band were nowhere near as active as Dylan, but that ultimately is a bit like nitpicking, since the music here (including the Band's) is astonishingly good. The party line on The Basement Tapes is that it is Americana, as Dylan and the Band pick up the weirdness inherent in old folk, country, and blues tunes, but it transcends mere historical arcana by being lively, humorous, full-bodied performances. Dylan never sounded as loose, nor was he ever as funny as he is here, and this positively revels in its weird, wild character. For all the apparent antecedents -- and the allusions are sly and obvious in equal measures -- this is truly Dylan's show, as he majestically evokes old myths and creates new ones, resulting in a crazy quilt of blues, humor, folk, tall tales, inside jokes, and rock. The Band pretty much pick up where Dylan left off, even singing a couple of his tunes, but they play it a little straight, on both their rockers and ballads. Not a bad thing at all, since this actually winds up providing context for the wild, mercurial brilliance of Dylan's work -- and, taken together, the results (especially in this judiciously compiled form; expert song selection, even if there's a bit too much Band) rank among the greatest American music ever made.\n\nTrack List:\n\nDisc 1:\n\n01. Odds And Ends\n02. Orange Juice Blues (Blues For Breakfast)\n03. Million Dollar Bash\n04. Yazoo Street Scandal\n05. Goin' To Acapulco\n06. Katie's Been Gone\n07. Lo And Behold!\n08. Bessie Smith\n09. Clothes Line Saga\n10. Apple Suckling Tree\n11. Please, Mrs. Henry\n12. Tears Of Rage\n\nDisc 2:\n\n01. Too Much Of Nothing\n02. Yea! Heavy And A Bottle Of Bread\n03. Ain't No More Cane\n04. Crash On The Levee (Down In The Flood)\n05. Ruben Remus\n06. Tiny Montgomery\n07. You Ain't Goin' Nowhere\n08. Don't Ya Tell Henry\n09. Nothing Was Delivered\n10. Open The Door, Homer\n11. Long Distance Operator\n12. This Wheel's On Fire\n\nMore album detail at: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:gifexqt5ld0e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:gifexqt5ld0e&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d70bb7f98cb5a3035e7d31e5cf89e78c53757854","amp;dn":"Bob+Dylan+%26amp%3B+The+Band+-+The+Basement+Tapes+%281975%29+%282+CDs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d70bb7f98cb5a3035e7d31e5cf89e78c53757854","infoHashBuffer":{"type":"Buffer","data":[215,11,183,249,140,181,163,3,94,125,49,229,207,137,231,140,83,117,120,84]},"announce":[],"urlList":[]}}