{"title":"The Mystery Chronicles: More Real-Life X-Files  {BBS}","uid":7689025,"size":8770829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d725881a8a220d2a1610511fd678179436faa781&amp;dn=The+Mystery+Chronicles%3A+More+Real-Life+X-Files++%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1349040357,"description":"&quot; With a foreword by James Randi Paranormal investigator Joe Nickell has spent more than thirty years solving the world's most perplexing mysteries. This new casebook reveals the secrets of the Winchester Mystery House, the giant Nazca drawings of Peru, the Shroud of Turin, the &quot;Mothman&quot; enigma, the Amityville Horror house, the vicious goatsucking El Chupacabras, and numerous other &quot;unexplainable&quot; paranormal phenomena. Nickell has traveled far and wide to solve cases, which include a weeping icon in Russia, the elusive Bigfoot-like &quot;yowie&quot; in Australia, the reputed power of a headless saint in Spain, and an &quot;alien hybrid&quot; in Germany. He has gone undercover -- often in disguise -- to reveal the tricks of those who pretend to talk to the dead, accompanied a Cajun guide into a Louisiana swamp in search of a fabled monster, and gained an audience with a voodoo queen. Superstar psychic medium John Edward, pet psychic Sonya Fitzpatrick, evangelist and healer Benny Hinn, and many other well-known figures have found themselves under Nickell's careful scrutiny. The Mystery Chronicles examines more than three dozen intriguing mysteries. Nickell uses a hands-on approach and the scientific method to steer between the extremes of mystery mongering and debunking. His investigative skills have won him both acclaim and controversy during his long career as one of the world's foremost paranormal investigators.\n\n\n# Hardcover: 384 pages\n# Publisher: The University Press of Kentucky (April 23, 2004)\n# Language: English\n# ISBN-10: 0813123186\n# ISBN-13: 978-0813123189","torrent":{"xt":"urn:btih:d725881a8a220d2a1610511fd678179436faa781","amp;dn":"The+Mystery+Chronicles%3A+More+Real-Life+X-Files++%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d725881a8a220d2a1610511fd678179436faa781","infoHashBuffer":{"type":"Buffer","data":[215,37,136,26,138,34,13,42,22,16,81,31,214,120,23,148,54,250,167,129]},"announce":[],"urlList":[]}}