{"title":"A Community of Witches by Helen A. Berger (1999) [5 Formats]","uid":10530399,"size":3050511,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d7ce764b9301f1704457405f1d0774feb5db7f19&amp;dn=A+Community+of+Witches+by+Helen+A.+Berger+%281999%29+%5B5+Formats%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1405102849,"description":"Title: A Community of Witches - Contemporary Neo-Paganism and Witchcraft in the United States \nAuthor: Helen A. Berger\nCategory: Academic/Religion \nSeries: Comparative Studies in Religion and Society\nPublisher: University of South Carolina Press; First Edition edition (January 1999)\nLanguage: English\nISBN-10: 1570032467\nISBN-13: 978-1570032462\n\nPromotional info/Publisher's summary - &quot;A Community of Witches explores the beliefs and practices of Neo-Paganism and Witchcraft - generally known to scholars and practitioners as Wicca. While the words &quot;magic, &quot; &quot;witchcraft, &quot; and &quot;paganism&quot; evoke images of the distant past and remote cultures, this book shows that Wicca has emerged as part of a new religious movement that reflects the era in which it developed. Imported to the United States in the late 1960s from the United Kingdom, the religion absorbed into its basic fabric the social concern of the time: feminism, environmentalism, self-development, alternative spirituality, and mistrust of authority. Helen A. Berger's ten-year participant observation study of Neo-Pagans and Witches on the eastern seaboard of the United States and her collaboration on a national survey of Neo-Pagans form the basis for exploring the practices, structures, and transformation of this nascent religion. Responding to scholars who suggest that Neo-Paganism is merely a pseudoreligion or a cultural movement because it lacks central authority and clear boundaries, Berger contends that Neo-Paganism has many of the characteristics that one would expect of a religion born in late modernity: the appropriation of rituals from other cultures, a view of the universe as a cosmic whole, an emphasis on creating and re-creating the self, an intertwining of the personal and the political, and a certain playfulness.&quot;\n\nReview:\n&quot;In the course of her conversion, Curott spent many hours reading about goddess religion in early cultures. In this way, Wiccans reject modernity, which is resolutely patriarchal, for something that is not so much postmodern as pre-postmodern or late modern. Like many postmodern theorists, they are comfortable with multiple realities. Intuition is as valid as rational argument; science works, but so does magic.&quot; - The Los Angeles Times Sunday Book Review, Mary Lefkowitz\n\nThis torrent contains the original EPUB, as well as conversions into MOBI, AZW3, LIT and large print PDF formats. The front cover image and generated metadata.opf file are also included. Please seed, and enjoy.\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:d7ce764b9301f1704457405f1d0774feb5db7f19","amp;dn":"A+Community+of+Witches+by+Helen+A.+Berger+%281999%29+%5B5+Formats%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7ce764b9301f1704457405f1d0774feb5db7f19","infoHashBuffer":{"type":"Buffer","data":[215,206,118,75,147,1,241,112,68,87,64,95,29,7,116,254,181,219,127,25]},"announce":[],"urlList":[]}}