{"title":"MenOnEdge------MoE-30806 Johnny Torque.wmv","uid":8626519,"size":460841180,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d88f6eefc9a0e92371aec3cd501fd48b7ef847dd&amp;dn=MenOnEdge%5C------MoE-30806+Johnny+Torque.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1372519482,"description":"REQUEST\n\n\nMenOnEdgeMoE-30806 Johnny Torque.wmv\n\n\nStraight Hunk Johnny Torque's First Time Bound\n\n\nWMV only.\n\nSexy straight stud Johnny Torque is brand new to Men on Edge and he's very excited about his first session. Johnny says he's never been tied up or edged before but he's ready for the surprises we have in store. We bring him in and have him remove his shirt before tying him to a pillar. We blindfold Johnny to let him focus all on his cock and the feel of the bondage against his skin. When we tear away his underwear Johnny's cock already has a nice hardon from all the excitement. With the help of Sebastian's teasing tongue, it doesn't take this stud long before his cock is rock hard. As we start to edge his cock, Johnny can't help but moan from all the pleasure he feels. Just as he's about to blow his load we surprise him with a few punches to his sexy body. Johnny then is suspended for the first time with his hard cock dangling towards the ground. We tease Johnny's cock and bring him to the point of cumming. Rather than let him orgasm, we give him a taste of the flogger as his body swings back and forth. Since Johnny had been such a good sport all day we reward him by milking a gigantic load out of his hot cock. We tickle Johnny and give him some post-orgasmic torment before leaving the straight stud and his hard cock hanging in the air.  \n\n\nScreens               &lt;a href=&quot;\nhttp://www.menonedge.com/site/shoot.jsp?shootId=30806&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.menonedge.com/site/shoot.jsp?shootId=30806&lt;/a&gt;\n\n\n11 000 uploads,12k here we come, and if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)    \n\n\nCheers  :-) ","torrent":{"xt":"urn:btih:d88f6eefc9a0e92371aec3cd501fd48b7ef847dd","amp;dn":"MenOnEdge%5C------MoE-30806+Johnny+Torque.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d88f6eefc9a0e92371aec3cd501fd48b7ef847dd","infoHashBuffer":{"type":"Buffer","data":[216,143,110,239,201,160,233,35,113,174,195,205,80,31,212,139,126,248,71,221]},"announce":[],"urlList":[]}}