{"title":"Fila Brazillia Discog (partial) 1994-2006 [FLAC]","uid":11228513,"size":7032673017,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d9c2d1282dc78d2c93f90f3e2b13a7426092e9c9&amp;dn=Fila+Brazillia+Discog+%28partial%29+1994-2006+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":null,"files":244,"time":1413486742,"description":"Artist Biography by Sean Cooper\n\nHull-based duo Fila Brazillia is the most popular and acclaimed of the noted Pork Recordings stable. Formed in 1990 by producers Steve Cobby and Dave McSherry, Fila followed Cobby's association with Ashley &amp; Jackson, a moderately successful pop/dance group signed to Big Life! that went belly up as the label began demanding more and more pop and less dance. Returning to his native Hull from Manchester, Cobby met DJ/dabbler Dave Pork, and the two forged a creative alliance. Hooking up with McSherry to form Fila, the group's first 12&quot;, &quot;The Mermaid,&quot; was released that same year on Pork's fledgling imprint (formed, actually, specifically for the occasion), gaining instant acclaim among DJs and headphonauts alike for its innovative fusion of funk, dub, house, hip-hop, and acid jazz.\n\nOld Codes, New Chaos\nThe group followed their debut single with a string of full-length releases (Old Codes, New Chaos, Maim That Tune, and Black Market Gardening among them), which were instrumental in building Pork's reputation as one of the most consistent and respected of England's vast ocean of underground breakbeat/trip-hop labels. Later releases integrated elements of pop and drum'n'bass on a number of tracks. Fila's rep also translated into a number of acclaimed remixes, including Lamb's &quot;Cotton Wool,&quot; the Orb's &quot;Toxygene,&quot; and DJ Food's &quot;Freedom&quot; (over a dozen of which were featured on the 2000 collection Brazilification). During the new millennium, the duo released the mix album Another Late Night in 2001 and the studio effort Jump Leads early the following year. After two years of recording inactivity, in 2004 the duo released a pair of production albums (The Life and Times of Phoebus Brumal and Dicks), plus another mix album (Another Fine Mess). In addition to Fila, Cobby is also an active member of other Pork stable acts such as Solid Doctor (his solo guise) and Heights of Abraham, both of which have released a number of full-length recordings","torrent":{"xt":"urn:btih:d9c2d1282dc78d2c93f90f3e2b13a7426092e9c9","amp;dn":"Fila+Brazillia+Discog+%28partial%29+1994-2006+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9c2d1282dc78d2c93f90f3e2b13a7426092e9c9","infoHashBuffer":{"type":"Buffer","data":[217,194,209,40,45,199,141,44,147,249,15,62,43,19,167,66,96,146,233,201]},"announce":[],"urlList":[]}}