{"title":"VMware ThinApp Enterprise 4.7.3-891762+keyG by Senzati.rar","uid":7825738,"size":53855875,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:da0c7d906734471b4128d37fa8af0df08a1ed6fb&amp;dn=VMware+ThinApp+Enterprise+4.7.3-891762%2BkeyG+by+Senzati.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BySenzati","files":-1,"time":1352922793,"description":"VMware ThinApp Enterprise 4.7.3 Build 891762\n\n\nRun any version of virtually any application on a single operating system without conflicts. You can even run multiple versions of the same application. Plug VMware ThinApp, formerly known as Thinstall, into your existing management infrastructure and accelerate your software development and desktop deployment. Deliver and deploy applications more efficiently, more securely, and more cost-effectively with agentless application virtualization.\n\n\nWhat's New\n\nThe ThinApp 4.7.3 release adds support for packaging and execution of virtualized applications on Windows 8 operating system. The Windows 8 support enables cross-platform capability for many applications regardless of the operating system of capture. The cross-platform capability is an important component of supporting the latest Microsoft Windows releases for both managed and unmanaged endpoints.\n\nNew Package.ini parameter - You can use the PreventDllInjection=1 parameter to prevent ThinApp runtime from loading a DLL when another external application calls the SetWindowHook to set a global hook. This parameter should be used only when the hook is in conflict with a virtualized application. For example, if a virtualized application is unable to start because the other application NxPowerLite calls SetWindowsHook to set a global hook oehook.dll, modifying the package.ini with PreventDllInjection entry allows the virtualized application to start.\n\nOS  WindowsÂ® XP/Vista/7/8","torrent":{"xt":"urn:btih:da0c7d906734471b4128d37fa8af0df08a1ed6fb","amp;dn":"VMware+ThinApp+Enterprise+4.7.3-891762%2BkeyG+by+Senzati.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da0c7d906734471b4128d37fa8af0df08a1ed6fb","infoHashBuffer":{"type":"Buffer","data":[218,12,125,144,103,52,71,27,65,40,211,127,168,175,13,240,138,30,214,251]},"announce":[],"urlList":[]}}