{"title":"The Third Reich in Colour  (1998 - Complete)","uid":6811476,"size":2935347956,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dac3e83b4df80d986d6743e79364df1b3cfaaaf0&amp;dn=The+Third+Reich+in+Colour++%281998+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"neil1966hardy","files":5,"time":1321049784,"description":"This is an excellent film but the title is a little misleading, as there is also plenty of colour footage from the UK, USA and the Pacific theatre.\n\nThe chronology of the Second World War is sometimes tricky to follow, because the producers were limited to colour film footage. But, that aside, there is much to gain from this film. Not only are there extracts from footage taken by famous film directors while in uniform, there are extracts from propaganda films of both sides and of film that never made it to the screen, having not met with the approval of the censor.\n\nWell known aspects of the Second World War are here in colour and that certainly adds some immediacy for viewers today. For me, however, it is the footage that one never, or rarely, sees that makes this film so valuable a contribution to one's understanding of the war. Life went on, of course, and it's the private 'home movies' taken by civilians and military alike that are so memorable. It is so easy to forget, when watching some of the classic footage of the fighting of the Second World War, that ordinary life did go on. Propaganda some of it may have been, but it's no less valuable.\n\nRobert Powell's English narrative is wrong when he describes HMS Ivanhoe as a cruiser - she was an I class destroyer (lost 1 September 1940).\n\nOverall, this is an excellent addition to the wealth of material already available and it helps to understand the human story of the years 1939 to 1945.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0243872/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0243872/&lt;/a&gt;\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:dac3e83b4df80d986d6743e79364df1b3cfaaaf0","amp;dn":"The+Third+Reich+in+Colour++%281998+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dac3e83b4df80d986d6743e79364df1b3cfaaaf0","infoHashBuffer":{"type":"Buffer","data":[218,195,232,59,77,248,13,152,109,103,67,231,147,100,223,27,60,250,170,240]},"announce":[],"urlList":[]}}