{"title":"Direct Synthesis of Coordination and Organometallic Compounds","uid":15357513,"size":10225706,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db4801accc09c32932679fd1cd7591774378b025&amp;dn=Direct+Synthesis+of+Coordination+and+Organometallic+Compounds&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1468989583,"description":"Direct Synthesis of Coordination and Organometallic Compounds - A. D. Garnovskii, ‎Boris I. Kharissov (Elsevier, 1999).pdf\r\n\r\nISBN 0 444 72000 6\r\n\r\nThis book is devoted to the interaction between elemental metals and (in)organic ligands in different reaction conditions. Metals could be activated for further reactions as cryosynthesis, electrosynthesis and tribosynthesis, some of them with or without ultrasonic and microwave treatment. The kinetics of metal dissolution in various non-aqueous media is discussed in detail.\r\n\r\nMany methods are used nowadays to synthesize coordination compounds. Metal complexes are obtained mainly by the direct interaction of the components (the ligands and a source of the complex-forming metal), as a result of ligand and metal exchange, and under the conditions of template synthesis, which also include the method of nascent reagents. In these methods the source of the metal is either its salts or carbonyls. At the same time, it has long been known that coordination compounds may be obtained as a result of direct synthesis from zero-valent metals. Methods for the synthesis of complex compounds under the conditions of gas-phase reactions, oxidative dissolution of zero-valent metals in non-aqueous media, and in the solid phase have been developed. These methods have become the basis of a new field in synthetic chemistry - the direct synthesis of coordination and organometallic compounds from zero-valent metals.\r\n\r\nParticular aspects of the above problem have been described in a series of reviews and monographs. However, on the whole these main parts of the direct synthesis of metal complexes has not been dealt with in the review and monograph publications on coordination chemistry. So, the main objective of this book is to analyze, discuss and generalize the existing information in the area of direct reactions leading to the coordination and organometallic reactions.\r\n\r\nSome methods of direct synthesis have been developed in the former USSR (in particular, a lot of works on cryosynthesis, pioneered (1972-1973) and recent works on electrosynthesis) but, in spite of their novelty and/or wide applicability, they are practically unknown elsewhere due to the language barrier. Thus, another objective of this book is to acquaint the readers with the mentioned achievements.\r\n\r\nEvery chapter contains the tables which describe all the reported data on direct reaction between metal atoms, metal particles or bulk metals with (in)organic ligans. There are some illustrations also (for example, the scheme of the reactor for gas-phase reaction between metal small particles and &amp;bgr;-diketones)","torrent":{"xt":"urn:btih:db4801accc09c32932679fd1cd7591774378b025","amp;dn":"Direct+Synthesis+of+Coordination+and+Organometallic+Compounds","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db4801accc09c32932679fd1cd7591774378b025","infoHashBuffer":{"type":"Buffer","data":[219,72,1,172,204,9,195,41,50,103,159,209,205,117,145,119,67,120,176,37]},"announce":[],"urlList":[]}}