{"title":"The Unseen War Allied Air Power and the Takedown of Saddam Husse","uid":9207903,"size":5447772,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbc4210f69a92bebf77e5adced5bf78a2af61be0&amp;dn=The+Unseen+War+Allied+Air+Power+and+the+Takedown+of+Saddam+Husse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1384729048,"description":"America's second war against Iraq differed notably from its first. Operation Desert Storm was a limited effort by coalition forces to drive out those Iraqi troops who had seized Kuwait six months before. In contrast, the major combat phase of Operation Iraqi Freedom in 2003 was a more ambitious undertaking aimed at decisively ending Saddam Hussein's rule. After several days of intense air strikes against fixed enemy targets, allied air operations began concentrating on Iraqi ground troops. The intended effect was to destroy Iraqi resistance and allow coalition land forces to maneuver without pausing in response to enemy actions. Iraqi tank concentrations were struck with consistently lethal effect, paving the way for an allied entrance into Baghdad that was largely unopposed. Hussein's regime finally collapsed on April 9. Viewed in hindsight, it was the combination of allied air power as an indispensable enabler and the unexpected rapidity of the allied ground advance that allowed coalition forces to overrun Baghdad before Iraq could mount a coherent defense. In achieving this unprecedented level of performance, allied air power was indispensable in setting the conditions for the campaign's end. Freedom from attack and freedom to attack prevailed for allied ground forces. The intended effect of allied air operations was to facilitate the quickest capture of Baghdad without the occurrence of any major head-to-head battles on the ground. This impressive short-term achievement, however, was soon overshadowed by the ensuing insurgency that continued for four years thereafter in Iraq. The mounting costs of that turmoil tended, for a time, to render the campaign's initial successes all but forgotten. Only more recently did the war begin showing signs of reaching an agreeable end when the coalition's commander put into effect a new counterinsurgency strategy in 2007 aimed at providing genuine security for Iraqi citizens. The toppling of Hussein's regime ended the iron rule of an odious dictator who had brutalized his people for more than 30 years. Yet the inadequate resourcing with which that goal was pursued showed that any effective plan for a regime takedown must include due hedging against the campaign's likely aftermath in addition to simply seeing to the needs of major combat. That said, despite the failure of the campaign's planners to underwrite the first need adequately, those who conducted the three-week offensive in pursuit of regime change performed all but flawlessly, thanks in considerable part to the mostly unobserved but crucial enabling contributions of allied air power. \nGenre: Non Fiction , Educational","torrent":{"xt":"urn:btih:dbc4210f69a92bebf77e5adced5bf78a2af61be0","amp;dn":"The+Unseen+War+Allied+Air+Power+and+the+Takedown+of+Saddam+Husse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbc4210f69a92bebf77e5adced5bf78a2af61be0","infoHashBuffer":{"type":"Buffer","data":[219,196,33,15,105,169,43,235,247,126,90,220,237,91,247,138,42,246,27,224]},"announce":[],"urlList":[]}}