{"title":"Dr. Dre - The Chronicle The Best Of The Works (2001) {FLAC} ","uid":12216160,"size":409901646,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:de49a54fd400828f8294de202419eb6a084abba7&amp;dn=Dr.+Dre+-+The+Chronicle+The+Best+Of+The+Works+%282001%29+%7BFLAC%7D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vtwin88cube","files":22,"time":1439234366,"description":"Dr. Dre\nThe Chronicle\nThe Best Of The Works (2001)\n\n\n\n\n\nallmusic.com...\n\nMore than any other rapper, Dr. Dre was responsible for moving away from the avant-noise and political stance of Public Enemy and Boogie Down Productions as well as the party vibes of old-school rap. Instead, Dre pioneered gangsta rap and his own variation of the sound, G-funk. BDP's early albums were hardcore but cautionary tales of the criminal mind, but Dre's records with N.W.A. celebrated the hedonistic, amoral side of gang life. Dre was never much of a rapper -- his rhymes were simple and his delivery was slow and clumsy -- but as a producer, he was extraordinary. With N.W.A. he melded the noise collages of the Bomb Squad with funky rhythms. On his own, he reworked George Clinton's elastic funk into the self-styled G-funk, a slow-rolling variation that relied more on sound than content. When he left N.W.A. in 1992, he founded Death Row Records with Suge Knight, and the label quickly became the dominant force in mid-'90s hip-hop thanks to his debut, The Chronic. Soon, most rap records imitated its sound, and his productions for Snoop Doggy Dogg and Blackstreet were massive hits. For nearly four years, G-funk dominated hip-hop, and Dre had enough sense to abandon it and Death Row just before the whole empire collapsed in late 1996. Dre retaliated by forming a new company, Aftermath, and while it was initially slow getting started, his bold moves forward earned critical respect. He later launched Beats by Dr. Dre, a company that introduced the celebrity headphones phenomenon, later morphed into a streaming music service, and was then bought by Apple Inc. \n\n\nGenre................: Rap\nQuality..............: Free Lossless Audio Codec (FLAC)\nLabel.................: Death Row\nIncluded.............: Covers, auCDtect, Log, Cue\n\n\nTracklist:\n\n01.Nuthin' But A G Thang\n02.Gin &amp; Juice\n03.Afro Puffs\n04.Natural Born Killaz\n05.Murder Was The Case (Soundtrack)\n06.Lil' Ghetto Boy\n07.Let Me Ride\n08.California Love\n09.Fuck Wit Dre Day (And Everybody's Celebratin')\n10.Serial Killa\n11.Stranded On Death Row\n12.Nuthin' But A G Thang (Remix)\n\n\n\n\n\nTHANKS for Seeding!\nCheers","torrent":{"xt":"urn:btih:de49a54fd400828f8294de202419eb6a084abba7","amp;dn":"Dr.+Dre+-+The+Chronicle+The+Best+Of+The+Works+%282001%29+%7BFLAC%7D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de49a54fd400828f8294de202419eb6a084abba7","infoHashBuffer":{"type":"Buffer","data":[222,73,165,79,212,0,130,143,130,148,222,32,36,25,235,106,8,74,187,167]},"announce":[],"urlList":[]}}