{"title":"mIRC v7.45 Fix","uid":14768465,"size":2715290,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:deb44b63e2945db431ff00bb190712f8cae3422b&amp;dn=mIRC+v7.45+Fix&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZarkBit","files":1,"time":1464900294,"description":"mIRC v7.45 Fix (Comment if crack doesn't work)\r\n\r\nLatest News\r\n\r\nmIRC 7.45 has been released! (April 25th 2016)\r\nThis is a small update that fixes an issue with the way BAN/UNBAN events are handled. This issue was introduced in a recent change to mIRC and we decided it was important enough, and affected enough users, to release a small update to fix it. This update includes the following improvements, changes and fixes:\r\n\r\n    Fixed on BAN/UNBAN event bug that caused it to not be triggered on mode +b/-b events.\r\n    Updated channels /list feature to send *matchtext* to server in LIST request on Undernet and Quakenet.\r\n    Fixed DCC Send file dialog nickname combobox being incorrectly sized.\r\n    Fixed $sdir() new file dialogs not handling invalid path names.\r\n    Fixed $sfile() new file dialogs not filling in filename editbox.\r\n    Fixed tray tips bug that caused gpf triggered by right-click on tray tip.\r\n    Fixed tray tips and speech bug in formatting of text for multiple mode changes.\r\n    Updated installer to re-use default NSIS uninstall executable.\r\n    Updated CA root certificates cacert.pem file. \r\n \t\r\n \t\r\nAbout mIRC\r\n\r\nmIRC is a full featured Internet Relay Chat client for Windows that can be used to communicate, share, play or work with others on IRC networks around the world, either in multi-user group conferences or in one-to-one private discussions.\r\n\r\nIt has a clean, practical interface that is highly configurable and supports features such as buddy lists, file transfers, multi-server connections, IPv6, SSL encryption, proxy support, UTF-8 display, UPnP, customizable sounds, spoken messages, tray notifications, message logging, and more.\r\n\r\nmIRC also has a powerful scripting language that can be used both to automate mIRC and to create applications that perform a wide range of functions from network communications to playing games.\r\n\r\nmIRC has been in development for over two decades and is constantly being improved and updated with new technologies. The most recent changes can be found on the latest news page","torrent":{"xt":"urn:btih:deb44b63e2945db431ff00bb190712f8cae3422b","amp;dn":"mIRC+v7.45+Fix","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"deb44b63e2945db431ff00bb190712f8cae3422b","infoHashBuffer":{"type":"Buffer","data":[222,180,75,99,226,148,93,180,49,255,0,187,25,7,18,248,202,227,66,43]},"announce":[],"urlList":[]}}