{"title":"Slim Cessnas Auto club - Unentitled (2011)","uid":7879005,"size":102965804,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:df71996e7b78658a30f04c90fe7747e95fb8ae21&amp;dn=Slim+Cessnas+Auto+club+-+Unentitled+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mr_Kurtz","files":-1,"time":1354437766,"description":"Slim Cessnas Auto club - Unentitled (2011) mp3\n\nSlim Cessnas Auto Club is an American alternative country, gothabilly rock band, originally formed in 1992 in Denver, Colorado. The constant in the band has been Slim Cessna, formerly a member of The Denver Gentlemen along with David Eugene Edwards and Jeffery-Paul of 16 Horsepower. Jay Munly (often credited as Munly Munly) is also a key member of the current lineup of the band. In addition to contributing songwriting, vocals, and banjo, he also serves as a sidekick to Cessna on stage.\n \nTheir music includes elements of country blues, Southern gospel, gothabilly and other forms loosely grouped as Americana or alternative country. The Auto Club is sometimes labeled country Gothic due to the juxtaposition of apocalyptic religious imagery with stories of alcohol, violence, and relationships gone awry.\n \nThe other current members are Lord Dwight Pentacost, Daniel Grandbois (Danny Pants), Robert Ferbrache, and Todd Moore. Former members of note are John Rumley (who also crafted many of the stringed instruments used), Ordy Garrison, Jon Killough (who also did the artwork for the 2005 live CD Jesus Let Me Down and Buried Behind the Barn, Shane Trost, Whiff (Steve) Cessna, Caleb Roberts, Frank Hauser Jr, Gregory Garcia Jr. Judith Ann Winters, Tim Maher, Reverend Glasseye, and Chad Johnson\n\n- This is the country band that plays the bar at the end of the world  -\nJello Biafra","torrent":{"xt":"urn:btih:df71996e7b78658a30f04c90fe7747e95fb8ae21","amp;dn":"Slim+Cessnas+Auto+club+-+Unentitled+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df71996e7b78658a30f04c90fe7747e95fb8ae21","infoHashBuffer":{"type":"Buffer","data":[223,113,153,110,123,120,101,138,48,240,76,144,254,119,71,233,95,184,174,33]},"announce":[],"urlList":[]}}