{"title":"Thin Lizzy - Funky Junction (Play A Tribute To Deep Purple)","uid":4502081,"size":48549117,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e04557c676404892459f60682d46cd1d4b67173b&amp;dn=Thin+Lizzy+-+Funky+Junction+%28Play+A+Tribute+To+Deep+Purple%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"apisto","files":14,"time":1226436780,"description":"192 mp3 vbr\n\nrip from vinyl (not my rip)\n\nfrom the txt that was included\n\nI first saw this album in 1973, in the Woolworths store at the east end of Princes Street in Edinburgh. It was 10pm on a Sunday night, the store was very firmly shut, the record was on a stand behind the glass door, I was on a school trip, and I was going back home first thing the next morning. So I had no chance to get it. \n\nI kept looking for it, but it was about three or four years before I found it, in another branch of Woolworths. \n\nWoolworths in the UK is a fairly downmarket high-street store (known to one and all as Woollies), and is definitely not the place to buy your records if you want to have any street cred. Worse, the album itself was one of these dirt-cheap ones that Woollies used to sell - older UK readers will remember labels such as &quot;Hallmark&quot;, &quot;Pickwick&quot;, &quot;Music for Pleasure&quot;, and the gloriously politically incorrect &quot;Top of the Pops&quot; series, each with a scantily-clad dolly-bird on the cover. In addition, Purple themselves were extremely unfashionable with most of my mates. \n\n All this meant that I practically had to slink into Woollies in disguise to look for it - it would have been social disaster for me to have been discovered there, looking through the cheapo crap for an album of Deep Purple covers. (Nowadays, you&amp;#039;ll have gathered, I don&amp;#039;t give a damn.) Anyway, by the time I found it, I hated the wretched thing for all the trouble it had caused me. It cost me 66 pence (it still has the sticker on the cover) in 1976 or 1977 - probably about the price of a 45rpm 7inch single at the time. And when I played it.....was it bad! \n\nMusicians were \nPhil Lynott (bass), \nEric Bell (guitar), \nBrian Downey (drums), \nDave Lennox (keyboards), ","torrent":{"xt":"urn:btih:e04557c676404892459f60682d46cd1d4b67173b","amp;dn":"Thin+Lizzy+-+Funky+Junction+%28Play+A+Tribute+To+Deep+Purple%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e04557c676404892459f60682d46cd1d4b67173b","infoHashBuffer":{"type":"Buffer","data":[224,69,87,198,118,64,72,146,69,159,96,104,45,70,205,29,75,103,23,59]},"announce":[],"urlList":[]}}