{"title":"Taking Back Sunday - Happiness Is (2014) [FLAC]","uid":9802563,"size":301830862,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e06bb3027d06225688b6eb01c78352b3af3e5775&amp;dn=Taking+Back+Sunday+-+Happiness+Is+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1395362621,"description":"\n  Taking Back Sunday - Happiness Is (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Emo\n  Source: Scene CD (forsaken)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Preface \n  02 Flicker, Fade \n  03 Stood a Chance\n  04. All the Way \n  05 Beat Up Car \n  06 It Takes More \n  07 They Don't Have Any Friends \n  08 Better Homes and Gardens \n  09 Like You Do\n  10 We Were Younger Then \n  11 Nothing at All \n\n  When Taking Back Sunday's original lineup reunited in 2011 for their self-titled fifth album, it felt as though the band had tapped into the youthful energy that had brought them together nearly a decade earlier, returning with a reinvigorated album that felt more like a reintroduction than a return to form. On Happiness Is, the band's sixth album, and second consecutive outing from the re-formed lineup, Taking Back Sunday bring more of their growth and experience into their work. While some of the energy of their previous outing can still be felt on the album, the band seems better able to harness it, giving the album a tighter, more controlled feel. This really comes through in how the album flows. Opening with the gentle &quot;Preface,&quot; the album allows the listener to settle in with a string arrangement that builds itself into a frenzy before ripping into &quot;Flicker, Fade,&quot; which channels the elegant discord of the opening into something more focused and dramatic. The album continues on this kind of arc, crashing and settling like the tides, before coming to a close with &quot;Nothing at All,&quot; a gentle number whose slow descent into discord feels like the perfect bookend to the album's jumping-off point. If Taking Back Sunday's self-titled album proved that time has allowed these guys to be a band again, Happiness Is shows that they've honed their skills, creating a beautifully crafted, well-constructed album that feels like more than merely a collection of songs, but rather an album full of soaring builds and heartbreaking collapses that lends credence to the notion that the best things come to those who wait.\n","torrent":{"xt":"urn:btih:e06bb3027d06225688b6eb01c78352b3af3e5775","amp;dn":"Taking+Back+Sunday+-+Happiness+Is+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e06bb3027d06225688b6eb01c78352b3af3e5775","infoHashBuffer":{"type":"Buffer","data":[224,107,179,2,125,6,34,86,136,182,235,1,199,131,82,179,175,62,87,117]},"announce":[],"urlList":[]}}