{"title":"Duke Nukem (Full PSX Collection) (PS1) (Use ePSXe)","uid":6209379,"size":888683265,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e0ecc36287f3885488613f26b05316b7c0f39020&amp;dn=Duke+Nukem+%28Full+PSX+Collection%29+%28PS1%29+%28Use+ePSXe%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"FuCtUpPuNk","files":9,"time":1298925606,"description":"INSTALLATION:\nUse an Emulator to run the games.\nRecommended: ePSXe 1.6 or 1.7\n\nI have also uploaded the emulator to run this game on the following link:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&lt;/a&gt;\n-----------------------------\n-----------------------------\n-----------------------------\n\nDuke Nukem Total Meltdown/Duke Nukem 3D:\n\nGAMEPLAY:\nAs a first-person shooter, the gameplay of Duke Nukem 3D involves moving through levels presented from the protagonist's point of view, shooting enemies on the way.\nThe environment of Duke Nukem 3D is highly destructible; most props can be destroyed by the player.\n\nLEVEL DESIGN:\nLevels were designed in a fairly non-linear manner such that players can advantageously use air ducts, back doors and sewers to avoid enemies or find hidden caches. These locations are also filled with objects with which the player can interact, that either benefit the player in some form (light switches make it easier to see, while water fountains and broken hydrants provide some health points) or simply provide diversion (tipping strippers provokes a quote from Duke and a provocative reveal from the dancer).\n\nWEAPONS AND EQUIPMENT:\nWeapons include the &quot;Mighty Boot&quot; (a basic kick attack), a pistol, a shotgun, a chain gun (similar in design to the Nordenfelt gun), a rocket-propelled grenade launcher, pipe bombs, freeze- and shrink-rays, laser trip mines, and rapid fire rocket launchers called the &quot;Devastator&quot;.\nOther items can be picked up during play. A portable medkit allows players to heal Duke whenever they choose to. Steroids speed up Duke's movement, as well as instantly reversing the effects of the shrinker. Nightvision goggles allow players to see enemies in the dark. The &quot;HoloDuke&quot; device projects a hologram of Duke that can be used to distract enemies. Protective boots allow Duke to cross dangerously hot or toxic terrain. Where progress requires more aquatic legwork, scuba gear (an aqua-lung) allows Duke to take longer trips away from air. Duke's jetpack allows the player to move vertically.\n\nMONSTERS:\nThe game features a wide range of monsters, some of which are aliens, other mutated humans (the LAPD has been turned into &quot;Pig-cops&quot;, a play on the derogatory term &quot;pig&quot; for police officers, with LARD emblazoned on their uniforms). As is usual for a first-person shooter, Nukem encounters a large number of lesser foes, and a small number of boss enemies (usually at the end of chapters). Like Duke, these enemies have access to a wide range of weapons and equipment (some weaker enemies have jet packs).\n\nSETTING:\nDuke Nukem 3D is set on Earth &quot;sometime in the early 21st century&quot;. The levels of Duke Nukem 3D take the player outdoors and indoors through rendered street scenes, military bases, deserts, a flooded city, space stations, moon bases and a Japanese restaurant.\nThe game contains several humorous references to pop culture, like some of Duke's lines that are drawn from movies like They Live, Evil Dead II, Jaws, Dirty Harry, Pulp Fiction, and Aliens; the mutated women begging &quot;Kill me&quot; are also a reference to the latter. The player will encounter corpses of famous characters such as Luke Skywalker, Indiana Jones, the protagonist of Doom, and a smashed T-800. During the second episode, the player can see The Monolith (from 2001: A Space Odyssey) on the Moon.\nThe game cover itself is a parody of Army of Darkness, while Duke poses as Ash Williams.\n\nSTORY:\nThere is little story in the game except for a brief text prelude located under &quot;Help&quot; in the Main Menu, and a few cutscenes after the completion of an episode. The introduction establishes that the game picks up right after the events of Duke Nukem II, with Duke returning to Earth in his space cruiser. As Duke descends on Los Angeles in hopes for a vacation, a blast rips through from unknown hostiles and critically damages Duke's ship. While sending a distress signal, Duke learns that aliens are attacking Los Angeles and have mutated the LAPD. With his plans now ruined, Duke hits the &quot;eject&quot; button, and vows to do whatever it takes to stop the alien invasion.\nIn &quot;Episode One: L.A. Meltdown&quot;, Duke fights his way through a dystopic Los Angeles. At a strip-club, he is captured by pig-cops, but escapes the alien-controlled penitentiary and tracks down the alien cruiser responsible for the invasion in the San Andreas Fault. After killing the first boss, the Alien Battlelord, Duke discovers that the aliens were capturing women, and detonates the ship.\nIn &quot;Episode Two: Lunar Apocalypse&quot;, Duke journeys to space, where he finds many of the captured women held in various incubators throughout space stations that had been conquered by the aliens. Duke reaches the alien mothership on the Moon and kills an Alien Overlord. As Duke inspects the ship's computer, it is revealed that the plot to capture women was merely a ruse to distract him. The aliens have already begun their main and ultimate attack on Earth.\nIn &quot;Episode Three: Shrapnel City&quot;, Duke battles the massive alien resistance through Los Angeles once again, and finally saves the day after he kills the leader of alien menace: the Cycloid Emperor. The game ends as Duke promises in a voice-over that after some &quot;R&amp;R&quot;, he'll be &quot;...ready for more action!&quot;, as an anonymous woman calls him back to bed...\nThe story continues in the Atomic Edition. In &quot;Episode Four: The Birth&quot;, it is revealed that the aliens were really capturing women to produce a Queen, which could quickly give birth to deadly alien drones. Duke is dispatched back to Los Angeles to fight hoardes of aliens, including the alien drones. Eventually, Duke finds the lair of the alien Queen, and kills her, thus thwarting the alien plot.\n------------------------------\n------------------------------\n------------------------------\n\nDuke Nukem Time to Kill:\n\nPLOT:\nThe game opens with an introduction video sequence of Duke riding his motorbike towards the Bootylicious Strip Club in downtown Los Angeles, only to find &quot;Pig Cops&quot; teleporting in to disrupt his fun, turning his motorcycle into a pink child's bicycle. Duke takes out the Pig Cops and the game begins. The video sequence is accompanied by the song &quot;The Thing I Hate&quot; by Stabbing Westward.\nThe first stage of the game is a hub stage. It is an &quot;inner city&quot; composed of the strip club, a subway, an apartment and manufacturing plant. On each visit to the hub stage, duke can kill the dancers, which leads to Mutated Pigs teleporting in, resulting in humorous comments from a disgusted Duke. The objectives of the hub stages are to find 3 key crystals (hidden in a different location each time) and use them to operate a Time-Space Warp that Duke must use to travel to the Old West, Medieval Europe and Ancient Rome. In each scenario, Duke finds evidence of the aliens and pigs in period dress attempting to change history in their favor. Duke encounters several stages of action before a final confrontation against an enormous end boss.\n\nFEATURES:\nThe game also features a 2-Player Deathmatch option, where 2 players can battle against each other in environments loosely based on the single-player stages referring to the different time periods. The multiplayer stages can also be accessed in the single-player game by finding stopwatches or 'Surprises.' If these hidden items are found, the player is given an opportunity to take on a horde of enemies in the multiplayer stages using an upgraded version of the current weapon used, with the prize for completion being to keep the upgrade for the remainder of the game.\n---------------------------\n---------------------------\n---------------------------\n\nDuke Nukem Land of the Babes:\n\nPLOT:\nSet mostly in a dystopian future, the game begins in modern day Los Angeles, when Duke is interrupted at a strip club by the sudden teleportation of women and pig-cops. After a fire fight, Duke uses the teleportation device to travel forwards through time, where he is greeted by a woman - a member of the Unified Babe Resistance - who explains that in the future aliens have invaded earth, killed all men and enslaved all women. The Unified Babe Resistance has avoided the aliens thus far, and have sent for Duke to fight off the aliens. The game has a linear story mode that focuses more on tactical maneuvering than on the gung-ho jumping and shooting in other Duke games; it also includes a two player death match in rooms similar to some of the other game's environments.\n\nThe gameplay and objectives initially involve Duke:\n\n    * Trying to reach the surface &amp; save the babes.\n    * Bringing down the ship of General Silverback.\n    * Chasing Silverback underwater.\n    * Disrupting alien advances and killing Silverback.\n    * Transporting to an alien base and wrecking it.\n    * Stealing a spaceship.\n    * Flying to a galactic base.\n    * Rescue missions of imprisoned women.\n    * Confronting the alien overlord.\n    * Running a gauntlet.\n    * Killing the alien overlord.\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSerious Sam: The First and Second Encounter\nNexuiz\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:e0ecc36287f3885488613f26b05316b7c0f39020","amp;dn":"Duke+Nukem+%28Full+PSX+Collection%29+%28PS1%29+%28Use+ePSXe%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0ecc36287f3885488613f26b05316b7c0f39020","infoHashBuffer":{"type":"Buffer","data":[224,236,195,98,135,243,136,84,136,97,63,38,176,83,22,183,192,243,144,32]},"announce":[],"urlList":[]}}