{"title":"Treasures in Heaven (Animated Christian Movie)","uid":5015362,"size":229953848,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e12c85da1b08348529e49279a5635a8295f4f097&amp;dn=Treasures+in+Heaven+%28Animated+Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"IndianChristian","files":3,"time":1248198568,"description":"Treasures in Heaven (Animated Christian Movie)\n\nTwo wealthy men respond to Jesus in very different ways. One, who is basically good, is unable to accept Jesus' directive that he give up the treasures of this world for the greater treasures of Heaven. The other, a sinful Publican, struggles to come to grips with his emerging faith in Jesus, and finally accepts with his fellow man and achieving eternal salvation. Zacchaeus is the Chief Publican of Jericho, gaining great wealth by cheating others. His young son has heard of Jesus and wants to go see Him. But Zacchaeus will not give up the opportunity to make money just to listen to a mere &quot;rabbi.&quot; In the countryside, a wealthy young man finds Jesus preaching. When he asks Jesus what he must do to inherit eternal life, Jesus tells him to obey the commandments, to sell all he has and give to the poor. The rich man, unable to part with his gold, turns away. &quot; How difficult it is for a rich man to enter the Kingdom of God&quot;, observes Jesus. &quot; It is easier for a camel to go through the eye of a needle.&quot; When a man named Bartimaeus is arrested, he asks Zacchaeus to let him hear Jesus before being thrown in prison. Zacchaeus is troubled by the intensity of Bartimaeus' faith and sets him free. Zacchaeus then witnesses the miraculous healing of Bartimaeus by Jesus, who says, &quot; Your faith has made you whole.&quot; Zacchaeus struggles to come to terms with his awaking faith. The things of the world have been replaced with a longing in his heart, and he prays that Jesus will heal him since, he says, &quot;I am a sinner, and not worthy.&quot; But Jesus tells him, and us, &quot;I have not come to this world for righteous only, but to seek and save that which is lost.&quot; Zacchaeus decides he will give half of his wealth to the poor, and repay those he has cheated. &quot; Zacchaeus &quot;, says Jesus, &quot;today has salvation come to your house. Lay not for yourself treasures on earth, but lay up for yourself treasures in heaven.&quot;\n \nRuntime: 25 mins\nLanguage: English (No-Subtitles)\nYear: 1991\nMy Rating: 9/10\nQuality: 8/10 \n\nIf financially possible, please buy this CD/DVD to keep Christian films in business. If Christians won't buy Christian films then who will?\n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God's word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\nPS: If you need any specific christian movie or have something to say then kindly send a mail to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;88e1e6ece1e9e6ebe0fae1fbfce1e9e6bab8b8b1c8f1e9e0e7e7a6ebe7a6e1e6&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n&quot;Don't ask me what Christ can do for you! \nHe has done all he could. \nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\t\t\n","torrent":{"xt":"urn:btih:e12c85da1b08348529e49279a5635a8295f4f097","amp;dn":"Treasures+in+Heaven+%28Animated+Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e12c85da1b08348529e49279a5635a8295f4f097","infoHashBuffer":{"type":"Buffer","data":[225,44,133,218,27,8,52,133,41,228,146,121,165,99,90,130,149,244,240,151]},"announce":[],"urlList":[]}}