{"title":"The Trickster Comes West: Pan-African Influence in Early Black D","uid":8758597,"size":1624239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e17986874cf2fd17750d1aed8496672be799aad1&amp;dn=The+Trickster+Comes+West%3A+Pan-African+Influence+in+Early+Black+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackatk","files":-1,"time":1375197254,"description":"[img]http://image.bayimg.com/7b186b253ecdfa3ec31f7a5dd8ee99a6f016e476.jpg[/img]\n\n\nPublication Date: May 12, 2009 | filetype: pdf\n\nIn the past, scholars have looked at narratives of the African diaspora only to discover how these memoirs, poems, and fictions related to the West. The Trickster Comes West: Pan-African Influence in Early Black Diasporan Narratives explores relationships among African American, Afro-Caribbean, and Afro-British narratives of slavery and of New World and British oppression and what African influences brought to these diasporic expressions.\n\nUsing an interdisciplinary method that combines history, literary theory, cultural studies, anthropology, folklore, and philosophy, the book examines the work of Pan-African trickster icons, such as Leuk (Rabbit), Golo (Monkey), Bouki (Hyena), Mbe (Tortoise), and Anancy (Spider), on the resistance strategies of early black writers who were exposing the evils of slavery, racism, sexism, economic exploitation, and other forms of oppression.\n\nWorks discussed in this book include Phillis Wheatley's Poems on Various Subjects, Religious and Moral (1773), Quobna Ottobah Cugoano's Thoughts and Sentiments on the Evil of Slavery (1787), Olaudah Equiano's The Interesting Narrative of the Life of Olaudah Equiano (1795), Elizabeth Hart Thwaites's &quot;History of Methodism&quot; (1804), Anne Hart Gilbert's &quot;History of Methodism&quot; (1804), and Mary Prince's The History of Mary Prince: A West Indian Slave, Related By Herself (1831). Analyzing these writings in the context of the black Atlantic struggle for freedom, The Trickster Comes West relocates the beginnings of Pan-Africanism and suggests the strong influence of its theories of communal resistance, racial solidarity, and economic development on pioneering black narratives.\n\n\nAbout the Author\nBabacar M'Baye is an assistant professor of English and Pan-African studies at Kent State University. His work has appeared in the Journal of African Literature and Culture, the Journal of Pan-African Studies, New England Journal of History, and other publications. \n\n\nPrint Length: 272 pages\nPublisher: University Press of Mississippi (May 12, 2009)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B002OB5HC4\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Trickster-Comes-West-Pan-African-ebook/dp/B002OB5HC4/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Trickster-Comes-West-Pan-African-ebook/dp/B002OB5HC4/&lt;/a&gt;\n\n\nTags: eurocentric, eurocentricity, anglo, anglo-saxon bias, race, racism, oppression, nation, nationalist, marx, marxism, marxist, das kapital, africa, african, america, american, african american, black, literature, diaspora, Carib, Caribbean, ww2, cold war, ghana, Kwame, Nkrumah, IMF, capital, communism, capitalism, left, right, politics, pan-african, black star line, Malcolm X, W.E.B. Du Bois, Kwame Nkrumah, Martin Delany, World Bank, self-reliance, self-determination, independence, colonialism, UK, GB, Great Britain, England, French, dark continent, african studies, afro-centric, divide and conquer, colonialism, contested heritage, unity, nigeria, south africa, economic warfare, resource, REM, rare earths, gold, precious metals, bauxite, aluminum","torrent":{"xt":"urn:btih:e17986874cf2fd17750d1aed8496672be799aad1","amp;dn":"The+Trickster+Comes+West%3A+Pan-African+Influence+in+Early+Black+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e17986874cf2fd17750d1aed8496672be799aad1","infoHashBuffer":{"type":"Buffer","data":[225,121,134,135,76,242,253,23,117,13,26,237,132,150,103,43,231,153,170,209]},"announce":[],"urlList":[]}}