{"title":"Video Virgins 6 (1993) XXX Classic DVDRip","uid":11826251,"size":937367726,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e182c0c591e6b5ccd26ed6620969baf90d82cf69&amp;dn=Video+Virgins+6+%281993%29+XXX+Classic+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"B01010000","files":2,"time":1429506623,"description":"        ...::TORRENT NAME::...\nVideo Virgins 6 (1993) XXX Classic DVDRip\n\n         ...::POSTER::... &lt;a href=&quot;\nhttp://adsreserve.com/?v=51ITR.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adsreserve.com/?v=51ITR.jpg&lt;/a&gt;\n\n       ...::SCREENSHOTS::... &lt;a href=&quot;\nhttp://adsreserve.com/?v=BUYJF.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adsreserve.com/?v=BUYJF.jpg&lt;/a&gt;\n\n        ...::DESCRIPTION::...\nActresses\n\nGenevieve LeFleur\nHeather Lee\nRikki Parker\nSheila\nStephanie DuValle\nTracy Allen [Anal]\n\nActors\n\nBrad Michaels\nDave Hardman\nDick Nasty\nRick Masters\nTony Tedeschi\n\n\n\nFrom the original boxcover:\n\nWhat's more erotic than a woman's orgasm? The things she'll do to get it.\n\nScenes of lust so intense they might melt your DVD player! Women sharing their most intimate secrets of passion, touching themselves the way only they know how. Orgasms...the knee weakening, heavy breathing, body-shaking orgasms are back again! Hold on tight it's gonna be a wild ride with Video Virgins #6!\n\nHey there folks! Centex here with another great classic release--and lemme tell ya about the Video Virgins series. I've just finished previewing the first TEN and plan to post 'em up as I get the chance--they are hot as hell. First of all, remember that we're talking early to mid nineties here, so what I'm talking about will sound pretty standard now, but pro-am &amp; gonzo was a new budding flower at the time....Video Virgins was conceived to mimic the then recent success of Ed Powers' Dirty Debs series, which at the time was the hottest thing around at local video rental shops around the country. What Video Virgins did differently was they pretty much did ads in the local papers &amp; advertised to attract girls that might have been a step or two up (or is that down?) the ladder to porn. They'll have a couple of tattoos &amp; they know the actors they're gonna be fucking--cause these girls watch porn. Rather than Ed &amp; Jamie, they brought out pretty major male talent--if you have a look up at the male actors, these were guys you knew from major studio releases. So, what you had was more of &quot;So you wanna be a porn star&quot; instead of Ed's &quot;Think I can talk my way into that?&quot;\n\nSO--what Video Virgins does, and part of what makes them interesting, is nearly every scene is goddamn almost exactly the same! I've probably watched 50-60 scenes in the last day or so &amp; I can pretty much tell you what's gonna happen by counting the number and sex of the actors opposite the girl. First, all scenes begin with the girl alone vibing herself to orgasm to relax her &amp; set the scene. After she gets off, just count the number &amp; sex of the new partners--for a boy/girl scene it will go pussylicking, blowjob, doggie style to missionary(missionary to doggie usually means anal) then facial. FMM will be pretty much straight to 1 in the pussy &amp; one in the mouth, after the guy fucking her finishes &amp; cums on her pussy the second guy will fuck her &amp; pop on her face. Girl/girl goes kiss, kiss, swap licks, then either 69 or one uses a strap-on &amp; fucks the other. It's a straight up &quot;how to make a porno&quot; assembly line. Which is kinda what makes it good! Because the difference is almost exclusively the girl. Each girl gets to live out her porn star fantasy--often for the first &amp; only time...and she knows exactly how it'll go, so she lets it all hang out--vibe, cum, suck, spread, swallow. Done. This series is fantastic &amp; a fucking classic.\n\nOf course, these days Ed's just like the rest of 'em, calling the same agencies &amp; looking for the same fresh meat. But this really is different--if you're into classic pro/am, check this series out! Wal-Mart/Target, Chevy/Buick--they all have their place. I hope, if you haven't yet, you'll have a look &amp; pick out some cute girls from each series &amp; compare 'em. It's cool.\n\nMy personal favorite scenes from this vid are Tracy Allen, a trashy little blonde who is the anal fucker for this vid...and Heather Lee--but I've always kinda had a thing for her","torrent":{"xt":"urn:btih:e182c0c591e6b5ccd26ed6620969baf90d82cf69","amp;dn":"Video+Virgins+6+%281993%29+XXX+Classic+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e182c0c591e6b5ccd26ed6620969baf90d82cf69","infoHashBuffer":{"type":"Buffer","data":[225,130,192,197,145,230,181,204,210,110,214,98,9,105,186,249,13,130,207,105]},"announce":[],"urlList":[]}}