{"title":"VA - We Walk The Line: A Celebration of the Music of Johnny Cash","uid":7637575,"size":157382316,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e1ceba6ed2749d31907ac025ce4c47e938eb3b09&amp;dn=VA+-+We+Walk+The+Line%3A+A+Celebration+of+the+Music+of+Johnny+Cash&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Zypheiron","files":21,"time":1347691257,"description":"We Walk The Line: A Celebration of the Music of Johnny Cash\nIn April of 2012, ACL's Moody Theater in Austin, Texas, held an all-star bash to celebrate what would have been Johnny Cash's 80th Birthday and that concert is captured on Legacy's CD/DVD set We Walk the Line: A Celebration of the Music of Johnny Cash. The DVD has a slightly different sequencing than the CD but the essentials remain the same: this is a spirited salute to the great man. Where the slow spots arrive is all a matter of taste: it could be the slightly slick balladeering of Pat Monahan on &quot;Help Me Make It Through the Night,&quot; Iron &amp; Wine's overly sleepy &quot;The Long Black Veil,&quot; Ronnie Dunn's by-the-numbers &quot;Ring of Fire,&quot; or Lucinda Williams' growl through &quot;Hurt,&quot; none of which are bad but they may not appeal to those who prefer the wild, woolly train-track rhythms of Kris Kristofferson's &quot;Big River,&quot; Rhett Miller's &quot;Wreck of the Old 97,&quot; Carolina Chocolate Drops' stampeding &quot;Jackson,&quot; or Buddy Miller's &quot;Hey Porter,&quot; all faithful but loose evocations of Cash's prime. Along the way there are some surprises, too: Evanescence's Amy Lee delivers an expertly mournful &quot;I'm So Lonesome I Could Cry&quot; and Brandi Carlile tears through &quot;Folsom Prison Blues&quot; with an earthy ferocity she's long kept hidden. Ultimately, this show was not about surprises or reinventions; it was a full-throated celebration of Cash's music, both his songs and his sounds, both of which are given the loving but not overly respectful treatment they deserve. It's not major -- it's nothing but a good time, but that's enough. ","torrent":{"xt":"urn:btih:e1ceba6ed2749d31907ac025ce4c47e938eb3b09","amp;dn":"VA+-+We+Walk+The+Line%3A+A+Celebration+of+the+Music+of+Johnny+Cash","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1ceba6ed2749d31907ac025ce4c47e938eb3b09","infoHashBuffer":{"type":"Buffer","data":[225,206,186,110,210,116,157,49,144,122,192,37,206,76,71,233,56,235,59,9]},"announce":[],"urlList":[]}}