{"title":"Informatics and Communication Technology {Zzzz}","uid":11706946,"size":3573526,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e29e1fa5a2c3a8df194b3bb748a4b7f285301847&amp;dn=Informatics+and+Communication+Technology+%7BZzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1424167678,"description":"This volume comprises research papers presented at the International Conference on Informatics and Communication Technologies for Societal Development (ICICTS 2014) held at Karunya University, India. The content focuses on the recent advancements in image or signal processing, computer vision, communication technologies, soft computing, advanced computing, data mining and knowledge discovery. The primary objective of this volume is to facilitate advancement and application of the knowledge and to promote ideas that solve problems faced by society through cutting-edge technologies. The chapters contain selected articles from academicians, researchers and industry experts in the form of frameworks, models and architectures. Practical approaches, observations and results of research that promotes societal development are also incorporated. This volume will serve as a useful compendium for interested readers and researchers working towards societal development from the technological perspective.\n\nPublisher: Springer; 2015 edition (September 9, 2014)\nLanguage: English\nISBN-10: 8132219155\nISBN-13: 978-8132219156\n\nEditorial Reviews\nFrom the Back Cover\n\nThis volume comprises research papers presented at the International Conference on Informatics and Communication Technologies for Societal Development (ICICTS 2014) held at Karunya University, India. The content focuses on the recent advancements in image or signal processing, computer vision, communication technologies, soft computing, advanced computing, data mining, and knowledge discovery. The primary objective of this volume is to facilitate advancement and application of the knowledge and to promote ideas that solve problems faced by society through cutting-edge technologies. The chapters contain selected articles from academicians, researchers, and industry experts in the form of frameworks, models, and architectures. Practical approaches, observations, and results of research that promotes societal development are also incorporated. This volume will serve as a useful compendium for interested readers and researchers working towards societal development from the technological perspective.\nAbout the Author\n\nElijah Blessing Rajsingh is Professor and Director of the School of Computer Science and Technology at Karunya University, India. He received his MTech and PhD degrees from College of Engineering, Guindy, Anna University, India. His areas of research interest include network security, mobile computing, wireless and ad hoc networks, parallel and distributed computing, grid computing and pervasive computing. He has several papers to his credit. He is an Associate Editor for International Journal of Computers &amp; Applications, Acta Press, Canada and member of the editorial review board for many peer reviewed journals. He has been identified as an Expert Member of National Board of Accreditation (NBA), India. His research on health systems is being funded by the Indian Council of Medical Research. He is a member of IEEE, CSI, ISTE and has served as international advisory board member for various international conferences and workshops.\n\nAnand Bhojan is currently working in the School of Computing, National University of Singapore. He received his PhD in Computer Science from the School of Computing, National University of Singapore. His areas of specialization are systems &amp; networking, multimedia systems and energy management &amp; sustainability. Dr Anand is very active in the areas of his expertise. He has several publications in various reputed international journals and has authored more than ten books which are widely referred to. He is also an Honorary Secretary of International Researchers Club, Singapore.\n\nJ. Dinesh Peter is currently working as Head, Department of Information Technology at Karunya University, Coimbatore. Prior to this, he was a full time research scholar at National Institute of Technology, Calicut, India, from where he received his PhD in computer science and engineering. His research focus includes image processing and computer vision. He has published many papers in various international journals and conferences","torrent":{"xt":"urn:btih:e29e1fa5a2c3a8df194b3bb748a4b7f285301847","amp;dn":"Informatics+and+Communication+Technology+%7BZzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e29e1fa5a2c3a8df194b3bb748a4b7f285301847","infoHashBuffer":{"type":"Buffer","data":[226,158,31,165,162,195,168,223,25,75,59,183,72,164,183,242,133,48,24,71]},"announce":[],"urlList":[]}}