{"title":"Cyber Racism: White Supremacy Online and the New Attack on Civil","uid":8792924,"size":1584029,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2d02c618e9e73af0c449767af487f5fe7d217ad&amp;dn=Cyber+Racism%3A+White+Supremacy+Online+and+the+New+Attack+on+Civil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"blackatk","files":-1,"time":1375997647,"description":"Cyber Racism: White Supremacy Online and the New Attack on Civil Rights \n\n\nPublication Date: June 16, 2009 | ISBN-10: 0742561585 | ISBN-13: 978-0742561588 | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload. | filetype: pdf |\n\n\nIn this exploration of the way racism is translated from the print-only era to the cyber era the author takes the reader through a devastatingly informative tour of white supremacy online. The book examines how white supremacist organizations have translated their printed publications onto the Internet. Included are examples of open as well as 'cloaked' sites which disguise white supremacy sources as legitimate civil rights websites. Interviews with a small sample of teenagers as they surf the web, show how they encounter cloaked sites and attempt to make sense of them, mostly unsuccessfully. The result is a first-rate analysis of cyber racism within the global information age. The author debunks the common assumptions that the Internet is either an inherently democratizing technology or an effective 'recruiting' tool for white supremacists. The book concludes with a nuanced, challenging analysis that urges readers to rethink conventional ways of knowing about racial equality, civil rights, and the Internet.\n\n\n\n[b]Review [/b]\nWhite supremacy never sleeps, as pathbreaking sociologist Jessie Daniels again demonstrates. We see how cyber racism spreads like a sprawling cancerous growth across the Internet, as old white-racist groups get reinvigorated and new groups form and thrive all in the interest of aggressively spreading supremacist doctrines to yet more millions across the globe. (Feagin, Joe)\n\nPathbreaking look into new avenues for white supremacy in a digital age. (Kathleen M. Blee)\n\nIn Cyber Racism, Jessie Daniels provides a powerful corrective to rosy accounts of the World Wide Web as inherently progressive or liberatory. By carefully tracking both overt and cloaked hate activities on the web, Daniels reveals the dark underbelly of cyberspace: far-reaching white supremacist organizations that are utilizing the web to spread racism, hatred, and violence. The book convincingly tracks the global dimensions of white supremacy, while also illustrating the myriad ways in which racism intersects with issues of nationalism, gender, and literacy. (Tara McPherson)\n\nJessie Daniels' Cyber Racism is a well-written, insightful, and exhaustive examination of white supremacy online. I recommend this book to anyone who seeks to understand how hatemongers can have so much influence on our society in the digital era..... (Jack Levin)\n\nCyber Racism is a wonderful text and an excellent addition to the field. I'm excited to use it in class! (King, C Richard)\n\nI've known Jessie Daniels (for nearly a decade) to be a thoughtful and well-informed observer of the social nuances of online behavior. She's been carefully tracking one of the dark sides of life online, and Cyber Racism promises to be a landmark. (Rheingold, Howard)\n\nJessie Daniels' Cyber Racism is a well-written, insightful, and exhaustive examination of white supremacy online. I recommend this book to anyone who seeks to understand how hatemongers can have so much influence on our society in the digital era. (Jack Levin)\n\nDaniels (City Univ. of New York) focuses on manifestations of white supremacy and, to a lesser degree, gender disparity on the Internet. She is especially interested in offering a preliminary analysis of how the discourse of the white supremacist movement has been translated from print into the digital era. Recommended. (Choice)\nAbout the Author\nJessie Daniels teaches at Hunter College and writes and teaches about racism and anti-racism in print and online. She is the author of White Lies (Routledge). Daniels is a regular contributor to the blog Racism Review (www.racismreview.com ). Her research for this book was supported in part by the MacArthur Foundation. \n\n\n\nPaperback: 274 pages\nPublisher: Rowman &amp; Littlefield Publishers (June 16, 2009)\nLanguage: English\nISBN-10: 0742561585\nISBN-13: 978-0742561588\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Cyber-Racism-Supremacy-Perspectives-Multiracial/dp/0742561585/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Cyber-Racism-Supremacy-Perspectives-Multiracial/dp/0742561585/&lt;/a&gt;\n\n\n\n\nTags: race, racism, oppression, cyber, digital, white supremacy, white power, 88, narrative, media, pr, viewpoint, 88, ss, nsdp, aryan, nation, white narrative, contested, space, superiority, inferiority, subtle, racism, thought, logic, sociology, psychology, ethics, african, african american studies, AA, obama, militia, right, wing, mccain, bush, romney, tea, party, white anxiety, white rage, white guilt, inaction, complicity, slave, slavery, jim crow, segregation, knight, ku klux, inequality, Jim, Crow, race, racism, right, wing, republican, race coding, racially coded, subtle, doublespeak, George W Bush, George H.W Bush, Nixon, John Locke, William F Buckley, barack, obama, barry, black, biracial, IR, multiracial, preseident, bush, war, afghanistan, 2008, change, yes, we, can, hope, biden, china, afghanistan, tea, party, republican, democrat, politics, nobel, prize, war, peace, diplomacy, command, military, race, relations, racism, chicago, senator, white guilt, white anxiety, african, american, african american, black, racism, sociology, social mobiility, social climbing, mentor, race relations, race, militia, hate, nazi, white anxiety, oppression, tea party, fundamentalist, fundementalism, political science, hate group, ghettoization, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, experimentation, tuskeegee, unconscious, subconscious,\n\t\t","torrent":{"xt":"urn:btih:e2d02c618e9e73af0c449767af487f5fe7d217ad","amp;dn":"Cyber+Racism%3A+White+Supremacy+Online+and+the+New+Attack+on+Civil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2d02c618e9e73af0c449767af487f5fe7d217ad","infoHashBuffer":{"type":"Buffer","data":[226,208,44,97,142,158,115,175,12,68,151,103,175,72,127,95,231,210,23,173]},"announce":[],"urlList":[]}}