{"title":"Cradle to Cradle_ Remaking the Way We Ma - McDonough, William.pd","uid":8507487,"size":1041694,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3309b422703d074212551771fa5f67735575346&amp;dn=Cradle+to+Cradle_+Remaking+the+Way+We+Ma+-+McDonough%2C+William.pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BallinStalin","files":1,"time":1369465219,"description":"A manifesto for a radically different philosophy and practice of manufacture and environmentalism\n\n&quot;Reduce, reuse, recycle&quot; urge environmentalists; in other words, do more with less in order to minimize damage. As William McDonough and Michael Braungart argue in their provocative, visionary book, however, this approach perpetuates a one-way, &quot;cradle to grave&quot; manufacturing model that dates to the Industrial Revolution and casts off as much as 90 percent of the materials it uses as waste, much of it toxic. Why not challenge the notion that human industry must inevitably damage the natural world, they ask.\n\nIn fact, why not take nature itself as our model? A tree produces thousands of blossoms in order to create another tree, yet we do not consider its abundance wasteful but safe, beautiful, and highly effective; hence, &quot;waste equals food&quot; is the first principle the book sets forth. Products might be designed so that, after their useful life, they provide nourishment for something new-either as &quot;biological nutrients&quot; that safely re-enter the environment or as &quot;technical nutrients&quot; that circulate within closed-loop industrial cycles, without being &quot;downcycled&quot; into low-grade uses (as most &quot;recyclables&quot; now are). \n\nElaborating their principles from experience (re)designing everything from carpeting to corporate campuses, the authors make an exciting and viable case for change.","torrent":{"xt":"urn:btih:e3309b422703d074212551771fa5f67735575346","amp;dn":"Cradle+to+Cradle_+Remaking+the+Way+We+Ma+-+McDonough%2C+William.pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3309b422703d074212551771fa5f67735575346","infoHashBuffer":{"type":"Buffer","data":[227,48,155,66,39,3,208,116,33,37,81,119,31,165,246,119,53,87,83,70]},"announce":[],"urlList":[]}}