{"title":"[Vincent A . LoBrutto]Martin Scorsese A Biography(pdf){Zzzzz}","uid":11440973,"size":2687734,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e35e7670c01a93797c9c28e75438d8bb73f45cb1&amp;dn=%5BVincent+A+.+LoBrutto%5DMartin+Scorsese+A+Biography%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415808067,"description":"Martin Scorsese's current position in the international film community is unrivaled, and his name has become synonymous with the highest standards of filmmaking excellence. He is widely considered America's best living film director, and his Taxi Driver and Raging Bull appear frequently on worldwide surveys of the best films of all time. Here, in the first biographical account of this artist's life, Vincent LoBrutto traces Scorsese's Italian-American heritage, his strict Catholic upbringing, the continuing role of religion in his life and art, his obsessive love of cinema history, and the powerful impact that the streets of New York City had on his personal life and his professional career. Meanwhile, the filmmaker's humble, soft-spoken public persona tells only part of the story, and LoBrutto will delve into the other side of a complex and often tortured personality. Scorsese's intense passion, his private relationships, his stormy marriages, and his battles with drugs and depression are all chronicled here, and, in many cases, for the first time. In addition, the book includes an interview with the director, as well as filmographies cataloging his work as a director, producer, actor, and presenter. As his Best Director award at the 2007 Oscars clearly demonstrated, Scorsese has become something like Hollywood royalty in recent years, finally enjoying the insider status and favor that eluded him for most of his career. But these recent developments aside, Scorsese is also notable as a distinctly American type of artist, one whose work-created in a medium largely controlled by commercialism and marketing-has always been unmistakably his own, and who thus remains a touchstone of artistic integrity in American cinema. In Martin Scorsese: A Biography, readers can examine not only the work of one of the forM's genuine artists, but also the forces that have propelled the man behind it.\n\nReview\n&quot;Engaging, insightful, and wonderfully crafted, this succinct biography of Scorsese captures the essence of the man, the filmmaker, and the film historian. Using a form of intertextuality, LoBrutto demonstrates how Scorsese's Catholic Italian upbringing influenced his filmmaking from the beginning--and still continues to influence it. The author takes the reader on a visceral guided tour of Scorsese's life, beginning with his grandparents' immigration to the US and continuing to the present, noting along the way the critical stages in the filmmaker's development. He links the stages to specific films, showing the impact of Scorsese's dilemmas and personal growth on his filmmaking. Brutally honest, but never judgmental, LoBrutto reveals the man behind the myth, a man of genius plagued by personal struggles and artistic angst. Providing insight into the life and craft of one of the US's greatest filmmakers, this entertaining volume will be an invaluable resource for students of both film history and biography. Essential. All readers, all levels.&quot; - Choice\n\nAbout the Author\nVincent LoBrutto is author of Becoming Film Literate (Praeger, 2005) and Stanley Kubrick: A Biography (1999), one of the seminal Kubrick books. He teaches editing, production design, and cinema studies at the School of Visual Arts in New York City.\n\nPublisher: Praeger Publishers Inc (30 November 2007)\nLanguage: English\nISBN-10: 0275987051\nISBN-13: 978-0275987053","torrent":{"xt":"urn:btih:e35e7670c01a93797c9c28e75438d8bb73f45cb1","amp;dn":"%5BVincent+A+.+LoBrutto%5DMartin+Scorsese+A+Biography%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e35e7670c01a93797c9c28e75438d8bb73f45cb1","infoHashBuffer":{"type":"Buffer","data":[227,94,118,112,192,26,147,121,124,156,40,231,84,56,216,187,115,244,92,177]},"announce":[],"urlList":[]}}