{"title":"Film Noir Classic - Crime in the Streets (1956) Xvid 1cd - Sal M","uid":9495877,"size":734044160,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e3a8abc3e732f96b53500e6ce2d22581ff400a37&amp;dn=Film+Noir+Classic+-+Crime+in+the+Streets+%281956%29+Xvid+1cd+-+Sal+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SaM","files":-1,"time":1390106680,"description":"Film Noir Classic - Crime in the Streets (1956) Xvid 1cd - Sal Mineo, John Cassavetes [DDR]\n\nCrime in the Streets is a 1956 film about juvenile delinquency, directed by Don Siegel and based on a television play written by Reginald Rose. The play first appeared on the Elgin Hour and was directed by Sidney Lumet.\n\nThe film, starring James Whitmore and John Cassavetes, also featured actor Sal Mineo, who had previously appeared in Rebel Without A Cause. From his role in Crime in the Streets, Mineo earned a Hollywood nickname, &quot;The Switchblade Kid.&quot; Malcolm Atterbury, Virginia Gregg and future director Mark Rydell had prominent roles.\n\nSiegel adapted the play to a film by expanding some sequences but keeping much of the same cast. His credited dialogue coach on the film was Sam Peckinpah.\n\n    CAST:-\n    James Whitmore as Ben Wagner\n    John Cassavetes as Frankie Dane\n    Sal Mineo as &quot;Baby&quot; Gioia\n    Virginia Gregg as Mrs. Dane\n    Malcolm Atterbury as McAllister\n    Mark Rydell as Macklin\n\nDirected by Don Siegel\nWritten by Reginald Rose\nMusic by Franz Waxman\nRunning time 91 min.\n\nMOVIE REVIEW:- Crime in the Streets (1956)\nAfter a rumble between New York City street gangs, the Hornets and Dukes, a youth is taken captive and threatened with a zip gun by Lenny Daniels, one of the Hornets. The act is witnessed by a neighbor, McAllister, who tells the cops.\n\nLenny is arrested and sentenced to a year in jail. Hornets leader Frankie Dane decides to get even. Seemingly incorrigible, 18-year-old Frankie resists all efforts to get through to him by social worker Ben Wagner or his worried mother, who was abandoned by Frankie's father when he was eight.\n\nFrankie threatens McAllister, who isn't afraid of Frankie. McAllister even slaps him, then walks away. An angry Frankie then enlists friends Lou Macklin and Angelo &quot;Baby&quot; Gioia to assist in killing McAllister, which frightens Frankie's 10-year-old brother Richie, who overhears the plotting.\n\nBaby's dad slaps Baby and orders, then pleads with him to stop hanging out with the no-good Frankie. An effort is made by Wagner to understand the boys rather than be angry with them, and Richie tells him of Frankie's plans to commit a murder. Wagner talks to Frankie, seemingly to no avail. The three conspirators fake going to bed, (to later use as their alibi) to wait until the agreed upon time to act. McAllister is trapped in an alley at 1:30 in the morning by the three. Richie stops his brother just-in-time, but ends up with a knife held to his throat by angry Frankie, while McAllister and other two run off, as the intended victim yells for help. Wagner appears due to the commotion, and watches as Frankie finally comes to his senses and lets his brother go. He is then accompanied by Wagner to the approaching police.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 91 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]\nDuration: 91 mins","torrent":{"xt":"urn:btih:e3a8abc3e732f96b53500e6ce2d22581ff400a37","amp;dn":"Film+Noir+Classic+-+Crime+in+the+Streets+%281956%29+Xvid+1cd+-+Sal+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3a8abc3e732f96b53500e6ce2d22581ff400a37","infoHashBuffer":{"type":"Buffer","data":[227,168,171,195,231,50,249,107,83,80,14,108,226,210,37,129,255,64,10,55]},"announce":[],"urlList":[]}}