{"title":"The Jasonverse:  Space Academy and Jason of Star Command","uid":4448099,"size":5932772958,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e4078c2addd9f20797177930140d4a98c8a758f1&amp;dn=The+Jasonverse%3A++Space+Academy+and+Jason+of+Star+Command&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DakotaSmith","files":47,"time":1224140423,"description":"Space Academy was a live-action science fiction children&amp;#039;s television program, produced by Filmation and airing on CBS television on Saturday mornings from 1977 to 1979.  A total of fifteen half-hour episodes were produced over two seasons.\n\nThe program starred veteran actor Jonathan Harris (best remembered as Dr. Smith from Lost in Space) as Commander Isaac Gampu, the head of the academy.  The show focused on the adventures of the Academy&amp;#039;s Blue Team, who were Cadet Captain Chris Gentry (Ric Carrott), Chris&amp;#039; sister Cadet Laura Gentry (veteran child star Pamalyn Ferdin), Cadet Adrian (Maggie Cooper), Cadet Tee Gar (Brian Tochi), Cadet Lieutenant Paul Jerome (Ty Henderson), and Cadet Loki (Eric Greene).\n\nThe program also featured a pint-sized robot called Peepo (actually a radio-controlled machine, voiced by Erika Scheimer through a vocoder).\n\nA frequent element in stories was the use and display of telekinesis.  Orders were acknowledged by saying, &quot;ORACO&quot; (&quot;Order[s] Received And Carried Out&quot;).  Characters would punctuation moments of excitement, surprise, or amazement by exclaiming, &quot;Camelopardis!&quot; (derived from the real-world constellation Camelopardalis).\n\n1. The Survivors of Zalon\n2. Castaways in Time and Space\n3. Hide and Seek\n4. Countdown\n5. There&amp;#039;s No Place Like Home\n6. The Rocks of Janus\n7. Monkey Business\n8. The Phantom Planet\n9. Planet of Fire\n10. Life Begins at 300\n11. The Cheat\n12. My Favorite Marcia\n13. Space Hooky\n14. Star Legend\n15. Jonny Sunseed\n\n\n\nJason of Star Command was a live action television show produced by Filmation which ran between 1978 and 1981. The show revolved around the exploits of space adventurer Jason (Craig Littler) and his colleagues, including Professor E.J. Parsafoot (Charlie Dell), Captain Nicole Davidoff (Susan Pratt), Samantha (Tamara Dobson), the Commander (John Russell, second season) and the pocket robot &quot;Wiki&quot; (formally W.1.K.1.).\n\nThe show also starred Sid Haig as the evil Dragos, and, in the first season, James Doohan of Star Trek fame as Commander Canarvin.\n\nThe show was a nominal spin-off of Space Academy.  The asteroid miniature was used for Jason, where Star Command was stated to be &quot;in a secret section of Space Academy&quot;.  Uniforms, sets, and numerous miniatures built for Space Academy were used  in Jason.  The robot Peepo appears in several episodes, and an Academy Seeker spaceship piloted by Cadet Lieutenant Matt Prentiss (John Berwick) from &quot;The Cheat&quot; made brief appearances.  Beyond this, no references were made to the characters or situations in Space Academy.\n\nIts first season was only one of several segments of the program Tarzan and the Super 7.  The episodes were produced in the style of movie serials of the past, telling a single overall story with sixteen &quot;chapters&quot; of approximately fifteen minutes&amp;#039; length, each ending in a cliffhanger.  The second season was a stand-alone, half-hour series.\n\nSeason One:\n1. Attack of the Dragonship\n2. Prisoner of Dragos\n3. Escape from the Dragons\n4. A Cry for Help\n5. Wiki to the Rescue\n6. Planet of the Lost\n7. Marooned in Time\n8. Attack of the Dragons\n9. Peepo&amp;#039;s Last Chance\n10. The Disappearing Man\n11. The Haunted Planet\n12. Escape from Kesh\n13. Return of the Creature\n14. Peepo on Trial\n15. The Trojan Horse\n16. The Victory of Star Command\n\nSeason Two:\n17. Mission to the Stars\n18. Frozen in Space\n19. Web of the Star Witch\n20. Beyond the Stars!\n21. Secret of the Ancients\n22. The Power of the Star Disk\n23. Through the Stargate\n24. Face to Face\n25. Phantom Force\n26. Little Girl Lost\n27. Mimi&amp;#039;s Secret\n28. Battle for Freedom\n\nDocumentary and Effects Demo Reel included","torrent":{"xt":"urn:btih:e4078c2addd9f20797177930140d4a98c8a758f1","amp;dn":"The+Jasonverse%3A++Space+Academy+and+Jason+of+Star+Command","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4078c2addd9f20797177930140d4a98c8a758f1","infoHashBuffer":{"type":"Buffer","data":[228,7,140,42,221,217,242,7,151,23,121,48,20,13,74,152,200,167,88,241]},"announce":[],"urlList":[]}}