{"title":"Agoraphobic Nosebleed - Altered States Of America [2003] + ANbRX","uid":5859935,"size":83019509,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e46c5022466e25c037ee8e37e5f021e49d6809fa&amp;dn=Agoraphobic+Nosebleed+-+Altered+States+Of+America+%5B2003%5D+%2B+ANbRX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":133,"time":1285929006,"description":"Finally, after several EPs and 7&quot;s as well as two full-length albums -- including 2002's widely praised, yet still somewhat uneven Frozen Corpse Stuffed With Dope  -- Agoraphobic Nosebleed has come up with a release that fully realizes the potential they've shown all along. This time out, they've remedied the slight faults of their past releases, such as the occasionally non-descript songwriting of Honkey Reduction and the herky-jerky editing and song sequencing on Frozen Corpse..., meanwhile upping the ridiculousness quotient by slapping no fewer than 100 tracks (one of which is hidden) on this cute little 3&quot; CD. The &quot;songs&quot; here are rapid-fire bursts that, despite their brevity, do not feel fragmented or incomplete. Each track has a place in the bigger picture of this disc, which is a constantly shifting barrage of grindcore blasts, noise interludes, voice samples, and other brief soundbites. The song sequencing is tight and precise, while the band's trademark harsh, boxy drum-machine programming sounds better than ever here, bringing to mind old Godflesh  at 380 miles per hour. Finally, the lyrics are (mostly) right on target as well (i.e., they're demented enough to keep pace with the music), including lots of over-the-top bits about religious cults, paranoid drug conspiracies, and bizarre sex practices. (As on Frozen Corpse..., there is some problematic ranting about homosexuals here, mainly on the track &quot;Black Metal Transvestite,&quot; but it's hard to know how to take that in the context of all the other shocking lyrics.) In any case, this is Agoraphobic Nosebleed's most accomplished release to date, and despite being released on a 3&quot; disc, this 21-plus-minute program is still very much a full-length by grindcore's compressed-time standards. Put simply, there's not a dull moment to be found here. \n4/5\n\n-William York, Allmusic\n\nThis torrent includes the remix disk &quot;ANbRX Pharmaceuticals II&quot;, by Delta 9, which is amazing.","torrent":{"xt":"urn:btih:e46c5022466e25c037ee8e37e5f021e49d6809fa","amp;dn":"Agoraphobic+Nosebleed+-+Altered+States+Of+America+%5B2003%5D+%2B+ANbRX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e46c5022466e25c037ee8e37e5f021e49d6809fa","infoHashBuffer":{"type":"Buffer","data":[228,108,80,34,70,110,37,192,55,238,142,55,229,240,33,228,157,104,9,250]},"announce":[],"urlList":[]}}