{"title":"Gerry Mulligan - 2006 - Supreme Jazz (SACD 24 88.2) FLAC","uid":9166659,"size":1274668713,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e5301444934a839239a1e70bbb535041771f4630&amp;dn=Gerry+Mulligan+-+2006+-+Supreme+Jazz+%28SACD+24+88.2%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"eika256","files":-1,"time":1383998197,"description":"Gerry Mulligan - 2006 - Supreme Jazz\nSACD 24 bits, 88.2 KHz\n\nThe most famous and probably greatest jazz baritonist of all time, Gerry Mulligan was a giant. A flexible soloist who was always ready to jam with anyone from Dixielanders to the most advanced boppers, Mulligan brought a somewhat revolutionary light sound to his potentially awkward and brutal horn and played with the speed and dexterity of an altoist.\nMulligan started on the piano before learning clarinet and the various saxophones. His initial reputation was as an arranger. In 1944 he wrote charts for Johnny Warrington's radio band and soon was making contributions to the books of Tommy Tucker and George Paxton. He moved to New York in 1946 and joined Gene Krupa's Orchestra as a staff arranger; his most notable chart was &quot;Disc Jockey Jump.&quot; The rare times he played with Krupa's band was on alto and the same situation existed when he was with Claude Thornhill in 1948.\nGerry Mulligan's first notable recorded work on baritone was with Miles Davis' Birth of the Cool nonet (1948-50) but once again his arrangements (&quot;Godchild,&quot; &quot;Darn That Dream&quot; and three of his originals &quot;Jeru,&quot; &quot;Rocker&quot; and &quot;Venus de Milo&quot;) were more significant than his short solos. Mulligan spent much of 1949 writing for Elliot Lawrence's orchestra and playing anonymously in the saxophone section. It was not until 1951 that he began to get a bit of attention for his work on baritone. Mulligan recorded with his own nonet for Prestige, displaying an already recognizable sound. After he traveled to Los Angeles, he wrote some arrangements for Stan Kenton (including &quot;Youngblood,&quot; &quot;Swing House&quot; and &quot;Walking Shoes&quot;), worked at the Lighthouse and then gained a regular Monday night engagement at the Haig. Around this time Mulligan realized that he enjoyed the extra freedom of soloing without a pianist. He jammed with trumpeter Chet Baker and soon their magical rapport was featured in his piano-less quartet. The group caught on quickly in 1952 and made both Mulligan and Baker into stars.\nA drug bust put Mulligan out of action and ended that quartet but, when he was released from jail in 1954, Mulligan began a new musical partnership with valve trombonist Bob Brookmeyer that was just as successful. Trumpeter Jon Eardley and Zoot Sims on tenor occasionally made the group a sextet and in 1958 trumpeter Art Farmer was featured in Mulligan's Quartet. Being a very flexible player with respect for other stylists, Mulligan went out of his way to record with some of the great musicians he admired. At the 1958 Newport Jazz Festival he traded off with baritonist Harry Carney on &quot;Prima Bara Dubla&quot; while backed by the Duke Ellington Orchestra, and during 1957-60 he recorded separate albums with Thelonious Monk, Paul Desmond, Stan Getz, Ben Webster and Johnny Hodges. Mulligan played on the classic Sound of Jazz television special in 1958 and appeared in the movies I Want to Live and The Subterraneans.\nDuring 1960-64 Mulligan led his Concert Jazz Band which gave him an opportunity to write, play baritone and occasionally double on piano. The orchestra at times included Brookmeyer, Sims, Clark Terry and Mel Lewis. Mulligan was a little less active after the big band broke up but he toured extensively with the Dave Brubeck Quartet (1968-72), had a part-time big band in the 1970s (the Age of Steam), doubled on soprano for a period, led a mid-'70s sextet that included vibraphonist Dave Samuels, and in 1986 jammed on a record with Scott Hamilton. In the 1990s he toured the world with his excellent &quot;no-name&quot; quartet and led a &quot;Rebirth of the Cool Band&quot; that performed and recorded remakes of the Miles Davis Nonet classics. Up until the end, Gerry Mulligan was always eager to play.\nAmong Mulligan's compositions were &quot;Walkin' Shoes,&quot; &quot;Line for Lyons,&quot; &quot;Bark for Barksdale,&quot; &quot;Nights at the Turntable,&quot; &quot;Utter Chaos,&quot; &quot;Soft Shoe,&quot; &quot;Blueport,&quot; &quot;Song for Strayhorn,&quot; &quot;Song for an Unfinished Woman&quot; and &quot;I Never Was a Young Man&quot; (which he often sang). He recorded extensively through the years for such labels as Prestige, Pacific Jazz, Capitol, Vogue, EmArcy, Columbia, Verve, Milestone, United Artists, Philips, Limelight, A&amp;M, CTI, Chiaroscuro, Who's Who, DRG, Concord and GRP. (AllMusic)\n\nTrack list:\n01. So What\nMarch 15. 1950, Gerry Mulligan (bar), Zoot Sims (ts), Charlie Kennedy (as), J.J. Johnson, Kai Winding (tb), Tony Aless (p), Chubby Jackson (b), Don Lamond (d)\n02. Mullenium\nNew York. August 27. 1951, Gerry Mulligan (bar), Ollie Wilson (tb), Jerry Hurwitz, Nick Travis (tp), Max Me Elroy (bar)(2nd baritone solo), Allen Eager (ts), George Wallington (p), Phil Leshin (b), Walter Bolden (d), Gail Madden (maracas)\n03. Soft Shoe\nLos Angeles. October 15-16. 1952, Chet Baker (tp), Gerry Mulligan (bar), Jimmy Rowles (p), Bobby Whitlock (b)\n04. Turnstile\nLos Angeles. January 9. 1953. same: Carson Smith (b)\n05. Five Brothers\nLos Angeles. Mav 20. 1953, Gerry Mulligan (bar), Chet Baker (tp), Carson Smith (b), Larry Bunker (d)\n06. Westwood Walk\n07. Flash\n08. A Ballad\n09. Ontet\n10. Half Nelson\n11. Walkin Shoes\n12. Simbah\n13. Speak Low\n14. Taking A Chance On Love\n15. Varsity Drag\n16. Lady Bird\n17. Love Me Or Leave Me\n18. Swing House\n19. Rocker\nRecorded 1953\n20. Line For Lyons\n21. Limelight\nGerry Mulligan (bar), Lionel Hampton (vib), Hank Jones (p), Bucky Pizzarelli (b), Grady Tate (d), Candidi Camero (conga drums)\n\nEnjoy and share!","torrent":{"xt":"urn:btih:e5301444934a839239a1e70bbb535041771f4630","amp;dn":"Gerry+Mulligan+-+2006+-+Supreme+Jazz+%28SACD+24+88.2%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5301444934a839239a1e70bbb535041771f4630","infoHashBuffer":{"type":"Buffer","data":[229,48,20,68,147,74,131,146,57,161,231,11,187,83,80,65,119,31,70,48]},"announce":[],"urlList":[]}}