{"title":"Carole Garibaldi Rogers - Habits of Change. An Oral History of A","uid":9940047,"size":1782287,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5584c2d3e3d7485f41d5935cfac1e3f210ecd85&amp;dn=Carole+Garibaldi+Rogers+-+Habits+of+Change.+An+Oral+History+of+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1397226205,"description":"Description\nProduct Details\nBook Title: Habits of Change: An Oral History of American Nuns (Oxford Oral History Series)\t\nBook Author: Carole Garibaldi Rogers (Author)\nSeries: Oxford Oral History Series\nPaperback: 344 pages\nPublisher: Oxford University Press, USA; Reprint edition (June 1, 2011)\nLanguage: English\nISBN-10: 0199757062\nISBN-13: 978-0199757060\n\nA collection of extraordinary oral histories of American nuns, Habits of Change captures the experiences of women whose lives over the past fifty years have been marked by dramatic transformation. Bringing together women from more than forty different religious communities, most of whom entered religious life before Vatican II, the book shows how their lives were suddenly turned around in the 1960s--perhaps more so than any other group of contemporary women. Here these women speak of their active engagement in the events that disrupted their church and society and of the lives they lead today, offering their unique perspective on issues such as peace activism, global equality for women, and the clergy sexual abuse crisis. The interviewees include a Maryknoll missionary who spent decades in Africa, most recently in the Congo; an inner-city art teacher whose own paintings reflect the vibrancy of Haiti; a recovering alcoholic who at age 71 has embarked on her fourth ministry; a life-long nurse, educator, and hospital administrator; and an outspoken advocate for the gay and lesbian community. Told with simplicity, honesty, and passion, their stories deserve to be heard.\n\nReviews\n&quot;Rogers has conducted an amazing series of interviews with female members of more than 40 different religious communities, weaving them into a vibrant tapestry reflecting the spiritual continuities and the corporeal changes that have defined their lives and their work during the past 50 years.&quot; - Booklist\n\n&quot;Rogers's richly detailed oral history will be welcomed by all who seek a deeper understanding of women's religious sommunities; those who are exploring such a life for themselves will find the answers they seek in these frank, honest, and moving stories.&quot; - Foreword\n\n&quot;Throught skillful editing of much longer narratives, the author offers readers a realistic and poignant portrayal of the 'uncommon change' sisters experienced from the 1960'd to the present.&quot;--Katarina Schuth, America\n\n&quot;A rare insight into religious life for women as seen through the eyes of the women themselves...a welcome addition to the history of women religious in the United States.&quot;--Theological Studies\n\nAbout the Author\nCarole Garibaldi Rogers has been an oral historian for more than 20 years. Her research and writing focus on the intersection of women and religion.\n","torrent":{"xt":"urn:btih:e5584c2d3e3d7485f41d5935cfac1e3f210ecd85","amp;dn":"Carole+Garibaldi+Rogers+-+Habits+of+Change.+An+Oral+History+of+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5584c2d3e3d7485f41d5935cfac1e3f210ecd85","infoHashBuffer":{"type":"Buffer","data":[229,88,76,45,62,61,116,133,244,29,89,53,207,172,30,63,33,14,205,133]},"announce":[],"urlList":[]}}