{"title":"Pokemon Movie Collectie (1999-2011) DVDRip NL gesproken DutchRel","uid":6576202,"size":15552768500,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e59abe39368d940552074a1f5f6d26c2580a8267&amp;dn=Pokemon+Movie+Collectie+%281999-2011%29+DVDRip+NL+gesproken+DutchRel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"Koedje","files":-1,"time":1312205105,"description":"Dutch Audio, no subtitles\n\n\n\n &lt;a href=&quot;\nhttp://img88.imageshack.us/img88/6295/pokemon13a.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img88.imageshack.us/img88/6295/pokemon13a.jpg&lt;/a&gt;\n\n\nPlot:\n\nIn de serie volgen we een jongen genaamd Ash, die woont in het dorp Pallet Town. Toen hij 10 jaar werd mocht hij voor het eerst trainer van PokÃƒÂ©mon worden, en zijn eerste PokÃƒÂ©mon ophalen bij Professor Oak. Maar hij verslaapt zich en komt te laat om uit ÃƒÂ©ÃƒÂ©n van de starters (Bulbasaur, Charmander en Squirtle) te kiezen. Omdat hij toch heel graag aan zijn PokÃƒÂ©monreis wil beginnen, krijgt hij van Professor Oak uiteindelijk toch een PokÃƒÂ©mon mee: Pikachu. Deze PokÃƒÂ©mon is echter niet bepaald gehoorzaam, en het zal een moeilijke taak voor Ash worden om zijn vertrouwen te winnen. Zal het hem lukken met Pikachu vriendschap te sluiten en genoeg gymgevechten winnen om de PokÃƒÂ©mon League te bereiken?\n\n\nOverige informatie;\n\nSinds PokÃƒÂ©mon 4-Ever worden de PokÃƒÂ©monfilms in Nederland niet meer door de oorspronkelijke uitgever Warner Bros uitgebracht. De nieuwe distributeur stapte over op een andere, goedkopere nasynchronisatiestudio, wat zijn weerslag had op de serie. De studio nam niet de moeite met de originele cast contact op te nemen, en werd dus in 4-Ever tot ongenoegen van fans bijna de hele cast vervangen door andere stemacteurs. De enige 'bekende' stemmen die nog overbleven waren Christa Lips (Ash) en Marlies Somers (Misty). PokÃƒÂ©mon was voordien een kwalitatief goede Nederlandse dub.\n\nOok de vervanging van zanger Herman van Doorn beviel de fans niet, en de titelsong werd belabberd vertaald. Ook Nederlandse filmkritieken hamerden totaal op de nasynchronisatie: een film met een goede boodschap, maar een belabberde nasynchronisatie waar waarschijnlijk simpelweg een veel te klein budget voor is vrijgesteld. Op Nederlandse fora werd pas echt geklaagd toen in de vijfde film (Heroes) ook de stemmen van hoofdkarakters Ash en Misty veranderden. De verkoopcijfers van de dvd's daalden.\n\nMaar dit ging echter verder dan alleen geldbesparing; op sommige punten in de films zijn Engelse stemmen te horen, terwijl men de Nederlandse stemmen moet horen. Men hoort de Nederlandse audiotrack met op de achtergrond de Engelse stemmen, of gewoon scÃƒÂ©nes waar helemaal geen stemmen te horen zijn, terwijl wel de lipbewegingen te zien zijn.\n\nEind 2007 nam de situatie echter een ommekeer. De films beleven voortaan niet hun premiÃƒÂ¨re op dvd, maar televisiezender Jetix brengt eerst de nieuwste films naar televisie. Dit bracht mee als resultaat dat de nasynchronisatie weer van hoge kwaliteit was en de - voor de fans - oude, vertrouwde cast van de tekenfilmserie ook weer in de films te horen waren. Voor de muziek betekende dit niet langer een belabberde vertaling of gewoon onvertaalde nummers, maar een volledig Nederlandstalige soundtrack met onder andere zanger Herman van Doorn.\n\nIn 2008 nam het verhaal nog een laatste wending. Het Amerikaanse concern achter de serie, de PokÃƒÂ©mon Company, besloot de gehele PokÃƒÂ©mon reeks (televisieserie, films en specials) voor de Nederlandse nasynchronisatie onder te brengen bij ÃƒÂ©ÃƒÂ©n studio: Sun Studio.\n\n\nMeer informatie: \n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Pok%C3%A9mon_%28anime%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Pok%C3%A9mon_%28anime%29&lt;/a&gt;\n\n\nDeze collectie bevat de volgende films:\n\nPokÃƒÂ©mon De Film: Mewtwo tegen Mew\nPokÃƒÂ©mon 2: Op eigen kracht\nPokÃƒÂ©mon 3: In de Greep van Unown\nPokÃƒÂ©mon 4Ever\nPokÃƒÂ©mon 5: Helden\nPokÃƒÂ©mon 6: Jirachi, Droomtovenaar\nPokÃƒÂ©mon 7: Doel Deoxys\nPokÃƒÂ©mon 8: Lucario en het Mysterie van Mew\nPokÃƒÂ©mon 9: PokÃƒÂ©mon Ranger en de Tempel van de Zee\nPokÃƒÂ©mon 10: De Opkomst van Darkrai\nPokÃƒÂ©mon 11: Giratina en de Krijger van de Lucht\nPokÃƒÂ©mon 12: Arceus en het Juweel des Levens\nPokÃƒÂ©mon: Zoroark: Meester der Illusie\n\n\n\nNiet alle films zijn DVDRips, films nr. 9, 12 en 13 zijn TVrips.","torrent":{"xt":"urn:btih:e59abe39368d940552074a1f5f6d26c2580a8267","amp;dn":"Pokemon+Movie+Collectie+%281999-2011%29+DVDRip+NL+gesproken+DutchRel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e59abe39368d940552074a1f5f6d26c2580a8267","infoHashBuffer":{"type":"Buffer","data":[229,154,190,57,54,141,148,5,82,7,74,31,95,109,38,194,88,10,130,103]},"announce":[],"urlList":[]}}