{"title":"Vitamins and Minerals{BBS}","uid":6739550,"size":2354324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e63a89f78d4fd6d5c5acd3f73229d1a1b09d6c47&amp;dn=Vitamins+and+Minerals%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1318443752,"description":"When it comes to vitamins and health supplements, some blithely assume that &quot;more is better&quot; or &quot;if it is over the counter, it must be safe.&quot; But making these assumptions can be a serious mistake. For example, an excess of iron can contribute to coronary artery disease; melatonin may increase the risk of seizures in patients with epilepsy.\nProduct Description\n\nAn endless array of vitamin and mineral supplements are available to health-conscious consumers today, and an increasing number of individuals have incorporated these supplements into their daily routines. Unfortunately, their use is often inspired by rumor rather than sound medical advice. The results of clinical research on these supplements' effectiveness are often inconclusive while some studies have even shown negative health effects from overuse. Instead of relying on media hype and often-conflicting &quot;word-of-mouth&quot; information, people who take nutritional supplements need an authoritative, evidence-based reference text about self-medication with vitamins and minerals. Dr. Zina Kroner has provided exactly that.\n\nVitamins and Minerals is an eye-opening guide that separates truth from myth about dozens of today's common and popular supplements. It covers the effects of the deficiency of each nutrient, its primary uses, dosages, food sources, potential side effects, and mechanism of action, helping readers make informed decisions about use of these under-regulated, over-the-counter &quot;nutraceuticals.&quot;\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 383 pages\n    * Publisher: Greenwood (April 8, 2011)\n    * Language: English\n    * ISBN-10: 0313382247\n    * ISBN-13: 978-0313382246","torrent":{"xt":"urn:btih:e63a89f78d4fd6d5c5acd3f73229d1a1b09d6c47","amp;dn":"Vitamins+and+Minerals%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e63a89f78d4fd6d5c5acd3f73229d1a1b09d6c47","infoHashBuffer":{"type":"Buffer","data":[230,58,137,247,141,79,214,213,197,172,211,247,50,41,209,161,176,157,108,71]},"announce":[],"urlList":[]}}