{"title":"Seven Elements That Have Changed The World by John Browne","uid":10047075,"size":9298827,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e664fcc6016b86efdda8938dd3f4095ffda2bc0d&amp;dn=Seven+Elements+That+Have+Changed+The+World+by+John+Browne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":1,"time":1398548885,"description":"\nSeven Elements That Have Changed The World: Iron, Carbon, Gold, Silver, Uranium, Titanium, Silicon by John Browne\n\n\nHumans have put the Earth's resources to extraordinary use. Carbon provides us with heat, light and mobility at the flick of a switch. From silver came photography, the preservation of memories, and a task which for centuries was confined to painters, sketchers and our imaginations. Silver in turn was eventually replaced by silicon, an element which enables us to communicate and transmit information across the globe in an instant. \n\nBut our use of the Earth's resources is not always for the benefit of humankind. Our relationship with the elements is one of great ambivalence. \nUranium produces both productive nuclear power and destructive atomic bombs; iron is the bloody weapon of war, but also the economic tool of peace; our desire for alluring gold is the foundation of global trade, but has also led to the death of millions. This book vividly describes how seven key elements have shaped the world around us - for good and for bad.\n \nSeven Elements takes you on an adventure of human passion, ingenuity and discovery. This journey is far from over: we continue to find surprising new uses for these seven elements. Discover how titanium pervades modern consumer society; how natural gas is transforming the global energy sector; and how an innovative new form of carbon could be starting a technological revolution.\n\nGenre: Non Fiction , Science","torrent":{"xt":"urn:btih:e664fcc6016b86efdda8938dd3f4095ffda2bc0d","amp;dn":"Seven+Elements+That+Have+Changed+The+World+by+John+Browne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e664fcc6016b86efdda8938dd3f4095ffda2bc0d","infoHashBuffer":{"type":"Buffer","data":[230,100,252,198,1,107,134,239,221,168,147,141,211,244,9,95,253,162,188,13]},"announce":[],"urlList":[]}}