{"title":"Travis - The Invisible Band [24 bit FLAC] vinyl","uid":8312930,"size":2031905206,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e6a64ce62b537a278e31b837f11abe87545ef68b&amp;dn=Travis+-+The+Invisible+Band+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"24.96","files":-1,"time":1364517390,"description":"  Travis - The Invisible Band (2001) [24 bit FLAC] vinyl\n\n  Released: 2001\n  Source: ISOM 25LP / UK\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 192,000 Hz\n\n  A1. Sing \n  A2. Dear Diary \n  A3. Side \n  A4. Pipe Dreams \n  A5. Flowers In The Windows \n  A6. The Cage \n  B1. Safe \n  B2. Follow The Light \n  B3. Last Train \n  B4. Afterglow \n  B5. Indefinitly \n  B6. The Humpty Dumpty Love Song\n\n  After the momentous success achieved with their sophomore effort (The Man Who), Travis' return to melodic rock &amp; roll with The Invisible Band is once again personal and earnest. Having spent most of 2000 supporting Oasis and playing their own headlining gigs in the States, Travis remained humble while collecting a dozen solid tracks for another album, most of them plucked from Fran Healy's own humming and tinkering around with an acoustic. The Invisible Band finds Nigel Godrich (Radiohead, Beck, Neil Finn) mixing and mastering again, and vulnerability found within these songs is what makes Travis a decent band. They are not afraid to be catchy and they're certainly suckers for a sweet love tune. But Travis is conscious of the unconscious and reflects any kind of lyrical emotion. Debut single &quot;Sing&quot; is charming while addressing inhibitions within a relationship. The banjo is a nice touch, for it becomes a mainstay throughout and adds a slightly different touch versus the simplicities of an acoustic. &quot;Side&quot; and &quot;Flowers in the Window&quot; are instantly endearing with their Beatlesque hooks, but &quot;The Humpty Dumpty Love Song&quot; is Travis' finest moment of musical clarity with Healy's heart on his sleeve. Written while on tour with Oasis, &quot;The Humpty Dumpty Love Song&quot; reflects a hero's fading fervor of love lost -- &quot;All the kings horses and all the kings men/Couldn't pull my heart back together again/All the physicians and mathematicians too/Failed to stop my heart from breaking in two.&quot; Indeed, Travis is the basic man's poets and The Invisible Band plays toward the simplicities of humility. They've done it again, but with more internal charisma. The Man Who took them from indie angst to melodic humdrum. The Invisible Band perfects the ever-changing growth within the band for something great.","torrent":{"xt":"urn:btih:e6a64ce62b537a278e31b837f11abe87545ef68b","amp;dn":"Travis+-+The+Invisible+Band+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6a64ce62b537a278e31b837f11abe87545ef68b","infoHashBuffer":{"type":"Buffer","data":[230,166,76,230,43,83,122,39,142,49,184,55,241,26,190,135,84,94,246,139]},"announce":[],"urlList":[]}}