{"title":"Kolberg (1945)","uid":6258780,"size":1651687804,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e6bdfbd117a3df6355d11bf6bba89f8f0abfacc3&amp;dn=Kolberg+%281945%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"CaptButler","files":10,"time":1300680186,"description":"CAPT. BUTLER PRESENTS:\tKolberg (1945).MP4\n\nFILE INFO\n\nFILES:\t\t10\nSIZE:\t\t1.53 GB (film 1.50 GB)\nAUDIO:\t\tAAC LC\nVIDEO:\t\tH.264/AVC MPEG-4\nASPECT RATIO:\t1.33 : 1  (1.37 : 1 original)\nRESOLUTION:\t640 x 480\nFPS:\t\t29.97\nBITRATE:\t1861 Kbps (V) / 152 Kbps (A)\nSOURCE:\t\tDVD rip (NTSC)\n\nTHE FILM\n\nTITLE:\t\tKolberg\nYEAR:\t\t1945\nGENRE:\t\tWar\nCOUNTRY:\tGermany\nRUNTIME:\t1:47:10\nLANGUAGE:\tGerman / French\nSUBS:\t\tEnglish (hardcoded)\nCOLOR:\t\tAgfacolor\nDIRECTOR:\tVeit Harlan, Wolfgang Liebeneiner\nSCREENPLAY:\tAlfred Braun, Veit Harlan, Josef Goebbels, Thea von Harbou\nCINEMATOGRAPHY:\tBruno Mondi\nCAST:\t\tHeinrich George, Kristina Soederbaum, Paul Wegener, Horst Caspar\n\t\tGustav Diessl, Otto Wernicke, Kurt Meisel, Heinz Lausch\nSTUDIO:\t\tUFA\nIMDb PAGE:\thttp://www.imdb.com/title/tt0036989/\nSYNOPSIS:\tThe film tells the &quot;historical&quot; story of Napoleon's 1807 siege of Kolberg, a Baltic coast city then in the Pomerania district of the old Germanic kingdom of Prussia.  The film plays fast and loose with historical fact, but no more than a Hollywood film of the 1940s.  Though undoubtedly a Nazi propaganda piece, the film is not what you would expect; there are many myths and misconceptions about it.  One is director Veit Harlan's absurd claim that nearly 180,000 Wehrmacht troops were diverted from the eastern front to be used as \nextras.  The prevailing estimate today is between 10,000 to 20,000, but even this may well be inflated.  There is no doubt, however, that Propaganda Minister Josef Goebbels was much involved in the writing and editing, and that major resources were put into the production, the last major release in the Third Reich.  It is not a celebration of the Nazi cult of death as some suppose.  In fact, Goebbels found the initial cut of the film to be too violent and graphic and caused many shots to be deleted.  If the film has any coherent message at all, it seems to be one of defiance and survival in the face of overwhelming odds.  It is not anti-Semitic or anti-Slavic; the Russians are barely mentioned in the film, the Jews not at all.\n\n\tTechnically speaking the film is up to the highest standards for the time; the battle sequences in particular are rather well done.  Regardless of whatever Goebbels intended, the film had practically no effect on the German public.  When it was released in January 1945, there were few cinemas left in Germany due to Allied bombing.  Also, the real Kolberg (now Kolobrzeg, Poland) had just fallen to the Red Army.  It is what it is.\n\nNOTE:\tThanks to the uploader of the ISO.  This is a corrected torrent.  The names and content of the folder and files have not been changed since the original torrent was posted.","torrent":{"xt":"urn:btih:e6bdfbd117a3df6355d11bf6bba89f8f0abfacc3","amp;dn":"Kolberg+%281945%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6bdfbd117a3df6355d11bf6bba89f8f0abfacc3","infoHashBuffer":{"type":"Buffer","data":[230,189,251,209,23,163,223,99,85,209,27,246,187,168,159,143,10,191,172,195]},"announce":[],"urlList":[]}}