{"title":"Suzanne Bell - The Facts on File Dictionary of Forensic Science.","uid":8120925,"size":5934492,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6cb3ac1432259333579ee48a6b3e4a16d03fc6c&amp;dn=Suzanne+Bell+-+The+Facts+on+File+Dictionary+of+Forensic+Science.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SectorVector","files":1,"time":1360401956,"description":"The Facts on File Dictionary of Forensic Science\n(Facts on File Science Dictionary) \n\nSuzanne Bell, Ph.D.\n\nJune 2004\n\n278 pages.\n\n\nAbout the author:\n\nDr. Bell's adventure in forensic chemistry began a long time\nago in a galaxy far to  the west of West Virginia. She began\nwith  a BS  with  a  double major  in  chemistry and  police\nscience(criminal justice)at Northern Arizona University. She\nthen ventured to the University  of New Haven in Connecticut\nand obtained an  MS in forensic science .  After working for\nthe New Mexico State Police  for several years, she ventured\nnorth to  Los Alamos  National Laboratory  where she  was an\nenvironmental analytical chemist. She returned to university\nat the  ripe old  age of  29 at New  Mexico State  where she\nobtained  her  PhD  in  chemistry  working  under  Dr.  Gary\nEiceman. Incidentally,  three of  the four  research schools\nshe has been  affiliated with have colors of  blue and gold,\nas was her junior high school.  This could be fate, it could\nbe destiny, or it could be coincidence.\n\nSuzanne's love of writing began  about the time when she was\nat NMSU, where the pressures  of the doctoral program forced\nher to  seek an outlet. She  is the author of  much mediocre\nand unpublished fiction and the joy  she found in the act of\nwriting led her to test the non-fiction and textbook waters.\nCurrently, she  has two projects underway  in various stages\nof completion in addition to the books seen here.\n\nSource:\n\n-_-","torrent":{"xt":"urn:btih:e6cb3ac1432259333579ee48a6b3e4a16d03fc6c","amp;dn":"Suzanne+Bell+-+The+Facts+on+File+Dictionary+of+Forensic+Science.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6cb3ac1432259333579ee48a6b3e4a16d03fc6c","infoHashBuffer":{"type":"Buffer","data":[230,203,58,193,67,34,89,51,53,121,238,72,166,179,228,161,109,3,252,108]},"announce":[],"urlList":[]}}