{"title":"Norwegian Sweater Techniques for Today's Knitter","uid":9217362,"size":24314587,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e70e32c6a04f017e33bdb2d4f6ad30afbade71b8&amp;dn=Norwegian+Sweater+Techniques+for+Today%27s+Knitter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1384881496,"description":"Norwegian sweater construction is demystified in this one-of-a-kind, workshop-based book Often considered intimidating and complex, Norwegian sweater construction is simplified in this one-of-a-kind, step-by-step book. You'll get all the skills and confidence you need to tackle any Norwegian sweater plus 20 patterns to make modern garments! Beginning with a look at color stranded knitting methods, Norwegian Sweater Techniques progresses on to the various types of Norwegian pattern graphs (and how they can differ from Fair Isle patterns). An emphasis is given to the use of &quot;cutting stitches&quot; for cardigans and armholes, along with measuring for armholes, sewing along the sides of the cutting stitches, and cutting the fabric to create these openings. Patterns utilize the advantages of Norwegian construction and apply them to non-traditionally Norwegian garments Detailed color photos and drawings provide additional guidance Norwegian techniques yield sturdier construction and a more versatile skill set Norwegian sweaters have been popular for centuries, and it's no wonder-they're classic, warm, and often feature beautiful colorwork. Now you &quot;cut without fear&quot; and create your very own pieces employing these time-honored techniques.","torrent":{"xt":"urn:btih:e70e32c6a04f017e33bdb2d4f6ad30afbade71b8","amp;dn":"Norwegian+Sweater+Techniques+for+Today%27s+Knitter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e70e32c6a04f017e33bdb2d4f6ad30afbade71b8","infoHashBuffer":{"type":"Buffer","data":[231,14,50,198,160,79,1,126,51,189,178,212,246,173,48,175,186,222,113,184]},"announce":[],"urlList":[]}}