{"title":"Trust Company - Discography","uid":4385365,"size":129193138,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e781a5d38719c39627d4b9e59cde1d800fea11da&amp;dn=Trust+Company+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Justusintejesus","files":49,"time":1220892665,"description":"&quot;Formed in 1997,disbanded in 2005 and came back together in 2007, TRUSTcompany came together through vocalist Kevin Palmer and drummer Jason Singleton. Originally called 41 Down, the band then recruited bassist Josh Moates and guitarist James Fukai. After building a local fanbase, the band went on to sign a major label deal with Geffen Records. After being signed, the band changed their name to TRUSTcompany so they would not be confused with the Canadian band Sum 41.\t\n\nThe band released their debut album The Lonely Position of Neutral on July 23, 2002. The album was well received with the lead single 'Downfall' gaining heavy exposure through MTV2's Headbanger's Ball. Subsequently, the song entered the Billboard Hot 100 singles charts. The album's second single 'Running From Me' followed with more moderate success. The album was certified gold by the RIAA, and the band went on to tour with artists such as 30 Seconds to Mars and Papa Roach. They also toured with KoRn and Disturbed as part of the Pop Sux Tour in 2002.\n\nTRUSTcompany belatedly released their second album True Parallels on March 22, 2005, after an 8-10 month delay. Despite little promotion from their label, the album entered the Billboard album charts at #32, and has gone on to sell in excess of 200,000 copies. The first and only single from the album, 'Stronger', made a moderate impact on mainstream rock radio. According to drummer Jason Singleton on the band's website message board, the second single may have been 'The War is Over'.&quot;\n\n\n\n\nSeed after downloaded, otherwise no one else will have the chance to enjoy!\n","torrent":{"xt":"urn:btih:e781a5d38719c39627d4b9e59cde1d800fea11da","amp;dn":"Trust+Company+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e781a5d38719c39627d4b9e59cde1d800fea11da","infoHashBuffer":{"type":"Buffer","data":[231,129,165,211,135,25,195,150,39,212,185,229,156,222,29,128,15,234,17,218]},"announce":[],"urlList":[]}}