{"title":"Brian McGreevy - Hemlock Grove","uid":12836706,"size":310694213,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e8b3f20d13841dbe7c5863f1c9e9dcfaaf41f49b&amp;dn=Brian+McGreevy+-+Hemlock+Grove&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":4,"time":1448464318,"description":"\nHemlock Grove ( or, The Wise Wolf )\r\n\r\nA charismatic young writer reinvents the gothic novel, bringing a fresh energy to our darkest myths and deepest horrors in an expectation-defying tale of adolescent deception, ravenous violence, and rumors of werewolves.\r\n\r\nThe body of a young girl is found mangled and murdered in the woods of Hemlock Grove, Pennsylvania, in the shadow of the abandoned Godfrey Steel Mill. A manhunt ensues - though the authorities aren’t sure if it's a man they should be looking for.\r\n\r\nSome suspect an escapee from the White Tower, a foreboding biotech facility owned by the Godfrey family, where some suspect that biological experiments of the most unethical kind take place. Others turn to Peter Rumancek, a Gypsy trailer-trash kid who has told impressionable high-school classmates that he’s a werewolf. Or perhaps it’s Roman, the son of the late JR Godfrey, who rules the adolescent social scene with the casual arrogance of a cold-blooded aristocrat, his superior status unquestioned - despite his decidedly freakish sister, Shelley, whose monstrous medical conditions belie a sweet intelligence, and his otherworldly, sexy control-freak of a mother, Olivia.\r\n\r\nAs the crime goes unsolved and the police seem more and more willing to believe any outlandish rumor, Peter and Roman decide the only way to save their own skins is to find the killer themselves. Along the way they uncover local secrets and designs that are much bigger than some small-town murder.\r\n\r\nHemlock Grove is an exhilarating reinvention of the gothic novel, inspired by the iconic characters of our greatest myths and nightmares. At once a riveting mystery and a fascinating revelation of the grotesque and darkness within, Hemlock Grove has the architecture and energy to become a classic in its own right - and Brian McGreevy, the talent and ambition to enthrall us for years to come.\r\n\r\nBrian McGreevy grew up near Pittsburgh and received his MFA from the Michener Center for Writers at the University of Texas. Now a screenwriter who has had two screenplays featured on the best of the year Black List, he is working on an adaptation of Dracula for Leonardo DiCaprio’s production company. He lives in Los Angeles.\r\n\r\n\r\nRead by Sean Runnette\r\nFormat: MP3","torrent":{"xt":"urn:btih:e8b3f20d13841dbe7c5863f1c9e9dcfaaf41f49b","amp;dn":"Brian+McGreevy+-+Hemlock+Grove","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8b3f20d13841dbe7c5863f1c9e9dcfaaf41f49b","infoHashBuffer":{"type":"Buffer","data":[232,179,242,13,19,132,29,190,124,88,99,241,201,233,220,250,175,65,244,155]},"announce":[],"urlList":[]}}