{"title":"Network Addon Mod (NAM) for SimCity 4 v30","uid":6853442,"size":23474609,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e8b4d6a365d5f5822c3d61af6de70847d7e83ae0&amp;dn=Network+Addon+Mod+%28NAM%29+for+SimCity+4+v30&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"edgeser","files":24,"time":1322607175,"description":"The NAM Team is pleased to announce the long-awaited release of NAM Version 30.  The product of a 13-month development cycle, NAM Version 30 offers the following:\n\n    Elevated Road, One-Way Road and Avenue viaduct models have been revamped, with new orthogonal-to-diagonal curves added to One-Way Road and Avenue Viaduct sets.\n    Numerous new Tram-in-Avenue, Tram-in-Road and Tram-on-Road puzzle pieces, many of which dramatically improve diagonal functionality.\n    New Elevated Maxis Highway Interchanges for Tram-in-Avenue, and improvements to existing Diagonal Avenue Elevated Maxis Highway interchanges.\n    New Underground Rail puzzle pieces have been added.\n    NAM Controller and Bridge Controller files have been updated.\n    New Turn Lane Extension Pieces (TuLEPs) have been added, including TuLEP Rail Crossings.\n    Avenue Roundabouts Plugin updated, adding new BSC Ripptide filler, and support for Flexible Underpass (FLUPs) functionality.\n    Two new styles of Draggable Ground Light Rail/Tram with easily-customizable base textures have been added with the optional Draggable GLR/Tram Extension Plugin.\n    (Please note that due to the model-based nature of this functionality, the natively-built pillars on the Elevated Rail network had to be removed.  You may need to reconstruct sections of your Elevated Rail network to re-add the pillars with this plugin installed.)\n    RUL updates for the RealHighway Mod (RHW), Network Widening Mod (NWM), Street Addon Mod (SAM) and soon-to-be-released Diagonal Bridge Enabler (DBE), all downloaded separately.\n    Traffic Simulator Configuration Tool (TSCT) updated to Version 1.2.6, reflecting proper One-Way Road capacities.\n\n\nAdditionally, this marks the release of RealHighway (RHW) Version 5.0 and Network Widening Mod (NWM) Version 2.0:\n\nRHW 5.0 includes the following features:\n\n    New &quot;V5-Spec&quot; texture set, with improved scaling and aesthetics.\n    New networks--in addition to the Double-Decker RHW-4 (DDRHW-4), the RHW-3, Elevated RHW-2, Elevated RHW-6S and Elevated RHW-6C have been added.\n    FlexSPUI system, allowing for a flexible, overrideable Single-Point Urban Interchange system that can be elevated.\n    RHW Regional Transport View Mod by jondor added, allowing RHW networks to appear on the Regional Transport View.\n    Fractional Angle RHW (FARHW) system expanded to include FARHW-6C, and numerous new transitions and exit/entrance ramps.\n    Basic, stable draggable diagonal and curving functionality added to the RHW-6S, 6C, 8S, 8C and 10S.  New RHW-3, ERHW-2 and DDRHW-4 networks also support limited diagonal functionality. (ERHW-6S and ERHW-6C cannot yet curve\n    or go diagonal.) Please Note: If you have built any RHW-6C diagonals with Version 4.0 or 4.1, you will need to rebuild them.\n    New, simpler ramp interface nomenclature system, coupled with a number of new ramps.\n    Draggable Ramp Interface (DRI) functionality added to RHW-6S and RHW-8C networks.\n    Additional functionality for FLEXFly.\n    Many new cosmetic pieces, allowing you to better control the look and realism factor on even more RHW networks.\n    DDRHW-4 plain bridge added.\n    Improved stability and pathing.\n\n\nNWM 2.0 includes the following features:\n\n    Three new networks have been added, including the triple-tile 6-lane Avenue and 7-lane Turning Lane Avenue, plus the single-tile 4-lane Narrow Medianless Avenue\n    Draggable transition functionality, allowing easier connections with default networks, other NWM networks, and networks in the RealHighway addon (downloaded separately).\n    Basic diagonal and curving functionality for dual-tile and triple-tile networks (note: this does not include intersections).\n    Numerous new T-intersections, including dual-tile networks ending at single-tile networks.\n    Limited support for diagonal intersections on single-tile networks--this functionality is still experimental and offered on an &quot;as-is&quot; basis.","torrent":{"xt":"urn:btih:e8b4d6a365d5f5822c3d61af6de70847d7e83ae0","amp;dn":"Network+Addon+Mod+%28NAM%29+for+SimCity+4+v30","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8b4d6a365d5f5822c3d61af6de70847d7e83ae0","infoHashBuffer":{"type":"Buffer","data":[232,180,214,163,101,213,245,130,44,61,97,175,109,231,8,71,215,232,58,224]},"announce":[],"urlList":[]}}