{"title":"Mike Oldfield - Tubular Bells II TQMP","uid":4832600,"size":354757640,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e943d45e060440707c5bb5fcba4b5687d467b88f&amp;dn=Mike+Oldfield+-+Tubular+Bells+II+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zootallure","files":27,"time":1239151546,"description":"Tubular Bells II is the 15th music album by Mike Oldfield, released in 1992. The album - the first for his new record label, Warner Bros. Records, following an acrimonious departure from Virgin Records after twenty years - was conceived as a sequel to Oldfield's 1973 Tubular Bells.\n\nTubular Bells II partly follows musical\nstructures of the original Tubular Bells (1973). Themes of the original Bells are taken and then completely re-composed and played with mostly new instruments. The result is an album that has same kind of thematic variation but is still new musically. Some themes can be seen as variations of themes taken from the original Bells, while some other parts of Tubular Bells II do not have much common with the themes of the original album except their overall mood or feeling.\n\nUnlike Tubular Bells there is a recurring theme, first appearing at the end of &quot;Sentinel&quot; that reappears throughout the album, though it is most obvious at the end of &quot;The Bell&quot;.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:e943d45e060440707c5bb5fcba4b5687d467b88f","amp;dn":"Mike+Oldfield+-+Tubular+Bells+II+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e943d45e060440707c5bb5fcba4b5687d467b88f","infoHashBuffer":{"type":"Buffer","data":[233,67,212,94,6,4,64,112,124,91,181,252,186,75,86,135,212,103,184,143]},"announce":[],"urlList":[]}}