{"title":"Savannahs.Secret.XXX.DVDRip.x264-CHiKANi","uid":8941130,"size":2036637230,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e9a4b7f5163b87e461337d1572785971b525d182&amp;dn=Savannahs.Secret.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"chkm8te","files":1,"time":1379659057,"description":"Savannahs.Secret.XXX.DVDRip.x264-CHiKANi\n\nStarring : Kendra Star, Omar Galanti, Savannah Secret, Steve Holmes Description : Latvian beauty Savannah Secret, a gorgeous brunette model, is the erotic muse of perverted Italian director / stud Omar Galanti. But this sensuous bitch has a dark side that Omar explores in his hard-core epic, &quot;Savannah's Secret,&quot; a four-scene tale of dominance, submission, bondage, nasty double crosses and sexual magic. &quot;Savannah's Secret&quot; showcases this glamorous superslut's range of kinky role-playing in a wide variety of filthy action. First, the decadently rich brunette telephones suave pimp Steve Holmes, ordering a male subject for her perverse games. Steve drugs Omar, who awakens in a straitjacket; in heels, fishnets and a black latex dress, Savannah dominates her new pet. Later, Savannah and Steve are abducted, but when Savannah wakes up, she discovers that the &quot;kidnapping&quot; was all a ruse planned by Steve! He chains her to the wall and torments the most sensitive areas of her flesh with clothespins. Steve jams his meat down her throat and up her ass; he even makes her eat his hairy bunghole! After fingering Savannah to a squirting climax, he unloads his sperm into her mouth. Next, Savannah casts a love spell on Omar ... and receives a brutal anal punishment as revenge. Finally, Savannah is overjoyed when Omar proposes marriage. But first comes some spanking and strap-on domination from sexy Kendra Star. A filthy anal foursome includes lewd double-penetration for the blushing bride. In &quot;Savannah's Secret,&quot; Omar Galanti reveals the inner desires of Europe's loveliest new porn prodigy\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=pmwgzlw4rl100hov2g26.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=pmwgzlw4rl100hov2g26.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=9tbx7eax2n16mefb216k.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=9tbx7eax2n16mefb216k.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:e9a4b7f5163b87e461337d1572785971b525d182","amp;dn":"Savannahs.Secret.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9a4b7f5163b87e461337d1572785971b525d182","infoHashBuffer":{"type":"Buffer","data":[233,164,183,245,22,59,135,228,97,51,125,21,114,120,89,113,181,37,209,130]},"announce":[],"urlList":[]}}