{"title":"THE OSMONDS - Ultimate Collection ( 2 d i s c s )","uid":3970400,"size":154241535,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e9bf8a6597db9261208c9b29d0367ecc4275e388&amp;dn=THE+OSMONDS+-+Ultimate+Collection+%28+2+d+i+s+c+s+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"badbigdog","files":-1,"time":1199972606,"description":"DISC  1 ===\n01. Crazy Horses\n02. Love Me for a Reason\n03. Let Me In\n04. Proud One\n05. Goin' Home\n06. Hold Her Tight\n07. Traffic in My Mind\n08. One Way Ticket to Anywhere\n09. Down by the Lazy River\n10. One Bad Apple\n11. Yo-Yo\n12. Double Lovin'\n13. I Can't Stop\n14. I'm Still Gonna Need You\n15. I Can't Live a Dream\n16. Darlin'\n17. What Could It Be?\n18. Girl\n19. Having a Party\n20. Love Me for a Reason [Moon River Theatre Missouri 2003]\n21. Crazy Horses [7&quot; Remix]\nDISC  2 ===\n01. Puppy Love - Donny Osmond\n02. Twelfth of Never - Donny Osmond\n03. Young Love - Donny Osmond\n04. I'm Leaving It All up to You - Donny Osmond, Marie Osmond\n05. Paper Roses - Marie Osmond\n06. Why - Donny Osmond\n07. Too Young - Donny Osmond\n08. When I Fall in Love - Donny Osmond\n09. Where Did All the Good Times Go - Donny Osmond\n10. Soldier of Love - Donny Osmond\n11. All Out of Love - Donny Osmond\n12. Morning Side of the Mountain - Donny Osmond, Marie Osmond\n13. Make the World Go Away - Donny Osmond, Marie Osmond\n14. Deep Purple - Donny Osmond, Marie Osmond\n15. Long Haired Lover from Liverpool - Jimmy Osmond\n16. Tweedle Dee - Jimmy Osmond-------------------------------------O S M O N D S are an American family pop group who achieved enormous worldwide success as teenage music idols in the 1970s.\n\nThe group originally comprised brothers Alan Ralph Osmond (born June 22, 1949), Melvin Wayne Osmond (born August 28, 1951), Merrill Davis Osmond (born April 30, 1953), Jay Wesley Osmond (born March 2, 1955) and Donald Clark &quot;Donny&quot; Osmond (born December 9, 1957). They were later joined by younger siblings (Olive) Marie Osmond (born October 13, 1959) and James Arthur &quot;Jimmy&quot; Osmond (born April 16, 1963).\n\nOlder brothers George Virl Osmond, Jr. (born October 19, 1945), and Thomas Rulon Osmond (born October 26, 1947) were born deaf and did not appear on any of the records. In 1978, they made their performing debut with their siblings on The Donny &amp; Marie Christmas Special and made occasional appearances from then on. --- The Osmonds' career started with a big break at Disneyland, followed quickly by regular appearances on The Andy Williams Show in the early 1960s. In the mid-60s they performed with Sweden's most popular singer Lars LÃƒÆ’Ã‚Â¶nndahl, and gained a lot of popularity in Sweden. However, their most successful period was the early 1970s, when they achieved a string of chart hits.\n\nThey were joined for a time by younger brothers Donny and Jimmy Osmond. They had a self-titled Rankin/Bass-produced Saturday morning cartoon series on ABC-TV from 1972 to 1973. Donny, and to a lesser extent Jimmy, both achieved success as solo artists, as did their only sister Marie. Marie's signature hit was the country song &quot;Paper Roses&quot; (hence the recurring theme on their variety show where Marie sang, &quot;I'm a little bit country,&quot; and Donny responded by singing &quot;and I'm a little bit rock and roll&quot;). Jimmy achieved particular success in the UK and Japan (most notably for his single &quot;Long Haired Lover from Liverpool&quot;), while Donny and Marie's success was nearly worldwide. Donny and Marie also performed as a duo, and hosted their own variety show, Donny &amp; Marie, on ABC from 1976 to 1979.\n\nThe family members are well known as devout members of The Church of Jesus Christ of Latter-day Saints.\n\nThe Osmonds are of English descent on both their paternal and maternal sides, as well as Welsh descent on their maternal side. --- The Osmonds' breakthrough US hit, &quot;One Bad Apple&quot;, featuring lead vocals by Merrill and Donny, bore an uncanny similarity to the &quot;bubblegum soul&quot; sound of their contemporaries, The Jackson 5. The song spent five weeks at No. 1 in the Billboard Hot 100 in the winter of 1971, and even hit #6 on the R&amp;B chart. The single and the accompanying debut album (called &quot;The Osmonds&quot;) were recorded at Muscle Shoals by R&amp;B producer Rick Hall.\n\nThe follow-up to &quot;One Bad Apple&quot;, &quot;Double Lovin'&quot; stalled at #14, but the mildly psychedelic &quot;Yo-Yo&quot; climbed all the way to #3 in late 1971. &quot;Yo-Yo&quot; marks the point where the brothers began recording as a self-contained rock and roll band (instead of relying on session musicians.) In spite of their squeaky-clean image, the Osmonds had a soulful, sometimes raucous sound which was a precursor of the power pop of later years. (For a time in the mid-1970s, they were the one of the few rock acts on TV, since the entire Osmond family appeared on a variety show which was mostly devoted to Donny and Marie, but where the Brothers were given a segment or two each week to rock out.)\n\nTheir first single release of 1972, &quot;Down By The Lazy River&quot;, headed to #4 and finally broke the group in the UK, where it peaked at #40. Their British fan base exploded overnight. All members of the Osmond family, counting group and solo recordings, charted an astonishing thirteen singles in the UK charts during 1973.\n\nTheir 1972 LP Crazy Horses and its title track were met with mixed critical reaction. The album attempted a more rock-oriented sound and image, its lead track, &quot;Hold Her Tight&quot; bearing a marked similarity to Led Zeppelin's Immigrant Song with its churning bass line and wailing guitar breaks. The album, however, was a real testament to the brothers' ability to write and play (they played all the instruments on the album) and featured some serious songwriting, singing and playing chops.\n\nFollowing quickly on its heels was the ambitious 1973 release, The Plan, perhaps best described as a Mormon concept album with prog rock aspirations. These albums were followed with gentler, more sentimental songs such as &quot;Let Me In&quot; and &quot;Love Me For A Reason&quot;. This music, combined with the brothers' good looks and clean image, greatly appealed to the teenybopper market. Like the word &quot;Beatlemania&quot;, a new word, &quot;Osmania&quot;, was coined to describe the phenomenon.\n\nNot only just a vocal group, each brother also played an instrument and sometimes played and composed their own tracks: Merrill (bass), Donny (Keyboards), Jay (drums), Alan (guitar, trumpet), Jimmy (drums, piano) &amp; Wayne (guitar). [ w I K I P E D I A http://en.wikipedia.org/wiki/The_Osmonds ]","torrent":{"xt":"urn:btih:e9bf8a6597db9261208c9b29d0367ecc4275e388","amp;dn":"THE+OSMONDS+-+Ultimate+Collection+%28+2+d+i+s+c+s+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9bf8a6597db9261208c9b29d0367ecc4275e388","infoHashBuffer":{"type":"Buffer","data":[233,191,138,101,151,219,146,97,32,140,155,41,208,54,126,204,66,117,227,136]},"announce":[],"urlList":[]}}