{"title":"Moorcock, collection reupload","uid":9293632,"size":3128547468,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ea75d75d6559e9b068144ed79eb2f923ceed1ddc&amp;dn=Moorcock%2C+collection+reupload&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"stroncyk","files":205,"time":1386128611,"description":"The promised Eternal Champion torrent. Includes P. Craig Russell's adaptations of Moorcock's Elric material. Also includes Elric's crossover with Conan (including a little-known sequel to the story, which appeared in the black and white Marvel magazine some years later). Alas, this does not include the James Cawthorn adaptations of Elric and Hawkmoon, but those are scarce. Nor does it include the Druillet adaptation/portfolio. What it DOES include, however, is some role playing game manuals, The story that appeared in Star-Reach, Frank Brunner's adaptation, Wendy Pini's artbook for an aborted animated film, The very first Elric adaptation from Windy City comics (never reprinted), 2 issues of the Tom Strong series, and Elric: The Balance Lost. I've also included TMM's Multiverse, a DC 12 issue maxi series that features a team up of some of the incarnations of the Eternal Champion.\n\nA Note on the latter: I have edited MMM into the 2 component Elric tales: Duke Elric and Zenith the Albino. The two tales crossover, and both feature Elric, so I feel justified in doing so. If you want to read the original miniseries in unadulterated form, it's here as well.\n\nTorrent details:\n\nCorum:\nChronicles of Corum 1-12\nThe Bull and the Ram 1-4\n\nElric\n00 The Making of a Sorcerer\n01 Elric of Melnibone' (Frank Brunner's adaptation, from Heavy Metal + Pacific Comics series 1-6)\n02 Sailor on the Seas of Fate (+ 3 page Robert Gould illustrated poem from Heavy Metal #20)\n03 Elric and Conan\n05 The Dreaming City (orig PCR version from Heavy Metal + later completed GN version) + Dreaming City Comics adaptation\n06 Weird of the White Wolf (Bookended with Prisoner of Pan Tang from Star Reach, and PCR's While The Gods Laugh From Epic Illustrated #14)\n07 The Vanishing Tower\n08 Bane of the Black Sword\n09 Dreams of a Thousand Years (Tom Strong, Duke Elric, Count Zenith)\n10 The Balance Lost\n11 Stormbringer\n\nArt:\nFrank Brunner art book\nWendy Pino art book\nassorted pinups\n\nHawkmoon:\n01 Jewel In The Skull\n02 The Mad God's Amulet\n03 The Sword of the Dawn\n04 The Runestaff\n\nJerry Cornelius (appearances)\nAdventures of Luther Arkwright\nMidnight Kiss\nSebastian O\nThe Adventures of the English Assassin (newspaper strip)\nLeague Of Extraordinary Gentlemen v3 - The Black Dossier (2007)\n\nMichael Moorcock's Multiverse 1-12\nBehold the Man (from Unknown Worlds of Science Fiction 06)\nmichael moorcock and the comics of the multiverse\nOne Life Furnished In Early Moorcock (Topps) (Neil Gaiman and PCR)\nThe Swords of Heaven, the Flowers of Hell (Howard Chaykin)\n\nAlso includes RPG manuals for Corum, Hawkmoon, Elric, etc.\n\nThanks to original scanners, and of course The Man Himself.\t","torrent":{"xt":"urn:btih:ea75d75d6559e9b068144ed79eb2f923ceed1ddc","amp;dn":"Moorcock%2C+collection+reupload","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea75d75d6559e9b068144ed79eb2f923ceed1ddc","infoHashBuffer":{"type":"Buffer","data":[234,117,215,93,101,89,233,176,104,20,78,215,158,178,249,35,206,237,29,220]},"announce":[],"urlList":[]}}