{"title":"Lowlife - Four Albums: Permanent Sleep/Rain + Diminuendo + Godhe","uid":4620385,"size":283754849,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eb3ab0385450f862ef026f1a07bd9e22be7245ee&amp;dn=Lowlife+-+Four+Albums%3A+Permanent+Sleep%2FRain+%2B+Diminuendo+%2B+Godhe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"AS1002MSB","files":62,"time":1231009586,"description":"Four Albums from the scottish band Lowlife. These are cd rips of the 2006 re-issues. Unfortunately i do not have the album 'Gush', which i think was not re-released.\n\n* Permanent Sleep was released in 1986 in Scotland on Nightshift Records, an independent music record label. It was Lowlife's debut album. The LP was recorded at Palladium Studios in Edinburgh, Scotland, during June - July 1986, and released in August of that year. The original album included eight songs, and the 2006 reissue by LTM Recordings was augmented by seven bonus tracks: the six-song EP Rain (1985) and a slightly different version of a track taken from the band's 1987 Diminuendo album, &quot;From Side to Side.&quot;\n\n* Diminuendo was released in 1987 in Scotland on Nightshift Records, an independent music record label. It was Lowlife's second album. The LP was recorded at Palladium Studios in Edinburgh, Scotland, and released in May. In 2006, LTM Recordings reissued it as a CD with six bonus tracks: two songs from the &quot;Vain Delights&quot; 12&quot; single (1986) and three from the Swirl It Swings EP (1986). The sixth bonus track is &quot;Ramified&quot;, a song never previously available on CD. It had been specially recorded by the band for Underground Magazine and provided on a free cassette that was included with the debut issue of that publication in 1987.\n\n* Godhead was Lowlife's third album, released in 1989 in Scotland on Nightshift Records, an independent music record label. The LP had been recorded at Pet Sounds Studios in Glasgow, Scotland. Prior to the recording of the album, original guitarist Stuart Everest had been asked to leave the group by the other bandmembers, and was replaced by Hamish McIntosh. LTM Recordings reissued much of the band's entire back catalogue on CD, and released Godhead in August 2006, with five bonus tracks taken from the band's unreleased &quot;Black Sessions&quot; demo album.\n\n* San Antorium was Lowlife's fourth album, released in 1991 in Scotland on Nightshift Records. The LP was recorded at Tower Studios in Glasgow, Scotland. Personnel changes prior to the album's recording involved the near-simultaneous departures of guitarist Hamish McIntosh and drummer Grant McDowall, who were replaced by Hugh Duggie and Greg Orr, respectively. Orr's role was somewhat limited as several of the tracks employed drum programming and/or drum loops. LTM Recordings reissued much of the band's entire back catalogue on CD in 2006, and San Antorium was released with five bonus tracks taken from the band's &quot;Black Sessions&quot; demo album.","torrent":{"xt":"urn:btih:eb3ab0385450f862ef026f1a07bd9e22be7245ee","amp;dn":"Lowlife+-+Four+Albums%3A+Permanent+Sleep%2FRain+%2B+Diminuendo+%2B+Godhe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb3ab0385450f862ef026f1a07bd9e22be7245ee","infoHashBuffer":{"type":"Buffer","data":[235,58,176,56,84,80,248,98,239,2,111,26,7,189,158,34,190,114,69,238]},"announce":[],"urlList":[]}}