{"title":"PBS Nova - S30E11 - Battle of the X-Planes","uid":8866114,"size":394301481,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ecbd2b71c228ac557fea00057315077ba99345f7&amp;dn=PBS+Nova+-+S30E11+-+Battle+of+the+X-Planes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Arrrrrrrrrr","files":-1,"time":1377910535,"description":"&quot;From 1996 to 2001, Boeing and Lockheed Martin produced rival designs and prototypes for the Joint Strike Fighter, a stealthy, affordable combat plane intended for the 21st century needs of the U.S. Air Force, Navy, and Marines. In 'Battle of the X-Planes,' NOVA goes behind the scenes to show the world's newest fighter taking shape, as Boeing and Lockheed Martin compete to win the largest contract in military history.\nNOVA's film crew was part of a small group allowed into both camps, in the first-ever inside look at a Department of Defense weapons competition. The team filmed inside installations where cameras have never been allowed: the famous Skunk Works, where Lockheed Martin designed the celebrated U-2 and SR-71 spy planes, and Boeing's equally hush-hush Phantom Works.\nThe result is a fascinating glimpse of creative minds at work on one of the most difficult and potentially lucrative aeronautical projects ever undertaken, which is expected to earn the winner $200 billion, with the potential to earn up to $1 trillion over the life of the project. Many aviation experts believe the Joint Strike Fighter will be the last manned fighter built by the United States.&quot;\n\nPBS.Nova.-.S30E11.-.Battle.of.the.X-Planes.mp4 (376MB, 01:55:26)\nResolution: 718x376 (native DVD), 16:9 aspect ratio\nAudio: AAC 48kHz 128kb/s stereo\nVideo: H-264 MPEG-4, 29.97fps\nSubtitles: English CC\nEncoding: Handbrake, RF=25\nOriginally broadcast: 2003-Feb.-04\n\nNotes:\n\n- Already posted here ( http://thepiratebay.se/torrent/8300852/NOVA.Battle.Of.The.X-Planes.2003.iNTERNAL.DVDRip.XviD-EXViDiNT  and another dead torrent of the same) but at 1.43GB is around 4x the size of this one.\n\n- The aspect ratio and resolution of the original DVD source were non-standard/letterboxed. I cropped out most of the letterboxing. The black bar at the bottom isn't erroneous; it is due to the program's overlays extending into the letterboxing so enough was left that they were not lost.\n\n- Wikipedia calls this episode S30E04 (all of their episode numbers seem to differ from here.)\n\n- Please seed to 100% or higher and do your part so free media will always be available. My upstream isn't the fastest (max. about 50kBps) so be patient and you'll get your file.\nIf everyone seeded to 101%, no torrent would ever die.","torrent":{"xt":"urn:btih:ecbd2b71c228ac557fea00057315077ba99345f7","amp;dn":"PBS+Nova+-+S30E11+-+Battle+of+the+X-Planes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecbd2b71c228ac557fea00057315077ba99345f7","infoHashBuffer":{"type":"Buffer","data":[236,189,43,113,194,40,172,85,127,234,0,5,115,21,7,123,169,147,69,247]},"announce":[],"urlList":[]}}