{"title":"World War 2: Stories Of The Schutzstaffel: True Accounts Of Hitl","uid":15327826,"size":213538,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecf6884a8a756b189c7f89e983b45b79378cee62&amp;dn=World+War+2%3A+Stories+Of+The+Schutzstaffel%3A+True+Accounts+Of+Hitl&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TopShelfBook","files":1,"time":1468708311,"description":"World War 2: Stories Of The Schutzstaffel: True Accounts Of Hitler's Personal Bodyguards\r\n\r\n\r\n\r\nThe instigator and the mastermind behind the Holocaust; Adolf Hitler of Germany, was at the forefront of the Second World War and ruined millions of lives, throwing the entire European continent into chaos. Not only was he hated by the whole world, even some of his own military commanders didn’t like him. \r\n\r\nMost leaders around the world rely on one, maybe two bodyguards to keep them safe. Even the President of the United States today has only one or two teams of security personnel; while there may be many men and women who take turns to protect their leader, the numbers are not as big as you would expect it to be. \r\n\r\nWe will look at the origins of a number of bodies, such as the ‘Sturmabteilung’ or the SA, the Schutzstaffel (the SS) and the many other sub-sections of the SS such as the FBK, the LSSAH, etc., all of which were tasked with protecting Hitler. \r\n\r\nFrom the background, we will move on to individual accounts of men who served on these teams – they were Hitler’s personal bodyguards and some stayed with him until the very end. \r\n\r\nHumanity’s depraved nature came to fore with these men; despite having a master who was truly mad and ravenous for blood, they served him loyally","torrent":{"xt":"urn:btih:ecf6884a8a756b189c7f89e983b45b79378cee62","amp;dn":"World+War+2%3A+Stories+Of+The+Schutzstaffel%3A+True+Accounts+Of+Hitl","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecf6884a8a756b189c7f89e983b45b79378cee62","infoHashBuffer":{"type":"Buffer","data":[236,246,136,74,138,117,107,24,156,127,137,233,131,180,91,121,55,140,238,98]},"announce":[],"urlList":[]}}