{"title":"HISTORY OF POP AND ROCK MUSIC - part 354","uid":7026019,"size":1393035732,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ed129bf179d4240a265ef884dd737a378fcf9f97&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+354&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1329002258,"description":"    \n\n\n             PART  354\n\n\n          PRINCE  - When Doves Cry  (1984)\n          ALEXANDER O'NEAL  -  Fake  (1987)\n          SHEILA E  -  Sex Cymbal (1991)\n          PRINCE  - 7  (1992)\n          PATTI LABELLE  - When You Talk About Love (1997)\n\n\n\n\n    &quot;When Doves Cry&quot; is a song by the American musician Prince, and the lead single from his 1984 album &quot;Purple Rain&quot;. It was an unprecedented worldwide hit, and his first American number one single, topping charts for five weeks. According to Billboard magazine, it was the top-selling single of the year.It was certified platinum by the Recording Industry Association of America, shipping two-million units in the United States.\n            &quot;Fake&quot; is a 1987 single by Alexander O'Neal. The single was O'Neal's most successful song on both soul and pop charts. &quot;Fake&quot; went to number one on the Hot Black Singles chart for two weeks, and peaked at number twenty-five on the Hot 100.[1] The single was also O'Neal's most successful single on the dance charts, peaking at number seven.[2] The song was later interpolated for Patti LaBelle's 1997 hit, &quot;When You Talk About Love&quot;, repeating the &quot;Patti Patti&quot; refrain after the singer demands her background to say her name.\n            &quot;Sex Cymbal&quot; was the lead single released from Sheila E.'s album of the same name.Records in 1991, four years after Sheila E.'s previous album. It is her first album that does not feature any input by her mentor Prince. The song is a mid-tempo Hip-Hop/House number and features a rap verse from Sheila E. herself. &quot;Sex Cymbal&quot; was a Top 40 R&amp;B hit, peaking at #32 on the U.S. R&amp;B charts, but it did not touch the Billboard Hot 100. It was the highest charting single from the album. The B-side is the instrumental &quot;Bass Base&quot;.\n       &quot;7&quot; is a song by Prince and The New Power Generation, from the 1992  &quot;Love Symbol&quot; Album.   The most successful single from the album in the U.S., &quot;7&quot; was most successful on the Top 40 Pop/Mainstream charts, where it earned a #3 placement, and coincidentally the single peaked at #7 on the Billboard Hot 100. It performed respectably on the Rhythmic charts (#19). However, it was less popular with R&amp;B/Hip Hop radio, stalling at #61. In the Canadian RPM charts the song peaked at #12.\nThe single performed well in the U.K., rising as high as #27, but falling short of the success of the previous two releases.\n     \n.","torrent":{"xt":"urn:btih:ed129bf179d4240a265ef884dd737a378fcf9f97","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+354","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed129bf179d4240a265ef884dd737a378fcf9f97","infoHashBuffer":{"type":"Buffer","data":[237,18,155,241,121,212,36,10,38,94,248,132,221,115,122,55,143,207,159,151]},"announce":[],"urlList":[]}}