{"title":"Placebo - Studio Albums (5CD) Japanese SHM (2012) MP3@320kbps Be","uid":10164063,"size":665250060,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ed58cb42948158efdfcc6c62f49549727b770e4d&amp;dn=Placebo+-+Studio+Albums+%285CD%29+Japanese+SHM+%282012%29+MP3%40320kbps+Be&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"Beolab1700","files":65,"time":1400287473,"description":"[center]\n\n[size=5]Placebo - Studio Albums (5CD) Japanese SHM (2012) MP3@320kbps Beolab1700[/size]\n\n[IMG]http://i.imgur.com/Csl9nVQ.jpg[/IMG]\n\n---------------------------------------------------------------------\n                          Placebo - Placebo\n---------------------------------------------------------------------\n\nArtist...............: Placebo\nAlbum................: Studio Albums\nGenre................: Alt. Rock\nSource...............: CD\nYear.................: 2012\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.98\nVersion..............: MPEG 1 Layer III\nQuality..............: Insane, (avg. bitrate: 320kbps)\nChannels.............: Joint Stereo / 44100 hz\nTags.................: ID3 v1.1, ID3 v2.3\nInformation..........: \n\nPosted by............: Beolab1700 on 16/05/2014\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n01. Come Home (05:09)\n02. Teenage Angst (02:42)\n03. Bionic (05:00)\n04. 36 Degrees (03:05)\n05. Hang On To Your IQ (05:13)\n06. Nancy Boy (03:31)\n07. I Know (04:44)\n08. Bruise Pristine (03:35)\n09. Lady Of The Flowers (04:47)\n10. Swallow (22:26)\n\n01. Pure Morning (04:15)\n02. Brick Shithouse (03:18)\n03. You Don't Care About Us (03:58)\n04. Ask For Answers (05:19)\n05. Without You I'm Nothing (04:09)\n06. Allergic (To Thoughts Of Mother Earth) (03:49)\n07. The Crawl (02:59)\n08. Every You Every Me (03:33)\n09. My Sweet Prince (05:45)\n10. Summer's Gone (03:05)\n11. Scared Of Girls (03:01)\n12. Unknown Title (22:41)\n\n01. Taste In Men (04:15)\n02. Days Before You Came (02:33)\n03. Special K (03:52)\n04. Spite &amp; Malice (03:37)\n05. Passive Aggressive (05:24)\n06. Black-Eyed (03:48)\n07. Blue American (03:31)\n08. Slave To The Wage (04:06)\n09. Commercial For Levi (02:20)\n10. Haemoglobin (03:46)\n11. Narcoleptic (04:22)\n12. Peeping Tom (14:10)\n\n01. Bulletproof Cupid (02:22)\n02. English Summer Rain (04:01)\n03. This Picture (03:34)\n04. Sleeping with Ghosts (04:38)\n05. The Bitter End (03:10)\n06. Something Rotten (05:28)\n07. Plasticine (03:26)\n08. Special Needs (05:16)\n09. I'll Be Yours (03:32)\n10. Second Sight (02:50)\n11. Protect me from what I Want (03:15)\n12. Centrefolds (05:00)\n\n01. Meds (02:55)\n02. Infra-Red (03:15)\n03. Drag (03:21)\n04. Space Monkey (03:51)\n05. Follow The Cops Back Home (04:39)\n06. Post Blue (03:12)\n07. Because I Want You (03:22)\n08. Blind (04:01)\n09. Pierrot The Clown (04:22)\n10. Broken Promise (04:12)\n11. One Of A Kind (03:20)\n12. In The Cold Light Of Morning (03:52)\n13. Song To Say Goodbye (03:36)\n\n---------------------------------------------------------------------\n\nDue to their penchant for androgynous attire/makeup and raw, punky guitar riffs, Placebo have been described by some as a glam version of Nirvana. The multinational band was formed by singer/guitarist Brian Molko (part Scottish and American descent, but raised in England) and Swedish bassist Stefan Olsdal. Both members had previously attended the same school in Luxembourg, but they didn't cross paths properly until 1994 in London, England. Briefly called Ashtray Heart and influenced by the likes of Sonic Youth, the Pixies, the Smashing Pumpkins, and the aforementioned Nirvana, they began filling the vacant drum spot with percussionists like Robert Schultzberg and Steve Hewitt (the latter being the group's only member of English origin). Although Molko and Olsdal preferred Hewitt as their main man (it was this lineup that recorded several early demos), Hewitt opted to return to his other band at the time, Breed. With Schultzberg back on board instead, Placebo signed a recording contract with Caroline Records and released a self-titled debut in 1996. The album was a surprise hit in the U.K., where singles like &quot;Nancy Boy&quot; and &quot;Teenage Angst&quot; became Top 40 hits. Meanwhile, the bandmates themselves became the toast of the British music weeklies and supported their debut by opening for such outfits as the reunited Sex Pistols, U2, and Weezer.\n\nDespite the group's early success, Schultzberg wasn't seeing eye to eye with the other bandmembers, who by this point were able to convince Hewitt to rejoin the lineup, prompting Schultzberg's exit from the band in September 1996. One of Hewitt's first performances with Placebo upon returning proved to be a big one, as David Bowie -- a fan of the band, not to mention an influence on its sound -- personally invited the trio to play his 50th birthday bash at New York's Madison Square Garden in 1997. The following year, Placebo switched over to the major-label division of Caroline, Virgin Records, and issued Without You I'm Nothing in November. The album was another large seller in England and initially appeared to be the group's breakthrough in the U.S., where MTV embraced the album's leadoff single, &quot;Pure Morning.&quot; Subsequent singles failed to match the success of that first song, but Without You I'm Nothing remained popular in England, where it eventually went platinum. Around the same time, Placebo recorded a cover of T. Rex's &quot;20th Century Boy&quot; for Velvet Goldmine, a movie in which the trio also appeared.\n\nThe relationship between Placebo and Bowie continued to blossom. Bowie made a special on-stage appearance with the band during a tour stop in New York, and both parties united for a re-recording of the title track from Without You I'm Nothing, which was issued as a single in 1999. Placebo's third release, Black Market Music, added hip-hop and disco elements to the band's tense rock sound. The album was released in Europe in 2000, followed several months later by a re-sequenced American version whose track list featured several additions, including the aforementioned Bowie version of &quot;Without You I'm Nothing&quot; and the band's cover of Depeche Mode's &quot;I Feel You.&quot; The recording spawned additional U.K. hits such as &quot;Taste in Men&quot; and &quot;Slave to the Wage.&quot;\n\nIn spring 2003, Placebo showcased a harder edge with the release of their fourth album, Sleeping with Ghosts. The album cracked the Top Ten in the U.K. and sold 1.4 million copies worldwide. Australian tour dates with Elbow and U.K. shows with Har Mar Superstar followed in 2004. Placebo's singles collection, Once More with Feeling: Singles 1996-2004, was released before the year's end. The 19-song compilation included their biggest U.K. hits and the new track &quot;Twenty Years.&quot; Frenchman Dimitri Tikovoi (Goldfrapp, the Cranes), who had mixed selected songs on Once More with Feeling, also signed on to produce Placebo's fifth effort, 2006's Meds. One year later, after landing a spot on the Projekt Revolution tour alongside Linkin Park and My Chemical Romance, Virgin released the Extended Play '07 EP as a simple introduction for new fans to the band's past decade of music.\n\nSteven Hewitt departed Placebo in the fall of 2007, and the band left its longtime home of EMI/Virgin one year later. With new drummer Steve Forrest now on board, the band recorded Battle for the Sun and released it during the summer of 2009. A box set of the band's work for EMI, The Hut Recordings, was released the same day, and an extensive tour kept the guys busy for another year. For fans who couldn't make the shows, Placebo also issued a live mini-album, Live at La Cigale, whose songs were taken from a 2006 performance in Paris. The band returned in 2009 with its sixth studio album, Battle for the Sun, which was produced by Grammy winner David Bottrill (dEUS, Silverchair, Muse). In 2010 Molko and Olsdal announced they had been working on new material, which culminated in the release of the mini-album B3 EP two years later. In 2013 Placebo delivered their seventh studio album, the Adam Noble-produced Loud Like Love.\n\n---------------------------------------------------------------------\n\n[/center]","torrent":{"xt":"urn:btih:ed58cb42948158efdfcc6c62f49549727b770e4d","amp;dn":"Placebo+-+Studio+Albums+%285CD%29+Japanese+SHM+%282012%29+MP3%40320kbps+Be","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed58cb42948158efdfcc6c62f49549727b770e4d","infoHashBuffer":{"type":"Buffer","data":[237,88,203,66,148,129,88,239,223,204,108,98,244,149,73,114,123,119,14,77]},"announce":[],"urlList":[]}}