{"title":"Dopingo paslaptis. Lengvosios atletikos šešėlyje.","uid":15707472,"size":3152982662,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ed5de84a024f494ea0c23bde494c776aa3493a31&amp;dn=Dopingo+paslaptis.+Lengvosios+atletikos+%26scaron%3Be%26scaron%3B%C4%97lyje.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1472537971,"description":"Dopingo paslaptis. Lengvosios atletikos šešėlyje. | (Doping-Top Secret. The Shadowy World of Athletics/Geheimsache Doping – Im Schattenreich der Leichtat)\r\n\r\nMetai: 2015\r\nŠalis: Vokietija\r\nRežisierius: Hajo Seppelt.\r\nŽanras: Dokumentinis\r\n\r\nAprašymas:\r\nLT\r\nNėra lietuviško aprašymo.\r\n\r\nEN\r\nIn December 2014, with the help of athletes, who told their stories in front of the camera, Seppelt reported about widespread doping in Russia. In December of that year, ARD broadcast Seppelt’s film Geheimsache Doping: Wie Russland seine Sieger macht (The Doping Secret: How Russia Creates Champions). In the 60-minute documentary, whistleblowers testified to systematic doping in athletics and other sports in Russia. This is the second part of the documentary, which completes the troubling image of worldwide doping in athletics\r\n\r\nThis video documentary, published on August 1, is hour long report that asked serious question of athletics in general, and Russia’s athletes and Kenya's long-distance runners in particular.\r\n\r\n&quot;The Doping Secret: The Dark Side of Athletics&quot; suggests that Russia is not the only nation with a doping problem and that many marathon runners and other track-and-field athletes from Kenya in blood doping with substances such as EPO. Kenyans have dominated long-distance running events for years, and large numbers of people in the country see athletics as their only way to escape poverty.\r\n\r\nThe documentary shows that it is relatively easy to obtain banned performance-enhancing drugs in Kenya and traces the story of an impoverished young runner who seems to have died from the side effects of taking EPO.\r\n\r\nSeppelt also suggests the International Association of Athletics Federations isn't doing enough to address the problem of doping in endurance disciplines. After evaluating data on athletes' blood collected at major athletics competitions over a number of years, two Australian scientists conclude that doping is the only plausible explanation for some of the measurements. The IAAF also refused to speak with Seppelt about his suspicions.\r\n\r\n\r\nFailo formatas: MKV\r\nTrukmė: 00:55:37\r\nVideo: AVC, 1920x1078 (16:9), 25.000 fps, 6 920 Kbps\r\nAudio LT: MP3, 48.0 KHz, 2 ch,128 CBR (Lithuanian)\r\n\r\nReliso grupė: BTT-Team/Wolvescall\r\nRippino: Vaidas782\r\nŠaltinis LRT HD","torrent":{"xt":"urn:btih:ed5de84a024f494ea0c23bde494c776aa3493a31","amp;dn":"Dopingo+paslaptis.+Lengvosios+atletikos+%26scaron%3Be%26scaron%3B%C4%97lyje.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed5de84a024f494ea0c23bde494c776aa3493a31","infoHashBuffer":{"type":"Buffer","data":[237,93,232,74,2,79,73,78,160,194,59,222,73,76,119,106,163,73,58,49]},"announce":[],"urlList":[]}}