{"title":"Django Reinhardt - Django Reinhardt [EAC FLAC]","uid":9918045,"size":211989865,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:edf2552ef9bcd197cd251bd37ccf9db6c61255ed&amp;dn=Django+Reinhardt+-+Django+Reinhardt+%5BEAC+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jamezua","files":-1,"time":1396969424,"description":"Django Reinhardt was the first hugely influential jazz figure to emerge from Europe -- and he remains the most influential European to this day. A free-spirited gypsy, Reinhardt wasn't the most reliable person in the world, frequently wandering off into the countryside on a whim. Yet Reinhardt came up with a unique way of propelling the humble acoustic guitar into the front line of a jazz combo in the days before amplification became widespread. He would spin joyous, arcing, marvelously inflected solos above the thrumming base of two rhythm guitars and a bass, with Grappelli's elegantly gliding violin serving as the perfect foil. His harmonic concepts were startling for their time -- making a direct impression upon Charlie Christian and Les Paul, among others -- and he was an energizing rhythm guitarist behind Grappelli, pushing their groups into a higher gear. Not only did Reinhardt put his stamp upon jazz, his string band music also had an impact upon the parallel development of Western swing, which eventually fed into the wellspring of what is now called country music. Although he could not read music, with Grappelli and on his own, Reinhardt composed several winsome, highly original tunes like &quot;Daphne,&quot; &quot;Nuages&quot; and &quot;Manoir de Mes Reves,&quot; as well as mad swingers like &quot;Minor Swing&quot; and the ode to his record label of the '30s, &quot;Stomping at Decca.&quot; As the late Ralph Gleason said about Django's recordings, &quot;They were European and they were French and they were still jazz.&quot;\n\nTracklist:\n\n01. Nuages\n02. Tears\n03. DJangology\n04. Echoes Of France\n05. Crazy Rythm\n06. Saint Louis Blues\n07. Tiger Rag\n08. Swing 41\n09. Over The Rainbow\n10. Over The Rainbow\n11. Troublant Bolero\n12. Minor Swing\n13. Sweet Georgia Brown\n14. Just Gigolo\n15. What Is This Thing Called Love\n16. My Blue Heaven\n17. Clopin Clopant ","torrent":{"xt":"urn:btih:edf2552ef9bcd197cd251bd37ccf9db6c61255ed","amp;dn":"Django+Reinhardt+-+Django+Reinhardt+%5BEAC+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edf2552ef9bcd197cd251bd37ccf9db6c61255ed","infoHashBuffer":{"type":"Buffer","data":[237,242,85,46,249,188,209,151,205,37,27,211,124,207,157,182,198,18,85,237]},"announce":[],"urlList":[]}}