{"title":"Diane Birch - Bible Belt 2009 (flac)","uid":6440542,"size":344630109,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ee18e379e271e4045d8854c9531ad588daf50756&amp;dn=Diane+Birch+-+Bible+Belt+2009+%28flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"barber9","files":-1,"time":1306967092,"description":"Diane Birch (born January 24, 1983) is an American singer-songwriter. \nBirch was born in Michigan and her father was a Seventh-day Adventist preacher whose work took him to several countries. As a child Birch lived with her family in Zimbabwe, South Africa and Sydney, Australia. When she was ten, her family returned to the United States of America, and settled in Portland, Oregon. Diane attended Portland Adventist Elementary School and later, Portland Adventist Academy. Birch began studying piano using the Suzuki method at the age of seven and she listened to opera, classical and church music while growing up.\n\nBirch moved to Los Angeles to compose music for films and instead played piano at the Beverly Hotel and L'Orangerie. Prince heard her perform at the Polo Lounge in 2006 and invited her to join him at his home for a music session with his band. Birch moved to London, signed a publishing contract and wrote most of the songs that appeared on her debut album.\nIn 2007, she moved to New York after signing with Steve Greenberg's S-Curve Records.\nBirch's debut album, Bible Belt, was released in 2009 on S-Curve Records and received supportive reviews in Rolling Stone, Paper Magazine and the Huffington Post.\nIn 2009 Birch appeared on the Late Late Show with Craig Ferguson, Late Show with David Letterman, the Carson Daly Show, Jimmy Kimmel, The Tonight Show with Conan O'Brien, The Tonight Show with Jay Leno and the webcast, Live from Daryl's House \nHer song Rise Up was the Starbucks iTunes Pick of the Week in October 2009 and her song Valentino appeared in the movie Valentine's Day.\nIn 2010 Birch was the opening act for Stevie Wonder at the Hard Rock Calling Festival in Hyde Park and NÃƒÂ®mes, France and Nick Jonas and the Administration. Birch performed shows in Osaka and Tokyo. In September, Birch released the single track Gee Whiz It's Christmas on Amazon and iTunes. Birch also co-wrote and sang the song Too Soon to End by Alain Clark. In December Birch released a digital only EP called The Velveteen Age.\n\nBible Belt is the debut release by soul singer-songwriter Diane Birch. The lead single is Nothing But a Miracle. Birch wrote all the tracks on the album. Her backing band consists of Jay Foote on bass, vocals and tambourine, Eric Bloom on trumpet, flugelhorn and backing vocals, and Alex Foote on guitars and backing vocals.   (wikipedia)\n\nIn Mojo, Charles Waring described it as a mighty impressive first album and claimed she combines strong vocal melodies with infectious hook lines and delivers them with a soulful fervour. He also compared her with Carole King, Laura Nyro and Phoebe Snow, while acknowledging there are elements of gospel, doo wop, Americana and Motown. Birch has got a great voice and the depth of feeling she injects into her performances imbues her songs with a genuine soulfulness. Solidly consistent, the set is packed with memorable moments, including Fools, Nothing But A Miracle and Mirror Mirror.\n\n\n 1. Fire escape\n 2. Valentino\n 3. Fools\n 4. Nothing but a miracle\n 5. Rewind\n 6. Rise up\n 7. Photograph\n 8. Don't wait up\n 9. Mirror mirror\n10. Ariel\n11. Choo choo\n12. Forgiveness\n13. Magic view\n","torrent":{"xt":"urn:btih:ee18e379e271e4045d8854c9531ad588daf50756","amp;dn":"Diane+Birch+-+Bible+Belt+2009+%28flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee18e379e271e4045d8854c9531ad588daf50756","infoHashBuffer":{"type":"Buffer","data":[238,24,227,121,226,113,228,4,93,136,84,201,83,26,213,136,218,245,7,86]},"announce":[],"urlList":[]}}