{"title":"The Book of Tells - Peter Collett.pdf","uid":4260929,"size":2167682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee782281c48828aa18585e0fc5d48579e9b5c10a&amp;dn=The+Book+of+Tells+-+Peter+Collett.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jeanmichel73","files":1,"time":1214473465,"description":"Reviewed by Roy Sugarman, Ph.D., Senior Clinical Neuropsychologist, Glenside Campus/RAH, Clinical Lecturer, Dept of Psychiatry, Adelaide University, P O Box 17, Fullarton SA 5063, Australia.\n\nPeter Collett is Channel 4?s Big Brother resident psychologist, and the author of other books on body language, and co-author with the perhaps better-known Desmond Morris of another work.\n\nThis is of course another book on body language, but in this case based on what one poker player looks for in another, a sign of hidden or secret agendas, the Tell, or a give-away sign generated by the body which reveals something about an inner state of being. A kind of biological projective test, the Tell is a vehicle allowing us to make attributions about what another is feeling, or the nature of inner conflict, or perhaps that the patting on the back we receive during a hug is a signal to let go, rather than a gesture of sustained affection.\n\nOf course we all want to be able to detect the lie, the cheat, the swindle, the manipulation. Some research shows we are not very good at this, perhaps we believe customs officers or judges are better at it, and of course forensic psychologists and secret service officers really are better at it than we are. Whatever the case maybe, we all want to know if OJ, or Bill Clinton lied.\n\nAlthough I have yet to watch a Big Brother, and although seldom am I aware of others? body language, like most in the profession I do get a sense of where they are at by just being in the body contact sport of assessment, before I really get real about using specific tools.\n\nIn the specific tools department, Collett covers a whole range of tells in his opening and fast-moving discussion. Most interesting of course is his discussion of signature tells, like Napoleon?s hand in his jacket (artist?s artifice, or fact?). He discusses how Hitler covered his genital area, so often seen standing after a speech with hands clasped low and tight. In Hitler?s case, Collett felt he may have been hiding the last unemployed member of the Third Reich, but of course Hitler may have been hiding the fact he only had one testicle. Attribution of course is the problem with any belief that tells, or body language that truly is revealing. For instance, the idea that a wiping movement under the eye constitutes the brushing away of a tear, or that the biting of a lip reveals the struggle to hold back the tears:\n\nThe book has a few photos, largely of celebrities, and largely predictable. I personally love the pictures of Jane Fonda, and of Liverpool missing a goal against Manchester United, but why Elvis had the lip curl is not shown, a grave omission I think. Perhaps it was Elvis? contempt for the establishment, but what then of the swivel hips? I am of course happy that he takes Michael Jackson to task on those most annoying crotch-yanks, and refers to my favourite scowling Italian Western star, Clint Eastwood. While on the topic of Italians and crotches, he of course has a lot to say about that subject, getting me on the phone to my Italian friends immediately to point out such pearls. Speaking of Italians, testosterone, and voices, tenors have less testosterone than bass singers - don?t anyone tell Pavarotti, he may not agree from what I?ve read. Getting closer to my home, he speaks of Australians and their rising interrogative intonation, a means of avoiding conflict in this country of tall poppy syndrome - according to ex-prime minister Paul Keating anyway. While on the subject of Keating, his faux pas of placing a guiding arm around the waist of Queen Elizabeth II, during a state visit to Australia, made the British tabloids: bad body language that, by the Lizard of Oz.\n\nBack to Collett. Elvis may have been taller than Buddy Holly, and thus did better, to a point. Collett points out that involuntary tells, like height, are social mediators, with full professors in Universities being on average nearly 2 inches taller than the average for their gender and age. In Wall Street, this is worth about $600 per month per inch of height. We are, of course, subject to such prejudice, and only three of the Presidents of the USA were below average height (who?). I note that the same does not apply to Israel or Palestine, for instance; now maybe if Sharon were 6?4?, or if Barak, Ben Gurion, or Meir had been taller, then the problems would have been easier. Sadat of course was tall, Arafat is not, and so perhaps keeping one?s head down is a good strategy in the Middle East! Certainly some of the taller have been assassinated.\n\nOn the other hand Collett points out that sitting up straighter when depressed, instead of the defeated slouch, helps nothing: we need to cave in on ourselves to collect our thoughts. What then, about smiling, and putting on a happy face, or thinking nice thoughts, how do they work, when slumping does, and sitting up all bright eyed and bushy tailed doesn?t? Collett doesn?t say here.\n\nOther interesting things emerge, such as the analysis of Larry King?s voice to determine whom he holds in esteem, by adjusting his voice to theirs, and who does the reverse with him.\n\nThe use of tells of course has endless variations, including the obvious political ones, and this chapter is one of Collett?s best, with humorous references to the many British and American politicians who have enriched our television talk-show hosts? repertoires. There is some repetition in the book, but it is necessary and not tedious.\n\nOverall the book is written with pace, referenced only when entirely necessary, and constitutes a nice primer for those of us with no idea about the subject, and witty and accomplished enough a read for those of us who do have a clue.\n\nHe leaves no hand unturned, no body part or population group unexamined for nuance of thought or motor expression. Much of what he says is equivocal, all of it interesting, some fascinating, not a boring line in sight, even if a substantial amount is known, or has been known for some time.\n\nNor does he ignore the effects of culture, for instance in the handshake, or the scrubbing of indigo dye out of the crotch of jeans, or anywhere else, but each section has been transduced in some ways to make it memorable. For instance, chapter on sexual tells includes the usual highlighted areas, in this case, scanning and promenading, the tells of a teenager on the prowl for talent in a club. Later, the highlighted arena is that of approach tells from females, namely the strobe glance, the eye-lock, the eye-flicker, the hair-flick, the pout, and of course the old favourite, the smile, all described in shameless detail.\n\nIt?s a fine read, a nice book, effortless for most readers, fun for everyone, and a little knowledge too that the obvious is not always correct, challenging here and there but without preaching or ever trying to make a point, rather like a travelogue of experience, mapping out our most human interactions without spoiling the mystique.","torrent":{"xt":"urn:btih:ee782281c48828aa18585e0fc5d48579e9b5c10a","amp;dn":"The+Book+of+Tells+-+Peter+Collett.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee782281c48828aa18585e0fc5d48579e9b5c10a","infoHashBuffer":{"type":"Buffer","data":[238,120,34,129,196,136,40,170,24,88,94,15,197,212,133,121,233,181,193,10]},"announce":[],"urlList":[]}}