{"title":"Phoenix Tears - Cure for Cancer - The Rick Simpson Protocol - e-","uid":10434373,"size":893540,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eea303d721abd76c1d74d0506e9f74c7cc18a5c9&amp;dn=Phoenix+Tears+-+Cure+for+Cancer+-+The+Rick+Simpson+Protocol+-+e-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HempOilCures","files":-1,"time":1403824981,"description":"Phoenix Tears - Cure for Cancer - The Rick Simpson Protocol\n\nFirst Edition\nPublishe May 2014\n\nThe newest book from Rick Simpson and Jindrich Bayer specifically details how to use cannabis extract medicine to cure cancer, going into extensive detail on the official Rick Simpson protocol.\n\n--------------------\nQuote from the start of the e-book:\n&quot;Start people with minuscule doses, the size of half a grain of dry short-grained rice. Although the oil is harmless, less is better than more for those starting treatment. In the beginning take just a tiny speck of this amazing substance every eight hours, then increase your dosage every four days on a regular basis and soon your tolerance will increase. If the person says he or she did not feel its effects or that they only felt them slightly, I would consider this a good dosage for a beginner. You just want to get a little bit of the medicine in their system so they can start getting used to it.&quot;\n\n--------------------\n\nThe revenue from this book supports Rick's living expenses \nand helps further his mission to bring cannabis extract medicine to the world. \n\nIf you support this cause, please buy the book.\nThere's also money needed to translate the book \nand to get it published in hard copy.\n\n--------------------\n\nI, the uploader, do not wish to take revenue away from \nRick Simpson and the other people involved with phoenixtears.ca. \nI would prefer to just supply a link to where you can buy the book. \nBut since I know there are some people that want to see what \nthey get before they pay, others just don't have the money \nat the moment or don't have a way to pay and others have other \nreasons not to be able to buy it, I'm uploading it here.\nI think this message is too important to miss just because \nyou cannot buy it for whatever reason. \nIf you like it and support the work of Rick Simpson, \nspread the word, spread the book and spread the place \nwhere it can be bought. And buy it yourself, \neven when you've already read it. \nRick has been helping dozens of people free of charge and \nthis is a way in which you can contribute to his work.\nSo, buy the book.\n\nIt's 9.99 USD well invested in a better world.\n\nGood health to everyone!\t","torrent":{"xt":"urn:btih:eea303d721abd76c1d74d0506e9f74c7cc18a5c9","amp;dn":"Phoenix+Tears+-+Cure+for+Cancer+-+The+Rick+Simpson+Protocol+-+e-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eea303d721abd76c1d74d0506e9f74c7cc18a5c9","infoHashBuffer":{"type":"Buffer","data":[238,163,3,215,33,171,215,108,29,116,208,80,110,159,116,199,204,24,165,201]},"announce":[],"urlList":[]}}