{"title":"LaVern Baker - The Chronological 1949-1954","uid":5481540,"size":46596986,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ef221283a813bc1cd54a5229debdb3c0249b3642&amp;dn=LaVern+Baker+-+The+Chronological+1949-1954&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"artpepper","files":-1,"time":1270466868,"description":"The Chronological LaVern Baker 1949 - 1954\n\nReleased by City Hall Records (2005)\n\n\n\nLaVern Baker was one of the sexiest divas gracing the mid-'50s rock &amp; roll circuit, boasting a brashly seductive vocal delivery tailor-made for belting the catchy novelties\n\nA distant relative of Memphis Minnie, LaVern Baker was instrumental in reshaping the blues vocal into something closer to pop. This interesting collection includes the fiery singer's earliest sides, beginning with her debut recording for RCA Victor in 1949, &quot;Easy Baby,&quot; when she was billing herself as Little Miss Sharecropper. Also included here are sides she cut for the Columbia and OKeh labels in 1952 under the name Bea Baker, and the four songs she recorded for the King label a year later under her own name before signing with Atlantic in 1953. \n\nBaker's stay at Atlantic was to last ten years, and her reputation rests with the material she did while with the label, the earliest sides of which appear on this compilation, including the masterful &quot;Must I Cry Again,&quot; the stunning &quot;Soul on Fire,&quot; and her first big hit, &quot;Tweedle Dee.&quot; \n\nWhite singer Georgia Gibbs quickly did a note-for-note cover of &quot;Tweedle Dee&quot; and had a substantial pop hit with it, leading Baker to sue her, and although Baker lost the suit, she had no problem hitting the pop charts with her subsequent Atlantic releases. \n\nSexy, sensual, and a dynamite singer, Baker brought style and substance to her jazzy jump blues material, transforming it to the edge of rock &amp; roll, and paving the way for the pop-soul of the 1960s. Her best work was on Atlantic, and this collection just edges into that era, so casual listeners may be better off picking up Atlantic's fine 20-track, single-disc Soul on Fire anthology that features the highlights from her stay with the label. As a buildup to that, though, this chronological set gives a fine portrait of this impressive performer. ~ Steve Leggett\n\n\nBorn Delores Williams, she was singing at the Club DeLisa on Chicago's south side at age 17, decked out in raggedy attire and billed as &quot;Little Miss Sharecropper&quot; (the same handle that she made her recording debut under for RCA Victor with Eddie &quot;Sugarman&quot; Penigar's band in 1949). She changed her name briefly to Bea Baker when recording for OKeh in 1951 with Maurice King's Wolverines, then settled on the first name of LaVern when she joined Todd Rhodes' band as featured vocalist in 1952 (she fronted Rhodes' aggregation on the impassioned ballad &quot;Trying&quot; for Cincinnati's King Records).\n\nLaVern signed with Atlantic as a solo in 1953, debuting with the incendiary &quot;Soul on Fire.&quot; The coy, Latin-tempo &quot;Tweedlee Dee&quot; was a smash in 1955 on both the R&amp;B and pop charts, although her impact on the latter was blunted when squeaky-clean Georgia Gibbs covered it for Mercury. An infuriated Baker filed suit over the whitewashing, but she lost. By that time, though, her star had ascended: Baker's &quot;Bop-Ting-A-Ling,&quot; &quot;Play It Fair,&quot; &quot;Still,&quot; and the rocking &quot;Jim Dandy&quot; all vaulted into the R&amp;B Top Ten over the next couple of years.\n\nBaker's statuesque figure and charismatic persona made her a natural for TV and movies. She co-starred on the historic R&amp;B revue segment on Ed Sullivan's TV program in November of 1955 and did memorable numbers in Alan Freed's rock movies Rock, Rock, Rock and Mr. Rock &amp; Roll. Her Atlantic records remained popular throughout the decade: she hit big in 1958 with the ballad &quot;I Cried a Tear,&quot; adopted a pseudo-sanctified bellow for the rousing Leiber &amp; Stoller-penned gospel sendup &quot;Saved&quot; in 1960, and cut a Bessie Smith tribute album before leaving Atlantic in 1964. \n\nA brief stop at Brunswick Records (where she did a sassy duet with Jackie Wilson, &quot;Think Twice&quot;) preceded a late-'60s jaunt to entertain the troops in Vietnam. She became seriously ill after the trip and was hospitalized, eventually settling far out of the limelight in the Philippines. She remained there for 22 years, running an NCO club on Subic Bay for the U.S. government.\n\nFinally, in 1988, Baker returned stateside to star in Atlantic's 40th anniversary bash at New York's Madison Square Garden. That led to a soundtrack appearance in the film Dick Tracy, a starring role in the Broadway musical Black &amp; Blue (replacing her ex-Atlantic labelmate Ruth Brown), a nice comeback disc for DRG (Woke Up This Mornin'), and a memorable appearance at the Chicago Blues Festival. Baker died on March 10, 1997. ~ Bill Dahl, All Music Guide\n\n\nAlbum Notes and Credits\n\nLabel: City Hall Records\n\nUPC: 03448967512629\n\nRelease Date: 4/19/2005\n\nNotes &amp; Personnel Info:\n\nPersonnel: LaVern Baker (vocals); The Gliders, Bea Baker, Little Miss Sharecropper (vocals); Sam Taylor (guitar, tenor saxophone, piano); John Faire, Jimmy Lewis , Mickey Baker (guitar); Oett &quot;Sax&quot; Mallard (saxophone); Holley Dismukes, Maurice King (alto saxophone); Freddie Mitchell, Louis Barnett, Louis Stephens (tenor saxophone); Ellis &quot;Stumpy&quot; Whitlock, Russell Green, Charlie Hooks, Taft Jordan, Sonny Cohn (trumpet); Hank Jones , Al Williams, Neal Robinson, Todd Rhodes, Walter Davis, Jr. (piano); Connie Kay, O.S. Coleman, Sylvester Payne, Joseph Marshall, Bill Benjamin, Elbert Langford, Red Saunders (drums).\n\nTracklist:\n\t\n1. Easy Baby\t\n2. I Wonder, Baby\t\n3. Take Out Some Time\t\n4. I'll Try (I've Tried)\t\n5. How Long\t\n6. I Want To Rock\t\n7. Good Daddy\t\n8. I Want a Lavender Cadillac\t\n9. Make It Good\t\n10. Trying\t\n11. Pig Latin Blues\t\n12. Lost Child\t\n13. Must I Cry Again\t\n14. You'll Be Crying\t\n15. How Can You Leave A Man Like This\t\n16. Soul On Fire\t\n17. I'm Living My Life For You\t\n18. I'm In A Crying Mood\t\n19. I Can't Hold Out Any Longer\t\n20. Of Course I Do\t\n21. Tomorrow Night\t\n22. You Better Stop\t\n23. Tweedle Dee\t\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/LaVern_Baker&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/LaVern_Baker&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ef221283a813bc1cd54a5229debdb3c0249b3642","amp;dn":"LaVern+Baker+-+The+Chronological+1949-1954","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef221283a813bc1cd54a5229debdb3c0249b3642","infoHashBuffer":{"type":"Buffer","data":[239,34,18,131,168,19,188,28,213,74,82,41,222,189,179,192,36,155,54,66]},"announce":[],"urlList":[]}}