{"title":"The Life and Adventures of Nat Love, Better Known in the Cattle","uid":11771226,"size":609739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef6010125f4d1ecb505f1cb63df878454fb873a6&amp;dn=The+Life+and+Adventures+of+Nat+Love%2C+Better+Known+in+the+Cattle+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427089999,"description":"The Life and Adventures of Nat Love, Better Known in the Cattle Country as Deadwood Dick\n\nThousands of black cowpunchers drove cattle up the Chisholm Trail after the Civil War, but only Nat Love wrote about his experiences. Born to slaves in Davidson County, Tennessee, the newly freed Love struck out for Kansas after the war. He was fifteen and already endowed with a reckless and romantic readiness. In wide-open Dodge City he joined up with an outfit from the Texas Panhandle to begin a career riding the range and fighting Indians, outlaws, and the elements. Years later he would say, &quot;I had an unusually adventurous life&quot;. That was rare understatement. More characteristic was Love's claim: &quot;I carry the marks of fourteen bullet wounds on different parts of my body, most any one of which would be sufficient to kill an ordinary man, but I am not even crippled&quot;. In 1876 a virtuoso rodeo performance in Deadwood, Dakota Territory, won him the moniker of Deadwood Dick. He became known as DD all over the West, entering into dime novels as a mysteriously dark and heroic presence. This vivid autobiography includes encounters with Bat Masterson and Billy the Kid, a soon-after view of the Custer battlefield, and a successful courtship. Love left the range in 1890, the year of the official closing of the frontier. Then, as a Pullman train conductor he traveled his old trails, and those good times bring his story to a satisfying end","torrent":{"xt":"urn:btih:ef6010125f4d1ecb505f1cb63df878454fb873a6","amp;dn":"The+Life+and+Adventures+of+Nat+Love%2C+Better+Known+in+the+Cattle+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef6010125f4d1ecb505f1cb63df878454fb873a6","infoHashBuffer":{"type":"Buffer","data":[239,96,16,18,95,77,30,203,80,95,28,182,61,248,120,69,79,184,115,166]},"announce":[],"urlList":[]}}