{"title":"Hot Chip - 2008 - Made In The Dark [FLAC]","uid":4873562,"size":366515974,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ef91d7c496711fa7d343e8e7e65bafc41a1d6418&amp;dn=Hot+Chip+-+2008+-+Made+In+The+Dark+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SickTwist","files":14,"time":1240977471,"description":"Made in the Dark is the third studio album from British electronic indie pop band Hot Chip. The album, of 13 songs, was released on 4 February 2008 on the EMI label. It peaked at number four on the UK Album Chart, number 25 on the Australian album charts, and entered at number 109 on the U.S. Billboard 200. Several singles have been released from the album, including &quot;Shake a Fist&quot;, &quot;Ready for the Floor&quot;, which reached number six on the UK Singles Chart, and &quot;One Pure Thought&quot;.\n\nA defining feature of the album is the strong presence of romantic ballads. The ballad &quot;Made in the Dark&quot; was described as &quot;sublime&quot; by one critic, although not all the ballads received universal praise. Alexis Taylor, the main contributor to the lyrics, stated that he was proud of the album lyrically and felt that feelings of love and happiness, partly the result of his recent marriage, had contributed to the album's romantic tone.\n\nCritics stated that songs such as &quot;Ready for the Floor&quot; and &quot;Bendable Poseable&quot; were reminiscent of their previous release, The Warning. The style of the album was not considered as big a leap forward as the changes evident between Coming on Strong (2004) to The Warning (2006). It was said that Hot Chip had honed their music by using quirks of their musical style to make more accomplished music, however, some critics felt that the album lacked focus, containing too many varied elements; it was described as &quot;loveable but flawed&quot;.\n\nTrack Listing\n01 - Out At The Pictures\n02 - Shake A Fist\n03 - Ready For The Floor\n04 - Bendable Poseable\n05 - We're Looking For A Lot of Love\n06 - Touch Too Much\n07 - Made In The Dark\n08 - One Pure Thought\n09 - Hold On\n10 - Wrestlers\n11 - Don't Dance\n12 - Whistle For Will\n13 - In The Privacy Of Our Love\n\nAll tracks are DRM-free and encoded losslessly in FLAC format (16 bit, stereo, 44.1 kHz). For more information about FLAC visit http://flac.sourceforge.net/. Album summary courtesy of Wikipedia and is available under the terms of the GNU Free Documentation License.","torrent":{"xt":"urn:btih:ef91d7c496711fa7d343e8e7e65bafc41a1d6418","amp;dn":"Hot+Chip+-+2008+-+Made+In+The+Dark+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef91d7c496711fa7d343e8e7e65bafc41a1d6418","infoHashBuffer":{"type":"Buffer","data":[239,145,215,196,150,113,31,167,211,67,232,231,230,91,175,196,26,29,100,24]},"announce":[],"urlList":[]}}