{"title":"The Uncanny Valley in Games and Animation (2014) pdf","uid":11759953,"size":11763323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef94f7dca10c1977ea7b1b5ddd2b6555b3e319ac&amp;dn=The+Uncanny+Valley+in+Games+and+Animation+%282014%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1426552293,"description":"Advances in technology have enabled animators and video game designers to design increasingly realistic, human-like characters in animation and games. Although it was intended that this increased realism would allow viewers to appreciate the emotional state of characters, research has shown that audiences often have a negative reaction as the human likeness of a character increases. This phenomenon, known as the Uncanny Valley, has become a benchmark for measuring if a character is believably realistic and authentically human like. This book is an essential guide on how to overcome the Uncanny Valley phenomenon when designing human-like characters in digital applications.\n\n In this book, the author provides a synopsis of literature about the Uncanny Valley phenomenon and explains how it was introduced into contemporary thought. She then presents her theories on its possible psychological causes based on a series of empirical studies. The book focuses on how aspects of facial expression and speech can be manipulated to overcome the Uncanny Valley in character design","torrent":{"xt":"urn:btih:ef94f7dca10c1977ea7b1b5ddd2b6555b3e319ac","amp;dn":"The+Uncanny+Valley+in+Games+and+Animation+%282014%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef94f7dca10c1977ea7b1b5ddd2b6555b3e319ac","infoHashBuffer":{"type":"Buffer","data":[239,148,247,220,161,12,25,119,234,123,27,93,221,43,101,85,179,227,25,172]},"announce":[],"urlList":[]}}