{"title":"From the Tree to the Labyrinth (2014) epub","uid":9732165,"size":1758123,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:efa783f5b175b52c1156d09b39d68d4fc8f0cac7&amp;dn=From+the+Tree+to+the+Labyrinth+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1394398961,"description":"The way we create and organize knowledge is the theme of From the Tree to the Labyrinth, a major achievement by one of the world's foremost thinkers on language and interpretation. Umberto Eco begins by arguing that our familiar system of classification by genus and species derives from the Neo-Platonist idea of a &quot;tree of knowledge.&quot; He then moves to the idea of the dictionary, which--like a tree whose trunk anchors a great hierarchy of branching categories--orders knowledge into a matrix of definitions. In Eco's view, though, the dictionary is too rigid: it turns knowledge into a closed system. A more flexible organizational scheme is the encyclopedia, whichÂ­--instead of resembling a tree with finite branches--offers a labyrinth of never-ending pathways. Presenting knowledge as a network of interlinked relationships, the encyclopedia sacrifices humankind's dream of possessing absolute knowledge, but in compensation we gain the freedom to pursue an infinity of new connections and meanings.\n\n Moving effortlessly from analyses of Aristotle and James Joyce to the philosophical difficulties of telling dogs from cats, Eco demonstrates time and again his inimitable ability to bridge ancient, medieval, and modern modes of thought. From the Tree to the Labyrinth is a brilliant illustration of Eco's longstanding argument that problems of interpretation can be solved only in historical context.\n","torrent":{"xt":"urn:btih:efa783f5b175b52c1156d09b39d68d4fc8f0cac7","amp;dn":"From+the+Tree+to+the+Labyrinth+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efa783f5b175b52c1156d09b39d68d4fc8f0cac7","infoHashBuffer":{"type":"Buffer","data":[239,167,131,245,177,117,181,44,17,86,208,155,57,214,141,79,200,240,202,199]},"announce":[],"urlList":[]}}