{"title":"Knight Rider (2008) - The Movie","uid":4424519,"size":733798400,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:efb78fb67bb995c8ebb0217a9bc72028b644c8fd&amp;dn=Knight+Rider+%282008%29+-+The+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Chimera2005","files":-1,"time":1222960535,"description":"Original Air 02/17/08\n\nThe film opens at night with several technicians from the power company answering a call at the home of Charles Graiman. He is suspicious, as he did not expect them until the next morning, but allows them inside. They soon reveal their hostile intent and threaten his daughter if he does not cooperate, and as the situation intensifies, Graiman collapses and dies from an apparent heart attack. While searching his home for hard drives containing the information they are after (for a defense project named Prometheus), they stumble across a car, which drives away before they can stop it.\n\nThe next morning, Mike Traceur (Bruening), a 23-year-old ex-Army Ranger, is awakened by his friend Dylan Fass to deal with two men who are attempting to collect a $90,000 gambling debt. Traceur's car breaks down when he attempts to flee, and the men threaten Fass's life if Traceur does not pay the debt.\n\nFBI agent Carrie Rivai (Poitier) receives a call that Graiman, her long time friend, is dead and leaves her date, a woman she had just met the night before, to go investigate.\n\nSarah Graiman (Russo), a 24-year old Ph.D. candidate at Stanford University, is lecturing a class on nanotechnology. Following the lecture, she receives a phone call from KITT warning her about the men attempting to abduct her, and instructing her to safety. Her pursuers catch her, but KITT arrives and rescues her. Sarah and KITT escape, and leave to track down Traceur, who turns out to be her childhood friend, and whom she was previously involved with but has not seen since he left home at 18. They find him at the Montecito Casino, playing poker to attempt to repay his debt. He is initially resistant when Sarah asks for his help, but agrees when she offers to pay his debt, and the two set out to find out what happened to Graiman, and discover who's after them.\n\nRivai arrives at Graiman's home, and is asked by the local sheriff (Chris Mulkey) to identify the body. She discovers it's not Charles Graiman, the real Graiman (Davison) having escaped through the woods and left a double in his place. Graiman makes his way to a house belonging to Traceur's mother, Jennifer (Susan Gibney). The two set off to a motel.\n\nThe men chasing them are revealed to be mercenaries for BlackRiver, (a security contractor inspired by Blackwater Worldwide). They are after a system that Graiman designed called Prometheus, which controls the entire U.S. defense network. The information needed to take control of the system is contained on Graiman's hard drives in the mercenaries' possession, but is encrypted, and only Graiman and Sarah know the encryption keys. KITT also possesses the data and the ability to access the system.\n\nGraiman contacts Sarah and asks her to meet him at the motel. He advises Sarah to contact Rivai for help. When she does so, Rivai puts her phone in speaker-mode so that the sheriff can hear the location, unaware that the sheriff is working with the mercenaries.\n\nKITT, Sarah, and Traceur arrive to find that the men have already reached the motel, but have yet to find Graiman, as he has checked into four different rooms. With the help of KITT's infrared sensors, Traceur finds Graiman and his mother and brings them to safety, avoiding the mercenaries. Jennifer and Graiman reveal to him that his father was a man named Michael Knight and that he drove the first KITT, forcing him to stay away from his family. Traceur is still absorbing the weight of this information, when they reach KITT, and find that one of the mercenaries is hacking into his system. Graiman asks KITT to shut-down to prevent further infiltration, and suggests Traceur drive the car manually.\n\nAs the group is preparing to leave, the mercenaries, now joined by the sheriff, find them, and shoot and kill Jennifer in the confrontation. Two of them and the sheriff take Graiman away and the other two are left to kill Traceur and Rivai and watch over Sarah and KITT. Traceur and Rivai overpower them, and Traceur and Sarah take KITT to chase after Graiman, while Rivai stays behind with Jennifer's body.\n\nDuring the chase, Traceur and Sarah discover KITT's vulnerability to damage, due to the loss of his self-repair capabilities, when his system is deactivated. After exchanging fire, Traceur reactivates KITT with just enough time to activate his armor without allowing the mercenaries to complete hacking into his system, and turns KITT into the mercenaries' path, causing a massive collision; KITT survives with no damage, while the mercenaries' SUV is heavily damaged by the impact. Graiman survives with minor injuries, while all his captors are mortally wounded or have been killed.\n\nOn the way to Jennifer's funeral, Graiman reveals that he's re-forming the Foundation, and offers Traceur the chance to drive KITT permanently, which he refuses on grounds of philosophical differences, saying &quot;I just don't believe in the same things you do.&quot;\n\nAt the funeral, Traceur meets his father, Michael Knight (David Hasselhoff), who tells him what Wilton Knight once told him on his death-bed, that one man can make a difference, and that he (Knight) was that man. They shake hands and as Knight prepares to leave, Traceur stops him and asks if they will ever meet again, to which Knight responds &quot;I hope so.&quot;\n\nThe final scene begins inside an enclosed area with Mike behind KITT's wheel. Here, Rivai, Graiman, Sarah, and Fass bid him farewell and inform him of his new mission. Sarah kisses him goodbye, and a door opens behind him that shows a moving road. KITT drives out of the door/bay in reverse. The door is revealed to be the cargo hatch of what appears to be a C-130 cargo plane, which then takes off. Mike switches to manual at KITT's indignation, turns KITT around, and drives away.","torrent":{"xt":"urn:btih:efb78fb67bb995c8ebb0217a9bc72028b644c8fd","amp;dn":"Knight+Rider+%282008%29+-+The+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efb78fb67bb995c8ebb0217a9bc72028b644c8fd","infoHashBuffer":{"type":"Buffer","data":[239,183,143,182,123,185,149,200,235,176,33,122,155,199,32,40,182,68,200,253]},"announce":[],"urlList":[]}}