{"title":"Blur - Theres No Other Way [promo].VOB","uid":11775312,"size":149903360,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f09b7d676aeb380a00f37ed829f233104fe9a547&amp;dn=Blur+-+Theres+No+Other+Way+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":1,"time":1427260089,"description":"Blur - Theres No Other Way [promo].VOB\n\n\nHQ promo music video from a promo DVD. &quot;There's No Other Way&quot; is a song by Blur and was released 15 April 1991 as their second single. The song was the band's first top ten and top 40 hit and was also featured on the band's debut album Leisure. The single was also a minor hit in the US, reaching number 82 on the Billboard Hot 100, and number five on the Billboard Modern Rock Tracks chart. A playable version of the song is available for the Rock Band video game series, and it is available to download for Guitar Hero 5.\n\nThe song utilises a beat and tambourine sound typical to songs of the Madchester and baggy scene.\n\nLeisure is the debut studio album by the English rock band Blur. The album was released on 26 August 1991 in the United Kingdom via Food Records, and peaked at number 7 in the UK Albums Chart. It was released in the US a month later with a different track listing. The album was certified Gold in the UK. The US version of Leisure was frontloaded with Blur's three UK singles, and the song &quot;Sing&quot; was replaced by the B-side &quot;I Know&quot; (see track listings for exact changes). The Canadian version has the same tracklisting as the UK version.\n\nDespite a positive critical reaction upon release, lead singer Damon Albarn has since referred to Leisure as &quot;awful&quot;.\n\n\nBlur are an English rock band, formed in London in 1988. The group consists of singer/keyboardist Damon Albarn, guitarist/singer Graham Coxon, bassist Alex James and drummer Dave Rowntree. Blur's debut album Leisure (1991) incorporated the sounds of Madchester and shoegazing. Following a stylistic change influenced by English guitar pop groups such as the Kinks, the Beatles and XTC, Blur released Modern Life Is Rubbish (1993), Parklife (1994) and The Great Escape (1995). As a result, the band helped to popularise the Britpop genre and achieved mass popularity in the UK, aided by a chart battle with rivals Oasis in 1995 dubbed the &quot;Battle of Britpop&quot;.\n\nIn recording their follow-up, Blur (1997), the band underwent another reinvention, showing influence from the lo-fi style of American indie rock groups. The album, including the &quot;Song 2&quot; single, brought Blur mainstream success in the United States. Their next album, 13 (1999) saw the band members experimenting with electronic and gospel music, and featured more personal lyrics from Albarn. In May 2002, Coxon left Blur during the recording of their seventh album Think Tank (2003). Containing electronic sounds and more minimal guitar work, the album was marked by Albarn's growing interest in hip hop and African music. After a 2003 tour without Coxon, Blur did no studio work or touring as a band, as members engaged in other projects.\n\nBlur reunited, with Coxon back in the fold, for a series of concerts in 2009. In the following years they released several singles and retrospective compilations, and toured internationally. In 2012, the group received a Brit Award for Outstanding Contribution to Music. Blur are set to release their first studio album in twelve years, The Magic Whip, in April 2015.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/There's_No_Other_Way&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/There's_No_Other_Way&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://postimg.org/image/jm8iyow77/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/jm8iyow77/&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bits]\n   Duration: 00:03:13\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.8\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:f09b7d676aeb380a00f37ed829f233104fe9a547","amp;dn":"Blur+-+Theres+No+Other+Way+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f09b7d676aeb380a00f37ed829f233104fe9a547","infoHashBuffer":{"type":"Buffer","data":[240,155,125,103,106,235,56,10,0,243,126,216,41,242,51,16,79,233,165,71]},"announce":[],"urlList":[]}}