{"title":"Gene Clark With The Gosdin Brother Repost","uid":7460440,"size":139057572,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f0b70da1480b8db9dc930f3973c7176ab1de3660&amp;dn=Gene+Clark+With+The+Gosdin+Brother+Repost&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"akasyliphone","files":-1,"time":1342799636,"description":"The first album that Gene Clark released after his departure from the Byrds followed very closely on the model of his earlier efforts on the Byrds' first two albums. His backing musicians included ex-bandmates Chris Hillman and Michael Clarke, as well as future Byrd Clarence White and Clark collaborator Doug Dillard, not to mention the Gosdin Brothers, whose harmonies resembled a rockier Everly Brothers and brought the sound very close to that of the Byrds. The album contains a number of fine pop-oriented tunes and stellar folk-rock/country-rock numbers (a year before the Byrds' Sweetheart of the Rodeo, which employed both White and Dillard) and established Clark as a major songwriter, rivaling his old band and often coming close to the fabness of the Beatles. Still, despite such solid songs and backing musicians, Gene Clark with the Gosdin Brothers failed to make much of an impact, perhaps due to its being released in the same week as the Byrds' Younger Than Yesterday, itself a tour de force that cemented their influence. However, in the realm of Clark's recorded output, this album stands as the one of the best, if not the best, example of how powerful a singer, writer, and bandleader he was. ","torrent":{"xt":"urn:btih:f0b70da1480b8db9dc930f3973c7176ab1de3660","amp;dn":"Gene+Clark+With+The+Gosdin+Brother+Repost","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0b70da1480b8db9dc930f3973c7176ab1de3660","infoHashBuffer":{"type":"Buffer","data":[240,183,13,161,72,11,141,185,220,147,15,57,115,199,23,106,177,222,54,96]},"announce":[],"urlList":[]}}