{"title":"Fight the New World Order with Global Non Compliance","uid":4606018,"size":224111395,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f11826640032d955d09fb48695860188c6fae0ca&amp;dn=Fight+the+New+World+Order+with+Global+Non+Compliance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Claus-","files":-1,"time":1230474081,"description":"Fight the New World Order with Global Non Compliance\n &lt;a href=&quot;\nhttp://thecrowhouse.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thecrowhouse.com&lt;/a&gt;\n\n\nTranscript\n\nThe German Philosopher Johann Von Goethe, once said, there are none more hopelessly enslaved, than those who falsely believe they are free.\n\nBut few who hear the words realize that they are the ones to whom Goethe was referring. For the reality is that every person in the civilized world is enslaved from childhood. They are enslaved in a prison without walls or bars and so few ever even realize it. But all are enslaved none the less. And what the people of the world are enslaved to, is a system of perpetual self generating debt that is created for them wholly by design by private international banking interests, and the people are taught from an early age to just except this debt, because this is 'just the way things are'.\n\nBut the real reality is that it is NOT just the way things are, but more the way things have been designed and all one has to do is glance around them at the state of the world today to realise that though this is the way things current are, it is most definitely NOT the way things should be.\n\nThe most powerful and useful tool a person can ever gain in their life is knowledge for with knowledge comes wisdom and a deeper understanding and real truth can be exhilarating because real truth will set you free.\n\nNow Whether you believe in the Illuminati or not, whether you will take the time to listen to so called conspiracy theories or not, there are some things that should be clearly understood by all. And these are not conspiracy theories by any stretch of the imagination, they are well documented, quite traceable and very provable facts. And these facts are as follows.\n\nThere is one ruling bloodline that exists on this earth. This ruling Bloodline is very old. It is the same bloodline that has always ruled the earth ever since the days of ancient Egypt and it is very pervasive. For example, many people think that anyone can get to be President of the United States, but the reality is, that all US presidents have been freemasons, a large number of them are in fact related, and that their lineage can be traced back to European Monarchy and in particular to the line of William of Orange. This elite Bloodline can actually be traced back a good deal further than of William of Orange and can even back as far as the royalty of ancient Egypt. It is this very same bloodline that has ruled the earth ever since and to which the british Monarchy and the current US president can both be ultimately traced. Many people may surprised to learn That US President George W Bush is in fact the 13th cousin of Queen Elizabeth the second, the current British Monarch.\n\nReverence for the royal egyptian bloodline and worship of Amen Ra is still carried out in the world today though it is veiled and secretive but the symbolism remains true, as alway hidden in plain view. Adherence to such traditions is why each of the 3 city states of london, vatican and the district of Columbia all have their own obelisks. The London Obelisk is also accompanied by 2 sphinx wrought in the image of Thutmoses indicating that it is in london that the royal bloodline actually resides. The fact that out of all the Pharo's to choose from, the London sphinx depicts Thustmoses, is actually very telling indeed for a number of reasons but that is another tale.\n\nThe British Monarchy is steeped in ancient traditions and symbolisim and they do not attempt to hide these connections, they just dont mention them or answer questions about them, but the signs and symbols are right there for discerning eyes to clearly see, again and as always, hidden in plain view. Just a look at the Royal Coat of Arms, the Royal Regalia and the Coronation Throne clearly demonstrates these connections.\n\nThe evidence linking that these rulers to the one bloodline is does exist and all the information to verify these claims is available within the public domain. It is up to each of you to connect the dots yourself.\n\nMore importantly however is the fact that Over the last 200 odd years there has devoloped behind this ruling bloodline, another elite class, somewhat similar to a priesthood, that remains hidden in the shadows. This shadowy priesthood, is the money changers. The international banking elite, consisting of 13 very influential families and it is this shadowy elite who ultimately controls things from behind the scenes. This control is achieved through covert manipulation of the global money systems, and maintained through an intricate web of interconnected secret societies, through which control over the flow of all money, all resources, all food, and most importantly, all information, thru manipulation of the worlds educational institutions and corporate media, is also achieved. Many of these smaller secret societies, are completely oblivious to the existence of the others, but all lead back to a round table of six, and ultimately, to just one at the very top, that is populated by a virtual handful of individuals. It is this handful of very powerful men that controls all the other societies, and through them the heartbeat of the entire world.\n\nThe society that sits at the very top, was founded on Knights Templar traditions in Bavaria in 1776 by a man called Adam Weishaupt, and this is the order of the illuminati. The man who commissioned Weishaupt for the task was Mayer Amschel Rothschild, and it was done in order to carry out a plan conceived by Rothschild and the heads of 12 other families at a secret meeting that took place in 1773. These families included the Warburgs, the Schiffs and the Oppenheimers. The Illuminati has since become the most powerful society in the world, and in the last 230 years, it has been instrumental in helping the Rothschild family accumulate over one half of the worlds total wealth, at the cost of quite literally, millions of innocent lives. The horded wealth of this one family alone, could comfortably feed, clothe, and house, every man, woman, and child on earth. And this just one of the 13 illuminati families.\n\nThe goal of the illuminati has always been a simple one and that is to achieve, by whatever means possible, total ownership and control, over no less than every resource, every government, every rock, every drop of water, every blade of grass,and every living creature, both human, and non human, in the entire world. And since its inception, for over 230 years, the order of the illuminati has been tirelessly, relentlessly, and unfalteringly, steering its members towards the achievement of that one ultimate goal. Through secrecy, they have so far been extremely successful in their endeavors, in fact so much so, that we are, right now, living in the time when they intend to see this long spanned work come to fruition. The situation we are witnessing in our world, right now, is in fact the final endgame of the illuminati. This is their big grab for ultimate power and mass de-population.\n\nSome people claim that the Illuminati is a myth and that what is really to blame are oganizations such as zionism but I assure you that such is not the case. It goes far deeper than Zionism and such people have simply limited the scope of their vision. They have locked to to an anwser that supports their beliefs and have refused to delve any deeper. They are not seeing the Bigger picture. Greek Philosopher Socrates once said that true wisdom is knowing how little we actually know and he was absolutely correct and this is why is important to keep an open mind and allow your beliefs to be flexible enough to change as new knowledge is acquired. And it is important to listen to all the information and not just that which reinforces your beliefs because this conspiracy goes very deep and Zionism and the jewish influence over the money system is merely one layer of it. And it goes still deeper than even the illuminati. Those whom we know as the illuminati are merely the shadowy controllers.\n\nThe plan that is unfolding in the world today is indeed an old one, and it is a plan that is very complex, but not so with the system of control that is in place to blind the people to its existence. This system of control just appears to be complex, but in reality, it isn't. In reality, its very simple, and very fragile. However it is its apparent complexity, that has kept it so well veiled, and it has also been kept very well hidden by constructing a conspiracy culture to breed around it, and by then promoting an air of endless ridicule towards such concepts. Indeed, the creation, and proliferation of such a culture, and the promotion of constant ridicule towards it, has been one of the illuminati's most valuable assets in obscuring the reality of the society's existence.\n\nThe entire Illuminati system is today operated by the crown, and what is the crown exactly. Well contrary to popular belief the crown does not refer to the Royal family or to the british monarchy but to the Inner city of London which in actual fact is a privately owned corporation that functions as a completely seperate sovereign state, outside the Juristiction of Englnd, the same as its two sister city states of Vatican and Washingtons district of columbia, all of which combine to form the Empire of the three cities. Most people are completely unaware that when they swear alliegence to the crown they are actually swearing alliegence to this a private Corporate Empire owned by the the 13 Illuminati families. These are the same private individuals who also indirectly own and operate the world bank. And what does the world bank do exactly, well apart from other things like control global oil prices, it lends money to whole countries by supplying each countries Federal Reserve Bank and then it collects interest on these loans which is paid by taxing the the labor of the people of each country.\n\nNow let me just run that by you again so you clearly understand how this really works.\n\nIf you live in a country that has a federal reserve bank, then the world bank, a privately run company that is able to legally create money from thin air, is who supplies your country with money, at interest, and you the individual is required to pay a tax on your labor to pay off the interest on the governments loan from this private bank. Many people are duped into believing that their taxes pay for infrastructure and without taxes their would be no roads or schools and the country would fall apart, but this is completely untrue. The Govt has the legal right to coin its own money and control its value but it does not. It borrows money from a private bank and uses this bank loan to pay for infrastructure and you are taxed in order to pay of the interest on the loan, interest, which from a business perspective, is pure profit for the international banksters.\n\nHowever you choose to look at it one thing must be very clearly understood and that is that each person in the western world who has a job, is forced every year, to give away approximately 3 months worth of wages in taxes and that tax money goes directly into the pockets of the private individuals who own and run the world bank.\n\nIts one big, privately run scam. And if you ever allow yourself to be microchipped and cash money is abolished altogether, which is their plan, then all bills and all taxes will be automatically removed from your account when they are due, whether you actually owe the money or not, and if you complain about the system, well they can simply turn off your chip. Since all commerce will center around the chip, you will not be able to buy food, or pay rent or do anything and there will be absolutely nothing whatsover that you can do about it. And that is their goal. To limit the size of the population on earth and microchip those that are left. Then its game set and match and total control of the world and everyone in it will be in the hands of an international cartel of criminal banksters.\n\nThis whole scam is being planned and carried out very methodically. It is these people and their minions and puppets who attend such gatherings as bilderberg meetings and the Bohemian Grove summer festival and who still adhere closely to the schools of ancient mystery which many such as the late Bill Cooper have referred to as the Ancient Mystery Religion. However it is more a mechanism of control designed to reach an ultimate goal rather than a religion.\n\nThough steeped in ritual and what many would term 'black magic', It is simply a system, the illuminati system and though its workings seem complex to the layman, In reality its quite simple, and its also very easy to see, once one has acquired the correct manner of looking at things. And there is definite purpose and reason in the ritualistic nature of this system, in its use of numerology, symbolism and ritual, and all that is needed to realize this is a deeper understanding of the true nature of the Universe and how we are all connected to it. However this film directs its focus on the system itself and the key to this system functioning, which is thru covert control of the money supply by very few people.\n\nIt is crucial that people become aware of this because the methods by which society could free itself from this system of control are also very simple, once a person has gained an understanding of the true realities of this world we live in and this is not as difficult a task as you may at first think, because due to its complexities, the illusion the elite have created, that most perceive as reality, is a very fragile one.\n\nIt is fragile because it is not reality.\n\nThe reality is that the world does not have to be this way at all, it does not have to be heading in the direction it is heading, people do not have to live in a never ending sea of self generating debt. Wars do not have to be fought and children do NOT have to starve, and dont think people starve because the world is over populated. Dont believe what the Televisions tells you, the world isnt over populated at all. In fact lets look at it realistically with a simple comparison of population versus land mass, and we can do a rough estimate and formulate a quick hypothetical to demonstrate this very easily.\n\nThere are approximately 6 billion people in the world and there is 2.97 million square miles of land in the Island continent of Australia. 2.97 million square miles breaks down to 1 billion, 900 million, 800,000 acres which then converts down to 7,603,200,000 quarter acre blocks of land. So we could hypothetically give every person in the world a quarter acre block of land and they would all fit into an area the size of australia, each would have enough land that they could all have gardens and grow a substantial supply of their own food, and we would still have 1,603,200,000 quarter acre blocks, or an area roughly half the size of queensland left over - plus the entire rest of the world. Now just pause to let that sink in to your brain for a second. ALL the people, thats every man woman and child on earth would comfortably fit inside australia, each individual person could have a quarter acre block of land and we would STILL have half of queensland and the entire rest of the PLANET left totally unoccupied.\n\nThe world is not over populated at all. Its just very badly managed and and you need have absolutely no doubt whatsoever that this bad management is intentional, and it is methodical. It would however, be very simple to fix things. And all that is required is for people to wake up to how much they are being lied to and how much they are being scammed. And this goes for everyone.\n\nPeople really need to gain an understand of how this system actually works because this bad management is crippling the world and it is crippling the people. The methods that are used to do this become truly transparent once a person has gained a clear enough vision to see it and people really do need to open their eyes to see it right now because now that the world has been made smaller and now that all resources have been discovered and there are no frontiers left to conquer, the criminal elite intend to carry out a mass depoplulation of this world and their plan to do this is well underway. They are doing it in the middle east with war, in countries such as Africa through starvation and now in western countries through water additives, aerial spraying and through the introduction of toxic and nutrient deficient GM foods. This is to very soon be taken to the next level with the Global Implementation of Codex Alimentarius, an insidious set of food guidelines that are due to come into effect world wide on dec 31st 2009. But people are now beginning to wake and realize that all is not right and they are beginning to speak out. The police need to understand this situation and take action to address these matters as well, and this is very important and there is no reason the Police should act against the people who are waking up and speaking out about this corrupt system, for the police are also being scammed, just as badly and in some ways even worse than everyone else. Worse because it is the Police who are being coerced and tricked into defending this elitist corruption by puppet govts put in place by the banksters who coerce these officers into compliance by applying creative names to such public awakenings such as 'social unrest' or 'civil disobedience' and by instilling a robot like adherence to authority within the minds of police officers rather than a stong set of moral values.\n\nThe police in these cases should stand by the people they are sworn to protect, not blindly follow instructions given to them by the criminal elites to repress the people. The police need to realize that they too Are the people and they are being stolen from and used as well and the way to beat this system is for the people, the police and everybody else is to simply stop agreeing with it. And the also for the politicians who bow to these corrupt money cartels and enact these ridicluous pieces of legislation. The Politicians, need to think seriously about what they are doing. They need to realise that these money cartels dont care about them or their families, these politicians have children and grandchildren who are also going to have to live in this world that is being created. And dont kid yourself that there is a politician in a position of power who isnt a puppet. All are puppets of the money cartels without exception. These people may well have been voted into power but the voting process is simply theater for the masses, to promote the illusion of peoples choice. The people may vote for one particular candidate over another, but they do not get to actually decide who these candidates will be to begin with.\n\nThe people of the world need to realize their own potential and wake up from the dream they are living in. Forget what you are told and trained to you by the TV because its a lie. TV is there to train people what to think and how to act. End of list. It is nothing more than a tool of propaganda that has successfully brainwashed 95% of the western world by feeding people manufactured news, disinformation and giving people an utterly false perception of the the world and of their relationship to each other. Turn your TV off and leave it off, after even a month of no TV, you will be surprised at how much better and healthier you feel.\n\nIt needs to be clearly understood by people everywhere that the elite only have the power over the people that the people themselves grant to them, so stop giving it to them. Stop doing what the TV tells you to do and stop complying with the system. Understand that there truly is no division among the people of the world no matter who they are or where they are from. We are all people and we are all one. It is through the constantly promoted illusion of division that the system is able to function but in order for it to do so, it needs public compliance. Stop complying and you will shut the system down.\n\nYou will shut it down completely because if people stop complying, it will simply implode. It will collapse like a house of cards. And all it would take for this to occur, is global awareness of how it really works.\n\nWe have reached a turning point in history and the veil of secrecy that has always surrounded the illuminati system is now at last being lifted. Now is the time for the people of the world to look after each other, and not the system.\n\nIt really is that simple, and the world is almost on the verge of that happening now, because a new awareness is growing among the people. More and more are waking up every day, and they are spreading the word, as we all should do as often and as loudly as we can, because the masses who are still sleeping really must be woken up to what is occurring, there is quite literally nothing more important than this issue.\n\nAnd This plan goes even deeper than the International money Cartels. There truly are deep dark forces at work controlling things here but it is through the maniplulation of the money system that global control is maintained and it is that system that must first be addressed\n\nIts all very well for us to all talk about this stuff and to continue learning and gathering more information about it, but the time for merely gathering information is now passed. What is needed now is action, and it is needed very quickly because the prison door is swinging shut.\n\nPlease understand that these people plan on depopulating at least 80% of the world and that most likely includes you. This is not a joke and it is not some wild conspiracy theory. It is the absolute truth and this matter seriously needs to be addressed. All the information on how they intend to do this is available in the public domain though of course you are not hearing it reported by the mainstream media because the money cartels OWN the mainstream media.\n\nA great deal of information regarding this is posted on my youtube channel and I highy reccommend that you view it and distribute it to as many people as you are able to because the time for talk really is over. What is truly needed at this time is for the good people of the world to act and to act now. The key is in love and unity among all of mankind because it matters not who you are, what country you are in or where you are from, it makes no difference whether you are black or white or christian, or muslim, or jew, it makes no difference at all what your beliefs are, because the prison that is being constructed affects every one of us equally.\n\nThe world that we are allowing to be created for our childrn to live in is a world that will not be worth living in. and if we just allow the situation to continue along its current path then we are condemning our decendents to hell on earth, but We are many and they are few and it simply must not be allowed to occur.\n\nIt is time for the people of the world to stop and realise that the divisions that supposedly exists amongst us are an illusion. There is no division. Its time for everyone to understand the truth of this. Its time to approach the world and each other in a state of love rather than a state of fear. Its time for you to tap into the source and realize your own potential and its time for us all to collectively stand together and address the root cause of the problem. And all of you need to spread this information, its very important that you do. Burn DVD's and hand them out to people. Bring the conversation up at every opportunity. This issue is too important to ignore and if your not part of the solution then your part of the problem, theres simply no middle ground.\n\nBring all the truth factions of the world together under one banner, the banner of human unity. Set aside your differences and work the finer details out later. Regardless of who or what is the ultimate intelligence behind this plan for global control, everyone needs to understand clearly that the Fascist New World Order that is being introduced and the mass depopulation that is occurring across the globe is being implemented by the criminal banking elite.\n\nThe money system is the head of the snake.\n\nCut the head off the snake and the rest of it will whither and die.\n\nThe time for talk is over and the time has come for action. It is now time for the people of the world to stop complying with the system.\n\nEveryone.\n\nStop complying with it and you will shut it down. And the best form of non compliance is love. Approach every issue with love. Rather than obediently following orders given to you by a commanding officer, and rather than doing what is right for you personally. Do what is actually right. And if a leader wants to send you to war, say no sir, I wont murder other peoples children for you any more. You'll have to go and do it yourself. You will be called coward by the military but such is not the case. It is much easier to fight for principles than to live up to them and it takes a far braver man to stand up for what is right and spit in the face of authority than it does to blindly follow orders due to fear of the consequences.\nUnderstand that we are all one and the key to real change and unity in this world lies with love.\n\nThere need be No violence, no guns, no banners, no slogans, no group think, just a united act of global non compliance. Non compliance for any thing in conflict with the directives out lined in the universal declaration of human rights would be a good start. Simply stop giving these people the power to control you. Understand that the only power they have is the power the people themselves grant to them. Understand that injustice towards one is injustice towards all. Injustice against him, is injustice against you and there should be no grey area in you mind in regard to that. Everyone needs to stop going along with it. And it needs to be done immediately. Its time to cut the head off the snake.\n\nThe Revolution is not coming.\n\nThe Revolution is now.","torrent":{"xt":"urn:btih:f11826640032d955d09fb48695860188c6fae0ca","amp;dn":"Fight+the+New+World+Order+with+Global+Non+Compliance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f11826640032d955d09fb48695860188c6fae0ca","infoHashBuffer":{"type":"Buffer","data":[241,24,38,100,0,50,217,85,208,159,180,134,149,134,1,136,198,250,224,202]},"announce":[],"urlList":[]}}