{"title":"New 52 Action Comics #01 through #23 Including #00","uid":8859458,"size":741979013,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f129be216cf496954ed7dfabe1ae118a3ff06ee4&amp;dn=New+52+Action+Comics+%2301+through+%2323+Including+%2300&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Tek28","files":-1,"time":1377738577,"description":"The title was relaunched from issue #1, as part of The New 52 by the creative team of writer Grant Morrison and artist Rags Morales. As with all of the books associated with the DC relaunch, Clark Kent appears to be about five years younger than the previous incarnation of the character. Superheroes at large have appeared only in the past five years, and are viewed with at best, suspicion, and at worst, outright hostility. The storyline in Action Comics takes place about a year before the events of Justice League #1, and was referred to by DC Co-Publisher Dan DiDio as &quot;DC Universe Year Zero&quot; while JL operates as &quot;Year One.&quot;[92] The Man of Steel is not yet trusted by the citizens of Metropolis and wears a basic costume consisting of a caped t-shirt, jeans and work boots. The first issue has had five printings as of March 2012. \n\nThe first story arc of the relaunched series, titled Superman and the Men of Steel for the collected edition, begins very early in Superman's career as he starts making a name for himself as a champion of the oppressed in Metropolis. He captures the attention of the military and scientist Lex Luthor, who are both interested in testing his capabilities as well as discovering what kind of threat he represents.\n\nFollowing the completion of Morrison's storyline, writer Andy Diggle and artist Tony Daniel became the new creative team on the title with issue #19. Diggle announced his resignation as the writer of the series shortly before his first issue went on sale. Diggle left the title with only one issue completed (he would be co-writer for #20 and co-plot issue #21), with Daniel taking on full scripting and art duties for the two following issues completing the three part story arc &quot;Hybrid&quot;. Scott Lobdell will be writing the series after Diggle and Daniel's departure. ","torrent":{"xt":"urn:btih:f129be216cf496954ed7dfabe1ae118a3ff06ee4","amp;dn":"New+52+Action+Comics+%2301+through+%2323+Including+%2300","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f129be216cf496954ed7dfabe1ae118a3ff06ee4","infoHashBuffer":{"type":"Buffer","data":[241,41,190,33,108,244,150,149,78,215,223,171,225,174,17,138,63,240,110,228]},"announce":[],"urlList":[]}}