{"title":"The Encyclopedia of Ghosts and Spirits","uid":6845510,"size":11427400,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f184abfbc9b48890f813885d1a78d3e4bc1b20df&amp;dn=The+Encyclopedia+of+Ghosts+and+Spirits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"freaktorrent07","files":-1,"time":1322330591,"description":"\nThe Encyclopedia of Ghosts and Spirits: Praise for the previous edition:&quot;...can be used for ready reference or as a guide for further study. Highly recommended...&quot; Choice&quot;The writing style is very readable, and browsers may find themselves reading the entire work...Recommended...&quot; Booklist&quot;...beautifully produced...a really outstanding reference book that is accessible to nearly all lay people.&quot; Journal of Scientific ExplorationThe Encyclopedia of Ghosts and Spirits, Third Edition includes more than 600 fascinating entries about ghosts, hauntings, related paranormal phenomenon, the people who investigate them, and the key theories about what causes them. Widely regarded as the definitive reference in the field, this encyclopedia provides comprehensive coverage written in an engaging style. Paranormal expert Rosemary Ellen Guiley has compiled extensive research on the most current theories about what causes ghosts and the many new haunting cases documented since publication of the second edition. The third edition has been substantially updated with the addition of more than 130 new entries, more than 20 new black-and-white photographs, and an updated foreword by Troy Taylor, author and founder of the American Ghost Society. Many entries include bibliographical listings for further reading.New and revised entries include:After-death communicationApparitionsBorley RectoryDemonologyEastern State PenitentiaryElectronic voice phenomenaLizzie Borden houseMediums and mediumshipNecromancyPoltergeistsPossessed possessionsS ancesSpirit photographyTalking boardsWandering ghostsWaverly Hills Sanatoriumand more. \n\nPaperback: 480 pages\nPublisher: Checkmark Books; 3 edition (August 2007)\nLanguage: English\nISBN-10: 0816067384\nISBN-13: 978-0816067381","torrent":{"xt":"urn:btih:f184abfbc9b48890f813885d1a78d3e4bc1b20df","amp;dn":"The+Encyclopedia+of+Ghosts+and+Spirits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f184abfbc9b48890f813885d1a78d3e4bc1b20df","infoHashBuffer":{"type":"Buffer","data":[241,132,171,251,201,180,136,144,248,19,136,93,26,120,211,228,188,27,32,223]},"announce":[],"urlList":[]}}