{"title":"Jai Ho! - Pussycat Dolls [Ft. A.R. Rahman] 720p 2009 chikezei","uid":4834381,"size":77220732,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f274b3dd4adcd9ac23d187f92492324148a574df&amp;dn=Jai+Ho%21+-+Pussycat+Dolls+%5BFt.+A.R.+Rahman%5D+720p+2009+chikezei&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"jemyre","files":3,"time":1239260253,"description":"According to composer A.R. Rahman, &quot;Jai Ho!&quot; means, &quot;May victory be yours!&quot; The closing credits dance sequence set to the song in the film Slumdog Millionaire is certainly one more small element that helped lead the movie to victory at the 2009 Academy Awards. The beat structure has helped &quot;Jai Ho!&quot; to be quickly adopted by fans from workout gurus to late night club dancers.\n\nThe song was recorded in 2009 by the Pussycat Dolls with English lyrics and featuring lead vocals from Nicole Scherzinger, produced in collaboration with A.R. Rahman and Ron Fair. Scherzinger explained that the single is an interpretation rather than a remix. The music video, shot in a Vienna trainyard, alludes to the \ndance sequence in the film.\n\nThe song was released on February 23, 2009 on the U.S. iTunes Store and released internationally on February 24. The song debuted on both the Billboard Hot 100 and Canadian Hot 100 at number 100. The next week the song rose on the Hot 100 from 100 to 15, with downloads for &quot;Jai Ho&quot; up nearly 500%, totaling about 103,000 for the soundtrack version and 27,000 for the Dolls' version, and also debuted on the Pop 100 chart at 20. Sales for both versions were figured into the song's chart placement. As of Monday 16 March, the song has entered top 40 on US radio. On the Canadian Hot 100, the song reached its peak of number five on 14 March, 2009. &quot;Jai Ho!&quot; entered the UK Singles Chart at #20 on March 22 and two weeks later, rose to #3 giving the Pussycat Dolls their sixth top three single in the country. The single debuted on the Australian ARIA Charts at number 10. The song has also made waves in India.\n\nThe song initially was released as a promotional single, but will now be released as the first worldwide single from Doll Domination 2.0, it will be the fifth overall single to be released from the Dolls since 2008.\nThe addition of the Pussycat Dolls to the song may have seemed a questional decision at first glance, but it is this move that is likely to get the joyful explosion on to pop radio playlists. &quot;Jai Ho!&quot; abundantly \ndeserves its place, and the vocals of head Pussycat Doll Nicole Scherzinger will have pop fans singing as well as dancing along. Look for this song to set up a long residency scaling pop charts around the world.\n\nThe music video premiered on March 13, 2009.\n\nVideo Specs :\n\nFormat: Matroska (.mkv) | AVC\nNominal Bitrate: 3 199 kbps\nOverall Bitrate: 2 833 kbps\nEncoding: 2 Pass [Extreme]\nResolution: 1280 x 720\nQuality Factor: 0.118\nFrame Rate: 30.000 fps\nDisplay Aspect Ratio: 16/9\n\nAudio Specs :\n\nType: Vorbis\nBitrate Mode: Variable\nSample Rate: 44.1 KHz\nChannels: 2 channels\n\nBest Player: KMPlayer\n\nDon't Forget to say a little 'Thank You' and lots of SEEDs! :]","torrent":{"xt":"urn:btih:f274b3dd4adcd9ac23d187f92492324148a574df","amp;dn":"Jai+Ho%21+-+Pussycat+Dolls+%5BFt.+A.R.+Rahman%5D+720p+2009+chikezei","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f274b3dd4adcd9ac23d187f92492324148a574df","infoHashBuffer":{"type":"Buffer","data":[242,116,179,221,74,220,217,172,35,209,135,249,36,146,50,65,72,165,116,223]},"announce":[],"urlList":[]}}