{"title":"Brown Sugar 2010 VCD [Thai Movie]","uid":5952598,"size":1258157800,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f2ea0c4069eb96c32464491906ee189618cfa56b&amp;dn=Brown+Sugar+2010+VCD+%5BThai+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"poothaijaa","files":-1,"time":1289579995,"description":"Title: Brown Sugar\nAKA: Nam Tan Daeng\nYear: 2010\nGenre: Drama / Erotic\nDirector: Panumat Deesatta, Zart Tancharoen, Kittiyaporn Klangsurin\nRuntime: 90 mins\nCountry: Thailand\nAudio: Thai\nsubtitle: none\nStarring: Odette Henriette Jacomin, Pitisak Yaowanin, Prakasit Bosuwan, Patsawipit Son-akkarapa, Nathakhun Anumatchimpalee, Chittkhon Songchan, Lakkana Wattanawongsiri, Warin Yarujnon\n\n\nSource: 2 VCDs\nFile Format: DAT\nRelease Date: 10 November, 2010\n\nPlot:\n\nA collection of three short stories by three young independent directors\n\nFirst Story: Sopeni Bon Tiang (literally &quot;prostitute on the bed&quot;)\nDirector: Panumat Deesatta's\nPlot:\nA story about an older gentleman (Prakasit Bosuwan) and his affair with a younger-looking woman (Patsawipit Son-akkarapa) who wears a snug-fitting, revealing university schoolgirl uniform. A family man with a Mercedes station wagon and pictures of his three young children hanging from the rearview, he meets her for a tryst that takes them to a lakeside picnic spot, dinner at an outdoor barbecue stand where she steams up the customers, dancing in a nightclub and finally a short-time motel.\n\nSecond Story: Raktongloon\nDirector: Zart Tancharoen\nPlot:\nAbout teenage lovers (Nathakhun Anumatchimpalee and Chittkhon Songchan), playfully experimenting with sex while at home alone in the girl's house, sitting on the coach. Zart, who's previously worked under director Thunska Pansittivorakul, a filmmaker who uses no restraint when it comes to expression of sexual desires and exploration, makes some interesting choices in his segment. Just as things are on the verge, the illusion is broken. And even after the illusion is broken, later on when the girl's parents show up while the couple are in the bedroom, it's still pretty tense, but ultimately comical and absurd.\n\nThird Story: Prattana (literally &quot;desire&quot;)\nDirector: Kittiyaporn Klangsurin\nPlot:\nwhich has a masseuse (Lakkana Wattanawongsiri) in a Khao San Road traditional (non-sexual) massage parlor, fantasizing about a musclebound, long-haired tattoo artist (Warin Yarujnon) who runs a studio in the same building.\n\nThe much-talked about 10-minute masturbation scene, which comes after the woman gets all hot and bothered during a massage session with the guy, is actually a letdown. Lakkana, who's said she just &quot;went for it&quot;, remains fully clothed during the scene, which takes place in the toilet at the massage parlor. She sticks one hand down her trousers and uses the other to lift up her shirt and play with her breasts. Her bra remains on. Much sighing and heavy breathing ensue. She then goes to get a tattoo from her fantasy man. She wants it in her pelvic region, and so there's the other talked-about scene that involves the upper regions of her pubic hair being shaved. And then the needle starts in with its pain and vibration.\n\n","torrent":{"xt":"urn:btih:f2ea0c4069eb96c32464491906ee189618cfa56b","amp;dn":"Brown+Sugar+2010+VCD+%5BThai+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2ea0c4069eb96c32464491906ee189618cfa56b","infoHashBuffer":{"type":"Buffer","data":[242,234,12,64,105,235,150,195,36,100,73,25,6,238,24,150,24,207,165,107]},"announce":[],"urlList":[]}}