{"title":"Kali Linux Social Engineering","uid":9635161,"size":3987932,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3309b64f5a01a63c4acfc9a3ede5333efacf41e&amp;dn=Kali+Linux+Social+Engineering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"iv0live","files":-1,"time":1392837991,"description":"Kali Linux Social Engineering\n\nRahul Singh Patel\nPackt Publishing\n2013\n\nPDF\n\n\nKali Linux has a specific toolkit that incorporates numerous social-engineering attacks all into one simplified interface. The main purpose of SET (social engineering toolkit) is to automate and improve on many of the social engineering attacks currently out there.\n\nThis book is based on current advanced social engineering attacks using SET that help you learn how security can be breached and thus avoid it. You will attain a very unique ability to perform a security audit based on social engineering attacks.\n\nStarting with ways of performing the social engineering attacks using Kali, this book covers a detailed description on various website attack vectors and client side attacks that can be performed through SET. This book contains some of the most advanced techniques that are currently being utilized by hackers to get inside secured networks. This book covers phishing (credential harvester attack), web jacking attack method, spear phishing attack vector, Metasploit browser exploit method, Mass mailer attack and more.\n\nBy the end of this book you will be able to test the security of any organization based on social engineering attacks.","torrent":{"xt":"urn:btih:f3309b64f5a01a63c4acfc9a3ede5333efacf41e","amp;dn":"Kali+Linux+Social+Engineering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3309b64f5a01a63c4acfc9a3ede5333efacf41e","infoHashBuffer":{"type":"Buffer","data":[243,48,155,100,245,160,26,99,196,172,252,154,62,222,83,51,239,172,244,30]},"announce":[],"urlList":[]}}