{"title":"(Blues) D. Johnson - Mississippi Delta Blues","uid":6232922,"size":100980643,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f37c91adaeb2d8e62abbcd8c31428d2000caa051&amp;dn=%28Blues%29+D.+Johnson+-+Mississippi+Delta+Blues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1299769822,"description":"Styles: Acoustic delta blues\nReleased: 1998\nLabel: NSCD\nFile: mp3   320kbps\nArt: front cover\n\n1. Death Letter [4:44]\n2. Radio Blues [4:34]\n3. Roaming Mind Blues [4:50]\n4. If I Had Possession Over Judgment Day [3:59]\n5. Posion Your Whiskey [3:45]\n6. Front Porch Blues [4:35]\n7. God Fearing Woman [5:47]\n8. I Can't Be Satisfied [4:26]\n9. Find Me Religion [5:17]\n\n\nD. Johnson peforms acoustic delta blues and ragtime songs from the 1920s and 1930s. The premier national blues magazine, Blues Access, described the music as follows: &quot;Johnson has a master's touch with his instrument and a good feel for the Son House/Robert Johnson styled blues. if you are looking for well played, traditional acoustic blues, you'll find it here.&quot; Southwest Blues Magazine described the music as follows: &quot;This debut CD is a fascinating exploration of that tangent of blues music referred to as (for better or worse) the Mississippi Delta style. The sound is raw, traditional, gritty; fiercely personal and visceral in character. Johnson has done his homework and then some. The vocals grovel and growl. The acoustic guitar slides. The foot stomps out the rhythm changes and the harmonica bales like a wounded hound stuck out in the swamp after dark. This is incredible stuff: Remarkably disturbing traditional slide blues cut from the same cloth of the likes of Son House and Robert Johnson. Listen to the anger, the sheer bitter energy D. Johnson throws into Son House's &quot;Death Letter,&quot; or the venomous testament he cuts loose in Robert Johnson's &quot;If I Had Possession Over Judgement Day.&quot; Close your eyes and you can almost see those dark storm clouds moving in overhead. Johnson has an incredible ability to conjure up that mood, all within the intricate layers of his ax work. The nuances normally lost behind the roar of other instruments in other types of music take on new life in Johnson' hands: the slapping of guitar strings, the stomping of a foot, the growl of a voice, the echo of silence. Joining him on this musical journey, Alan &quot;Dr. Blues&quot; Werblin plays a mean harmonica; blowing out the heartache and pain resonated in the lyrics of the songs. Johnson has six original tunes that sound as though they were written in the same time frame as his mentors' tunes. There is an obvious love and admiration of the Skip James, Charley Patton schools of style, and for me, that is one of the finest things about this release. Not only is Johnson an incredibly talented musician and performer, but he is also a devoted student; igniting fires of interest and awareness to the uninitiated of roots that should not be buried or forgotten. Johnson's CD is something old, something new and definitely something blue. This music is lean, catchy, scary and in your face: everything it should be.&quot;\n\n\nthis is a bit good","torrent":{"xt":"urn:btih:f37c91adaeb2d8e62abbcd8c31428d2000caa051","amp;dn":"%28Blues%29+D.+Johnson+-+Mississippi+Delta+Blues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f37c91adaeb2d8e62abbcd8c31428d2000caa051","infoHashBuffer":{"type":"Buffer","data":[243,124,145,173,174,178,216,230,42,187,205,140,49,66,141,32,0,202,160,81]},"announce":[],"urlList":[]}}