{"title":"The Sound of Insects: Record of a Mummy","uid":7283545,"size":1263756174,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f408df2264641b8ed7db5b0f8800f32519bf9dee&amp;dn=The+Sound+of+Insects%3A+Record+of+a+Mummy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Ixellikepixel","files":-1,"time":1337510363,"description":"Japanese novelist Shimada Masahiko based his novel Until I Am a Mummy on the true story of a man who chose a truly unusual way to end his life -- he traveled by himself to a remote corner of the woods, built a small tent from plastic sheeting, and slowly starved himself to death, allowing nature to gradually rob him of his life. No one knew of his plans until a hunter happened upon his dead body, with insects the only witness to the passing he so desired. Filmmaker Peter Liechti fuses fiction and documentary in Sound of Insects: Record of a Mummy, which uses passages from Masahiko's novel as narration while Liechti creates a artful but realistic recreation of the stranger's suicide as he records his thoughts in journals, revels in his loneliness, hallucinates, and anticipates his final hours with both enthusiasm and dread. Canadian director Peter Mettler provides narration for the English-language version of the film, while Alexander Tschernek lends his voice to the German-language edition. Sound of Insects: Record of a Mummy was an official selection at the 2009 Hot Docs International Film Festival.","torrent":{"xt":"urn:btih:f408df2264641b8ed7db5b0f8800f32519bf9dee","amp;dn":"The+Sound+of+Insects%3A+Record+of+a+Mummy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f408df2264641b8ed7db5b0f8800f32519bf9dee","infoHashBuffer":{"type":"Buffer","data":[244,8,223,34,100,100,27,142,215,219,91,15,136,0,243,37,25,191,157,238]},"announce":[],"urlList":[]}}