{"title":"Walter (Wendy) Carlos - Sonic Seasonings (1972,1998 reissue) mp3","uid":8912728,"size":334639225,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f40e519199bcf11c5acd32563f93e87f9c5905af&amp;dn=Walter+%28Wendy%29+Carlos+-+Sonic+Seasonings+%281972%2C1998+reissue%29+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"glngwl","files":22,"time":1379063595,"description":"Walter Carlos - &quot;Sonic Seasonings&quot; (1972, reissued 1998) (mp3) (320 kbps) (cover scans)\n\n\nWalter Carlos recorded his &quot;Sonic Seasonings&quot; double-album in 1971, and it was released in 1972.  It had no CD reissue until more than quarter of a century later, in 1998.  Still now, 15 years since then, that remains the only CD issue of this album.\n\nThe CD issue includes three bonus tracks:\n#  an out-take of the &quot;Winter&quot; movement, representing first thoughts and the initial direction,\n#  and two long movements recorded in 1986, together known as &quot;The Land of the Midnight Sun&quot;, which had not been previously issued.\n\nThis torrent contains full booklet and cover scans of the 1998 CD issue.  (The 14 pages in that booklet were printed in the wrong order.  The incorrect printed order of those seven double-page spreads is retained here (scans 1-7); but each scan has two extra numbers appended; to indicate the correct reading order.)\n\n\n[Just in case it's still confusing anyone: Walter Carlos and Wendy Carlos are the same person.  Walter Carlos began hormone treatments in 1968, and soon began living full-time as a woman.  He underwent sex-reassignment surgery in May 1972 - after this album was recorded.  This album was credited upon its original release to Walter Carlos (not Wendy Carlos, as the CD booklet here shows).  Carlos did not announce himself publicly as a woman for another 7 years, until May 1979.  The first music therefore correctly publicly credited to Wendy Carlos was the music that he (by then, she) wrote for Stanley Kubrick's &quot;The Shining&quot; in 1980.]","torrent":{"xt":"urn:btih:f40e519199bcf11c5acd32563f93e87f9c5905af","amp;dn":"Walter+%28Wendy%29+Carlos+-+Sonic+Seasonings+%281972%2C1998+reissue%29+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f40e519199bcf11c5acd32563f93e87f9c5905af","infoHashBuffer":{"type":"Buffer","data":[244,14,81,145,153,188,241,28,90,205,50,86,63,147,232,127,156,89,5,175]},"announce":[],"urlList":[]}}