{"title":"VAN DER GRAAF GENERATOR - COMPLETE ALBUMS 1969 1978[TNTVILLAGE]","uid":5299267,"size":3737580953,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f44e400ed6813d1a61a7095e5a282f8cc7e327fb&amp;dn=VAN+DER+GRAAF+GENERATOR+-+COMPLETE+ALBUMS+1969+1978%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gopolino","files":121,"time":1264166512,"description":"[b][color=red] VAN DER GRAAF GENERATOR\n\nCOMPLETE ALBUMS \n(1969-1978)[/color][/b]\n\n[b][color=green]::-&gt;Il Gruppo&lt;-::[/b][/color]\n\n[IMG]http://img163.imageshack.us/img163/4213/vdggearly69pic.jpg[/IMG]\n \n    * Peter Hammill: Voce, chitarra, pianoforte (1967-1978,2005-attuale)\n    * Hugh Banton: Tastiere, basso elettrico, chitarra (1968-1976,2005-attuale)\n    * Guy Evans: Batteria (1968-1978,2005-attuale)\n    * David Jackson: Fiati (1970-1977,1978,2005)\n\n[b][color=green]::-&gt;Tracklist&lt;-::[/color][/b]\n\n[b]The Aerosol Grey Machine (Repertoire, 1969):[/b]\n\n[IMG]http://img37.imageshack.us/img37/4394/aerosolmercuryfront.jpg[/IMG]\n\n1. Afterwards\n2. Orthenthian St (Part I)\n3. Orthenthian St (Part II)\n4. Running Back\n5. Into A Game\n6. Aerosol Grey Machine\n7. Black Smoke Yen\n8. Aquarian\n9. Necromancer\n10. Octopus\n\n[b]The Least We Can Do Is Wave To Each Other (Blue Plate, 1970):[/b]\n\n[IMG]http://img685.imageshack.us/img685/3208/theleast.jpg[/IMG]\n\n1. Darkness (11/11)\n(Kensington Court, 1968)\n2. Refugees\n(Kensington Court, 1969)\n3. White Hammer\n(Kensington Court/Derby, 1969)\n4. Whatever would Robert have said\n(Fawley Road, W. Kensington, 1970)\n5. Out of my Book\n(Fawley Road, 1969)\n6. After the Flood\n(Fawley Road, 1969)\n7. Boat of Millions of Years (2005 re-master only)\n(Derby, 1967)\n8. Refugees (Single version - 2005 re-master only)\n(Kensington Court, 1969)\n\n[b]H To He, Who Am The Only One (Blue Plate, 1970):[/b]\n\n[IMG]http://img46.imageshack.us/img46/9915/htohe.jpg[/IMG]\n\n1. Killer\n(Manchester, 1968)\n2. House with no Door\n(Fawley Road, 1970)\n3.The Emperor in his War Room\n(Fawley Road/Derby, 1970)\n   i) The Emperor\n   ii) The Room\n4.Lost\n(Fawley Road/Derby, 1970)\n   i) The dance in sand and sea\n   ii) The dance in frost\n5.Pioneers over c\n(Fawley Road, 1970)\n6.Squid 1/Squid 2/Octopus (2005 re-master only)\n(Southampton, 1967)\n7.The Emperor in his War Room (2005 re-master only)\n(Fawley Road/Derby, 1970)\n   (First version)\n\n[b]Pawn Hearts (Blue Plate, 1971):[/b]\n\n[IMG]http://img191.imageshack.us/img191/2860/pawnhts.jpg[/IMG]\n\n1. Lemmings (including COG)\n1a. Theme One (US only)\n2. Man-Erg\n3. A Plague of Lighthouse Keepers\n   a. Eyewitness\n   b. Pictures/Lighthouse\n   c. Eyewitness\n   d. S.H.M.\n   e. Presence of the Night\n   f. Kosmos Tours\n   g. (Custard's) Last Stand\n   h. The Clot Thickens\n   i. Land's End (Sineline)\n   j. We Go Now\nOn the 2005 re-master only:\n4. Theme One (original mix)\n5. w\n6. Angle of Incidents\n7. Ponker's Theme\n8. Diminutions\n\n[b]Godbluff (Blue Plate, 1975):[/b]\n\n[IMG]http://img685.imageshack.us/img685/9961/godbluff.jpg[/IMG]\n\n1.The Undercover Man\n2.Scorched Earth\n3.Arrow\n4.The Sleepwalkers\nOn 2005 re-masters only:\n5.Forsaken Gardens\n6.A Louse is not a Home\n\n[b]Still Life (Blue Plate, 1976):[/b]\n\n[IMG]http://img190.imageshack.us/img190/4641/stillife.jpg[/IMG]\n\n1. Pilgrims\n2. Still Life\n3. La Rossa\n4. My Room (Waiting for Wonderland)\n5. Childlike Faith in Childhood's End\n\n[b]World Record (Blue Plate, 1976):[/b]\n\n[IMG]http://img46.imageshack.us/img46/3445/worldq.jpg[/IMG]\n\n1. When She Comes\n2. A Place to Survive\n3. Masks\n4. Meurglys III, The Songwriters Guild\n5. Wondering\n\n[b]The Quiet Zone The Pleasure Dome (Blue Plate, 1977):[/b]\n\n[IMG]http://img190.imageshack.us/img190/1395/quietzon.jpg[/IMG]\n\n1. Lizard Play\n2. The Habit of the Broken Heart\n3. The Siren Song\n4. Last Frame\n5. The Wave\n6. Cat's Eye / Yellow Fever (running)\n7. The Sphinx in the Face\n8. Chemical World\n9. The Sphinx Returns\n\n[b]Vital (Blue Plate, 1978):[/b]\n\n[IMG]http://img191.imageshack.us/img191/8623/vital.jpg[/IMG]\n\n1. Ship of Fools\n2. Still Life\n3. Last Frame\n4. Mirror Images\n5. Medley (parts of A Plague\nof Lighthouse Keepers\nand The Sleepwalkers)\n6. Pioneers Over C\n7. Sci-finance\n8. Door\n9. Urban\n10. Nadir's Big Chance\n\n\n[b][color=green]::-&gt;Biografia&lt;-::[/color][/b]\n\nSe c'ÃƒÂ¨ un gruppo progressive che merita l'aggettivazione di &quot;esistenziale&quot; questi sono sicuramente i Van Der Graaf Generator e se c'ÃƒÂ¨ un gruppo, in tale ambito, che si ÃƒÂ¨ salvato, per lo meno nella considerazione critica, dal terremoto punk della fine degli anni settanta questi sono ancora i VDGG.\nTroppo bravi, troppo lontani da cascami esibizionistici e da derive virtuosistiche, troppo profondi e drammatici e in fondo troppo proiettati sul futuro per non essere ricordati e stimati anche ai giorni nostri.\nL'estetica e la filosofia che sottende la musica dei VDGG, poi, non trascende il reale nel favolistico, come nei Genesis, non lo dissolve nell'indeterminato, come nella grande progettualitÃƒÂ  musicale dei King Crimson, non lo avviluppa in forme estetizzanti e alla fine rassicuranti, come nel formalismo degli Emerson, Lake and Palmer o degli Yes, bensÃƒÂ¬ lo sviluppa nel simbolismo e nella metafora dello psicodramma, nella forza catartica dell'angoscia del divenire.\nNon fiabe, elfi, gnomi, ma l'angoscia del reale in una musica che quasi fin dall'inizio vive il senso del dramma in una chiave che ÃƒÂ¨ sÃƒÂ¬ epica, ma al contempo quotidiana e suburbana; in tal senso un gruppo molto avanti sui suoi tempi, esilmente ma inequivocabilmente giÃƒÂ  proiettato verso il superamento del progressive come determinazione stilistica, spostando invece i criteri del genere in un'ottica di strategia compositiva e di progettualitÃƒÂ  artistica ed emozionale.\nIl gruppo esordisce discograficamente nel 1969 con Aerosol Grey Machine ed ÃƒÂ¨ costituito da Hugh Banton alle tastiere, Keith Ellis al basso, Guy Evans alla batteria, un misterioso Jeff al flauto e da Peter Hammill, autore della totalitÃƒÂ  dei brani e leader indiscusso, alla chitarra e alla voce.\nIl disco ÃƒÂ¨ generalmente poco considerato e giudicato di transizione, ma in realtÃƒÂ  contiene in sÃƒÂ©, in maniera se si vuole incompleta e confusa, giÃƒÂ  tutti gli elementi degli anni a venire: musica percorsa da una strana tensione sotterranea, tenuta assieme dall'organo di Hugh Banton, antieroe delle tastiere in un'epoca di solisti, e percorsa dai fremiti della vocalitÃƒÂ  di Hammill, all'esordio ancora timida e flautata; i pezzi perÃƒÂ² hanno una struttura melodica che se giÃƒÂ  contiene elementi complessi e una forte tendenza al chiaroscuro, dall'altra appare poco limpida e coinvolgente, con il risultato di musica emotivamente forte ma di forma confusa, indeterminata; spesso i pezzi sono condotti dalla chitarra acustica, che il gruppo successivamente abbandonerÃƒÂ  quasi del tutto, dando a volte una nota quasi cantautorale a livello di arrangiamento; comunque il disco contiene due pezzi notevoli: &quot;Afterward&quot; e &quot;The Necromancer&quot;.\nPassa un anno, esce The least we can do is wave to each other, con un line-up composto da Hammill, Banton, Evans e da David Jackson ai fiati, e sembra che ne siano passati dieci tanto il salto ÃƒÂ¨ notevole; il songwriting di Hammill ÃƒÂ¨ molto piÃƒÂ¹ maturo e strutturato, l'organo di Banton descrive volute armoniche inconfondibili, la voce appare piÃƒÂ¹ piena e convincente, guadagnando in personalitÃƒÂ  e aggressivitÃƒÂ , poi a far quadrare il cerchio c'ÃƒÂ¨ l'acquisizione del sax di Jackson, che con il suo stile lirico e dissonante caratterizzerÃƒÂ  il sound del gruppo per gli anni a venire. La prima facciata del vecchio LP, poi, ÃƒÂ¨ splendida, con la tensione e la raffinatezza armonica di &quot;Darkness&quot; e &quot;White Hammer&quot; e il crescendo lirico della straordinaria ballata &quot;Refugee&quot;, certamente uno dei brani piÃƒÂ¹ famosi del gruppo.\nIl disco non ha successo di vendita ma non passa inosservato se sua maestÃƒÂ  Fripp in persona scomoda la sua chitarra per suonare in un brano del successivo H to he who am the only one, disco compiuto e impeccabile in tutti i suoi 5 brani, tra cui si stagliano la melanconica e pianistica &quot;House with no door&quot;, la inquietante, romantica &quot;Lost&quot; e l'aggressiva &quot;Killer&quot;. H to he ÃƒÂ¨ un disco nel quale prende piena forma e coscienza il sound cupo e drammatico, ma sempre estremamente raffinato e non scevro da efficacissime aperture melodiche, del gruppo.\nAlla fine, perÃƒÂ², ÃƒÂ¨ un disco di transizione, e ci se ne accorge l'anno successivo, il 1972, quando esce Pawn Hearts, considerato giustamente il capolavoro dei VDGG e uno dei dischi cardine del progressive tutto. Difficile descrivere la suite &quot;The Plague Of Lighthouse Keeper&quot;, con i suoi saliscendi emotivi, con la teatralitÃƒÂ  dell'impostazione vocale, con lo splendore delle parti in cui Hammill al piano stempera l'angoscia e la risolve in un romanticismo drammatico e letterario; difficile descrivere la tensione estraniante di un brano che racconta di un mondo altro ma incombente, di una musicalitÃƒÂ  quasi aliena ma presente, impossibile da ignorare. Tale splendore rischia di far passare in secondo piano gli altri due brani, altri due capolavori, &quot;Man-erg&quot; e &quot;Lemmings&quot;.\nDopo Pawn Hearts Hammill scioglie il gruppo per proseguire i suoi progetti solisti, per poi ricompattarlo a sorpresa nel 1975 con Godbluff. Parte qui la seconda fase dell'esperienza dei Van Der Graaf, una fase evolutiva di estremo interesse ma sostanzialmente ignorata e sottovalutata dal pubblico, anche quello legato al genere, e dalla critica.\nGodbluff ÃƒÂ¨ un disco buono e un po' deludente al contempo. Tra pezzi di retrogusto romantico come &quot;Undercoverman&quot; e l'aggressivitÃƒÂ  urlata di &quot;Sleepwalker&quot;, il gruppo sembra non poter ripetere le meraviglie del periodo precedente, comincia perÃƒÂ² ad affiorare una maggiore urgenza e secchezza negli arrangiamenti con la voce di Hammill che spesso si erge in un urlo disperato.\nMeglio farÃƒÂ  &quot;Still Life&quot; l'anno successivo. Se l'iniziale &quot;Pilgrim&quot; ci porta indietro di qualche anno, il successivo brano che dÃƒÂ  il titolo all'album ÃƒÂ¨ qualcosa di terrificante e in qualche modo di inedito e ineguagliato, con un inizio inquietante per voce e organo e con il successivo intervento di tutto l'organico in un brano disperato nel suo dispiegarsi contorto.\nIl successivo World Record farÃƒÂ  ancora meglio, i pezzi assumono qualcosa di alienante, gli arrangiamenti sono articolati ma anche piÃƒÂ¹ schematici rispetto al passato, la tensione esistenziale dei brani rimane altissima tra un potenziale hit come la solenne &quot;Wondering&quot; e il minimalismo che fa capolino nella lunga e complessa &quot;Meurglis III&quot;. L'involucro rimane legato al rock progressivo, ma sottotraccia si erge un'estetica diversa, piÃƒÂ¹ ruvida e meno consolatoria.\nWorld Record ÃƒÂ¨ il disco migliore della seconda fase del gruppo, se non altro per la presenza degli oltre 20 minuti della giÃƒÂ  citata &quot;Meurglis III&quot;, in assoluto una delle migliori composizioni di Hammill, brano articolato, fortemente pittorico e teatrale, e per il livello quasi perfetto di interplay strumentale, in particolare tra l'organo di Banton e il sax di Jackson.\nL'anno successivo esce &quot;The quiet zone/the pleasure dome&quot; con il violino di Graham Smith che sostituisce il sax di Jackson. Siamo sempre su livelli ottimi e l'introduzione del violino accentua ancor piÃƒÂ¹ gli aspetti lirici e melodrammatici della musica interagendo alla perfezione con la voce di Hammill. Il disco, comunque, contiene alcuni brani deboli e non ÃƒÂ¨ al livello dei precedenti.\nForse Hammill ÃƒÂ¨ conscio che il generatore sta esaurendo la sua carica e nel 1978 il gruppo conclude definitivamente la sua parabola, ma prima esce un live, Vital; in copertina i musicisti sono statuine inanimate e ciÃƒÂ² introduce un disco che ÃƒÂ¨ la logica conclusione della parabola musicale dei VDGG e in qualche modo la sua sintesi estrema: un disco di una tensione insostenibile, quasi brutale, cattiva e disperata, suonato in maniera aspra e ruvida, spesso guidato da secchi accordi di chitarra elettrica e dalla vocalitÃƒÂ  del leader, sempre piÃƒÂ¹ drammatica e teatrale, ma al contempo lontanissimo da derive rumoristiche e cacofoniche e da ingenui spontaneismi; a suo modo un disco molto piÃƒÂ¹ vicino a una certa new wave che al progressive e che rappresenta il precipitato emotivo di ciÃƒÂ² che il gruppo ÃƒÂ¨ sempre stato e che ha convogliato di volta in volta in forme espressive diverse.\nCon Vital si conclude la storia del gruppo, proseguirÃƒÂ  Hammill da solista con risultati alterni ma sempre onesti, un gruppo estraneo alle facili trappole del manierismo e influente anche al di lÃƒÂ  dei confini, per quanto vasti e labili, del progressive. \n\n\n[b][color=green]::-&gt;Dati Tecnici&lt;-::[/color][/b]\n[color=red][b]\nFLAC + CUE\nCOVER ED INSIDE inclusi\n[/b][/color]\n\n\n[color=RED][B]\n\nTNTVILLAGE.SCAMBIOETICO.ORG[/b][/color]","torrent":{"xt":"urn:btih:f44e400ed6813d1a61a7095e5a282f8cc7e327fb","amp;dn":"VAN+DER+GRAAF+GENERATOR+-+COMPLETE+ALBUMS+1969+1978%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f44e400ed6813d1a61a7095e5a282f8cc7e327fb","infoHashBuffer":{"type":"Buffer","data":[244,78,64,14,214,129,61,26,97,167,9,94,90,40,47,140,199,227,39,251]},"announce":[],"urlList":[]}}