{"title":"Foundations Of Cognitive Psychology - (Malestrom)","uid":4819528,"size":13503360,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f458cec55081b61e4c0dae7602930e8c066eae4a&amp;dn=Foundations+Of+Cognitive+Psychology+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1238696996,"description":" &lt;a href=&quot;http://www.image-upload.net/images/paakuth8ltkuanchwac8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/paakuth8ltkuanchwac8.jpg&lt;/a&gt;\n\nPublisher: The MIT Press (September 9, 2002)\nLanguage: English\nISBN-10: 0262621592\nISBN-13: 978-0262621595\n\nProduct Description\nScientists from many disciplines, including physics, chemistry, biology, and neuroscience, contribute to the study of cognition. Cognitive psychology, the science of the human mind and of how people process information, is at the core of empirical investigations into the nature of mind and thought. This anthology is based on the assumption that cognitive psychology is at heart empirical philosophy. Many of the core questions about thought, language, perception, memory, and knowledge of other people's minds were for centuries the domain of philosophy. The book begins with the philosophical foundations of inquiry into the nature of mind and thought, in particular the writings of Descartes, and then covers the principal topics of cognitive psychology including memory, attention, and decision making. The book organizes a daunting amount of information, underlining the essentials, while also introducing readers to the ambiguities and controversies of research. It is arranged thematically and includes many topics not typically taught in cognition courses, including human factors and ergonomics, evolutionary psychology, music cognition, and experimental design. The contributors include Daniel Dennett, Daniel Kahneman, Jay McClelland, Donald Norman, Michael Posner, Stephen Palmer, Eleanor Rosch, John Searle, Roger Shepard, and Anne Treisman.\n\nAbout the Author\nDaniel J. Levitin is Assistant Professor of Psychology at McGill University, where he holds the Bell Chair in the Psychology of Electronic Communication and the FQRT Strategic Professor Chair in Psychology.","torrent":{"xt":"urn:btih:f458cec55081b61e4c0dae7602930e8c066eae4a","amp;dn":"Foundations+Of+Cognitive+Psychology+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f458cec55081b61e4c0dae7602930e8c066eae4a","infoHashBuffer":{"type":"Buffer","data":[244,88,206,197,80,129,182,30,76,13,174,118,2,147,14,140,6,110,174,74]},"announce":[],"urlList":[]}}