{"title":"Gorillas in the Mist (1988)(dvd5)(Nl subs) RETAIL SAM","uid":8232003,"size":4681532712,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f46bb678d8e2d253cddc092bfb4d4a1f18601bb0&amp;dn=Gorillas+in+the+Mist+%281988%29%28dvd5%29%28Nl+subs%29+RETAIL+SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Sammynet","files":-1,"time":1362748491,"description":"Gorillas in the Mist (1988) The Story of Dian Fossey\n\nDutch\nHoog in de jungle van Rwanda, diep verscholen in het diepe groen, zit een familie berggorilla's.\nZe ontspannen zich en spelen in het gefilterde zonlicht. Bij hen hurkt een vrouw die hun\nbewegingen imiteert en doet alsof ze op bladeren kauwt om door het dominante mannetje aanvaard\nte worden. Die vrouw is Dian Fossey, een primatologe met een heel aparte benadering van haar\nonderwerp. Zo apart, dat haar imposante, charismatische verschijning en haar onverzettelijkheid\nhaar tot doelwit van de lokale stropers maken. De film vertelt het waargebeurde verhaal van\nDian Fossey, haar studie van gorilla's en haar pogingen om de met uitsterven bedreigde apen te\nbeschermen.\n\nEnglisch\nGorillas in the Mist is based on the autobiographical 1983 book by naturalist Dian Fossey.\nBefore the book could be brought before the cameras, Fossey had been mysteriously killed;\nher death provides a logical, if somewhat ghoulish climax to the film. A Kentucky girl,\nFossey (Sigourney Weaver) is inspired by famed anthropologist Louis Leakey (Iain Cuthbertson)\nto devote her life to the study of primates. Traveling into deepest Africa, Fossey becomes\nfascinated with the lives and habits of the rare mountain gorillas of the Ugandan wilderness.\nStudying them at close quarters, Fossey develops a means of communicating with the gorillas,\nand in so doing becomes obsessed with the beasts' well-being. She is so devoted to &quot;her&quot;\nmountain that she loses the opportunity for a romance with a National Geographic photographer\n(Bryan Brown). Appalled by the poaching of the gorillas for their skins, Fossey complains to\nthe Ugandan government, which dismisses her by explaining that poaching is the only means by\nwhich some of the Ugandan natives can themselves survive. She refuses to accept this, and\nbecomes a militant animal-rights activist, burning down the poachers' villages and even staging\na mock execution of one of the offenders.\n\nSpot Information\nSource............: RETAIL\nFormaat...........: DVD5\nVideo.............: PAL / 16:9\nAudio.............: Dolby Digital 5.1, DTS\nGenre.............: Biography / Drama \nSpeelduur.........: 129 minutes\nMenu..............: Yes\njaar uitgave......: 1988\nCover &amp; label.....: Yes\nAudio.............: Englisch, French, German, Italian\nSubs..............: Englisch, French, Italian, Dutch, Arabic, Spanich, Portuguese, German, Romanian\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0095243/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0095243/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1737&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1737&lt;/a&gt;\n\nSeeden wordt op prijs gesteld, om deze torrent in leven te houden\n\nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:f46bb678d8e2d253cddc092bfb4d4a1f18601bb0","amp;dn":"Gorillas+in+the+Mist+%281988%29%28dvd5%29%28Nl+subs%29+RETAIL+SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f46bb678d8e2d253cddc092bfb4d4a1f18601bb0","infoHashBuffer":{"type":"Buffer","data":[244,107,182,120,216,226,210,83,205,220,9,43,251,77,74,31,24,96,27,176]},"announce":[],"urlList":[]}}