{"title":"Life Eaters HC (WildStorm-DC) (2003) (Soze`s Scans).cbr","uid":10849881,"size":94420538,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f475129a77f7c58c2ddc359ab841bccabdebfca7&amp;dn=Life+Eaters+HC+%28WildStorm-DC%29+%282003%29+%28Soze%60s+Scans%29.cbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nemesis43","files":1,"time":1408802755,"description":"Life Eaters HC (WildStorm-DC) (2003) (Soze`s Scans)\n\n\n\nThe history of the comic follows ours, until one night during the winter of 1943, when a number of bright lights appeared over Nazi-occupied Europe. Intentionally or otherwise, the slaughter of the death camps has somehow been used to summon the Aesir, Norse gods. Quickly allying themselves with the gods, the Nazis are able to push aside their mortal foes. The extended war has an amazing effect on human technology - by the fifties, the American military has a manned spy satellite.\n\nThe trickster, Loki, works against his fellow Aesir. On the night they arrived, Loki used his magic to whisk hundreds of thousands of death camp internees to safety in Persia. Thanks to his knowledge of magic, the American government cracks the necromancy angle - before that, they had assumed the Aesir were secretly alien invaders. (This is a reversal of roles from the The Mighty Thor series of Marvel Comics, which partially inspired Brin, and where Loki is the unquestioned villain).\n\nAs the Nazis continue to conquer the world, with the help of their Japanese allies (and their Shinto gods), the story of the necromancy spreads. As a result of &quot;Asian faith and African desperation... and all the madness of the tropics&quot;, the multiple gods of the developing world are given form through human sacrifice, band together and fight the Aesir (who have to keep to colder regions). As the Tropicals advance, they burn the Arabian oilfields, leading to global warming. With the atomic-armed Nazis beginning to understand the principles of nuclear winter, the remaining free Americans must race against time to prevent the fulfillment of an ancient prophecy...","torrent":{"xt":"urn:btih:f475129a77f7c58c2ddc359ab841bccabdebfca7","amp;dn":"Life+Eaters+HC+%28WildStorm-DC%29+%282003%29+%28Soze%60s+Scans%29.cbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f475129a77f7c58c2ddc359ab841bccabdebfca7","infoHashBuffer":{"type":"Buffer","data":[244,117,18,154,119,247,197,140,45,220,53,154,184,65,188,202,189,235,252,167]},"announce":[],"urlList":[]}}