{"title":"Chinese Dress - From the Qing Dinasty (Art Ebook).epub","uid":9945152,"size":38541293,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f4ba6c132cd6b06cf3fa27619a81da2325d21723&amp;dn=Chinese+Dress+-+From+the+Qing+Dinasty+%28Art+Ebook%29.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1397299005,"description":"Chinese Dress: From the Qing Dynasty to the Present by Valery Garrett\nEnglish | 2008 | ISBN: 0804836639 | ISBN-13: 9780804836630 | 240 pages | EPUB | 37 MB\n\nAgainst a background of historical, cultural and social change comes Chinese Dress, a comprehensive and sumptuously illustrated book examining the extraordinary range of Chinese dress. \n\nSkillfully weaving together everything from court and formal costumes through to the working attire of the lower classes and the latest fashions of New China, Chinese Dress tells the story of the evolution of Chinese clothing. The first section details attire worn during the Qing dynasty by the emperors and their consorts, as well as the mandarins, merchants, and their womenfolk, both Manchu and Chinese. The following sections pay particular attention to the dramatic changes in clothing that took place in China from the Republican period, including rural dress and children's wear, through to dress in New China from 1949 to the present day. An engaging and original text, Chinese Dress is the essential reference for costume historians, fashion designers and collectors, as well as lovers of beautiful clothes everywhere.","torrent":{"xt":"urn:btih:f4ba6c132cd6b06cf3fa27619a81da2325d21723","amp;dn":"Chinese+Dress+-+From+the+Qing+Dinasty+%28Art+Ebook%29.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4ba6c132cd6b06cf3fa27619a81da2325d21723","infoHashBuffer":{"type":"Buffer","data":[244,186,108,19,44,214,176,108,243,250,39,97,154,129,218,35,37,210,23,35]},"announce":[],"urlList":[]}}