{"title":"Melanie - Brand New Key","uid":4765505,"size":99041284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f532acc05d7e819e3214178929a07e798d1b7d7f&amp;dn=Melanie+-+Brand+New+Key&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"2nafish","files":-1,"time":1236855088,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Brand New Key&quot; is a pop song written by folk singer Melanie (Melanie Safka), which became a novelty hit in 1971-2. Taken from Melanie's album Gather Me the song (also known as &quot;The Rollerskate Song&quot;) was her biggest hit, reaching #1 on the Billboard Hot 100 singles chart in December 1971 and January 1972. It reached #1 in Canada and Australia, and #4 in the UK charts. Melanie's version of &quot;Brand New Key&quot; was also featured in the 1997 film Boogie Nights.\n\nMelanie Anne Safka-Schekeryk (born February 3, 1947, in Astoria, New York City) is an American singer-songwriter.\n\nUsually known professionally as Melanie, she is best known for her hits &quot;Brand New Key&quot;, &quot;Lay Down (Candles in the Rain)&quot; and &quot;What They Done To My Song Ma&quot;. Melanie has sold over 25 million records over the course of her career.\n\nMany listeners detected innuendo in the lyrics, with the key in its lock symbolizing sexual intercourse, or in phrases like &quot;I go pretty far&quot; and &quot;I been all around the world&quot;. The phrase &quot;new key&quot; could be interpreted as &quot;nookie&quot;, slang for sexual intercourse.\n\nMelanie has acknowledged the possibility of reading sexual innuendo in the song:\n\n    &quot;Brand New Key I wrote in about fifteen minutes one night. I thought it was cute; a kind of old thirties' tune. I guess a key and a lock have always been Freudian symbols, and pretty obvious ones at that. There was no deep serious expression behind the song, but people read things into it. They made up incredible stories as to what the lyrics said and what the song meant. In some places, it was even banned from the radio. &quot;My idea about songs is that once you write them, you have very little say in their life afterward. It's a lot like having a baby. You conceive a song, deliver it, and then give it as good a start as you can. After that, it's on its own. People will take it any way they want to take it.&quot;\n\nIt was on the Neighborhood label that Melanie had her biggest American hit with the novelty-sounding 1972 number one, &quot;Brand New Key&quot; (often referred to as &quot;The Roller Skate Song&quot;). &quot;Brand New Key&quot; sold over three million copies worldwide and was featured in the 1997 movie Boogie Nights.\n\nWhen first released, Brand New Key was banned by some radio stations due to the lyrics being interpreted as being sexual innuendo:\n\n    &quot;I got a brand new pair of roller skates / You got a brand new key / I think that we should get together and try them out you see / I been looking around awhile / You got something for me / Oh! I got a brand new pair of roller skates / You got a brand new key. / I ride my bike, I roller skate, don't drive no car / Don't go too fast, but I go pretty far / For somebody who don't drive / I been all around the world / Some people say I've done alright for a girl...&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f532acc05d7e819e3214178929a07e798d1b7d7f","amp;dn":"Melanie+-+Brand+New+Key","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f532acc05d7e819e3214178929a07e798d1b7d7f","infoHashBuffer":{"type":"Buffer","data":[245,50,172,192,93,126,129,158,50,20,23,137,41,160,126,121,141,27,125,127]},"announce":[],"urlList":[]}}