{"title":"The Basics of IT Audit- Syngress 2013 [PDF]","uid":9439056,"size":5769349,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f576db0ebb895006a97743f1fff987c6cf5d9b6c&amp;dn=The+Basics+of+IT+Audit-+Syngress+2013+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"F1restorm","files":-1,"time":1388962857,"description":"The Basics of IT Audit: Purposes, Processes, and Practical Information \nAuthor: Stephen D. Gantz \nPublished: October 31, 2013\nPublisher: Syngress\nISBN: 9780124171596 \nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nTested on the above readers with no problems on laptop and Android tablet. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n_____________________________________________________________________________________\n\nThe Basics of IT Audit: Purposes, Processes, and Practical Information provides you with a thorough, yet concise overview of IT auditing. Packed with specific examples, this book gives insight into the auditing process and explains regulations and standards such as the ISO-27000, series program, CoBIT, ITIL, Sarbanes-Oxley, and HIPPA.\n\nIT auditing occurs in some form in virtually every organization, private or public, large or small. The large number and wide variety of laws, regulations, policies, and industry standards that call for IT auditing make it hard for organizations to consistently and effectively prepare for, conduct, and respond to the results of audits, or to comply with audit requirements.\n\nThis guide provides you with all the necessary information if you're preparing for an IT audit, participating in an IT audit or responding to an IT audit.\n\n-Provides a concise treatment of IT auditing, allowing you to prepare for, participate in, and respond to the results\n-Discusses the pros and cons of doing internal and external IT audits, including the benefits and potential drawbacks of each\n-Covers the basics of complex regulations and standards, such as Sarbanes-Oxley, SEC (public companies), HIPAA, and FFIEC\n-Includes most methods and frameworks, including GAAS, COSO, COBIT, ITIL, ISO (27000), and FISCAM\n\n","torrent":{"xt":"urn:btih:f576db0ebb895006a97743f1fff987c6cf5d9b6c","amp;dn":"The+Basics+of+IT+Audit-+Syngress+2013+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f576db0ebb895006a97743f1fff987c6cf5d9b6c","infoHashBuffer":{"type":"Buffer","data":[245,118,219,14,187,137,80,6,169,119,67,241,255,249,135,198,207,93,155,108]},"announce":[],"urlList":[]}}