{"title":"Osho_Bodhidharma The Greatest Zen Master-04.avi","uid":15223125,"size":198362842,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f623b799245060f8276220eca1bb2d11d1219be5&amp;dn=Osho_Bodhidharma+The+Greatest+Zen+Master-04.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1467750319,"description":"Bodhidharma: The Greatest Zen Master\r\nChapter #4\r\nChapter title: Buddhas don't practice nonsense\r\n6 July 1987 pm in Chuang Tzu Auditorium\r\nLength: \t105 mins\r\nBELOVED Bhagwan\r\nBUT SUPPOSE I DON'T SEE MY NATURE, CAN'T I STILL ATTAIN ENLIGHTENMENT BY INVOKING BUDDHAS, RECITING SUTRAS, MAKING OFFERINGS, OBSERVING PRECEPTS, PRACTICING DEVOTIONS, OR DOING GOOD WORKS?\r\nNO, YOU CAN'T.\r\nAND WHY NOT?\r\nIF YOU ATTAIN ANYTHING AT ALL IT'S CONDITIONAL, IT'S KARMIC. IT RESULTS IN RETRIBUTION. IT TURNS THE WHEEL. AND AS LONG AS YOU'RE SUBJECT TO BIRTH AND DEATH, YOU'LL NEVER ATTAIN ENLIGHTENMENT. TO ATTAIN ENLIGHTENMENT YOU HAVE TO SEE YOUR NATURE. UNLESS YOU SEE YOUR NATURE, ALL THIS TALK ABOUT CAUSE AND EFFECT IS NONSENSE. BUDDHAS DON'T PRACTICE NONSENSE. A BUDDHA IS FREE OF KARMA, FREE OF CAUSE AND EFFECT. TO SAY HE ATTAINS ANYTHING AT ALL IS TO SLANDER A BUDDHA. WHAT COULD HE POSSIBLY ATTAIN? EVEN FOCUSING ON A MIND, A POWER, AN UNDERSTANDING OR A VIEW IS IMPOSSIBLE FOR A BUDDHA. A BUDDHA ISN'T ONE-SIDED. THE NATURE OF HIS MIND IS BASICALLY EMPTY, NEITHER PURE NOR IMPURE. HE'S FREE OF PRACTICE AND REALIZATION. HE'S FREE OF CAUSE AND EFFECT.\r\nA BUDDHA DOESN'T OBSERVE PRECEPTS. A BUDDHA DOESN'T DO GOOD OR EVIL. A BUDDHA ISN'T ENERGETIC OR LAZY. A BUDDHA IS SOMEONE WHO DOES NOTHING, SOMEONE WHO CAN'T EVEN FOCUS HIS MIND ON A BUDDHA. A BUDDHA ISN'T A BUDDHA. DON'T THINK ABOUT BUDDHAS. IF YOU DON'T SEE WHAT I'M TALKING ABOUT, YOU'LL NEVER KNOW YOUR OWN MIND.\r\nPEOPLE WHO DON'T SEE THEIR NATURE AND IMAGINE THEY CAN PRACTICE DOING NOTHING ALL THE TIME ARE LIARS AND FOOLS. THEY FALL INTO ENDLESS SPACE. THEY'RE LIKE DRUNKS. THEY CAN'T TELL GOOD FROM EVIL. IF YOU INTEND TO PRACTICE DOING NOTHING, YOU HAVE TO SEE YOUR NATURE BEFORE YOU CAN PUT AN END TO RATIONAL THOUGHT. TO ATTAIN ENLIGHTENMENT WITHOUT SEEING YOUR NATURE IS IMPOSSIBLE.\r\nSTILL OTHERS COMMIT ALL SORTS OF EVIL DEEDS, CLAIMING KARMA DOESN'T EXIST. THEY ERRONEOUSLY MAINTAIN THAT SINCE EVERYTHING IS EMPTY, COMMITTING EVIL ISN'T WRONG. SUCH PERSONS FALL INTO A HELL OF ENDLESS DARKNESS WITH NO HOPE OF RELEASE. THOSE WHO ARE WISE HOLD NO SUCH CONCEPTION.\r\nBUT IF OUR EVERY MOVEMENT OR STATE, WHENEVER IT OCCURS, IS THE MIND, WHY DON'T WE SEE THIS MIND WHEN A PERSON'S BODY DIES?\r\nTHE MIND IS ALWAYS PRESENT. YOU JUST DON'T SEE IT.\r\nBUT IF THE MIND IS PRESENT, WHY DON'T I SEE IT?\r\nDO YOU EVER DREAM?\r\nOF COURSE.\r\nWHEN YOU DREAM, IS THAT YOU?\r\nYES, IT'S ME.\r\nAND IS WHAT YOU'RE DOING AND SAYING DIFFERENT FROM YOU?\r\nNO, IT ISN'T.\r\nBUT IF IT ISN'T, THEN THIS BODY IS YOUR REAL BODY. AND THIS REAL BODY IS YOUR MIND. AND THIS MIND, THROUGH ENDLESS KALPAS WITHOUT BEGINNING, HAS NEVER VARIED. IT HAS NEVER LIVED OR DIED, APPEARED OR DISAPPEARED, INCREASED OR DECREASED. IT'S NOT PURE OR IMPURE, GOOD OR EVIL, PAST OR FUTURE. IT'S NOT TRUE OR FALSE. IT'S NOT MALE OR FEMALE. IT DOESN'T APPEAR AS A MONK OR A LAYMAN, AN ELDER OR A NOVICE, A SAGE OR A FOOL, A BUDDHA OR A MORTAL. IT STRIVES FOR NO REALIZATION AND SUFFERS NO KARMA. IT HAS NO STRENGTH OR FORM. IT'S LIKE SPACE. YOU CAN'T POSSESS IT. AND YOU CAN'T LOSE IT. ITS MOVEMENTS CAN'T BE BLOCKED BY MOUNTAINS, RIVERS OR ROCK WALLS. ITS UNSTOPPABLE POWERS PENETRATE THE MOUNTAIN OF FIVE SKANDHAS AND CROSS THE RIVER OF SAMSARA. NO KARMA CAN RESTRAIN THIS REAL BODY. BUT THIS MIND IS SUBTLE AND HARD TO SEE. IT'S NOT THE SAME AS THE SENSUAL MIND. EVERYONE WANTS TO SEE THIS MIND. AND THOSE WHO MOVE THEIR HANDS AND FEET BY ITS LIGHT ARE AS MANY AS THE GRAINS OF SAND ALONG THE GANGES. BUT ASK THEM. THEY CAN'T EXPLAIN IT. THEY'RE LIKE PUPPETS. IT'S THEIRS TO USE. WHY DON'T THEY SEE IT?\r\n\r\nI feel extremely sad and sorry because Bodhidharma has the wrong kind of people taking the notes of his statements; they are mixing in their own confusions","torrent":{"xt":"urn:btih:f623b799245060f8276220eca1bb2d11d1219be5","amp;dn":"Osho_Bodhidharma+The+Greatest+Zen+Master-04.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f623b799245060f8276220eca1bb2d11d1219be5","infoHashBuffer":{"type":"Buffer","data":[246,35,183,153,36,80,96,248,39,98,32,236,161,187,45,17,209,33,155,229]},"announce":[],"urlList":[]}}