{"title":"Sex 01-12 (2013- |Digital|Darkness-Empire)","uid":10131027,"size":703665244,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f6d9b1e79e378d48b330fb621ec29dc3c12c9e77&amp;dn=Sex+01-12+%282013-+%7CDigital%7CDarkness-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1399882995,"description":"Simon Cooke used to be a superhero fighting crime on the seedy streets of Saturn City, but all that changed a while ago. Now he has returned to the cesspool and it may be worse than when he left. He just wants to run his business again, but old lovers, allies and enemies lurk about waiting to pounce on way or another. \nAll that plus he's sexually repressed beyond belief. \nJoe Casey's tremendous Sex is an adult, explicit and entertaining examination of the various ways in which we get our rocks off - or at least try to. Filthy, funny and full of great characters, dialogue and action, this is a comic definitely worth reading and the art by Piotr Kowalski and others is OUTSTANDING. The colors pop off the page and with so many varied interiors and crazy lettering, make the book stand out from anything else on offer. But it is Casey who truly shines here, and he lets the slow burn of the plot points develop as we grow more and more curious about what exactly happened in the past - with only a few glimpses here and there to keep us wanted. Such a tease. ;-)\n\nThis is all 12 issues released up to this point, so the first full year's worth of an arc so far. All the issues are digital copies by Darkness-Empire. There are also 1440px and 2048px scans by Novus available but I have opted for the Empire releases here because the single issue torrents are less well-seeded and I wanted to keep it unform; and there are already two packs with the Novus scans in them if you prefer. Thanks to all the scanners for their efforts as usual, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:f6d9b1e79e378d48b330fb621ec29dc3c12c9e77","amp;dn":"Sex+01-12+%282013-+%7CDigital%7CDarkness-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6d9b1e79e378d48b330fb621ec29dc3c12c9e77","infoHashBuffer":{"type":"Buffer","data":[246,217,177,231,158,55,141,72,179,48,251,98,30,194,157,195,193,44,158,119]},"announce":[],"urlList":[]}}