{"title":"Jay Allan - The Fall (Crimson Worlds #9)","uid":13135183,"size":212055636,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f70b4c5ac691d466d10ac2c7ca7eccea648cb733&amp;dn=Jay+Allan+-+The+Fall+%28Crimson+Worlds+%239%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":38,"time":1451895282,"description":"\nThe Epic Conclusion to the Crimson Worlds Series…\r\n\r\nErik Cain is the hero of the Marine Corps, a celebrated warrior who has led his grim veterans into every war the Alliance and mankind have faced. But now he has left the Corps, driven to near madness by an overwhelming need for vengeance. He has sworn to kill Gavin Stark, the madman responsible for his mentor’s death and, with a small band of dedicated followers, he is pursuing his prey across occupied space.\r\n\r\nMeanwhile, on a dozen colony worlds, Marines land to face the occupying forces of Stark’s Shadow Legions. They are supported by the Janissaries, their longtime enemies, now turned allies, but they are exhausted and outnumbered, facing a vastly superior enemy entrenched and waiting for them. But they are veterans, Marines and Janissaries both, men and women who have battled the armies of the First Imperium and lived to tell the tale. They know what is at stake, and they are determined to prevail, even if none of them come back.\r\n\r\nAnd on Earth, the economic collapse Stark engineered has shattered the Treaty of Paris and its century-long prohibition against terrestrial warfare. Millions are already dead as the war between the Superpowers spreads across the Earth, a growing conflagration that could end in apocalyptic nuclear, chemical, and biological exchanges between the powers.\r\n\r\nWill mankind live under the iron boot of Gavin Stark and his clone descendants forever? Or will Erik Cain and the Marines defeat him once and for all?\r\n\r\n\r\nRead by Jeff Bower\r\nFormat: MP3\r\nBitrate: 48 Kbps\r\nLength: 9 hrs and 40 mins\r\nUnabridged Audiobook\r\nRelease Date:01-07-15\r\nPublisher: Jay Allan Books","torrent":{"xt":"urn:btih:f70b4c5ac691d466d10ac2c7ca7eccea648cb733","amp;dn":"Jay+Allan+-+The+Fall+%28Crimson+Worlds+%239%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f70b4c5ac691d466d10ac2c7ca7eccea648cb733","infoHashBuffer":{"type":"Buffer","data":[247,11,76,90,198,145,212,102,209,10,194,199,202,126,204,234,100,140,183,51]},"announce":[],"urlList":[]}}