{"title":"Pas Chic Chic (ex-Godspeed You Black Emperor!, Fly Pan Am) 2008","uid":4290910,"size":73137101,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f8259a7342382e2b5528388bacea28cfddfeafbb&amp;dn=Pas+Chic+Chic+%28ex-Godspeed+You+Black+Emperor%21%2C+Fly+Pan+Am%29+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"lovver8","files":14,"time":1215895141,"description":"Pas Chic Chic - \\&quot;Au Contraire\\&quot; \n(ex-Godspeed You Black Emperor!, Fly Pan Am, Et Sans) - \n[2008/semprini Records] \nMP3 256kbps\n\n\nPas Chic Chic - \\&quot;Au Contraire\\&quot; \nRelease Date: April 1, 2008 \n\nPas Chic Chic is a bande a part, formed in the void like a Mayan Egg in autumn 2005. \n\nIn 2006, the band released a two-song limited edition vinyl seven inch single after only a handful of shows. Even though the band\\&amp;#039;s lyrics are in French they managed to build up a quick reputation as being one of the city\\&amp;#039;s brightest new acts, and found themselves embraced by its hometown\\&amp;#039;s Anglophone community. Over the next twelve months they generated much interest and were asked to participate in some pf the city\\&amp;#039;s biggest festivals including: Osheaga, Les Francofolies, FME and Suoni Per Il Popolo. \n\nThe music is a form of fractured francophone pop that brings to mind rhythms, melodies and approaches associated with shoegaze, psychedelia and tropicalia and it is the individuals that compose Pas Chic Chic that best define the originality, energy and identity of the band. \n\nAll the band members have come very different yet illustrious musical backgrounds that have morphed into the unique sound that makes Pas Chic Chic. \n\nSinger/guitarist Roger Tellier-Craig was a member of the legendary godspeed! you black emperor, as well as a founding member of Fly Pan Am and Set Fire To Flames. \n\nOther projects also include the group Et Sans and his DJ moniker sundown sundown. \n\nGuitarist Radwan Moumneh played in the celebrated hardcore band Cursed and along with two former members of godspeed / current A Silver Mt. Zion, he runs and engineers at the studio Hotel 2 Tango, where albums for Wolf Parade, The Dears, Arcade Fire, and Stuart Staples of the Tindersticks is just the short list of the impressive credentials for the studio. \n\nOther projects include the one man Jerusalem In My Heart. \n\nDrummer Eric Fillion, a former history teacher, has played in well-known punk acts Cobra Noir, The Black Hand, and IRE. \n\nBassist Eric Gingras was also a member of Fly Pan Am, Ghislain Poirer, and continues to play with Cian Ethrie and pursues a solo project as well. \n\nMarie-Douce sings and plays Farfisa, Maxi-Korg, and Mellotron. She published her own fanzine, ama-zine, and along with Roger started \\&quot;noa identificado\\&quot; music nights at Montreal\\&amp;#039;s own Casa Del Popolo.\n","torrent":{"xt":"urn:btih:f8259a7342382e2b5528388bacea28cfddfeafbb","amp;dn":"Pas+Chic+Chic+%28ex-Godspeed+You+Black+Emperor%21%2C+Fly+Pan+Am%29+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8259a7342382e2b5528388bacea28cfddfeafbb","infoHashBuffer":{"type":"Buffer","data":[248,37,154,115,66,56,46,43,85,40,56,139,172,234,40,207,221,254,175,187]},"announce":[],"urlList":[]}}