{"title":"The Beatles - Rain [original promo].VOB","uid":10466368,"size":101079040,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f8debceaeb9053464262fc61ac03d8d35c04eb4d&amp;dn=The+Beatles+-+Rain+%5Boriginal+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1404201291,"description":"The Beatles - Rain [original promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Rain&quot; is a song by the English rock band the Beatles, credited to Lennon and McCartney and first released in June 1966 as the B-side of the &quot;Paperback Writer&quot; single. Both songs were recorded during the sessions for the album Revolver though neither appears on that album.\n\nWritten by John Lennon, &quot;Rain&quot; has been called the Beatles' finest B-side, noted for its slowed-down rhythm track and backwards vocals, both of which were a hint of things to come on Revolver, released two months later.\n\nThree promotional films were made for the song &quot;Rain&quot;. These videos, along with other Beatles videos at the time, sparked George Harrison to say during the Beatles Anthology, &quot;So I suppose, in a way, we invented MTV.&quot;\n\nRecording began on 14 April 1966, in the same session as &quot;Paperback Writer&quot;, and concluded on 16 April, with a series of overdubs before mixing on the same day. At that time, The Beatles were enthused about experimenting in the studio to achieve new sounds and effects. These experiments were showcased in their influential seventh album, Revolver. Geoff Emerick, who was the engineer for both sessions, described one technique he used to alter the sonic texture of the track by recording the backing track &quot;faster than normal.&quot; When played back, slightly slower than the usual speed, &quot;the music had a radically different tonal quality. The opposite technique was used to alter the tone of Lennon's lead vocal: it was recorded with the tape machine slowed down, making Lennon's voice sound higher when played back.\n\nThe &quot;Paperback Writer&quot;/&quot;Rain&quot; single was the first release to use a new device invented by the maintenance department at Abbey Road called &quot;ATOC&quot; for &quot;Automatic Transient Overload Control&quot;. The new device allowed the record to be cut at a louder volume, louder than any other single up to that time. On the final mix of the single, Lennon played a 1965 Gretsch Nashville, Paul McCartney a 1964 Rickenbacker 4001S bass, Harrison a 1964 Gibson SG, and Ringo Starr used Ludwig drums. Both McCartney and Starr have been praised for their performances on their instruments in this song. Starr particularly liked his drumming effort.\n\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Rain_(Beatles_song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Rain_(Beatles_song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/kApDNaAFa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/kApDNaAFa&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 4000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 448kbps\n   Duration: 00:02:59\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.5\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:f8debceaeb9053464262fc61ac03d8d35c04eb4d","amp;dn":"The+Beatles+-+Rain+%5Boriginal+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8debceaeb9053464262fc61ac03d8d35c04eb4d","infoHashBuffer":{"type":"Buffer","data":[248,222,188,234,235,144,83,70,66,98,252,97,172,3,216,211,92,4,235,77]},"announce":[],"urlList":[]}}