{"title":"Danger_Mouse_Seasons_1_and_2","uid":4229711,"size":1850992640,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f8e3885a2cb34dd9659fa586525e684198e33e35&amp;dn=Danger_Mouse_Seasons_1_and_2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"tgpf","files":17,"time":1212982993,"description":"Series 1 &amp; 2 \n_______________ \n\nDangerMouse is a wacky and hilarious adventure featuring a white secret agent mouse and his trusty bumbling sidekick/assistant, Penfold. Together they are given assignments by their commander, Colonel K. The orders consisted of doing battle to save the world from monsters, master thieves, and crazed fiends of all types. The most prolific threat is DangerMouse&amp;#039;s arch nemesis, a meglomanic frog named Baron Silas Greenback and his henchman, Stiletto. This was originally a British animated television series that aired in the 1980s. It loosely parodies British spy fiction, particularly the James Bond and the Danger Man series. \n\nIn the United States it was broadcast on Nickelodeon. \nVideo: XVID Resolution: 512 x 368 FPS: 29.97 fps \nAudio: MP3 Frequency: 44100 Hz \nLanguage: English \n_______________ \n\nSeries 1 Episodes \n\n1. &quot;Rogue Robots&quot; (28 September 1981) \nDanger Mouse discovers that Baron Greenback is behind a wave of attack robots that have been going after agents. \n\n2. &quot;Who Stole the Bagpipes?&quot; (30 September 1981) \nDanger Mouse and Penfold travel to Scotland to keep Greenback from destroying the world with music from all the world&amp;#039;s bagpipes. \n\n3. &quot;Trouble With Ghosts&quot; (5 October 1981) \nGreenback captures Colonel K and has the Colonel send Danger Mouse and Penfold on holiday to a haunted castle in Transylvania. \n\n4. &quot;The Chicken Run&quot; (7 October 1981) \nGreenback steals a growth serum from Professor Squakencluck and with it creates giant chickens to take over the world. \n\n5. &quot;The Martian Misfit&quot; (12 October 1981) \nGreenback creates a `Martian&amp;#039; to keep Danger Mouse busy while he sets out on a crime spree. \n\n6. &quot;The Dream Machine&quot; (14 October 1981) \nGreenback drives Danger Mouse and Penfold crazy with his dream machine. \n\n7. &quot;Lord of the Bungle&quot; (19 October 1981) \nA fall causes Penfold to think he is the Lord of the Jungle, when he and Danger Mouse try to find out why elephants are being turned into sugar cubes. \n\n8. &quot;Die Laughing&quot; (21 October 1981) \nGreenback is causing the world&amp;#039;s leaders to laugh themselves to death in his latest plot to become ruler of the Earth. \n\n9. &quot;The World of Machines&quot; (26 October 1981) \nGreenback kidnaps Penfold to lure Danger Mouse into a spaceship and send both of them to a planet ruled by machines. \n\n10. &quot;Ice Station Camel&quot; (28 October 1981) \nDanger Mouse must stop Greenback who has stopped the Earth&amp;#039;s rotation which in turn has canceled gravity. \n\n11. &quot;The Plague of Pyramids&quot; (14 Dec 1981) \nDanger Mouse discovers Greenback is behind a plague of pyramids which are popping up all over England and threatening to sink England. \n\n\nSeries 2 Episodes \n12. &quot;Custard&quot; (4 January 1982) \nDangerMouse travels to outer space to find a custard-mite and bring him to Earth after Greenback floods the world with instant custard. \n\n13. &quot;Close Encounters of the Absurd Kind&quot; (11 January 1982) \nAliens capture DangerMouse and Penfold for use in an experiment when they journey to the Bermuda Triangle out in the sea on the trail of Baron Greenback. \n\n14. &quot;The Duel&quot; )18 January 1982) \nGreenback tells DangerMouse that he will go straight and be good, if DangerMouse beats him in a duel and if DangerMouse promises to quit his job if he is the loser. \n\n15. &quot;The Day of the Suds&quot; (25 January 1982) \nWashing machines under the control of Greenback threaten to destroy London city. \n\n16. &quot;The Bad Luck Eye of the Little Yellow God&quot; (1 February 1982) \nGreenback has stolen a bad luck charm for use in a bad luck ray. DangerMouse manages to get it and attempts to give it back to the original owners who don&amp;#039;t really want it back. \n\n17. &quot;The Four Tasks of DangerMouse&quot; (8 February 1982) \nGreenback kidnaps Penfold to get DangerMouse to bring him four ingredients needed for an evil spell to take over the world. DangerMouse meets Count Duckula when one ingredient turns out to be the feather of a vampire duck. \n","torrent":{"xt":"urn:btih:f8e3885a2cb34dd9659fa586525e684198e33e35","amp;dn":"Danger_Mouse_Seasons_1_and_2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8e3885a2cb34dd9659fa586525e684198e33e35","infoHashBuffer":{"type":"Buffer","data":[248,227,136,90,44,179,77,217,101,159,165,134,82,94,104,65,152,227,62,53]},"announce":[],"urlList":[]}}