{"title":"Sexually Broken--Roxy Rox turned into cocksucking machine, bruta","uid":9542236,"size":826650766,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:f944f8398df8574872113e9a28f5bb673388dcd0&amp;dn=Sexually+Broken--Roxy+Rox+turned+into+cocksucking+machine%2C+bruta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1391069153,"description":"Roxy Rox turned into cocksucking machine, brutal deepthroat, blindfolded, bound, drools helplessly! | Roxy Rox | Matt Williams\n\nJanuary 29, 2014\n\n\nMP4 only.\n\n\nRoxy Rox is smoking hot with a model body and an out of control sex drive. A sex drive so strong it drove her into porn so that she could get it properly satisfied. Luckily for Roxy, satisfying out of control sluts is what Sexuallybroken does best. Today she is going to get to show just how well her training took from all those years of dick sucking practice.\n\nJust to make it interesting, we bind her down onto the most powerful vibrator in the world. A sybian sounds like an airplane taking off. It can not be denied. It always wins. The sybian rips out orgasm after orgasm, long after the pussy is tired and wants to tap out. How well can this slut multitask? Can she still deep throat while cumming her brains out? Only one way to find out!\n\nBlindfolded and bound, mouthhole completely exposed, we go to work on Roxy. Her dress is cut off, exposing her stunning body. A leather strap keeps her neck in place, making it impossible to move her face away from the cock. And then it begins. It is a complete deconstruction by dick. Roxy is pushed to her limits and beyond. As it turns out, all those years of slutting around town have paid off. This one is a cock sucking champion. She cums over and over as the dick owns her throat. Drool and spittle flows helplessly out of her face pussy.\n\nWe rip off the blindfold so that we look into those big blue eyes and pick up the pace. She becomes unraveled. Her eyes glaze over and her breathing becomes ragged. Her tiny perfect perky breasts are coated and shiny with her own juices. In the end, we leave her there, face vacant and slack, still bolted down in place. Her tongue is out, signaling her willingness to take any dick that might come by. Good girl Roxy... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/01_29rrox/SexuallyBroken-Roxy-Rox-Matt-Williams-Roxy-Rox-turned-into-cocksucking-machine-brutal-deepthroat-blindfolded-bound-drools-helplessly.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/01_29rrox/SexuallyBroken-Roxy-Rox-Matt-Williams-Roxy-Rox-turned-into-cocksucking-machine-brutal-deepthroat-blindfolded-bound-drools-helplessly.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:f944f8398df8574872113e9a28f5bb673388dcd0","amp;dn":"Sexually+Broken--Roxy+Rox+turned+into+cocksucking+machine%2C+bruta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f944f8398df8574872113e9a28f5bb673388dcd0","infoHashBuffer":{"type":"Buffer","data":[249,68,248,57,141,248,87,72,114,17,62,154,40,245,187,103,51,136,220,208]},"announce":[],"urlList":[]}}