{"title":"On The Map: Why the world looks the way it does","uid":8751708,"size":7247938,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9eb9cf72ea1dbd1f9041544cfa8031ff9721f66&amp;dn=On+The+Map%3A+Why+the+world+looks+the+way+it+does&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":1,"time":1375047415,"description":"Maps fascinate us. They chart our understanding of the world and they log our progress, but above all they tell our stories. From the early sketches of philosophers and explorers through to Google Maps and beyond, Simon Garfield examines how maps both relate and realign our history. His compelling narratives range from the quest to create the perfect globe to the challenges of mapping Africa and Antarctica, from spellbinding treasure maps to the naming of America, from Ordnance Survey to the mapping of Monopoly and Skyrim, and from rare map dealers to cartographic frauds. En route, there are 'pocket map' tales on dragons and undergrounds, a nineteenth century murder map, the research conducted on the different ways that men and women approach a map, and an explanation of the curious long-term cartographic role played by animals. On The Map is a witty and irrepressible examination of where we've been, how we got there and where we're going.\n\n -Delightful. If maps be the fuel of wanderlust, read on.- From the foreword by Dava Sobel, author of Longitude.","torrent":{"xt":"urn:btih:f9eb9cf72ea1dbd1f9041544cfa8031ff9721f66","amp;dn":"On+The+Map%3A+Why+the+world+looks+the+way+it+does","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9eb9cf72ea1dbd1f9041544cfa8031ff9721f66","infoHashBuffer":{"type":"Buffer","data":[249,235,156,247,46,161,219,209,249,4,21,68,207,168,3,31,249,114,31,102]},"announce":[],"urlList":[]}}