{"title":"Rockers (Jamaica, 1978) Patois uncut","uid":5101375,"size":725175078,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fa0f537cb69d9dda7f2842c4726f5af4aa32726b&amp;dn=Rockers+%28Jamaica%2C+1978%29+Patois+uncut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BenHardn","files":-1,"time":1254004087,"description":"Rockers no HD spoken Language is Patois\n\n\n\nRockers is a 1978 Jamaican film by Ted Bafaloukos. Several popular reggae artists star in the movie, including Leroy &quot;Horsemouth&quot; Wallace, Burning Spear, Gregory Isaacs, Big Youth, Dillinger, and Jacob Miller.\n\nRockers was originally to be a documentary but blossomed into a full-length feature showing the reggae culture at its peak.\n\nIn this film, the culture, characters and mannerisms are authentic. The main rocker Leroy &quot;Horsemouth&quot; Wallace, for example, is shown living with his actual wife and kids and in his own home. The recording studios shown are the famous Harry J Studios where many roots reggae artists recorded during the 70s including Bob Marley. Samples of the film's dialogue were used in the early 1990's jungle track, &quot;Babylon&quot; by Splash. The Jamaican Patois spoken throughout the film is rendered with English language subtitles for a foreign audience.\n\nAshley Higher Harris is a healer in real life, as well as playing one in the film. During production, his herbal preparations actually did heal the movie's sound-man of a severe skin allergy","torrent":{"xt":"urn:btih:fa0f537cb69d9dda7f2842c4726f5af4aa32726b","amp;dn":"Rockers+%28Jamaica%2C+1978%29+Patois+uncut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa0f537cb69d9dda7f2842c4726f5af4aa32726b","infoHashBuffer":{"type":"Buffer","data":[250,15,83,124,182,157,157,218,127,40,66,196,114,111,90,244,170,50,114,107]},"announce":[],"urlList":[]}}