{"title":"E.L.O-Out of the Blue Live at Wembley-Discovery [DVD] [2008] Ful","uid":6975297,"size":4137606962,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fa478f5da492e3447c7788ef8c783d10a79dac50&amp;dn=E.L.O-Out+of+the+Blue+Live+at+Wembley-Discovery+%5BDVD%5D+%5B2008%5D+Ful&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jocktheripper","files":-1,"time":1327191306,"description":"Title:  E.L.O [electric light orchestra-Out of the Blue: Live &amp; Discovery-live\n\n\n***************************************************************\n\n\n\nRelease:2007/8\n\nCountry: uk\n\nLanguage: English\n\nsource:dvd boxset\n\nfull disc\n****************************************************************\n Originally released on laser disc in Japan, ELO\\'s 1978 Wembley concert -- a benefit performance hosted by the Duke and Duchess of Gloucester and introduced by Tony Curtis -- finally showed up in America on DVD a decade later, remastered and with the added bonus of the group\\'s complete Discovery album appended to the concert; evidently, the group did videos to accompany the entire album\\'s content, most of which use the Out of the Blue spaceship emblem somewhere in their design and show the members miming in tight close-ups. In that regard, the Discovery material isn\\'t that different from the concert recording -- the DVD\\'s resolution is such that it is pathetically easy to see that audio and video material is seldom entirely in sync. Though there is a raw, live texture to much of the playing, there\\'s also a sharpness and clarity to the singing that indicates a lot of sweetening in the studio after the fact. The selection of material is drawn principally from Out of the Blue and A New World Record, augmented by \\&quot;Showdown\\&quot; and the finale of \\&quot;Roll Over Beethoven,\\&quot; and the visuals are a mix of straight concert views and more conceptual framing and editing, all of the work surrounded by the attempt at generating Close Encounters of the Third Kind-style spaceship visions. It is fun, if not quite as promising as the notion of an unedited concert might be, and the Discovery material slots in very well around the Out of the Blue songs. And the sound -- surprisingly on a DVD this vintage -- is loud and full-bodied. \n****************************************************************","torrent":{"xt":"urn:btih:fa478f5da492e3447c7788ef8c783d10a79dac50","amp;dn":"E.L.O-Out+of+the+Blue+Live+at+Wembley-Discovery+%5BDVD%5D+%5B2008%5D+Ful","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa478f5da492e3447c7788ef8c783d10a79dac50","infoHashBuffer":{"type":"Buffer","data":[250,71,143,93,164,146,227,68,124,119,136,239,140,120,61,16,167,157,172,80]},"announce":[],"urlList":[]}}