{"title":"New Larousse Encyclopedia Of Mythology","uid":6260056,"size":1846517,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa8dd76edcf5f98133ba1c43a7656790d9877ae0&amp;dn=New+Larousse+Encyclopedia+Of+Mythology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lionzbay","files":1,"time":1300718569,"description":"\nAuthor(s): Robert Graves\nPublisher: Crescent\nDate: 1987\nFormat: pdf\nLanguage: English\nISBN10: 0517004046\nPages: 500\n\nIn his illuminating introduction, Robert Graves discusses the function of myth. He claims that in the first place, it serves to answer the type of awkward questions that children ask, like Who made the world or Who were the first people? The second function of myth is to justify an existing social system and to account for traditional customs and rites.\n\nGraves points out how myths of origin and eventual extinction vary according to the climate and that one finds a warm celestial afterworld in the north or a fresh flowered Elysian Field in Greece. He also deals with the Akan of Ghana and with Egypt and India. His conclusion is that myth is a dramatic shorthand record of stuff like invasions, migrations, dynastic changes, admission of foreign cults and social reforms. For example, when bread was first introduced in Greece, the myth of Demeter and Triptolemus sanctified its use.\n\nThe Encyclopedia investigates prehistoric mythology and that of Egypt, Assyro-Babylonia, Phoenicia, Greece, Rome, Persia, India, China, Japan, Oceania and that of the Celts, the Teutons, the Amerindians and Africans. It contains 34 colour plates and hundred of black and white illustrations and it concludes with a further reading list divided under different headings reflecting its chapter contents, plus a thorough index.","torrent":{"xt":"urn:btih:fa8dd76edcf5f98133ba1c43a7656790d9877ae0","amp;dn":"New+Larousse+Encyclopedia+Of+Mythology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa8dd76edcf5f98133ba1c43a7656790d9877ae0","infoHashBuffer":{"type":"Buffer","data":[250,141,215,110,220,245,249,129,51,186,28,67,167,101,103,144,217,135,122,224]},"announce":[],"urlList":[]}}