{"title":"NFL Super Bowl 50 Panthers vs Broncos 2016-02-07 720p AVCHD-SC-S","uid":13464650,"size":8326221749,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:fabc2e8b7b7e226f5e0d8db90f65c261dd11753b&amp;dn=NFL+Super+Bowl+50+Panthers+vs+Broncos+2016-02-07+720p+AVCHD-SC-S&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SCSA420","files":5,"time":1454915257,"description":"StoneCold420 presents another High Quality 720p H264 release for the NFL fans around the world here exclusively on The Pirate Bay and KickAssTorrents so get this show while its available!!!\r\n\r\n\r\nNFL Super Bowl 50 Panthers vs Broncos 2016-02-07 720p AVCHD-SC-SDH\r\n\r\n\r\nincludes the Kickoff Preshow and Postgame trophy presentation and Halftime show \r\n\r\n\r\nNFL Super Bowl 50\r\nCarolina Panthers vs Denver Broncos\r\nLevi's Stadium\r\nSanta Clara, CA\r\nFebruary 7, 2016\r\n\r\n\r\nThis is the entire game including Kickoff Preshow with Lady Gaga, Coldplay with Beyonce and Bruno Mars Halftime show, and Postgame Trophy Presentation!!! There are NO COMMERCIALS included but you can see them on YouTube!!!\r\n\r\n\r\n1st half includes the Kickoff Preshow and 2nd half includes the Postshow Trophy Presentation and the Coldplay with Beyonce and Bruno Mars halftime show is separate.\r\n\r\n\r\nCam Newton and the Carolina Panthers vs Peyton Manning and the Denver Broncos\r\n\r\n\r\nJim Nance and Phil Simms call the action\r\n\r\n\r\n\r\nThis is SDH release #2,058 for the wrestling fans from a wrestling fan. First aired and captured from HDMI in H264 AVCHD at 8,000 kbps from the 16:9 widescreen 1280 x 720p resolution HD source on 02/07/2016 on the CBS Network on Cox Digital HD Cable. Framerate is 29.970 with an average Video Bitrate of 4,500 kbps in a High Quality 7.75 GB 720p H264 AVCHD MP4 release with 48khz 384 kbps AAC 2 channel stereo audio total show time is 3:37:20 Part 1 is 1:48:35 and Part 2 is 1:34:30 the Halftime show is 14:14\r\n\r\nThis is my 1,328th official 720p H264 AVCHD-SC-SDH release. Enjoy the show NFL Football fans. \r\n\r\n\r\nThis release is 3 parts because the size is more then 4 GB. Part 1 is 3.85 GB and Part 2 is 3.38 GB. The Halftime show is 521 MB This release is in AVCHD MP4 format with AAC 2 channel stereo audio. This release is playable with Sony Playstation 3 and 4, Xbox 360, Samsung Galaxy S III, SIV, S5, S6 smartphones, iPhone, iPad, VLC player as well as Media Player Classic, Windows Media Player, and any other devices capable of playing 720p HD MP4 video files with AAC 2 channel stereo audio.\r\n\r\n\r\nMy releases are in MP4 format with AAC 2 channel stereo audio so that they are playable with VLC player as well as Media Player Classic, Windows Media Player, Sony Playstation 3, Xbox 360, Samsung Galaxy S III, IV, V, VI smartphones, iPhones, iPads, and any other devices capable of playing 720p HD MP4 video files. \r\n\r\nTo ensure that you can get proper playback be sure you have installed the K-lite codec pack full version or mega version both of which comes with Media Player Classic Home Cinema and configure it properly for .mkv and .mp4 playback. If you do not have it you can get it here below: \r\n \nhttp://www.free-codecs.com/download/K_Lite_Codec_Pack.htm \r\n\r\nOnce installed you can playback the .mp4 files with the following players:\r\n\r\nMedia Player Classic or Windows Media Player. \r\n\r\n\r\nEnjoy the NFL Super Bowl 50 NFL fans and thanks for downloading my NFL Super Bowl 50 Panthers vs Broncos 2016-02-07 720p AVCHD-SC-SDH release. \r\n\r\n\r\nUploaded by SCSA420 on ThePirateBay and KickAss Torrents\r\n\r\n\r\nATTENTION: PLEASE FEEL FREE TO UPLOAD MY RELEASES ANYWHERE BUT DON'T ADD YOUR NAME TO MY HARD WORK and IF this show is uploaded on XWT then please keep the folder and files as they are and DO NOT RENAME the files or retag them with another name!!! Thank You!!!\r\n\r\nI work on my own so that I get all the credit for my hard work each and every week!!! \r\n\r\nBest Played With Media Player Classic or VLC Player \r\n\r\n\r\n\r\nStoneCold420 \r\nSmackDownHotel\r\nFebruary 7, 2016\r\n\r\n\r\n@SCSA420 on Twitter\r\n\r\n\r\nFor SC-SDH releases find me on KAT\r\nor on The Pirate Bay at: https://thepiratebay.se/user/SCSA420\r\n\r\n\r\nPlease check out the WrestleReaction show at: http://WrestleReaction.net","torrent":{"xt":"urn:btih:fabc2e8b7b7e226f5e0d8db90f65c261dd11753b","amp;dn":"NFL+Super+Bowl+50+Panthers+vs+Broncos+2016-02-07+720p+AVCHD-SC-S","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fabc2e8b7b7e226f5e0d8db90f65c261dd11753b","infoHashBuffer":{"type":"Buffer","data":[250,188,46,139,123,126,34,111,94,13,141,185,15,101,194,97,221,17,117,59]},"announce":[],"urlList":[]}}