{"title":"Tchaikovsky Piano Con. No.1 - Gilels CSO","uid":15605853,"size":171099825,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fac37bb0f2737f6537aa3a8eac6c70b076c0c387&amp;dn=Tchaikovsky+Piano+Con.+No.1+-+Gilels+CSO&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Vortex72","files":9,"time":1471721769,"description":"Tchaikovsky - Piano Concerto No.1 [FLAC]\r\n\r\n\r\nChicago Symphony Orchestra\r\nPiano: Emil Giles\r\nConductor: Fritz Reiner\r\n\r\n\r\n\r\nRCA Victor LM-1969 Red Seal\r\n\r\n\r\nPyotr Ilyich Tchaikovsky 1840–1893) often anglicized as Peter Ilyich Tchaikovsky, was a Russian composer of the late-Romantic period, some of whose works are among the most popular music in the classical repertoire. He was the first Russian composer whose music made a lasting impression internationally, bolstered by his appearances as a guest conductor in Europe and the United States. Tchaikovsky was honored in 1884, by Emperor Alexander III, and awarded a lifetime pension.\r\n\r\nAlthough musically precocious, Tchaikovsky was educated for a career as a civil servant. There was scant opportunity for a musical career in Russia at that time and no system of public music education. When an opportunity for such an education arose, he entered the nascent Saint Petersburg Conservatory, from which he graduated in 1865. The formal Western-oriented teaching he received there set him apart from composers of the contemporary nationalist movement embodied by the Russian composers of The Five, with whom his professional relationship was mixed. Tchaikovsky's training set him on a path to reconcile what he had learned with the native musical practices to which he had been exposed from childhood. From this reconciliation, he forged a personal but unmistakably Russian style—a task that did not prove easy. The principles that governed melody, harmony and other fundamentals of Russian music ran completely counter to those that governed Western European music; this seemed to defeat the potential for using Russian music in large-scale Western composition or from forming a composite style, and it caused personal antipathies that dented Tchaikovsky's self-confidence. Russian culture exhibited a split personality, with its native and adopted elements having drifted apart increasingly since the time of Peter the Great. This resulted in uncertainty among the intelligentsia about the country's national identity—an ambiguity mirrored in Tchaikovsky's career.\r\n\r\n\r\nTRACKLIST:\r\n\r\nPiano Concerto No.1 in B flat Minor, Op.23\r\n1.  First Movement (20:19)\r\n2.  Second Movement (7:06)\r\n3.  Third Movement (6:14)\r\n\r\nTotal Time:  33:39\r\nCOVER ART:  back, front\r\n\r\n\r\n\r\nReality Ascent by Dragan Glavasic\r\nWAKE UP!\r\n\r\n6:37 PM 8/20/2016","torrent":{"xt":"urn:btih:fac37bb0f2737f6537aa3a8eac6c70b076c0c387","amp;dn":"Tchaikovsky+Piano+Con.+No.1+-+Gilels+CSO","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fac37bb0f2737f6537aa3a8eac6c70b076c0c387","infoHashBuffer":{"type":"Buffer","data":[250,195,123,176,242,115,127,101,55,170,58,142,172,108,112,176,118,192,195,135]},"announce":[],"urlList":[]}}