{"title":"Bad Thoughts: A Guide to Clear Thinking","uid":6224477,"size":2177455,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:faec051ca1ea6eea8b13cb71345ed79657836bce&amp;dn=Bad+Thoughts%3A+A+Guide+to+Clear+Thinking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1299463971,"description":"aka Crimes Against Logic\n\n&quot;[Whyte] whets a long knife of ultra-rationalism on the cold stone of logic, and death by a thousand cuts is inflicted on prejudice, statistics, morality, religion, weasel words, and seductive sirens such as politicians, New Agers, advertising executives, and, of course, journalists who expect you to be persuaded by anything other than facts.&quot; (The Times )\n\n&quot;He ruthlessly exposes logical flaws and sheer nonsense. . . in likably angry and witty style.&quot; (The Guardian ) \nProduct Description\nUncover the truth under all the BS\n\nIn the daily battle for our hearts and minds--not to mention our hard-earned cash--the truth is usually the first casualty. It's time we learned how to see through the rhetoric, faulty reasoning, and misinformation that we're subjected to from morning to night by talk-radio hosts, op-ed columnists, advertisers, self-help gurus, business &quot;thinkers,&quot; and, of course, politicians. And no one is better equipped to show us how than award-winning philosopher Jamie Whyte.\n\nIn Crimes Against Logic Whyte take us on a fast-paced, ruthlessly funny romp through the mulligan stew of can, folderol, and bogus logic served up in the media, at the office, and even in your own home. Applying his laserlike wit to dozens of timely examples, Whyte cuts through the haze of facts, figures, and double-talk and gets at the real truth behind what they're telling us.\n\n160 pages \nPublisher: Corvo Books; First Edition edition (5 Oct 2003) \nLanguage English \n","torrent":{"xt":"urn:btih:faec051ca1ea6eea8b13cb71345ed79657836bce","amp;dn":"Bad+Thoughts%3A+A+Guide+to+Clear+Thinking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faec051ca1ea6eea8b13cb71345ed79657836bce","infoHashBuffer":{"type":"Buffer","data":[250,236,5,28,161,234,110,234,139,19,203,113,52,94,215,150,87,131,107,206]},"announce":[],"urlList":[]}}