{"title":"Toy Soldiers-SKIDROW","uid":7228235,"size":1566042053,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fb01ed68b5282a6d1e33f060ee8ef81f8916a752&amp;dn=Toy+Soldiers-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"FaMoUz","files":-1,"time":1335747127,"description":"\n\n\n\n\n\n\n\n\n                            Toy Soldiers-SKIDROW\n                            ____________________\n\n\n\n\n\n\n\n\n\nS K I D R O W\nthe leading force\n\nproudly presents\nToy Soldiers (c) Microsoft Games Studios\n\n29-04-2012....Release Date &lt;-&gt; Protection..............Steam+GFWL\nStrategy/Action..Game Type &lt;-&gt; Disk(s)......................1 DVD\n\nRELEASE NOTES\n\nToy Soldiers is an action-packed strategy-based game in which players\ncommand antique WWI toy soldiers vying for control of the trench-filled\nbattlefields of Europe. Deploy an exciting arsenal such as tanks\ncavalry, biplanes, and flamethrowers in vintage WWI toy dioramas\nDeveloped by Signal Studios, Toy Soldiers allows you to take control of\nindividual units or control the entire battlefield from a strategic\nview. Integrating multiple game genres and world-class visuals, Toy\nSoldiers is a unique and action-packed entertainment experience!\n\nCommand your Toy Soldiers in epic, action-packed battles. Position your\ndefenses and take direct control of your artillery to bomb the enemy\npositions, pilot your bi-plane against the enemy trench, or maneuver\nyour tanks across No-Man s Land and lead your Toy Soldiers to victory!\n\nAll DLC from the Xbox LIVE Arcade hit is included!\n\nThe Kaiser's Battle DLC\nEnter the fray as the French Army in all new Single Player\nMultiplayer, and Survival Mode Maps! Take on the new experimental\nboss, the fearsome K-Wagen! Earn three new achievements worth 50 gamer\npoints and enjoy all new French inspired content!\n\nInvasion DLC\nThe British are bringing brand new secret weapons of tiny toy mayhem\nin Invasion!, the second add-on to Toy Soldiers from Signal Studios!\nPut on your Kaiser's helmet and command the German Army against a mad\nmenagerie of new antagonistic toys, including flying saucers\nchivalrous knights, and the Rolls Royce of the Sky, the WWII Mustang\nDefend Germany in a new Survival level, two new multiplayer maps, and\na new mini-campaign topped by the most calculating, head-strong boss\nof all (batteries not included)! Raise your saber, soldier, and lead\nthe charge against is that a spaceman? The Invasion has begun!\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy!\n\nADDITIONAL NOTES\n\nYou need to make an offline Games For Windows Live profile, for being\nable to load/save\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix + irokos\ntitan artdivision\n\n\n\n\n\n\nTHNKZ 2 ALL ORIGINAL UPLOADERS\n\n\n\n\n\n\nPLZ HELP SEED &amp; ENJOY TOY SOLDIERS...\n\n\n\n\n","torrent":{"xt":"urn:btih:fb01ed68b5282a6d1e33f060ee8ef81f8916a752","amp;dn":"Toy+Soldiers-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb01ed68b5282a6d1e33f060ee8ef81f8916a752","infoHashBuffer":{"type":"Buffer","data":[251,1,237,104,181,40,42,109,30,51,240,96,238,142,248,31,137,22,167,82]},"announce":[],"urlList":[]}}