{"title":"Deadliest.Warrior.S01E01.HDTV.XviD-aAF.avi - Apache vs Gladiator","uid":4843872,"size":366906966,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb0ac6a92dfe033caa67aa51fe9f35f80402f550&amp;dn=Deadliest.Warrior.S01E01.HDTV.XviD-aAF.avi+-+Apache+vs+Gladiator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"herman_munst","files":-1,"time":1239607699,"description":"When I first saw the preview to this show a while back, I thought to myself, &quot;I blame the whole PIRATE VS NINJA Internet Meme&quot; for creating this bizarre show.\n\nSo, I watched the pilot, which was &quot;Apache vs. Gladiator&quot; and overall, I am biting my cheek right now because I recall watching something similar to this on Discovery Channel a few years back called &quot;Animal Face Off&quot; where &quot;battle data&quot; is taken from the contenders and put in a computer simulation. I actually, have an episode of that show titled &quot;Hippo vs. Bull Shark&quot; and the result of that fight still annoys me, but still I can't stop laughing about it. Another show, that similar that show is currently airing is &quot;Jurassic Fight Club.&quot;\n\nAnyway, &quot;Deadliest Warrior&quot; has a similar to motif to &quot;Animal Face Off&quot; and &quot;Jurassic Fight Club&quot;, but instead of wild animals or dinosaurs, this show uses types of warriors.\n\nI'm not sure if I should classify this as something in the realm of shows like &quot;Human Weapon&quot;, &quot;Fight Quest&quot;, &quot;Weapon Masters&quot;, &quot;Deadliest Art&quot;, &quot;XMA: Extreme Martial Arts&quot; or &quot;Fight Science.&quot;\n\nOverall, this show is pretty decent for all the corniness the show offers. It will irritate you, but at the same time make you laugh; thus pulling you as the viewer to watch the show for what its worth despite knowing how stupid it will eventually become as time goes on. But you just can't help yourself.\n\nMan, I can just see something like &quot;Deadliest Monster Face Off&quot; in the future and it will feature stuff like &quot;Mummy vs. Zombie vs. Werewolf vs. Vampire&quot; or something bizarre like that. \n\nSource: http://www.imdb.com/title/tt1281313/","torrent":{"xt":"urn:btih:fb0ac6a92dfe033caa67aa51fe9f35f80402f550","amp;dn":"Deadliest.Warrior.S01E01.HDTV.XviD-aAF.avi+-+Apache+vs+Gladiator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb0ac6a92dfe033caa67aa51fe9f35f80402f550","infoHashBuffer":{"type":"Buffer","data":[251,10,198,169,45,254,3,60,170,103,170,81,254,159,53,248,4,2,245,80]},"announce":[],"urlList":[]}}