{"title":"Douglas Jackson - Avenger Of Rome [Verrens 03]","uid":10444118,"size":303329551,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fb14b35e8f7e165238fbc1566ed31547fbd00e28&amp;dn=Douglas+Jackson+-+Avenger+Of+Rome+%5BVerrens+03%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mustafa-crap","files":9,"time":1403929752,"description":"Not my rip\n\nEmperor Nero's grip on power is weakening. In every shadow he sees an enemy and like a cornered animal he lashes out at every perceived threat. His paranoia settles on the figure of Gnaeus Domitius Corbulo, Rome's greatest General who leads the imperial legions in the East.\nSo popular is Corbulo with his men that he effective presides over an Empire within an Empire. Is Corbulo preparing to march against Rome and take the purple?\nGaius Valerius Verrens, Hero of Rome, is ordered to Antioch with the power of life and death over Corbulo, a soldier he worships. There he finds word of his mission has preceded him and every man's hand is turned against him. But Corbulo's eyes are not on Rome, but on a new threat to the Empire's border. The Parthian King of Kings, Vologases, is marching to war and with such an army that if not stopped he might overwhelm the entire Roman east.\nValerius marches at Corbulo's side. Outnumbered they make a stand in the barren wastes beyond the Tigris to meet Vologases in an epic contest of military might and ingenuity that will decide the fate of the Empire. And while he fights for the Empire, and for his own survival on the battlefield, Valerius must decide whether to complete his mission, or risk incurring his Emperor's dangerous wrath.","torrent":{"xt":"urn:btih:fb14b35e8f7e165238fbc1566ed31547fbd00e28","amp;dn":"Douglas+Jackson+-+Avenger+Of+Rome+%5BVerrens+03%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb14b35e8f7e165238fbc1566ed31547fbd00e28","infoHashBuffer":{"type":"Buffer","data":[251,20,179,94,143,126,22,82,56,251,193,86,110,211,21,71,251,208,14,40]},"announce":[],"urlList":[]}}