{"title":"Private L. A. by James Patterson (US Retail ePub)","uid":9595968,"size":796629,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fbf50e3b4c9a72a2851301f5ff1c8eb4a9df7b59&amp;dn=Private+L.+A.+by+James+Patterson+%28US+Retail+ePub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TxJag","files":3,"time":1392015569,"description":"Private Jack Morgan investigates the disappearance of the biggest superstar couple in Hollywood.\n\nThom and Jennifer Harlow are the perfect couple, with three perfect children. They maybe two of the biggest mega movie stars in the world, but they're also great parents, philanthropists and just all-around good people.\n\nWhen they disappear without a word from their ranch, facts are hard to find. They live behind such a high wall of security and image control that even world-renowned Private Investigator Jack Morgan can't get to the truth. But as Jack keeps probing, secrets sprout thick and fast--and the world's golden couple may emerge as hiding behind a world of desperation and deception that the wildest reality show couldn't begin to unveil. Murder is only the opening scene.\n\nFull Retail. ePub and Calibre reader. Metadata is complete and up to date.\n\nNote: This is technically book 7 in the Private series. Book 6 is Private: Oz or Private: Down Under will be getting a US publication in August 2014 as Private: Down Under.","torrent":{"xt":"urn:btih:fbf50e3b4c9a72a2851301f5ff1c8eb4a9df7b59","amp;dn":"Private+L.+A.+by+James+Patterson+%28US+Retail+ePub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbf50e3b4c9a72a2851301f5ff1c8eb4a9df7b59","infoHashBuffer":{"type":"Buffer","data":[251,245,14,59,76,154,114,162,133,19,1,245,255,28,142,180,169,223,123,89]},"announce":[],"urlList":[]}}