{"title":"Timber Timbre - Cedar Shakes [2005] [EAC,log,cue. FLAC]","uid":8923463,"size":157820899,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fd2d6574a027cee445e62af519bacd582f789191&amp;dn=Timber+Timbre+-+Cedar+Shakes+%5B2005%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":12,"time":1379309898,"description":"Artist:Timber Timbre\nRelease:Cedar Shakes\nReleased: 2005\nLabel: \nCatalog#: \nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: CAN\nStyle:folk,americana\n\n\nSo Much\t\nHome\t\nMercy\t\nCedar Shakes\t\nAs Angels Do\t\nBlack Creek Drive\t\nIt's Only Dark\t\nI'm A Long Way\t\nEach Good House\n\nFor some inexplicable reason, the music of Taylor Kirk, who writes and plays his songs under the moniker Timber Timbre, brings to mind a world like black and white photographs, ramshackle cabins in the far north, plains blanketed with thin layers of snow through which long brown weeds stand waving in the wind, the undulating and otherworldly reds and greens and purples of the aurora borealis during cold January nights in northern Alaska, and long stretches of rural highway in the middle of winter. In a way, it also brings to mind the strange and seemingly neverending Pine Barrens of New Jersey, the hazy southern twilights of Alabama, the rocky slopes and scatterings of trees of the Adirondack Mountains, and nameless pubs with sawdust-covered floors and taxidermy decors. Nighttime campfires in the desert wastelands of the dusty West, badly kept clapboard shacks surrounded by thick-rooted trees overtaken by Spanish moss in the sweaty backwoods of Louisiana, large dry-rotted barns and seemingly endless acres of verdant farmland in the Pennsylvania countryside, and gothic style churches with gray stone walls and pointed steeples upon which black-feathered birds perch through autumn. And finally, most of all, it brings to mind an old freight train thundering at half speed down the rusty rails and splintered ties of even older tracks, while night itself shivers with the cold, while a pale, anorexic moon hangs at the rootops of a far off cityscape on the apocalyptic horizon, and while a single shooting star falls to the ground without granting a single wish. \n\nIt would be dishonest of me to claim that I could explain such specific imagery, as I cannot, though it is presumably a reaction to something in the music...to the music itself. Yes, Timber Timbre's unique, strange, and brilliant songs conjure forth such things along with their attendant feelings, at least for me, which simply goes to show how very powerful the music truly is. And...let's be honest, aren't those some of the fundamental purposes of art: to make us feel something, to make us think, to open doors to new possibilities of thought and expression, and to inspire us to new creative heights? Of course those are the reasons, its purposes. But there is something more, isn't there? You see, the human race is fairly predictable in its collective need to relate, to understand others and have others understand them, to share mutual feelings on certain experiences and ideas, observations and dreams and...well, feelings. We like to feel connected. What is one's favorite song other than something one has developed a strong connection to? Granted, we choose favorite songs out of our appreciation for the music itself, and we enjoy the sound as it is processed by our ear and mind mechanics. But why else do we choose them? That's simple. Because we can relate to them. Because we understand them and they make us feel understood. And that goes a helluva long way.\n\nIndeed, the songs which appear on Taylor's first contribution to fans and participants of the independent music community are winter songs. It's not so much that the songs are about winter but that they evoke the feelings and images one often associates with that particular season. With each song Taylor unravels the very separate fabrics of folk and blues and stitches them together. There are no doubt other components involved in his elaborate patchwork of sound, such as country, Americana, and roots. All of those sound types go together to form a collection of solid song structures which collectively radiate a very organic, rustic and old-timey feel. And from what I have gathered, Taylor actually recorded his debut album, Cedar Shakes, in an old farm house in a remote area near Ontario. Hence the organic, rustic and old-timey feel...well, partly anyway, as those things also seem to be essential ingredients of Taylor's character.","torrent":{"xt":"urn:btih:fd2d6574a027cee445e62af519bacd582f789191","amp;dn":"Timber+Timbre+-+Cedar+Shakes+%5B2005%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd2d6574a027cee445e62af519bacd582f789191","infoHashBuffer":{"type":"Buffer","data":[253,45,101,116,160,39,206,228,69,230,42,245,25,186,205,88,47,120,145,145]},"announce":[],"urlList":[]}}