{"title":"Ella Fox - The Hart Family Series #1-6","uid":8913472,"size":1488142,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd6ece7a5866735d60134348f45e1468ca847156&amp;dn=Ella+Fox+-+The+Hart+Family+Series+%231-6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Ladyosphinx","files":6,"time":1379080985,"description":"Broken Hart(The Hart Family #1)\nSabrina Tyler is head over heels in love with her boss and best friend, Dante Hart. Sabrina thinks that Dante has no romantic interest in her but she's wrong.\n\nDante doesn't believe in love or commitment or any kind. Sabrina has gotten under his skin but Dante has no intention of acting on it.\n\nOne wild night changes their relationship forever, but Dante lacks faith in love and doesn't believe in Happily Ever Afters.\n\nCan Sabrina break through and fix what's broken in Dante Hart?\n\n\nShattered Hart(The Hart Family #2)\nDamien Hart will never allow himself to fall into a committed relationship. He's seen the worst of the worst, and he knows that there isn't a woman on earth that will ever change his mind. \n\nAll of that changes the moment he meets Brooke Tyler. Damien's entire view of women and relationships is rocked by her, and though he tries, he can't make himself stay away. \n\nBrooke is everything Damien never knew that he wanted. Will he be able to let go of his past and take a chance on love?\n\nLoving Hart (The Hart Family, #3)\nFrom the moment he saw her, Spencer Cross knew that Delilah Hart was special. Understanding that she needed him to be strong for her, Spencer endured a childhood filled with secrets, lies and abuse. Delilah gave him a reason to live as she protected his heart and kept him from going off the rails.\n\nDelilah knew that fate had delivered the love of her life to her at a very early age. Spencer was her anchor and the reason she believed in true love. She'd never doubted that they were meant to be together forever.\n\nUntil chance threatened to rip them apart...\n\nWill Delilah be able to convince Spencer to let go of his demons, or will she be forced to walk away with only the memories?\n\nUnbroken Hart (The Hart Family, #4)\nIt's time for Dante's narrative!\n\nFind out how he really felt when he met Sabrina and catch up with the couple that started the Hart Family series. Dante is as steamy as ever!\n\nMissing Hart (The Hart Family, #5)\nMy life has been built on a mountain of secrets, lies and half truths.\nFor a long time I wasn't able to let anyone get close to me.\nBut then I met my Prince Charming.\nThe man who saved me from myself, who showed me what true love was.\n\nIf only I'd been honest.\nIf only I'd been stronger.\nIf only I could forget.\n\nI've missed him every single day for four years,\nand nobody who means anything to me even knows he existed in my world.\n\nNow the part of my life that I've kept secret has collided head on with the life I built to survive the destruction of my heart. \n\nHe's back- and this time, we can't avoid each other.\n\nThe love story of Dominique Hart and Dillon Cooper has never been easy, but that doesn't make it any less real. \n\nNot everyone has an easy journey on the way to love, but sometimes, that makes getting there that much more meaningful.\n\nFinding Hart (The Hart Family, #6)\nThere is one person in the world that Spencer Cross can't live without and that's his wife, Delilah Hart Cross. With their baby on the way, life has never been sweeter.\n\nDillon Cooper finally had Dominique Hart back in his arms and he has no intention of letting her go. Happy for the first time in years, Dillon knows that things can only get better.\n\nNot everyone is happy that these two couples are finally living their dreams, and the past is about to explode into the present.\n\nSpencer and Dillon are about to find out just how far they will go to save the women that they love. \n\nFaith will be tested, secrets will be revealed and lives will be changed as the entire family joins together to face the toughest challenge of all...\n\n\nEpub only","torrent":{"xt":"urn:btih:fd6ece7a5866735d60134348f45e1468ca847156","amp;dn":"Ella+Fox+-+The+Hart+Family+Series+%231-6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd6ece7a5866735d60134348f45e1468ca847156","infoHashBuffer":{"type":"Buffer","data":[253,110,206,122,88,102,115,93,96,19,67,72,244,94,20,104,202,132,113,86]},"announce":[],"urlList":[]}}