{"title":"FreeBSD Device Drivers - A Guide for the Intrepid  {BBS}","uid":7296580,"size":9109652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd6f0d322c8d69335ef782af54649f146b32e9bb&amp;dn=FreeBSD+Device+Drivers+-+A+Guide+for+the+Intrepid++%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1337901161,"description":"Device drivers make it possible for your software to communicate with your hardware, and because every operating system has specific requirements, driver writing is nontrivial. When developing for FreeBSD, you've probably had to scour the Internet and dig through the kernel sources to figure out how to write the drivers you need. Thankfully, that stops now. In FreeBSD Device Drivers, Joseph Kong will teach you how to master everything from the basics of building and running loadable kernel modules to more complicated topics like thread synchronization. After a crash course in the different FreeBSD driver frameworks, extensive tutorial sections dissect real-world drivers like the parallel port printer driver.\n\nYou'll learn:\n\n    All about Newbus, the infrastructure used by FreeBSD to manage the hardware devices on your system\n    How to work with ISA, PCI, USB, and other buses\n    The best ways to control and communicate with the hardware devices from user space\n    How to use Direct Memory Access (DMA) for maximum system performance\n    The inner workings of the virtual null modem terminal driver, the USB printer driver, the Intel PCI Gigabit Ethernet adapter driver, and other important drivers\n    How to use Common Access Method (CAM) to manage host bus adapters (HBAs)\n\nConcise descriptions and extensive annotations walk you through the many code examples. Don't waste time searching man pages or digging through the kernel sources to figure out how to make that arcane bit of hardware work with your system. FreeBSD Device Drivers gives you the framework that you need to write any driver you want, now.\n\n\n\nPaperback: 352 pages\nPublisher: No Starch Press; Original edition (May 7, 2012)\nLanguage: English\nISBN-10: 1593272049\nISBN-13: 978-1593272043","torrent":{"xt":"urn:btih:fd6f0d322c8d69335ef782af54649f146b32e9bb","amp;dn":"FreeBSD+Device+Drivers+-+A+Guide+for+the+Intrepid++%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd6f0d322c8d69335ef782af54649f146b32e9bb","infoHashBuffer":{"type":"Buffer","data":[253,111,13,50,44,141,105,51,94,247,130,175,84,100,159,20,107,50,233,187]},"announce":[],"urlList":[]}}