{"title":"Stossel.2013.12.19.[The Good-Bad-Ugly Year in Review].FBN.CF.avi","uid":9373787,"size":363269796,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fd7bb8464a60374b4efc428f57f134084b0d4ecc&amp;dn=Stossel.2013.12.19.%5BThe+Good-Bad-Ugly+Year+in+Review%5D.FBN.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1387580461,"description":"----------\n\nSTOSSEL - [2013: The Good, The Bad, and The Ugly] - Fox Business Network\n2013, December 19, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nWas this a good year for freedom? I look at the good, the bad and the ugly in 2013 with David Boaz of the CATO Institute, Sabrina Schaeffer of the Independent Women's Forum and Nick Gillespie of Reason TV.\n\nTHE GOOD: A few freedom fighters in Congress pushed back against big government. One who probably did the most is Senator Rand Paul of Kentucky. He talks about his new plan for &quot;economic freedom zones.&quot;\n\nTHE BAD: After the Newtown school shooting there was another big push for gun control. My friends, and even my own wife, asked me, &quot;How could you not say there should be more rules against these weapons?&quot;\n\nTHE UGLY: Many people really believed that ObamaCare would cover more people with more insurance for more things and still be &quot;affordable.&quot; Now some of the truth is coming out. Boaz says people should realize that the &quot;government can't create more things for more people and have it cost less.&quot; But many people never realize that.\n\nREGULATION NATION: Jeff Rowes, of the Institute for Justice, talks about three new cases where the &quot;little guys&quot; are crushed by government regulation. One example: A Florida town forces a couple to rip out their vegetable garden.\n\nNAUGHTY OR NICE?: I play Santa and report on who was naughty and who was nice this year.\n\nFor example, Nancy Pelosi was naughty because she said government does not have a spending problem.\n\nThe rest of my Naughty or Nice list tonight.\n\nMY CHRISTMAS WISH: In 2013, our rulers added to the massive pile of rules that we must obey. My wish this Christmas is that reporters stop whining about the &quot;least productive&quot; and the &quot;do nothing&quot; Congress, and instead, celebrate the fact that politicians not passing more laws means more freedom for Santa, and for the rest of you. ","torrent":{"xt":"urn:btih:fd7bb8464a60374b4efc428f57f134084b0d4ecc","amp;dn":"Stossel.2013.12.19.%5BThe+Good-Bad-Ugly+Year+in+Review%5D.FBN.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd7bb8464a60374b4efc428f57f134084b0d4ecc","infoHashBuffer":{"type":"Buffer","data":[253,123,184,70,74,96,55,75,78,252,66,143,87,241,52,8,75,13,78,204]},"announce":[],"urlList":[]}}