{"title":"The Dark Lands (The Valkeryn Chronicles # 2) By Greig Beck","uid":10019912,"size":1928289,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe5a99cfded31e283a482d74beef7c3f6e3ac069&amp;dn=The+Dark+Lands+%28The+Valkeryn+Chronicles+%23+2%29+By+Greig+Beck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"maxdesolate","files":4,"time":1398191225,"description":"The wolf lives inside us all. Valkeryn has fallen, the great king dead, and the Wolfen scattered. The monstrous Lygon and Panterran now rule. Arnold 'Arn' Singer, the youth from the past and perhaps the last human being alive on the planet, flees to the dark lands with the heir to the throne. He seeks answers to the missing Ancients - Arn's ancestors - mankind itself. But back in his time the world continues to destabilize. The time distortion the mighty Tevatron collider created is growing larger and beginning to consume everything around it. The gateway vortex must be closed, Arn holds the key, and our world and its future is at stake. Colonel Marion Briggs leads a team of Special Operations soldiers into the distant future world, fully armed and with one order - bring back Arn or his body. But there are more dangers in this strange and beautiful world than anyone knew. More horrors dwell in the deep jungles, below the inland seas and deep below the earth. There are things that can change the shape of two worlds, tear at sanity, and stretch friendships and loves to the limit. Valkeryn II - The Dark Lands is the final chapter in an epic adventure that spans worlds and time itself.\n\nepub and mobi. enjoy and seed.","torrent":{"xt":"urn:btih:fe5a99cfded31e283a482d74beef7c3f6e3ac069","amp;dn":"The+Dark+Lands+%28The+Valkeryn+Chronicles+%23+2%29+By+Greig+Beck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe5a99cfded31e283a482d74beef7c3f6e3ac069","infoHashBuffer":{"type":"Buffer","data":[254,90,153,207,222,211,30,40,58,72,45,116,190,239,124,63,110,58,192,105]},"announce":[],"urlList":[]}}