{"title":"Shakira - Whenever, Wherever  (2nafish)","uid":5288277,"size":111034372,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fe90c0a3a0fb2236c544303d4a26dba97a6eedac&amp;dn=Shakira+-+Whenever%2C+Wherever++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1263801019,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Whenever, Wherever&quot; is a Latin pop song written by Colombian singer-songwriter Shakira for her first English album, Laundry Service (2001). It is the second most successful song in her career, behind only &quot;Hips Don't Lie&quot; (2006). There is also a version of &quot;Whenever, Wherever&quot; in the Spanish language, &quot;Suerte&quot;, meaning 'luck'. It talks about how she was &quot;lucky&quot; to find a person like him. It hit number 1 in 29 countries. The single became the biggest hit of 2002 worldwide. &quot;Whenever, Wherever&quot; has sold over 9 million copies as a single, placing it in the top 3 of the best selling singles of the decade.\n\nThe track was produced by Shakira, and was released as the first single from the album in the autumn of 2001. It was an international success, peaking at number one in Colombia, the rest of Latin America, almost all the European countries, Australia and New Zealand. In the Netherlands the song kept the number one position for nine weeks. It reached number two in the United Kingdom, number four in Canada, and number six in the U.S..\n\n&quot;Whenever, Wherever&quot; is Shakira's most successful song in Europe, where it topped many of the medium sized charts as Austria, Denmark, Finland, Norway and Sweden. &quot;Hips Don't Lie&quot; which is considered the most successful song in her career, though topping the majority of European markets sold substantially less in the bigger markets such as France and Germany.\n\nThe music video was directed by Francis Lawrence in front of a green screen, and features Shakira surrounded by the earth's natural wonders. It begins with Shakira submerged in the ocean, before leaping out onto the surrounding rocks and observing a landscape of mountains. She then proceeds to walk into the desert, where she is soon seen dancing amid a stampede of horses. The stampede suddenly ceases, and Shakira kneels into a shallow pool of mud, and begins crawling through it. As the video nears its end, she is on top of a snowy mountain, and jumps off, descending into water and submerging herself, as though to bring the video full circle.\n\nThe video became an instant hit on several music programs. It became Shakira's first video to retire on MTV's Total Request Live, and reached number one for a single week on the MuchMusic program Countdown. It won the 2002 Latin Grammy Award for &quot;Best Short Form Music Video&quot;.\n\n&quot;Whenever, Wherever&quot; was released as the first single from Shakira's first English album &quot;Laundry Service&quot;, in December 2001. The single became the biggest hit of 2002 worldwide.\n\n&quot;Whenever, Wherever&quot; is Shakira's first single reach the Top Ten on the USA Billboard Hot 100, peaking at #6. Despite not achieving a higher peak position in the U.S., the song achieved major cross over success on other Billboard charts after it peaked at #1 on the Billboard Hot Latin Tracks, #1 on the Billboard Latin Pop Airplay, at #3 on the Hot Dance Club Play and at #4 on the Top 40 Tracks.\n\nIn Europe, &quot;Whenever, Wherever&quot; became a major success, establishing Shakira's presence in the European Mainstream with her very first single of her debut album in English, a feat that is accomplished by many debuting American singers during their third or last single in many occasions.\n\nIn the UK, &quot;Whenever, Wherever&quot; became Shakira's first Top 3 hit, peaking at #2 for two consecutive weeks, and eventually spent ten weeks in the Top Ten and 19 weeks in the Top 75. The reason she didn't get the number one spot was because it was the same week that Will Young (The first Pop Idol) released Evergreen. The song currently stands as the seventh best selling song by a female artist in the 21st century in the UK. It is also the 38th best-selling single of the 2000 decade in UK.\n\nIn Switzerland, the song debuted at #9 and the following week, it reached the #1 position where it would stay for 17 consecutive weeks, becoming the 22nd most successful song in that country.\n\n&quot;Whenever, Wherever&quot; became a #1 hit in several countries after it peaked at #1 in Algeria, Australia, Austria, Belgium, Brazil, Denmark, Europe, France, Germany, Hungary, Ireland, Italy, Mexico, Netherlands, New Zealand, Peru, Poland, Portugal, Spain, Sweden and Venezuela.\n\nMeanwhile, Spanish version, &quot;Suerte&quot;, also written by Shakira and Mitchell, was released as a single in Spain and in a handful of nations in South America, and Mexico. It was a huge hit, peaking at number one on the Billboard's Hot Latin Tracks chart for 7 non-consecutive weeks and staying within the top ten over 4 months. It also topped almost all the Spanish-speaking countries.\n\nIt was also Shakira's most successful single, until &quot;Hips Don't Lie&quot; was released in 2006.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:fe90c0a3a0fb2236c544303d4a26dba97a6eedac","amp;dn":"Shakira+-+Whenever%2C+Wherever++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe90c0a3a0fb2236c544303d4a26dba97a6eedac","infoHashBuffer":{"type":"Buffer","data":[254,144,192,163,160,251,34,54,197,68,48,61,74,38,219,169,122,110,237,172]},"announce":[],"urlList":[]}}