{"title":"Sexually Broken--Flexible cock slut Abella Danger bound multiple","uid":11679049,"size":847756649,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ff0cc6d40aa26a6b1ca6f2ac5be8a35af39577e0&amp;dn=Sexually+Broken--Flexible+cock+slut+Abella+Danger+bound+multiple&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":1,"time":1422998706,"description":"Flexible cock slut Abella Danger bound multiple orgasms and drooling brutal deepthroat on hard cock! | Abella Danger | Maestro | Jack Hammer \n\nFebruary 2, 2015\n\nHigh MP4 only.\n\nCurly haired newbie bound and throat trained on hard cock \n\nAbella Danger is a curly haired flexible little slut with an eager throat and a perfect shaved cunt. While she is a relative newbie, she brings an enthusiasm to the table that rivals the most experienced cock suckers out there. Today she gets the full Sexuallybroken experience. Bondage, orgasms and brutal punishing deepthroat on hard cock.\n\nWith her tender thighs cranked wide open in the splits and a vibrator bolted down directly onto that perfect pussy, Abella's mouth is wide open and ready for business. We make full use of that fact and introduce hard cock directly into the back of her face pussy as she sputters and drools. \n\nIt is an overload of dick. The cock is relentless and never lefts up. We overload our starlet into dazed dick drunk subspace. She can not even get her eyes uncrossed. The nipple clamps keep her firmly in place, she can not escape or dodge the dick. Her only option is to accept the furious face fucking.\n\nAbella is left a broken doll, a cummed out shell of starlet wallowing in her own drool. We have reshaped her throat until it is custom fitted to the dick. She can not even recall her name. This is what sexually broken looks like. It is a good look on her. \n\n\nUploaded by Merzedes and Shallow2\n\n16 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\nAny Questions ?? Read our FAQ!!\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:ff0cc6d40aa26a6b1ca6f2ac5be8a35af39577e0","amp;dn":"Sexually+Broken--Flexible+cock+slut+Abella+Danger+bound+multiple","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff0cc6d40aa26a6b1ca6f2ac5be8a35af39577e0","infoHashBuffer":{"type":"Buffer","data":[255,12,198,212,10,162,106,107,28,166,242,172,91,232,163,90,243,149,119,224]},"announce":[],"urlList":[]}}