{"title":"Duke: A Life of Duke Ellington (Audiobook) - Terry Teachout","uid":9646413,"size":510738855,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ff284a022f35e6ffa43f312640de00d651abc835&amp;dn=Duke%3A+A+Life+of+Duke+Ellington+%28Audiobook%29+-+Terry+Teachout+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"bobpocket","files":19,"time":1393007378,"description":"Duke: A Life of Duke Ellington (Audiobook) By Terry Teachout, read by Peter Francis James\nUnabridged edition 2013 | 17 hours and 43 minutes | ISBN: B00FML26W2 | MP3 64 kbps | 487 MB\n\nA major new biography of Duke Ellington from the acclaimed author of Pops: A Life of Louis Armstrong. \n\nEdward Kennedy &quot;Duke&quot; Ellington was the greatest jazz composer of the twentieth century - and an impenetrably enigmatic personality whom no one, not even his closest friends, claimed to understand. The grandson of a slave, he dropped out of high school to become one of the world's most famous musicians, a showman of incomparable suavity who was as comfortable in Carnegie Hall as in the nightclubs where he honed his style. He wrote some fifteen hundred compositions, many of which, like &quot;Mood Indigo&quot; and &quot;Sophisticated Lady,&quot; remain beloved standards, and he sought inspiration in an endless string of transient lovers, concealing his inner self behind a smiling mask of flowery language and ironic charm. As the biographer of Louis Armstrong, Terry Teachout is uniquely qualified to tell the story of the public and private lives of Duke Ellington. Duke peels away countless layers of Ellington's evasion and public deception to tell the unvarnished truth about the creative genius who inspired Miles Davis to say, &quot;All the musicians should get together one certain day and get down on their knees and thank Duke.&quot;\n","torrent":{"xt":"urn:btih:ff284a022f35e6ffa43f312640de00d651abc835","amp;dn":"Duke%3A+A+Life+of+Duke+Ellington+%28Audiobook%29+-+Terry+Teachout+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff284a022f35e6ffa43f312640de00d651abc835","infoHashBuffer":{"type":"Buffer","data":[255,40,74,2,47,53,230,255,164,63,49,38,64,222,0,214,81,171,200,53]},"announce":[],"urlList":[]}}