{"title":"Electrokinetic and Colloid Transport Phenomena","uid":15385690,"size":13689298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff3cae4dd495940b38542a8fd161a4e47915891e&amp;dn=Electrokinetic+and+Colloid+Transport+Phenomena&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469290616,"description":"Electrokinetic and Colloid Transport Phenomena - J.H. Masliyah, S. Bhattacharjee (Wiley, 2006).pdf\r\n\r\nA new, definitive perspective of electrokinetic and colloid transport processes\r\n\r\nResponding to renewed interest in the subject of electrokinetics, Electrokinetic and Colloid Transport Phenomena is a timely overview of the latest research and applications in this field for both the beginner and the professional. An outgrowth of an earlier text (by coauthor Jacob Masliyah), this self-contained reference provides an up-to-date summary of the literature on electrokinetic and colloid transport phenomena as well as direct pedagogical insight into the development of the subject over the past several decades.\r\n\r\nA distinct departure from standard colloid science monographs, Electrokinetic and Colloid Transport Phenomena presents the most salient features of the theory in a simple and direct manner, allowing the book to serve as a stepping-stone for further learning and study. In addition, the book uniquely discusses numerical simulation of electrokinetic problems and demonstrates the use of commercial finite element software for solving these multiphysics problems. Among the topics covered are:\r\n* Mathematical preliminaries\r\n* Colloidal systems\r\n* Electrostatics and application of electrostatics\r\n* Electric double layer\r\n* Electroosmosis and streaming potential\r\n* Electrophoresis and sedimentation potential\r\n* London-Van der Waals forces and the DLVO theory\r\n* Coagulation and colloid deposition\r\n* Numerical simulation of electrokinetic phenomena\r\n* Applications of electrokinetic phenomena\r\n\r\n\r\nBecause this thorough reference does not require advanced mathematical knowledge, it enables a graduate or a senior undergraduate student approaching the subject for the first time to easily interpret the theories. On the other hand, the application of relevant mathematical principles and the worked examples are extremely useful to established researchers and professionals involved in a wide range of areas, including electroosmosis, streaming potential, electrophoretic separations, industrial practices involving colloids and complex fluids, environmental remediation, suspensions, and microfluidic systems","torrent":{"xt":"urn:btih:ff3cae4dd495940b38542a8fd161a4e47915891e","amp;dn":"Electrokinetic+and+Colloid+Transport+Phenomena","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff3cae4dd495940b38542a8fd161a4e47915891e","infoHashBuffer":{"type":"Buffer","data":[255,60,174,77,212,149,148,11,56,84,42,143,209,97,164,228,121,21,137,30]},"announce":[],"urlList":[]}}