{"title":"Wolf Girl (Ulvepigen Tinke)","uid":5193561,"size":721655735,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ff3f210e3257f3ea6dc5f0a21987408a18e70b12&amp;dn=Wolf+Girl+%28Ulvepigen+Tinke%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ForAnAngel","files":2,"time":1259817255,"description":"Ulvepigen Tinke is set in mid-nineteenth century Denmark and follows the plight of an 8-year-old girl named Tinke (Sarah Juel Werner), who is newly orphaned, living alone in a tattered shack somewhere among the trees, and left to fend for herself. We discover Tinke filthy, frightened, and hungry when she happens upon Larus, a boy not much older who tends to the cows of his employers, a somewhat unpleasant older couple.\n\nUpon discovering Tinke's situation, Larus brings her home to his master's house, not knowing what else to do. We learn that the lady of the house is desperate for children, having borne none of her own since realizing her son Hartad, now a man, is severely retarded. She is enamored with the idea of taking Tinke in, but her husband is not nearly as keen.\n\nNeither her husband nor Tinke are especially fond of each other. Tinke is stubborn and wonderfully indignant, and she does not take well to unjust treatment, which the man of the house is quite accustomed to dishing out. Seeing Tinke stand toe-to-toe with her would-be foster father in a kind of battle of wits, completely fearless, was terribly gratifying. &quot;I'm afraid of nothing,&quot; she says defiantly. &quot;Once I bit a wolf!&quot; And given her demonstrated inclination to, shall we say, feisty behavior, it is not a stretch to believe her.\n\nWe learn that Tinke's mother, on her deathbed, told Tinke to find her grandparents who will take good care of her, and gave her a medallion to prove her heritage. The problem is that Tinke remembers neither her surname nor her parents' names, perhaps a result of the trauma from witnessing their deaths. Slowly however, through flashbacks, she remembers enough to lead her to them.\n\nHer grandparents happen to be quite wealthy and otherwise certainly appear to be a considerable upgrade from Tinke's current temporary caretakers. Unfortunately both are quite skeptical that Tinke is who she says she is, instead suspecting that Tinke is a clever orphan with a good story. Their denial is compounded with the realization that to accept Tinke as their granddaughter is to tacitly acknowledge their own daughter, Tinke's mother, is dead. And Tinke stubbornly refuses to show them the medallion, presumably because she wishes for them to truly want her as herself, rather than be obligated through blood.\n\nThey are unwilling to chance being wrong, and take her home. While en route, Tinke realizes the doubt and resulting emotional distance of her grandparents, and so somehow induces herself to vomit on her grandfather's lap, while her grandmother pulls Tinke close, and coos and pets her protectively. Tinke then flashes her grandfather a subtle and knowing smile. Her professional manipulation was a delightful maneuver.\n\nAt her new home, Tinke discovers her many aunts, most of whom are equally unbelieving of her identity. At the dinner table, Tinke's gross and very intentional lack of manners offends the delicate sensibilities of her grandfather and some family members. When her grandfather scolds her, she literally growls at him. And when he tries to discipline her, she successfully manipulates the situation in order to rouse sympathy from the others.\n\nI won't spoil the ending, except to say that it is a happy one. Sometimes you just need a predictably happy ending.\n\nUlvepigen Tinke is Sarah's acting debut, and she is a natural. She is continually endearing, with some of the most expressive, gorgeous blue eyes. Her frequent spunky defiance was delightfully entertaining, but she was not the slightest bit brattish, usually because she was fully justified. Such spirit fits well with the title of the movie: the literal English translation of Ulvepigen is &quot;wolf girl.&quot;\n\nYet Tinke's situation must also earn the audience's genuine compassion. In some scenes, Sarah portrays a vulnerability and sadness that will tug at your heart strings. If she doesn't trigger every protective instinct in you, you just might not be human.\n\nUlvepigen Tinke is a film to be enjoyed by the whole family. This is not a glossy, high profile, high budget feature film and thank god for that. Instead this movie, and Sarah Juel Werner along with it, is a sincere and unexpected treasure. ","torrent":{"xt":"urn:btih:ff3f210e3257f3ea6dc5f0a21987408a18e70b12","amp;dn":"Wolf+Girl+%28Ulvepigen+Tinke%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff3f210e3257f3ea6dc5f0a21987408a18e70b12","infoHashBuffer":{"type":"Buffer","data":[255,63,33,14,50,87,243,234,109,197,240,162,25,135,64,138,24,231,11,18]},"announce":[],"urlList":[]}}