{"title":"VA - Road Of The Gypsies (L' Epopee Tzigane)@flac","uid":4847444,"size":415503491,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ff70deea373634213e3130a618be804e129717de&amp;dn=VA+-+Road+Of+The+Gypsies+%28L%5C%27+Epopee+Tzigane%29%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alekow1","files":-1,"time":1239738187,"description":"This is a sampler of the music of the Gypsies in Europe!\n\n\nNote that is also released as a 2CD edition,which I haven't.\nThe review is for this edition\n\n\nGypsy music is most often associated with the Balkans and Central Europe, but the truth is that it's still on a journey, one that began in India somewhere around the year 1000 A.D. \nThis compilation traces that, from its beginnings such as Suwa Devi Kabelya's &quot;Kaman Song&quot; or Abdullah and Gholam Sakhi's &quot;Lovesong From Herat&quot; before moving slowly West. Egypt was a stopping off point, and those who settled there took on their own forms -- witness the Musicians of the Nile, who've specialized in the use of the two-string lute known as the rebab. \nBut it's in Europe that Gypsy music became most focused, with its deeply dramatic vocal and emotive, flying melodic lines. In Spain it intertwined with Andalusian music and flamenco in the work of El Camaron de la Isla, who offers &quot;Nana del Caballo Grande,&quot; which harks back to the Romany origins with its sitar lines. Of course, it would be impossible for a collection like this to be complete without some of the fieriest playing around, and that brings everything back to Central Europe and the Balkans, where Jewish klezmer musicians and gypsies often played side by side (which accounts for the musical similarities between the two genres). \nTaraf de Haidouks, with their village Romanian beginning, are vastly different from the cultured, and very professional Istanbul Oriental Ensemble, but both have the same power and depth -- and similar skills. \nSinger Esma Redzepova shows it's not simply the instrumentalists who can breathe fire onto a melody and make it sizzle. If this set had stopped at Spain, it would have done well; thankfully, it goes beyond that to include such bands as Ireland's Loyko -- the &quot;traveling people&quot; are numerous in the Emerald Isle and Britain -- and East to include Russia with Jelem. The introductory essay offers plenty of information and enough of a history to put everything into context. \nAs with all the other double-CD sets Network has released, this is superbly, and thoughtfully, done. (AMG)\n\n\n\n01. Goran Bregovic - Ederlezi\n02. Lida Goulesko &amp; Schnuckenack Reinhardt Quintett - Moskovskija Okna\n03. Blehorkestar Bakija From Vranje - Pobjednicki Cocek\n04. Rromano Dives - Besena Rovena\n05. Goran Bregovic - Mesecina\n06. Esma Redzepova &amp; Ensemble Theodosievsky - Szelem Szelem\n07. Kocani Orkestar - Romski Cocek\n08. Bratsch - Nane Tsora\n09. Matelo Farret - Mademoiselle De Bucarest\n10. Kalyi Jag - Csilavtu\n11. Jelem - Nevechernyaya\n12. Romica Puceanu &amp; Orchestra Florea Cioaca - Erau Zarzarii-Nfloriti\n13. Vanessa &amp; Sorba With Titi Winterstein Quintett - Swiodeschka\n14. Camaron - Nana Del Caballo Grande\n15. Rromano Dives - Gelem, Gelem\n16. Loyko - Road Of The Gypsies\n\n\nLabel: Network Medien\nReleased: 1997\n\n\nCodec: Flac\nCompression Level: 3\nQuality: High\n\n\nMy cd-rip (EAC and Flac)\nCovers Included\n\n\n\n\n\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:ff70deea373634213e3130a618be804e129717de","amp;dn":"VA+-+Road+Of+The+Gypsies+%28L%5C%27+Epopee+Tzigane%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff70deea373634213e3130a618be804e129717de","infoHashBuffer":{"type":"Buffer","data":[255,112,222,234,55,54,52,33,62,49,48,166,24,190,128,78,18,151,23,222]},"announce":[],"urlList":[]}}